///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2026, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом
//
// Параметры:
//   Ограничение - см. УправлениеДоступомПереопределяемый.ПриЗаполненииОграниченияДоступа.Ограничение.
//
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Создает новую настройку подключения к онлайн-заказам.
//
// Параметры:
//  ДанныеНастройки - См.ОнлайнЗаказыСлужебный.НовыйДанныеНастройки.
//
// Возвращаемое значение:
//  Структура - результат создания торговой точки:
//    * НастройкаПодключения - СправочникСсылка.НастройкиПодключенияКОнлайнЗаказам - новая настройка;
//             - Неопределено - в случае возникновения ошибок;
//    * ОшибкаОтправкиВСервис - Булево - признак ошибки отправки в сервис;
//    * СообщениеОбОшибке  - Строка, ФорматированнаяСтрока - сообщение об ошибке для пользователя.
//
Функция НоваяНастройкаПодключения(ДанныеНастройки) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("НастройкаПодключения", Неопределено);
	Результат.Вставить("ОшибкаОтправкиВСервис", Ложь);
	Результат.Вставить("СообщениеОбОшибке", "");
	
	НастройкаПодключения = СоздатьЭлемент();
	НастройкаПодключения.Заполнить(Неопределено);
	
	ЗаполнитьНастройкуПодключения(НастройкаПодключения, ДанныеНастройки);
	
	НастройкаПодключения.Записать();
	
	Результат.НастройкаПодключения = НастройкаПодключения.Ссылка;
	
	РезультатОперации = ОнлайнЗаказыСлужебный.ОбновитьНастройку(
		НастройкаПодключения.Ссылка,
		Истина);
	
	Если ЗначениеЗаполнено(РезультатОперации.КодОшибки) Тогда
		
		Результат.ОшибкаОтправкиВСервис = Истина;
		Результат.СообщениеОбОшибке = РезультатОперации.СообщениеОбОшибке;
		РезультатУстановки = УстановитьПризнакОшибкиСинхронизации(НастройкаПодключения);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЗаписатьОбъект(
	НастройкаПодключенияОбъект,
	БлокироватьОбъект) Экспорт
	
	НастройкаПодключения = НастройкаПодключенияОбъект.Ссылка;
	Результат = ОнлайнЗаказыСлужебный.НовыйРезультатОбновленияНастройки(НастройкаПодключения);
	
	НачатьТранзакцию();
	
	Попытка
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("Справочник.НастройкиПодключенияКОнлайнЗаказам");
		ЭлементБлокировки.УстановитьЗначение("Ссылка", НастройкаПодключения);
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		Блокировка.Заблокировать();
		
		РезультатПроверки = ПроверитьАктуальностьНастройкиПодключения(НастройкаПодключенияОбъект);
		ЗаполнитьЗначенияСвойств(
			Результат,
			РезультатПроверки,
			"ИзмененыНастройкиСтраницы, НеактуальныеНастройки");
		
		Если БлокироватьОбъект Тогда
			НастройкаПодключенияОбъект.Заблокировать();
		КонецЕсли;
		НастройкаПодключенияОбъект.Записать();
		
		Результат.НастройкаПодключения = НастройкаПодключенияОбъект.Ссылка;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		// Вызов во вложенной транзакции не предполагается,
		// вместо вызова исключения обработка ошибки делегируется
		// вызывающему методу.
		Результат.ОшибкаЗаписи = Истина;
		Результат.СообщениеОбОшибке = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не удалось записать настройку подключения по причине:
				|%1'"),
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

Функция ИнициализироватьОбновлениеНастройки(
		НастройкаПодключения,
		Результат,
		НастроитьВнешнийВид) Экспорт
	
	ОшибкаСинхронизации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
		НастройкаПодключения,
		"ОшибкаСинхронизации");
	
	Если ОшибкаСинхронизации Тогда
		РезультатОбновления = ОнлайнЗаказыСлужебный.ОбновитьНастройкуСРевизиейТокенов(
			НастройкаПодключения,
			НастроитьВнешнийВид,
			Результат);
	ИначеЕсли ЗначениеЗаполнено(Результат.НеактуальныеНастройки) Тогда
		
		НеиспользуемыеНастройки = ПроверитьИспользованиеНастроек(
			НастройкаПодключения,
			Результат.НеактуальныеНастройки);
		
		Если ЗначениеЗаполнено(НеиспользуемыеНастройки) Тогда
			РезультатОбновления = ОнлайнЗаказыСлужебный.ОбновитьНастройкуСОтзывомТокенов(
				НастройкаПодключения,
				НеиспользуемыеНастройки,
				НастроитьВнешнийВид,
				Результат);
		Иначе
			РезультатОбновления = ОнлайнЗаказыСлужебный.ОбновитьНастройку(
				НастройкаПодключения,
				НастроитьВнешнийВид,
				Результат);
		КонецЕсли;
		
	Иначе
		РезультатОбновления = ОнлайнЗаказыСлужебный.ОбновитьНастройку(
			НастройкаПодключения,
			НастроитьВнешнийВид,
			Результат);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(РезультатОбновления.КодОшибки) Тогда
		Результат.ОшибкаОтправкиВСервис = Истина;
		Результат.СообщениеОбОшибке = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Ошибка отправки настройки в сервис. Подробности:
				|%1'"),
			РезультатОбновления.СообщениеОбОшибке);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаполнитьНастройкуПодключения(
		НастройкаПодключенияОбъект,
		ДанныеНастройки) Экспорт
	
	НастройкаПодключенияОбъект.Организация = ДанныеНастройки.ОбщиеПараметры.Организация;
	НастройкаПодключенияОбъект.Наименование = ДанныеНастройки.ОбщиеПараметры.ПредставлениеОрганизации;
	НастройкаПодключенияОбъект.Используется = ДанныеНастройки.ОбщиеПараметры.Используется;
	
	НастройкаПодключенияОбъект.ПоРеквизитамОтФизЛиц =
		ДанныеНастройки.НастройкиПриемаОплатПоРеквизитам.ИспользуетсяПриемОплатОтФизЛиц;
	НастройкаПодключенияОбъект.ПоРеквизитамОтЮрЛиц =
		ДанныеНастройки.НастройкиПриемаОплатПоРеквизитам.ИспользуетсяПриемОплатОтЮрЛиц;
	
	НастройкаПодключенияОбъект.НастройкаПодключенияКОблачнойКассе =
		ДанныеНастройки.НастройкиФискализации.НастройкаПодключения;
	НастройкаПодключенияОбъект.ФискализироватьОнлайнЗаказы =
		ДанныеНастройки.НастройкиФискализации.Используется;
	
	НастройкаПодключенияОбъект.НастройкиОплаты.Очистить();
	
	Для Каждого НастройкаОплаты Из ДанныеНастройки.НастройкиОплат Цикл
		НоваяНастройкаОплаты = НастройкаПодключенияОбъект.НастройкиОплаты.Добавить();
		НоваяНастройкаОплаты.СпособОплаты = НастройкаОплаты.Ключ;
		НоваяНастройкаОплаты.НастройкаПодключения = НастройкаОплаты.Значение.НастройкаПодключения;
		НоваяНастройкаОплаты.Используется = НастройкаОплаты.Значение.Используется;
	КонецЦикла;
	
КонецПроцедуры

// Выполняет включение использования настройки онлайн-заказов.
//
// Параметры:
//  НастройкаПодключения - СправочникСсылка.НастройкиПодключенияКОнлайнЗаказам -
//  настройка для которой выполняется операция включения.
//
// Возвращаемое значение:
//  Структура - результат создания торговой точки:
//    * Ошибка - Булево - признак ошибки сохранения;
//    * ОшибкаОтправкиВСервис - Булево - признак ошибки отправки в сервис;
//    * СообщениеОбОшибке  - Строка, ФорматированнаяСтрока - сообщение об ошибке для пользователя.
//
Функция ВключитьНастройку(НастройкаПодключения) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Ошибка", Ложь);
	Результат.Вставить("ОшибкаОтправкиВСервис", Ложь);
	Результат.Вставить("СообщениеОбОшибке", "");
	
	НачатьТранзакцию();
	
	Попытка
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("Справочник.НастройкиПодключенияКОнлайнЗаказам");
		ЭлементБлокировки.УстановитьЗначение("Ссылка", НастройкаПодключения);
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		Блокировка.Заблокировать();
		
		НастройкаПодключенияОбъект = НастройкаПодключения.ПолучитьОбъект();
		НастройкаПодключенияОбъект.Заблокировать();
		НастройкаПодключенияОбъект.Используется = Истина;
		НастройкаПодключенияОбъект.Записать();
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		// Вызов во вложенной транзакции не предполагается,
		// вместо вызова исключения обработка ошибки делегируется
		// вызывающему методу.
		Результат.Ошибка = Истина;
		Результат.СообщениеОбОшибке = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не удалось включить настройку подключения по причине:
				|%1'"),
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
		Возврат Результат;
		
	КонецПопытки;
	
	РезультатОперации = ОнлайнЗаказыСлужебный.ОбновитьНастройку(
		НастройкаПодключения);
	
	Если ЗначениеЗаполнено(РезультатОперации.КодОшибки) Тогда
		
		Результат.ОшибкаОтправкиВСервис = Истина;
		
		РезультатУстановки = УстановитьПризнакОшибкиСинхронизации(НастройкаПодключенияОбъект);
		
		Результат.СообщениеОбОшибке = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Ошибка отправки настройки в сервис. Подробности:
				|%1'"),
			РезультатОперации.СообщениеОбОшибке);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Формирует настройки подключения для выполнения запросов в сервисе.
//
// Параметры:
//  НастройкаПодключения - СправочникСсылка.НастройкиПодключенияКОнлайнЗаказам -
//    настройка выполнения операции.
//
// Возвращаемое значение:
//  Неопределено - Настройки не найдены.
//  Структура - Содержит параметры настройки:
//    * НастройкаПодключения - СправочникСсылка.НастройкиПодключенияКОнлайнЗаказам -
//    настройка подключения к сервису;
//    * ПредставлениеОрганизации - Строка - Представление организации на странице заказа;
//    * Используется - Булево - Признак использования настройки подключения;
//    * НастройкаОблачнойКассы - СправочникСсылка.НастройкиПодключенияКОблачнымКассам -
//      настройка подключения к облачной кассе.
//    * НастройкиОплат - Соответствие Из КлючИЗначение - Содержит данные по способам оплат:
//      ** Ключ - ПеречислениеСсылка.СпособыОплатыОнлайнЗаказов - Допустимый способ оплаты заказа;
//      ** Значение - Произвольный - Настройка подключения по способу оплаты.
//    * НастройкиПриемаОплатПоРеквизитам - Структура - настройки приема оплат от физ. лиц:
//      ** ИспользуетсяПриемОплатОтФизЛиц - Булево - настроен прием оплат от физ. лиц;
//      ** ИспользуетсяПриемОплатОтЮрЛиц - Булево - настроен прием оплат от юр. лиц.
//
Функция ПараметрыНастройки(НастройкаПодключения) Экспорт
	
	// Заполнение настроек проведения оплаты.
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НастройкиПодключенияКОнлайнЗаказам.Используется КАК Используется,
	|	НастройкиПодключенияКОнлайнЗаказам.Наименование КАК Наименование,
	|	НастройкиПодключенияКОнлайнЗаказам.ПоРеквизитамОтФизЛиц КАК ПоРеквизитамОтФизЛиц,
	|	НастройкиПодключенияКОнлайнЗаказам.ПоРеквизитамОтЮрЛиц КАК ПоРеквизитамОтЮрЛиц,
	|	НастройкиПодключенияКОнлайнЗаказам.НастройкаПодключенияКОблачнойКассе КАК НастройкаПодключенияКОблачнойКассе
	|ИЗ
	|	Справочник.НастройкиПодключенияКОнлайнЗаказам КАК НастройкиПодключенияКОнлайнЗаказам
	|ГДЕ
	|	НастройкиПодключенияКОнлайнЗаказам.Ссылка = &НастройкаПодключения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НастройкиОплаты.СпособОплаты КАК СпособОплаты,
	|	НастройкиОплаты.НастройкаПодключения КАК НастройкаПодключения
	|ИЗ
	|	Справочник.НастройкиПодключенияКОнлайнЗаказам.НастройкиОплаты КАК НастройкиОплаты
	|ГДЕ
	|	НастройкиОплаты.Ссылка = &НастройкаПодключения
	|	И НастройкиОплаты.Используется";
	
	Запрос.УстановитьПараметр("НастройкаПодключения", НастройкаПодключения);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаПараметров = РезультатЗапроса[0].Выбрать();
	
	Если Не ВыборкаПараметров.Следующий() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ПараметрыНастройки = Новый Структура;
	ПараметрыНастройки.Вставить("НастройкаПодключения",     НастройкаПодключения);
	ПараметрыНастройки.Вставить("ПредставлениеОрганизации", ВыборкаПараметров.Наименование);
	ПараметрыНастройки.Вставить("Используется",             ВыборкаПараметров.Используется);
	ПараметрыНастройки.Вставить("НастройкаОблачнойКассы",   ВыборкаПараметров.НастройкаПодключенияКОблачнойКассе);
	
	НастройкиПриемаОплатПоРеквизитам = Новый Структура;
	НастройкиПриемаОплатПоРеквизитам.Вставить(
		"ИспользуетсяПриемОплатОтФизЛиц",
		ВыборкаПараметров.ПоРеквизитамОтФизЛиц);
	НастройкиПриемаОплатПоРеквизитам.Вставить(
		"ИспользуетсяПриемОплатОтЮрЛиц",
		ВыборкаПараметров.ПоРеквизитамОтЮрЛиц);
		
	ПараметрыНастройки.Вставить("НастройкиПриемаОплатПоРеквизитам", НастройкиПриемаОплатПоРеквизитам);
	
	НастройкиОплат = Новый Соответствие;
	
	ВыборкаСпособовОплат = РезультатЗапроса[1].Выбрать();
	
	Пока ВыборкаСпособовОплат.Следующий() Цикл
		НастройкиОплат.Вставить(ВыборкаСпособовОплат.СпособОплаты, ВыборкаСпособовОплат.НастройкаПодключения);
	КонецЦикла;
	
	ПараметрыНастройки.Вставить("НастройкиОплат", НастройкиОплат);
	
	Возврат ПараметрыНастройки;
	
КонецФункции

// Формирует параметры приема оплат по настройке онлайн-заказов.
//
// Параметры:
//  НастройкаПодключения - СправочникСсылка.НастройкиПодключенияКОнлайнЗаказам - настройка онлайн-заказов.
//    настройка выполнения операции.
//
// Возвращаемое значение:
//  Неопределено - Настройки не найдены.
//  Структура - См.ОнлайнЗаказыСлужебный.НовыйДанныеНастройки
//
Функция ПараметрыПриемаОплат(НастройкаПодключения) Экспорт
	
	// Заполнение настроек проведения оплаты.
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НастройкиПодключенияКОнлайнЗаказам.Используется КАК Используется,
	|	НастройкиПодключенияКОнлайнЗаказам.Наименование КАК Наименование,
	|	НастройкиПодключенияКОнлайнЗаказам.ПоРеквизитамОтФизЛиц КАК ПоРеквизитамОтФизЛиц,
	|	НастройкиПодключенияКОнлайнЗаказам.ПоРеквизитамОтЮрЛиц КАК ПоРеквизитамОтЮрЛиц,
	|	НастройкиПодключенияКОнлайнЗаказам.НастройкаПодключенияКОблачнойКассе КАК НастройкаПодключенияКОблачнойКассе,
	|	НастройкиПодключенияКОнлайнЗаказам.ФискализироватьОнлайнЗаказы КАК ФискализироватьОнлайнЗаказы,
	|	НастройкиПодключенияКОнлайнЗаказам.Организация КАК Организация
	|ИЗ
	|	Справочник.НастройкиПодключенияКОнлайнЗаказам КАК НастройкиПодключенияКОнлайнЗаказам
	|ГДЕ
	|	НастройкиПодключенияКОнлайнЗаказам.Ссылка = &НастройкаПодключения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НастройкиОплаты.СпособОплаты КАК СпособОплаты,
	|	НастройкиОплаты.НастройкаПодключения КАК НастройкаПодключения,
	|	НастройкиОплаты.Используется КАК Используется
	|ИЗ
	|	Справочник.НастройкиПодключенияКОнлайнЗаказам.НастройкиОплаты КАК НастройкиОплаты
	|ГДЕ
	|	НастройкиОплаты.Ссылка = &НастройкаПодключения";
	
	Запрос.УстановитьПараметр("НастройкаПодключения", НастройкаПодключения);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаПараметров = РезультатЗапроса[0].Выбрать();
	
	Если Не ВыборкаПараметров.Следующий() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ДанныеНастройки = ОнлайнЗаказыСлужебный.НовыйДанныеНастройки();
	
	ДанныеНастройки.ОбщиеПараметры.Используется = ВыборкаПараметров.Используется;
	ДанныеНастройки.ОбщиеПараметры.Организация = ВыборкаПараметров.Организация;
	ДанныеНастройки.ОбщиеПараметры.ПредставлениеОрганизации = ВыборкаПараметров.Наименование;
	
	ДанныеНастройки.НастройкиФискализации.НастройкаПодключения = ВыборкаПараметров.НастройкаПодключенияКОблачнойКассе;
	ДанныеНастройки.НастройкиФискализации.Используется = ВыборкаПараметров.ФискализироватьОнлайнЗаказы;
	
	ДанныеНастройки.НастройкиПриемаОплатПоРеквизитам.ИспользуетсяПриемОплатОтФизЛиц =
		ВыборкаПараметров.ПоРеквизитамОтФизЛиц;
	ДанныеНастройки.НастройкиПриемаОплатПоРеквизитам.ИспользуетсяПриемОплатОтЮрЛиц =
		ВыборкаПараметров.ПоРеквизитамОтЮрЛиц;
	
	ВыборкаСпособовОплат = РезультатЗапроса[1].Выбрать();
	
	Пока ВыборкаСпособовОплат.Следующий() Цикл
		НастройкаОплаты = Новый Структура;
		НастройкаОплаты.Вставить("НастройкаПодключения", ВыборкаСпособовОплат.НастройкаПодключения);
		НастройкаОплаты.Вставить("Используется", ВыборкаСпособовОплат.Используется);
		ДанныеНастройки.НастройкиОплат.Вставить(ВыборкаСпособовОплат.СпособОплаты, НастройкаОплаты);
	КонецЦикла;
	
	Возврат ДанныеНастройки;
	
КонецФункции

// Определяет настройки подключений онлайн-заказов.
//
// Параметры:
//  Организация - ОпределяемыйТип.Организация - Организация по которой выполняется запрос.
//
// Возвращаемое значение:
//  Структура - настройки организации:
//    * ИспользуемыеНастройки - Массив Из СправочникСсылка.НастройкиПодключенияКОнлайнЗаказам - используемые настройки.
//    * ОтключенныеНастройки - Массив Из СправочникСсылка.НастройкиПодключенияКОнлайнЗаказам - отключенные настройки.
//
Функция НастройкиОрганизации(Организация) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ИспользуемыеНастройки", Новый Массив);
	Результат.Вставить("ОтключенныеНастройки", Новый Массив);
	
	ИспользуемыеНастройки = Новый Массив;
	ОтключенныеНастройки = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НастройкиПодключенияКОнлайнЗаказам.Ссылка КАК Ссылка,
	|	НастройкиПодключенияКОнлайнЗаказам.Используется КАК Используется
	|ИЗ
	|	Справочник.НастройкиПодключенияКОнлайнЗаказам КАК НастройкиПодключенияКОнлайнЗаказам
	|ГДЕ
	|	НастройкиПодключенияКОнлайнЗаказам.Организация = &Организация
	|
	|УПОРЯДОЧИТЬ ПО
	|	НастройкиПодключенияКОнлайнЗаказам.Наименование";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.Используется Тогда
			ИспользуемыеНастройки.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
		Иначе
			ОтключенныеНастройки.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
		КонецЕсли;
	КонецЦикла;
	
	Результат.ИспользуемыеНастройки = ИспользуемыеНастройки;
	Результат.ОтключенныеНастройки = ОтключенныеНастройки;
	
	Возврат Результат;
	
КонецФункции

// Определяет настройку подключения оплаты по ее способу.
//
// Параметры:
//  НастройкаПодключения - СправочникСсылка.НастройкиПодключенияКОнлайнЗаказам -
//    настройка выполнения операции.
//  СпособОплаты - ПеречислениеСсылка.СпособыОплатыОнлайнЗаказов -
//    способ оплаты.
//
// Возвращаемое значение:
//  Произвольный - настройка подключения по способу оплаты.
//
Функция НастройкаОплаты(НастройкаПодключения, СпособОплаты) Экспорт
	
	Результат = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НастройкиПодключенияКОнлайнЗаказамНастройкиОплаты.НастройкаПодключения КАК НастройкаПодключения
	|ИЗ
	|	Справочник.НастройкиПодключенияКОнлайнЗаказам.НастройкиОплаты КАК НастройкиПодключенияКОнлайнЗаказамНастройкиОплаты
	|ГДЕ
	|	НастройкиПодключенияКОнлайнЗаказамНастройкиОплаты.Ссылка = &НастройкаПодключения
	|	И НастройкиПодключенияКОнлайнЗаказамНастройкиОплаты.СпособОплаты = &СпособОплаты";
	
	Запрос.УстановитьПараметр("НастройкаПодключения", НастройкаПодключения);
	Запрос.УстановитьПараметр("СпособОплаты", СпособОплаты);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Результат = Выборка.НастройкаПодключения;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Определяет перечень настроек оплат для переданной настройки онлайн-заказов.
//
// Параметры:
//  НастройкаПодключения - СправочникСсылка.НастройкиПодключенияКОнлайнЗаказам -
//    настройка выполнения операции.
//  СпособОплаты - ПеречислениеСсылка.СпособыОплатыОнлайнЗаказов -
//    способ оплаты.
//
// Возвращаемое значение:
//  Соответствие Из КлючИЗначение - настройки подключения по способу оплаты:
//    * Ключ - ПеречислениеСсылка.СпособыОплатыОнлайнЗаказов- Способ оплаты;
//    * Значение - Произвольный- Ссылка на настройку подключения по способу оплаты
//
Функция ИспользуемыеНастройкиОплат(НастройкаПодключения) Экспорт
	
	Результат = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НастройкиПодключенияКОнлайнЗаказамНастройкиОплаты.СпособОплаты КАК СпособОплаты,
	|	НастройкиПодключенияКОнлайнЗаказамНастройкиОплаты.НастройкаПодключения КАК НастройкаПодключения
	|ИЗ
	|	Справочник.НастройкиПодключенияКОнлайнЗаказам.НастройкиОплаты КАК НастройкиПодключенияКОнлайнЗаказамНастройкиОплаты
	|ГДЕ
	|	НастройкиПодключенияКОнлайнЗаказамНастройкиОплаты.Ссылка = &НастройкаПодключения
	|	И НастройкиПодключенияКОнлайнЗаказамНастройкиОплаты.Используется";
	
	Запрос.УстановитьПараметр("НастройкаПодключения", НастройкаПодключения);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Результат.Вставить(Выборка.СпособОплаты, Выборка.НастройкаПодключения);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Определяет перечень настроек используемых активными настройками онлайн-заказов.
//
//
// Возвращаемое значение:
//  Структура - содержит описание используемых настроек подключения
//  сгруппированных по виду токена:
//    * Ключ - Строка - вид токена.
//    * Значение - Соответствие - содержит описание используемых настроек подключения:
//      ** Ключ - ПеречислениеСсылка.СпособыОплатыОнлайнЗаказов - Способ оплаты для которых получался токен;
//      ** Значение - Произвольный - используемые настройки подключения способа оплаты;
//
Функция ИспользуемыеНастройки() Экспорт
	
	Результат = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СпособыОплатыОнлайнЗаказов.Ссылка КАК СпособОплаты,
	|	НастройкиПодключенияКОнлайнЗаказамНастройкиОплаты.НастройкаПодключения КАК НастройкаПодключения
	|ИЗ
	|	Перечисление.СпособыОплатыОнлайнЗаказов КАК СпособыОплатыОнлайнЗаказов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НастройкиПодключенияКОнлайнЗаказам.НастройкиОплаты КАК НастройкиПодключенияКОнлайнЗаказамНастройкиОплаты
	|		ПО СпособыОплатыОнлайнЗаказов.Ссылка = НастройкиПодключенияКОнлайнЗаказамНастройкиОплаты.СпособОплаты
	|			И (НастройкиПодключенияКОнлайнЗаказамНастройкиОплаты.Используется)
	|			И (НастройкиПодключенияКОнлайнЗаказамНастройкиОплаты.Ссылка.Используется)
	|ИТОГИ ПО
	|	СпособОплаты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НастройкиПодключенияКОнлайнЗаказам.НастройкаПодключенияКОблачнойКассе КАК НастройкаПодключения
	|ИЗ
	|	Справочник.НастройкиПодключенияКОнлайнЗаказам КАК НастройкиПодключенияКОнлайнЗаказам
	|ГДЕ
	|	НастройкиПодключенияКОнлайнЗаказам.Используется
	|	И НастройкиПодключенияКОнлайнЗаказам.ФискализироватьОнлайнЗаказы";
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	НастройкиОплат = Новый Соответствие;
	ВыборкаПоСпособуОплаты = РезультатЗапроса[0].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаПоСпособуОплаты.Следующий() Цикл
		
		ИспользуемыеНастройки = Новый Массив;
		ВыборкаНастроек = ВыборкаПоСпособуОплаты.Выбрать();
		
		Пока ВыборкаНастроек.Следующий() Цикл
			ИспользуемыеНастройки.Добавить(ВыборкаНастроек.НастройкаПодключения);
		КонецЦикла;
		
		НастройкиОплат.Вставить(ВыборкаПоСпособуОплаты.СпособОплаты, ИспользуемыеНастройки);
		
	КонецЦикла;
	
	НастройкиФискализации = Новый Соответствие;
	ИспользуемыеНастройки = Новый Массив;
	ВыборкаНастроек = РезультатЗапроса[1].Выбрать();
	
	Пока ВыборкаНастроек.Следующий() Цикл
		ИспользуемыеНастройки.Добавить(ВыборкаНастроек.НастройкаПодключения);
	КонецЦикла;
	
	НастройкиФискализации.Вставить(Перечисления.СпособыОплатыОнлайнЗаказов.ПустаяСсылка(), ИспользуемыеНастройки);
	
	Результат.Вставить(
		ОнлайнЗаказыСлужебный.ИдентификаторВидаТокенаПриемОплат(),
		НастройкиОплат);
	Результат.Вставить(
		ОнлайнЗаказыСлужебный.ИдентификаторВидаТокенаОблачнаяКасса(),
		НастройкиФискализации);
	
	Возврат Результат;
	
КонецФункции

// Возвращает признак существования настроек онлайн-заказов с заполненными зависимыми настройками.
//
// Возвращаемое значение:
//  Булево - признак заполненности зависимых настроек (способов оплат, облачная касса).
//
Функция ЕстьЗаполненныеЗависимыеНастройки() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НастройкиПодключенияКОнлайнЗаказамНастройкиОплаты.НастройкаПодключения КАК НастройкаПодключения
	|ИЗ
	|	Справочник.НастройкиПодключенияКОнлайнЗаказам.НастройкиОплаты КАК НастройкиПодключенияКОнлайнЗаказамНастройкиОплаты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НастройкиПодключенияКОнлайнЗаказам.НастройкаПодключенияКОблачнойКассе
	|ИЗ
	|	Справочник.НастройкиПодключенияКОнлайнЗаказам КАК НастройкиПодключенияКОнлайнЗаказам
	|ГДЕ
	|	НЕ НастройкиПодключенияКОнлайнЗаказам.НастройкаПодключенияКОблачнойКассе.Ссылка ЕСТЬ NULL";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

Функция НастройкаОблачнойКассы(НастройкаПодключения) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НастройкиПодключенияКОнлайнЗаказам.НастройкаПодключенияКОблачнойКассе КАК НастройкаПодключенияКОблачнойКассе
	|ИЗ
	|	Справочник.НастройкиПодключенияКОнлайнЗаказам КАК НастройкиПодключенияКОнлайнЗаказам
	|ГДЕ
	|	НастройкиПодключенияКОнлайнЗаказам.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", НастройкаПодключения);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.НастройкаПодключенияКОблачнойКассе;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция ПроверитьИспользованиеНастроек(
		НастройкаОнлайнЗаказов,
		НеактуальныеНастройки)
	
	НеиспользуемыеНастройки = Новый Структура;
	НеиспользуемыеНастройкиОплат = Новый Соответствие;
	НеиспользуемыеНастройкиОблачныхКасс = Новый Соответствие;
	
	Для Каждого НеактуальнаяНастройка Из НеактуальныеНастройки Цикл
		
		Если СуществуютНастройки(
				НастройкаОнлайнЗаказов,
				НеактуальнаяНастройка.Значение.ВидТокена,
				НеактуальнаяНастройка.Ключ) Тогда
			Продолжить;
		КонецЕсли;
		
		Если НеактуальнаяНастройка.Значение.ВидТокена =
			ОнлайнЗаказыСлужебный.ИдентификаторВидаТокенаПриемОплат() Тогда
			
			НеиспользуемыеНастройкиОплат.Вставить(
				НеактуальнаяНастройка.Значение.СпособОплаты,
				НеактуальнаяНастройка.Ключ);
			
		ИначеЕсли НеактуальнаяНастройка.Значение.ВидТокена =
				ОнлайнЗаказыСлужебный.ИдентификаторВидаТокенаОблачнаяКасса() Тогда
			
			НеиспользуемыеНастройкиОблачныхКасс.Вставить(
				НеактуальнаяНастройка.Значение.СпособОплаты,
				НеактуальнаяНастройка.Ключ);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЗначениеЗаполнено(НеиспользуемыеНастройкиОплат)
		Или ЗначениеЗаполнено(НеиспользуемыеНастройкиОблачныхКасс) Тогда
		
		НеиспользуемыеНастройки.Вставить(
			ОнлайнЗаказыСлужебный.ИдентификаторВидаТокенаПриемОплат(),
			НеиспользуемыеНастройкиОплат);
		НеиспользуемыеНастройки.Вставить(
			ОнлайнЗаказыСлужебный.ИдентификаторВидаТокенаОблачнаяКасса(),
			НеиспользуемыеНастройкиОблачныхКасс);
		
	КонецЕсли;
		
	Возврат НеиспользуемыеНастройки;
	
КонецФункции

Функция СуществуютНастройки(
		НастройкаОнлайнЗаказов,
		ВидТокена,
		НастройкаПодключения)
	
	Если ВидТокена = ОнлайнЗаказыСлужебный.ИдентификаторВидаТокенаПриемОплат() Тогда
		Возврат СуществуютНастройкиПоНастройкеОплаты(
			НастройкаПодключения,
			НастройкаОнлайнЗаказов)
	ИначеЕсли ВидТокена = ОнлайнЗаказыСлужебный.ИдентификаторВидаТокенаОблачнаяКасса() Тогда
		Возврат СуществуютНастройкиПоОблачнойКассе(
			НастройкаПодключения,
			НастройкаОнлайнЗаказов)
	КонецЕсли
	
КонецФункции

// Определяет наличие введенных настроек онлайн-заказов по переданной настройке оплаты.
//
// Параметры:
//  НастройкаОплаты - СправочникСсылка.НастройкиПодключенияКСистемеБыстрыхПлатежей,
//    СправочникСсылка.НастройкиПодключенияКИнтернетЭквайрингу - искомая настройка подключения.
//  ИсключаемаяНастройка - СправочникСсылка.НастройкиПодключенияКОнлайнЗаказам -
//    Настройка подключения не учитываемая в результатах запроса.
//
// Возвращаемое значение:
//  Булево - Истина, если настройки введены.
//
Функция СуществуютНастройкиПоНастройкеОплаты(
		НастройкаОплаты,
		ИсключаемаяНастройка = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НастройкиПодключенияКОнлайнЗаказамНастройкиОплаты.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.НастройкиПодключенияКОнлайнЗаказам.НастройкиОплаты КАК НастройкиПодключенияКОнлайнЗаказамНастройкиОплаты
	|ГДЕ
	|	НастройкиПодключенияКОнлайнЗаказамНастройкиОплаты.НастройкаПодключения = &НастройкаОплаты
	|	И НастройкиПодключенияКОнлайнЗаказамНастройкиОплаты.Используется
	|	И НастройкиПодключенияКОнлайнЗаказамНастройкиОплаты.Ссылка <> &ИсключаемаяНастройка";
	
	Запрос.УстановитьПараметр("НастройкаОплаты",      НастройкаОплаты);
	Запрос.УстановитьПараметр("ИсключаемаяНастройка", ИсключаемаяНастройка);
	
	УстановитьПривилегированныйРежим(Истина);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

// Определяет наличие введенных настроек онлайн-заказов по переданной настройке оплаты.
//
// Параметры:
//  НастройкаОблачнойКассы - СправочникСсылка.НастройкиПодключенияКОблачнымКассам - искомая настройка подключения.
//  ИсключаемаяНастройка - СправочникСсылка.НастройкиПодключенияКОнлайнЗаказам -
//    Настройка подключения не учитываемая в результатах запроса.
//
// Возвращаемое значение:
//  Булево - Истина, если настройки введены.
//
Функция СуществуютНастройкиПоОблачнойКассе(
		НастройкаОблачнойКассы,
		ИсключаемаяНастройка = Неопределено)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НастройкиПодключенияКОнлайнЗаказам.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.НастройкиПодключенияКОнлайнЗаказам КАК НастройкиПодключенияКОнлайнЗаказам
	|ГДЕ
	|	НастройкиПодключенияКОнлайнЗаказам.Ссылка <> &ИсключаемаяНастройка
	|	И НастройкиПодключенияКОнлайнЗаказам.НастройкаПодключенияКОблачнойКассе = &НастройкаОблачнойКассы";
	
	Запрос.УстановитьПараметр("НастройкаОблачнойКассы", НастройкаОблачнойКассы);
	Запрос.УстановитьПараметр("ИсключаемаяНастройка", ИсключаемаяНастройка);
	
	УстановитьПривилегированныйРежим(Истина);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

// Определяет перечень введенных настроек онлайн-заказов по переданной настройке оплаты.
//
// Параметры:
//  НастройкаОплаты - СправочникСсылка.НастройкиПодключенияКСистемеБыстрыхПлатежей,
//    СправочникСсылка.НастройкиПодключенияКИнтернетЭквайрингу,
//    СправочникСсылка.НастройкиПодключенияКПлатежнымСистемам - настройка подключения к платежной системе.
//  Организация - ОпределяемыйТип.Организация, Неопределено - Организация по которой выполняется запрос,
//    Неопределено если отбор по организации не нужен.
//  БезОшибокСинхронизации - Булево - В случае Истина будут отобраны настройки без ошибок в синхронизации,
//    в случае Ложь отбор не накладывается.
//
// Возвращаемое значение:
//  Массив Из СправочникСсылка.НастройкиПодключенияКОнлайнЗаказам - перечень настроек.
//
Функция НастройкиПодключенияПоНастройкеОплаты(
	НастройкаОплаты,
	Организация,
	БезОшибокСинхронизации) Экспорт
	
	НастройкиПодключения = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НастройкиПодключенияКОнлайнЗаказамНастройкиОплаты.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.НастройкиПодключенияКОнлайнЗаказам.НастройкиОплаты КАК НастройкиПодключенияКОнлайнЗаказамНастройкиОплаты
	|ГДЕ
	|	НастройкиПодключенияКОнлайнЗаказамНастройкиОплаты.НастройкаПодключения = &НастройкаОплаты
	|	И &УсловиеПоОрганизации
	|	И &УсловиеПоОшибкеСинхронизации
	|
	|УПОРЯДОЧИТЬ ПО
	|	НастройкиПодключенияКОнлайнЗаказамНастройкиОплаты.Ссылка.ОшибкаСинхронизации УБЫВ";
	
	Запрос.УстановитьПараметр("НастройкаОплаты", НастройкаОплаты);
	
	Если ЗначениеЗаполнено(Организация) Тогда
		Запрос.УстановитьПараметр("Организация", Организация);
		Запрос.Текст = СтрЗаменить(
			Запрос.Текст,
			"&УсловиеПоОрганизации",
			"НастройкиПодключенияКОнлайнЗаказамНастройкиОплаты.Ссылка.Организация = &Организация");
	Иначе
		Запрос.Текст = СтрЗаменить(
			Запрос.Текст,
			"&УсловиеПоОрганизации",
			"ИСТИНА");
	КонецЕсли;
	
	Если БезОшибокСинхронизации Тогда
		Запрос.Текст = СтрЗаменить(
			Запрос.Текст,
			"&УсловиеПоОшибкеСинхронизации",
			"НЕ НастройкиПодключенияКОнлайнЗаказамНастройкиОплаты.Ссылка.ОшибкаСинхронизации");
	Иначе
		Запрос.Текст = СтрЗаменить(
			Запрос.Текст,
			"&УсловиеПоОшибкеСинхронизации",
			"ИСТИНА");
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НастройкиПодключения.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
	Возврат НастройкиПодключения;
	
КонецФункции

// Определяет наличие настроек подключения онлайн-заказов.
//
// Возвращаемое значение:
//  Булево - если Истина, есть настройки подключения.
//
Функция ЕстьНастройкиПодключения() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ИСТИНА КАК Признак
	|ИЗ
	|	Справочник.НастройкиПодключенияКОнлайнЗаказам КАК НастройкиПодключенияКОнлайнЗаказам";
	
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции

// Устанавливает признак ошибки синхронизации настройки с сервисом.
//
// Параметры:
//  НастройкаПодключения - СправочникСсылка.НастройкиПодключенияКОнлайнЗаказам -
//    настройка подключения к онлайн-заказам.
//  ЗначениеОшибки - Булево - значение признака ошибки синхронизации.
//
Процедура УстановитьОшибкуСинхронизации(НастройкаПодключения, ЗначениеОшибки) Экспорт
	
	НачатьТранзакцию();
	
	Попытка
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("Справочник.НастройкиПодключенияКОнлайнЗаказам");
		ЭлементБлокировки.УстановитьЗначение("Ссылка", НастройкаПодключения);
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		Блокировка.Заблокировать();
		
		НастройкаПодключенияОбъект = НастройкаПодключения.ПолучитьОбъект();
		Если НастройкаПодключенияОбъект.ОшибкаСинхронизации = ЗначениеОшибки Тогда
			ЗафиксироватьТранзакцию();
			Возврат;
		КонецЕсли;
		НастройкаПодключенияОбъект.ОшибкаСинхронизации = ЗначениеОшибки;
		НастройкаПодключенияОбъект.Записать();
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
	КонецПопытки;
	
КонецПроцедуры

Функция УстановитьПризнакОшибкиСинхронизации(НастройкаПодключенияОбъект)
	
	Результат = Новый Структура;
	Результат.Вставить("Ошибка", Ложь);
	Результат.Вставить("СообщениеОбОшибке", "");
	
	НачатьТранзакцию();
	
	Попытка
		
		НастройкаПодключенияОбъект.ОшибкаСинхронизации = Истина;
		НастройкаПодключенияОбъект.Записать();
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		// Вызов во вложенной транзакции не предполагается,
		// вместо вызова исключения обработка ошибки делегируется
		// вызывающему методу.
		Результат.Ошибка = Истина;
		Результат.СообщениеОбОшибке = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не удалось включить настройку подключения по причине:
				|%1'"),
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
		Возврат Результат;
		
	КонецПопытки;
	
КонецФункции

Процедура ПроверитьОбъектОбработан(Форма) Экспорт
	
	ОбъектОбработан = ОбновлениеИнформационнойБазы.ОбъектОбработан(
		"Справочник.НастройкиПодключенияКОнлайнЗаказам");
	Если ОбъектОбработан.Обработан Тогда
		Возврат;
	КонецЕсли;
	
	Форма.ТолькоПросмотр = Истина;
	
	ПараметрыСообщения = ОбщегоНазначения.ПараметрыВажногоСообщения();
	ПараметрыСообщения.Скрываемый = Ложь;
	ПараметрыСообщения.КраткоеПредставление = НСтр("ru = 'Не завершено обновление'");
	ПараметрыСообщения.Сообщение = НСтр("ru = 'Не завершен переход на новую версию программы.
		|Изменение данных временно запрещено.'");
	ПараметрыСообщения.Идентификатор = "НеЗавершеноОбновление";
	
	ОбщегоНазначения.ДобавитьВажноеСообщение(
		Форма,
		ПараметрыСообщения);
	
КонецПроцедуры

Функция ПроверитьАктуальностьНастройкиПодключения(НастройкаПодключенияОбъект)
	
	Результат = Новый Структура;
	Результат.Вставить("НеактуальныеНастройки", Новый ФиксированноеСоответствие(Новый Соответствие));
	Результат.Вставить("ИзмененыНастройкиСтраницы", Ложь);
	
	Если Не ЗначениеЗаполнено(НастройкаПодключенияОбъект.Ссылка) Тогда
		Возврат Результат;
	КонецЕсли;
	
	НеактуальныеНастройкиВрем = Новый Соответствие;
	ИзмененыНастройкиОплатФискализации = Ложь;
	
	СохраненнаяНастройка = НастройкаПодключенияОбъект.Ссылка.ПолучитьОбъект();
	
	ПроверитьАктуальностьНастроекФискализации(
		НастройкаПодключенияОбъект,
		СохраненнаяНастройка,
		НеактуальныеНастройкиВрем,
		ИзмененыНастройкиОплатФискализации);
	ПроверитьАктуальностьНастроекОплат(
		НастройкаПодключенияОбъект,
		СохраненнаяНастройка,
		НеактуальныеНастройкиВрем,
		ИзмененыНастройкиОплатФискализации);
	
	Если СохраненнаяНастройка.Используется <> НастройкаПодключенияОбъект.Используется
		Или СохраненнаяНастройка.Наименование <> НастройкаПодключенияОбъект.Наименование
		Или ИзмененыНастройкиОплатФискализации Тогда
		Результат.ИзмененыНастройкиСтраницы = Истина;
	КонецЕсли;
	
	Результат.НеактуальныеНастройки = Новый ФиксированноеСоответствие(НеактуальныеНастройкиВрем);
	
	Возврат Результат;
	
КонецФункции

Процедура ПроверитьАктуальностьНастроекФискализации(
	НастройкаПодключенияОбъект,
	СохраненнаяНастройка,
	НеактуальныеНастройкиВрем,
	ИзмененыНастройкиОплатФискализации)
	
	НеобходимОтзывТокенов = Не НастройкаПодключенияОбъект.Используется И СохраненнаяНастройка.Используется;
	
	Если СохраненнаяНастройка.ФискализироватьОнлайнЗаказы <> НастройкаПодключенияОбъект.ФискализироватьОнлайнЗаказы Тогда
		ИзмененыНастройкиОплатФискализации = Истина;
	КонецЕсли;
	
	НастройкаПодключенияКОблачнойКассеСохраненная = ?(
		СохраненнаяНастройка.ФискализироватьОнлайнЗаказы,
		СохраненнаяНастройка.НастройкаПодключенияКОблачнойКассе,
		Неопределено);
	
	НастройкаПодключенияКОблачнойКассе = ?(
		НастройкаПодключенияОбъект.ФискализироватьОнлайнЗаказы,
		НастройкаПодключенияОбъект.НастройкаПодключенияКОблачнойКассе,
		Неопределено);
	
	Если НастройкаПодключенияОбъект.ФискализироватьОнлайнЗаказы
		И НастройкаПодключенияКОблачнойКассеСохраненная <> НастройкаПодключенияОбъект.НастройкаПодключенияКОблачнойКассе Тогда
		ИзмененыНастройкиОплатФискализации = Истина;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(НастройкаПодключенияКОблачнойКассеСохраненная) Тогда
		Возврат;
	КонецЕсли;
	
	Если НастройкаПодключенияКОблачнойКассеСохраненная <> НастройкаПодключенияОбъект.НастройкаПодключенияКОблачнойКассе
		Или НеобходимОтзывТокенов Тогда
		
		НеактуальныеНастройкиВрем.Вставить(
			НастройкаПодключенияКОблачнойКассеСохраненная,
			НовыйПараметрыНастройкиПодключения(
				ОнлайнЗаказыСлужебный.ИдентификаторВидаТокенаОблачнаяКасса(),
				Перечисления.СпособыОплатыОнлайнЗаказов.ПустаяСсылка()));
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьАктуальностьНастроекОплат(
		НастройкаПодключенияОбъект,
		СохраненнаяНастройка,
		НеактуальныеНастройкиВрем,
		ИзмененыНастройкиОплатФискализации)
	
	НеобходимОтзывТокенов = Не НастройкаПодключенияОбъект.Используется И СохраненнаяНастройка.Используется;
	
	Если СохраненнаяНастройка.ПоРеквизитамОтФизЛиц <> НастройкаПодключенияОбъект.ПоРеквизитамОтФизЛиц
		Или СохраненнаяНастройка.ПоРеквизитамОтЮрЛиц <> НастройкаПодключенияОбъект.ПоРеквизитамОтЮрЛиц Тогда
		ИзмененыНастройкиОплатФискализации = Истина;
	КонецЕсли;
	
	Если СохраненнаяНастройка.НастройкиОплаты.Количество() <> НастройкаПодключенияОбъект.НастройкиОплаты.Количество() Тогда
		ИзмененыНастройкиОплатФискализации = Истина;
	КонецЕсли;
	
	Для Каждого СохраненнаяНастройкаОплаты Из СохраненнаяНастройка.НастройкиОплаты Цикл
		
		НастройкаОплаты = Неопределено;
		НастройкаОплатыИспользуется = Ложь;
		
		Отбор = Новый Структура;
		Отбор.Вставить("СпособОплаты", СохраненнаяНастройкаОплаты.СпособОплаты);
		
		НайденныеЗначения = НастройкаПодключенияОбъект.НастройкиОплаты.НайтиСтроки(Отбор);
		
		Для Каждого НайденноеЗначение Из НайденныеЗначения Цикл
			НастройкаОплаты = НайденноеЗначение.НастройкаПодключения;
			НастройкаОплатыИспользуется = НайденноеЗначение.Используется;
		КонецЦикла;
		
		Если СохраненнаяНастройкаОплаты.Используется <> НастройкаОплатыИспользуется Тогда
			ИзмененыНастройкиОплатФискализации = Истина;
		ИначеЕсли НастройкаОплатыИспользуется
			И СохраненнаяНастройкаОплаты.НастройкаПодключения <> НастройкаОплаты Тогда
			ИзмененыНастройкиОплатФискализации = Истина;
		КонецЕсли;
		
		Если НастройкаНеактуальна(СохраненнаяНастройкаОплаты, НастройкаОплаты, НастройкаОплатыИспользуется)
			Или НеобходимОтзывТокенов Тогда
			НеактуальныеНастройкиВрем.Вставить(
				СохраненнаяНастройкаОплаты.НастройкаПодключения,
				НовыйПараметрыНастройкиПодключения(
					ОнлайнЗаказыСлужебный.ИдентификаторВидаТокенаПриемОплат(),
					СохраненнаяНастройкаОплаты.СпособОплаты));
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция НастройкаНеактуальна(
		СохраненнаяНастройкаОплаты,
		НастройкаОплаты,
		НастройкаОплатыИспользуется)
	
	Если СохраненнаяНастройкаОплаты.Используется = Ложь
		И НастройкаОплатыИспользуется = Ложь Тогда
		Возврат Ложь;
	ИначеЕсли СохраненнаяНастройкаОплаты.Используется И Не НастройкаОплатыИспользуется Тогда
		Возврат Истина;
	ИначеЕсли СохраненнаяНастройкаОплаты.Используется
		И СохраненнаяНастройкаОплаты.НастройкаПодключения <> НастройкаОплаты Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Функция НовыйПараметрыНастройкиПодключения(
	ВидТокена,
	СпособОплаты)
	
	Результат = Новый Структура;
	Результат.Вставить("ВидТокена", ВидТокена);
	Результат.Вставить("СпособОплаты", СпособОплаты);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли