///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2026, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СрокЖизниОнлайнЗаказов = ОнлайнЗаказыСлужебный.НастройкиСрокаЖизни();
	
	ТипПериодаСрокаЖизни = СрокЖизниОнлайнЗаказов.ТипПериодаСрокаЖизни;
	СрокЖизни = СрокЖизниОнлайнЗаказов.СрокЖизни;
	
	СформироватьСписокСрокаЖизни();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если ОписаниеОповещенияОЗакрытии <> Неопределено
		И ОписаниеОповещенияОЗакрытии.ДополнительныеПараметры.Свойство("ПредставлениеСрокаЖизни") Тогда
		
		ОписаниеОповещенияОЗакрытии.ДополнительныеПараметры.ПредставлениеСрокаЖизни = ПредставлениеСрокаЖизни;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СрокЖизниПриИзменении(Элемент)
	
	СформироватьСписокСрокаЖизни();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сохранить(Команда)
	
	СрокЖизниЗаписан = ЗаписатьСрокЖизниОнлайнЗаказов();
	
	Если СрокЖизниЗаписан Тогда
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СформироватьСписокСрокаЖизни()
	
	Элементы.ТипПериодаСрокаЖизни.СписокВыбора.Очистить();
	
	Элементы.ТипПериодаСрокаЖизни.СписокВыбора.Добавить(
		ОнлайнЗаказыСлужебный.ИдентификаторИзмеренияСрокаЖизниДни(),
		ОнлайнЗаказыСлужебный.ПредставлениеИзмеренияСрокаЖизни(
			ОнлайнЗаказыСлужебный.ИдентификаторИзмеренияСрокаЖизниДни(),
			СрокЖизни));
	
	Элементы.ТипПериодаСрокаЖизни.СписокВыбора.Добавить(
		ОнлайнЗаказыСлужебный.ИдентификаторИзмеренияСрокаЖизниЧасы(),
		ОнлайнЗаказыСлужебный.ПредставлениеИзмеренияСрокаЖизни(
			ОнлайнЗаказыСлужебный.ИдентификаторИзмеренияСрокаЖизниЧасы(),
			СрокЖизни));
		
	Элементы.ТипПериодаСрокаЖизни.СписокВыбора.Добавить(
		ОнлайнЗаказыСлужебный.ИдентификаторИзмеренияСрокаЖизниМинуты(),
		ОнлайнЗаказыСлужебный.ПредставлениеИзмеренияСрокаЖизни(
			ОнлайнЗаказыСлужебный.ИдентификаторИзмеренияСрокаЖизниМинуты(),
			СрокЖизни));
	
КонецПроцедуры

&НаСервере
Функция ЗаписатьСрокЖизниОнлайнЗаказов()
	
	СрокЖизниВМинутах = ОнлайнЗаказыСлужебный.СрокЖизниВМинутах(СрокЖизни, ТипПериодаСрокаЖизни);
	
	Если СрокЖизниВМинутах > 60 * 24 *30 Тогда
		ОбщегоНазначения.СообщитьПользователю(
			НСтр("ru = 'Превышен максимальный срок жизни онлайн-заказа (30 дней).'"),
			,
			"СрокЖизни");
		Возврат Ложь;
	КонецЕсли;
	
	ОнлайнЗаказыСлужебный.СохранитьНастройкиСрокаЖизни(
		СрокЖизни,
		ТипПериодаСрокаЖизни,
		СрокЖизниВМинутах);
	ПредставлениеСрокаЖизни = ОнлайнЗаказыСлужебный.ПредставлениеСрокаЖизни(
		СрокЖизни,
		ТипПериодаСрокаЖизни);
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти
