&НаКлиенте
Перем КонтекстЭДОКлиент;

&НаКлиенте
Перем ВыбранныеОрганизации; // для обмена.

&НаКлиенте
Перем НомерОбъекта; // для обмена.

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	ЭтоРежимОблачной1СО = ДокументооборотСКОПовтИсп.ЭтоРежимОблачной1СО();
	НовыеСобытияПоСтраницамЖурнала =
		ЭлектронныйДокументооборотСКонтролирующимиОрганамиВызовСервера.НовыеСобытияПоСтраницамЖурнала();
	ЭтоАвтообмен = НЕ ЭтоРежимОблачной1СО ИЛИ НЕ НовыеСобытияПоСтраницамЖурнала
		ИЛИ НЕ Параметры.Свойство("ПереданныйРежимОткрытияОкна")
		ИЛИ НЕ ЗначениеЗаполнено(Параметры.ПереданныйРежимОткрытияОкна);
	
	Параметры.Свойство("АдресСведенийПоОшибкам", АдресСведенийПоОшибкам);
	Если НЕ ЗначениеЗаполнено(АдресСведенийПоОшибкам) И НЕ ЭтоАвтообмен Тогда
		ОшибкиПоследнегоОбмена = ДлительнаяОтправкаВызовСервера.ПолучитьОшибкиПоследнегоОбмена();
		Если ОшибкиПоследнегоОбмена <> Неопределено Тогда
			АдресСведенийПоОшибкам = ПоместитьВоВременноеХранилище(ОшибкиПоследнегоОбмена, Новый УникальныйИдентификатор);
		КонецЕсли;
	КонецЕсли;
	УстановитьВидимостьПанелиОшибокОбновления(ЭтаФорма);
	
	ОткрыватьВЛюбомСлучае = Параметры.Свойство("АдресДереваНовых") И ЗначениеЗаполнено(Параметры.АдресДереваНовых);
	
	Параметры.Свойство("ЭтоРасшифровка", ЭтоРасшифровка);
	
	Если НовыеСобытияПоСтраницамЖурнала Тогда
		МассивИнформацииЭкранов = ПолучитьИнформациюЭкрановКлиента();
		Если МассивИнформацииЭкранов <> Неопределено И МассивИнформацииЭкранов.Количество() <> 0 Тогда
			ШиринаЭкрана = МассивИнформацииЭкранов[0].Ширина + 0;
			ЭтоНебольшойЭкран = ШиринаЭкрана <> 0 И ШиринаЭкрана <= 1680;
		КонецЕсли;
	КонецЕсли;
	АдресДереваНовых = Неопределено;
	Параметры.Свойство("АдресДереваНовых", АдресДереваНовых);
	ЗаполнитьДеревоНовое(АдресДереваНовых);
	Если НовыеСобытияПоСтраницамЖурнала Тогда
		Элементы.Новое.НачальноеОтображениеДерева = НачальноеОтображениеДерева.РаскрыватьВсеУровни;
	КонецЕсли;
	Элементы.ГруппаОтборовНовое.Видимость = НовыеСобытияПоСтраницамЖурнала;
	Элементы.ГруппаНовоеОбмен.Видимость = ЭтоРежимОблачной1СО;
	Элементы.ОткрытьВПолномРазмере.Видимость = ЭтоАвтообмен;
	ПоказыватьНеобходимоРасшифровать = НовыеСобытияПоСтраницамЖурнала И НЕ ЭтоАвтообмен
		И ?(Параметры.Свойство("ПереданныйРежимОткрытияОкна"), Параметры.ПереданныйРежимОткрытияОкна,
			РежимОткрытияОкнаФормы.Независимый) = РежимОткрытияОкнаФормы.Независимый;
	ЗаполнитьНеобходимоРасшифровать();
	Если ЭтоРежимОблачной1СО И НовыеСобытияПоСтраницамЖурнала Тогда
		МассивПодключенныхОрганизаций = ЭлектронныйДокументооборотСКонтролирующимиОрганами.ПодключенныеОрганизации();
		ПодключенныеОрганизации.ЗагрузитьЗначения(МассивПодключенныхОрганизаций);
	КонецЕсли;
	
	Если ЭтоАвтообмен Тогда
		Заголовок = СтрШаблон(
			НСтр("ru = 'Обмен с контролирующими органами %1'"),
			Формат(ДатаПоследнегоОбновления, "ДФ='дд.ММ.гггг Ч:мм'"));
		
	Иначе
		Заголовок = НСтр("ru = 'Новые сообщения'");
	КонецЕсли;
	
	Если ЭтоАвтообмен И КоличествоНовых = 0 И НЕ ОткрыватьВЛюбомСлучае Тогда
		Отказ = Истина;
	КонецЕсли;
	
	Попытка
		МодульСверкаСФНС = ОбщегоНазначения.ОбщийМодуль("СверкаСФНС");
	Исключение
	    МодульСверкаСФНС = Неопределено;
	КонецПопытки;
	
	Если МодульСверкаСФНС <> Неопределено Тогда
		МодульСверкаСФНС.ФормаНовыхСобытий_ПриСозданииНаСервере(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Завершение обновления"
		ИЛИ ИмяСобытия = "Завершение расшифровки"
		ИЛИ ИмяСобытия = "Завершение групповой отправки" Тогда
		
		ЗаполнитьНеобходимоРасшифроватьВФоне();
		
	ИначеЕсли ИмяСобытия = "Пометка прочтенным"
		ИЛИ ИмяСобытия = "Пометка непрочтенным"
		ИЛИ ИмяСобытия = "Скрытие/восстановление объекта" Тогда
		
		Если ЭтоРежимОблачной1СО Тогда
			СсылкаВКлюче = Неопределено;
			Если ТипЗнч(Параметр) = Тип("Структура") И Параметр.Свойство("Организация") И Параметр.Свойство("Ссылка") Тогда
				СсылкаВКлюче = Параметр.Ссылка;
			ИначеЕсли Параметр = Неопределено Тогда
				СсылкаВКлюче = Источник;
			ИначеЕсли Источник <> Неопределено И ОбщегоНазначенияЭДКОКлиент.ЭтоЗначениеТипаСОтображениемНаСервере(Источник) Тогда
				СсылкаВКлюче = Источник;
			КонецЕсли;
			
			МодульКалендарьОтчетностиВызовСервера = ОбщегоНазначенияКлиент.ОбщийМодуль("КалендарьОтчетностиВызовСервера");
			МодульКалендарьОтчетностиВызовСервера.СнятьУстановитьПометкуНовогоДляДокументаСЭДО(СсылкаВКлюче, ИмяСобытия);
		КонецЕсли;
		
		Если ИмяСобытия = "Пометка непрочтенным" ИЛИ ИмяСобытия = "Скрытие/восстановление объекта" Тогда
			ЗаполнитьДеревоНовое(Истина);
			ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент.СвернутьНезначимоеНовое(ЭтотОбъект);
		Иначе
			СтрокиДерева = Новое.ПолучитьЭлементы();
			Если НовыеСобытияПоСтраницамЖурнала Тогда
				СтрокиДерева = ОбщегоНазначенияЭДКОКлиентСервер.СтрокиДереваСПодчиненными(СтрокиДерева);
			КонецЕсли;
			Для Каждого СтрокаДерева Из СтрокиДерева Цикл
				Если СтрокаДерева.ИсходнаяГруппа = ПредопределенноеЗначение("Перечисление.ГруппыНовыхСобытийДокументооборотаСКонтролирующимиОрганами.НезавершенныеОтправки") Тогда
					Прервать;
				КонецЕсли;
				
				Если СтрокаДерева.Ссылка = Источник Тогда
					СтрокаДерева.НеПрочитано = Ложь;
					СписокСсылок = Новый Массив;
					СписокСсылок.Добавить(Источник);
					ОбновитьКоличествоНовых(ЭтаФорма);
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
	ИначеЕсли (ИмяСобытия = "Получены новые сообщения 1С-Отчетности"
		ИЛИ ИмяСобытия = "Получены новые сообщения 1С-Отчетности без смены страницы") И Источник <> ЭтотОбъект Тогда
		
		Оповестить("Закрыть форму новых сообщений 1С-Отчетности",, ЭтотОбъект);
		
		Если ТипЗнч(Параметр) = Тип("Структура") И Параметр.Свойство("АдресСведенийПоОшибкам")
			ИЛИ ЭтоАдресВременногоХранилища(Параметр) Тогда
			
			Если ТипЗнч(Параметр) = Тип("Структура") Тогда
				АдресСведенийПоОшибкам = Параметр.АдресСведенийПоОшибкам;
			ИначеЕсли ЭтоАдресВременногоХранилища(Параметр) Тогда
				АдресСведенийПоОшибкам = Параметр;
			КонецЕсли;
			УстановитьВидимостьПанелиОшибокОбновления(ЭтаФорма);
		КонецЕсли;
		
		ЗаполнитьДеревоНовое();
		ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент.СвернутьНезначимоеНовое(ЭтотОбъект);
		ЗаполнитьНеобходимоРасшифроватьВФоне();
		
	ИначеЕсли ИмяСобытия = "Завершение автообмена с сервером ФСС" ИЛИ ИмяСобытия = "Завершение автообмена с сервером ФСРАР"
		ИЛИ ИмяСобытия = "Завершение автообмена с сервером РПН" ИЛИ ИмяСобытия = "Завершение автообмена с сервером ФТС"
		Или ИмяСобытия = РегламентированнаяОтчетностьКлиент.ИмяСобытияЗавершениеОтправкиВКонтролирующийОрган()
		ИЛИ ИмяСобытия = РегламентированнаяОтчетностьКлиент.ИмяСобытияЗавершениеОтправки()  Тогда
		
		ЗаполнитьДеревоНовое();
		ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент.СвернутьНезначимоеНовое(ЭтотОбъект);
	
	ИначеЕсли ИмяСобытия = "Закрыть форму новых сообщений 1С-Отчетности" И Источник <> ЭтаФорма
		И ЭтоАвтообмен Тогда
		
		ОтключитьОбработчикОжидания("ИнициализацияКонтекстЭДО");
		Если Открыта() Тогда
			Закрыть();
		КонецЕсли;
		
	ИначеЕсли ИмяСобытия = "ЗаполнитьНеобходимоРасшифровать" Тогда
		Если Параметр.Статус <> Неопределено И Параметр.Статус = "Выполнено" Тогда
			НеобходимоРасшифровать = ПолучитьИзВременногоХранилища(Параметр.АдресРезультата);
			ЗаполнитьНеобходимоРасшифровать(НеобходимоРасшифровать);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаУведомленияПолученияСообщения(Результат, ДополнительныеПараметры = Неопределено) Экспорт
	
	ЗаполнитьНеобходимоРасшифроватьВФоне();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Оповещение в форму 1С-Отчетности для того, чтобы вместо формы новых открыть закладку Новые.
	Оповестить("Получены новые сообщения 1С-Отчетности", АдресСведенийПоОшибкам, ЭтаФорма);
	
	ИщемФорму = ?(ЭтоРежимОблачной1СО
		И ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиентСервер.Облачная1СОИспользоватьФормуНовыхСобытий(),
		"Форма.ФормаНовыхСобытий", "ОбщаяФорма.РегламентированнаяОтчетность");
	Если ЭтоАвтообмен
		И ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент.ФормаОткрыта(ИщемФорму) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	#Если НЕ ВебКлиент Тогда
		Если НовыеСобытияПоСтраницамЖурнала Тогда
			СистемнаяИнформация = Новый СистемнаяИнформация;
			Если ОбщегоНазначенияКлиентСервер.СравнитьВерсии("8.3.26.0", СистемнаяИнформация.ВерсияПриложения) <= 0 Тогда
				ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаУведомленияПолученияСообщения", ЭтотОбъект);
				Выполнить("УведомленияКлиента.ПодключитьОбработчик(""ДокументооборотСКО_ПолученыСообщения"", ОписаниеОповещения)");
				Выполнить("УведомленияКлиента.ПодключитьОбработчик(""ЭлектронныйДокументооборотСФСС_ПолученыСообщенияСЭДО"", ОписаниеОповещения)");
			КонецЕсли;
		КонецЕсли;
	#КонецЕсли
	
	ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент.СвернутьНезначимоеНовое(ЭтотОбъект);
	
	Если НовыеСобытияПоСтраницамЖурнала Тогда
		// переход на первый элемент с данными и раскрыть его
		ПерейтиНаБлокНовогоИРаскрыть();
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ИнициализацияКонтекстЭДОЗавершение", ЭтотОбъект);
	ДокументооборотСКОКлиент.ПолучитьКонтекстЭДО(ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ИнициализацияКонтекстЭДОЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	КонтекстЭДОКлиент = Результат.КонтекстЭДО;
	ТекстОшибкиИнициализацииКонтекстаЭДО = Результат.ТекстОшибки;
	
	ОтметитьДеревоПросмотренным();
	
	ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент.ФормаНовыхСобытий_ПослеОткрытия();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	#Если НЕ ВебКлиент Тогда
		Если НовыеСобытияПоСтраницамЖурнала Тогда
			СистемнаяИнформация = Новый СистемнаяИнформация;
			Если ОбщегоНазначенияКлиентСервер.СравнитьВерсии("8.3.26.0", СистемнаяИнформация.ВерсияПриложения) <= 0 Тогда
				Выполнить("УведомленияКлиента.ОтключитьОбработчик(""ДокументооборотСКО_ПолученыСообщения"")");
				Выполнить("УведомленияКлиента.ОтключитьОбработчик(""ЭлектронныйДокументооборотСФСС_ПолученыСообщенияСЭДО"")");
			КонецЕсли;
		КонецЕсли;
	#КонецЕсли
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СообщениеПроОшибкиОбменаОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;

	ВходящийКонтекст = ПолучитьИзВременногоХранилища(АдресСведенийПоОшибкам);
	
	ДлительнаяОтправкаКлиент.ПоказатьОшибки(КонтекстЭДОКлиент.ПутьКОбъекту, ВходящийКонтекст);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборОрганизацияНовоеПриИзменении(Элемент)
	
	ЗаполнитьДеревоНовое();
	ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент.СвернутьНезначимоеНовое(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборГосорганНовоеПриИзменении(Элемент)
	
	ЗаполнитьДеревоНовое();
	ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент.СвернутьНезначимоеНовое(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПериодНовоеПриИзменении(Элемент)
	
	ЗаполнитьДеревоНовое();
	ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент.СвернутьНезначимоеНовое(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПериодНовоеНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОписаниеОповещения = Новый ОписаниеОповещения(
		"ОтборПериодНовоеНачалоВыбораПослеВыбора",
		ЭтотОбъект);
	
	НастройкиВызова = Новый Структура;
	НастройкиВызова.Вставить("ИмяРеквизитаНачалоПериода", "НачалоПериодаНовое");
	НастройкиВызова.Вставить("ИмяРеквизитаКонецПериода", "КонецПериодаНовое");
	НастройкиВызова.Вставить("ИмяРеквизитаТолькоУказанныйПериод", "ТолькоУказанныйПериодНовое");
	
	ТекущаяДатаСеанса = ОбщегоНазначенияКлиент.ДатаСеанса();
	
	РегламентированнаяОтчетностьКлиент.ОтборПериодНачалоВыбора(
		ЭтотОбъект,
		ОписаниеОповещения,
		СтандартнаяОбработка,
		ТекущаяДатаСеанса,
		НастройкиВызова);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПериодНовоеНачалоВыбораПослеВыбора(РезультатВыбора, ДопПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОтборПериодНовое = РезультатВыбора.ПериодОтчета;
	НачалоПериодаНовое = РезультатВыбора.НачалоПериода;
	КонецПериодаНовое = РезультатВыбора.КонецПериода;
	ТолькоУказанныйПериодНовое = РезультатВыбора.ТолькоУказанныйПериод;
	
	ЗаполнитьДеревоНовое();
	ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент.СвернутьНезначимоеНовое(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПериодНовоеОчистка(Элемент, СтандартнаяОбработка)
	
	НачалоПериодаНовое = Дата(1, 1, 1);
	КонецПериодаНовое = Дата(1, 1, 1);
	
	ЗаполнитьДеревоНовое();
	ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент.СвернутьНезначимоеНовое(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура БлокиНовогоТребованияЗаголовокНажатие(Элемент)
	
	ПерейтиНаБлокНовогоИРаскрыть(
		ПредопределенноеЗначение("Перечисление.ВидыДокументовВЖурнале.ТребованиеИлиУведомление"));
	
КонецПроцедуры

&НаКлиенте
Процедура БлокиНовогоОтчетыЗаголовокНажатие(Элемент)
	
	ПерейтиНаБлокНовогоИРаскрыть(ПредопределенноеЗначение("Перечисление.СтраницыЖурналаОтчетность.Отчеты"));
	
КонецПроцедуры

&НаКлиенте
Процедура БлокиНовогоУведомленияЗаголовокНажатие(Элемент)
	
	ПерейтиНаБлокНовогоИРаскрыть(ПредопределенноеЗначение("Перечисление.СтраницыЖурналаОтчетность.Уведомления"));
	
КонецПроцедуры

&НаКлиенте
Процедура БлокиНовогоСверкиЗаголовокНажатие(Элемент)
	
	ПерейтиНаБлокНовогоИРаскрыть(ПредопределенноеЗначение("Перечисление.СтраницыЖурналаОтчетность.Сверки"));
	
КонецПроцедуры

&НаКлиенте
Процедура БлокиНовогоПисьмаЗаголовокНажатие(Элемент)
	
	ПерейтиНаБлокНовогоИРаскрыть(ПредопределенноеЗначение("Перечисление.СтраницыЖурналаОтчетность.Письма"));
	
КонецПроцедуры

&НаКлиенте
Процедура БлокиНовогоВходящиеЗаголовокНажатие(Элемент)
	
	ПерейтиНаБлокНовогоИРаскрыть(ПредопределенноеЗначение("Перечисление.СтраницыЖурналаОтчетность.Входящие"));
	
КонецПроцедуры

&НаКлиенте
Процедура БлокиНовогоВыплатыИПособияЗаголовокНажатие(Элемент)
	
	ПерейтиНаБлокНовогоИРаскрыть(ПредопределенноеЗначение("Перечисление.СтраницыЖурналаОтчетность.ВыплатыИПособия"));
	
КонецПроцедуры

&НаКлиенте
Процедура БлокиНовогоРассылкиЗаголовокНажатие(Элемент)
	
	ПерейтиНаБлокНовогоИРаскрыть(ПредопределенноеЗначение("Перечисление.ВидыДокументовВЖурнале.Рассылка"));
	
КонецПроцедуры

&НаКлиенте
Процедура БлокиНовогоПрочтенныеЗаголовокНажатие(Элемент)
	
	ПерейтиНаБлокНовогоИРаскрыть("Прочтенные");
	
КонецПроцедуры

&НаКлиенте
Процедура БлокиНовогоОбработанныеЗапросыЗаголовокНажатие(Элемент)
	
	ПерейтиНаБлокНовогоИРаскрыть(
		ПредопределенноеЗначение("Перечисление.ГруппыНовыхСобытийДокументооборотаСКонтролирующимиОрганами.ОбработанныеЗапросы"));
	
КонецПроцедуры

&НаКлиенте
Процедура БлокиНовогоЗавершенныеОтправкиЗаголовокНажатие(Элемент)
	
	ПерейтиНаБлокНовогоИРаскрыть(
		ПредопределенноеЗначение("Перечисление.ГруппыНовыхСобытийДокументооборотаСКонтролирующимиОрганами.ЗавершенныеОтправки"));
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыНовое

&НаКлиенте
Процедура ТаблицаНовоеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Ссылка = Элемент.ТекущиеДанные.Ссылка;
	Если Поле.Имя = "ТаблицаНовоеОбъектНаименованиеСсылка" Тогда
		Если Элемент.ТекущиеДанные.ЕстьОтвет
			И ТипЗнч(Ссылка) <> Тип("СправочникСсылка.ДокументыРеализацииПолномочийНалоговыхОрганов") Тогда // есть ответ
			Если КонтекстЭДОКлиент <> Неопределено И НЕ ПереопределитьОткрытие(Элемент) Тогда
				Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.ЗапросНаИнформационноеОбслуживаниеНалогоплательщика") Тогда
					КонтекстЭДОКлиент.ПоказатьОтветНаЗапросИОН(Ссылка);
				ИначеЕсли ТипЗнч(Ссылка) = Тип("ДокументСсылка.ЗапросНаИнформационноеОбслуживаниеСтрахователя") Тогда
					КонтекстЭДОКлиент.ПоказатьОтветНаЗапросИОС(Ссылка);
				ИначеЕсли ТипЗнч(Ссылка) = Тип("ДокументСсылка.ЗапросНаВыпискуИзЕГРЮЛ_ЕГРИП") Тогда
					КонтекстЭДОКлиент.ПоказатьОтветНаЗапросВыпискиЕГРЮЛ_ЕГРИП(Ссылка);
				КонецЕсли;
				ДанныеВыделенныхСтрок = ДокументооборотСКОКлиент.ДанныеВыделенныхСтрок(Элементы.Новое);
				ПометитьПрочтенными(ДанныеВыделенныхСтрок);
			КонецЕсли;
		ИначеЕсли НЕ ПереопределитьОткрытие(Элемент) Тогда
			РедактироватьОбъект(Элемент);
		КонецЕсли;
	ИначеЕсли Поле.Имя = "ТаблицаНовоеСтатус" Тогда
		ПоказатьФормуСтатусовОтправкиИзСписка(Элемент);
	ИначеЕсли Поле.Имя = "ТаблицаНовоеЕстьКритическиеОшибкиОтправки" И Элемент.ТекущиеДанные.ЕстьКритическиеОшибкиОтправки Тогда
		ПоказатьКритическиеОшибкиПоСсылке(Ссылка);
	ИначеЕсли НЕ ПереопределитьОткрытие(Элемент) Тогда
		РедактироватьОбъект(Элемент);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура НеобходимоРасшифроватьРасшифровать(Команда)
	
	КонтекстЭДОКлиент.ПолучитьИОбработатьВходящиеКлиент(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанные(Команда)
	
	ДанныеДляОбмена = ВсеОрганизации();
	ВыбранныеОрганизации = ДанныеДляОбмена.МассивОрганизаций;
	
	КалендарьОтчетностиБРОКлиентПереопределяемый.ПолучитьОтборПоОрганизациям(ВыбранныеОрганизации);
	
	Если ДанныеДляОбмена.МассивОрганизаций.Количество() = 0
		И НЕ ДанныеДляОбмена.ЕстьОграничения Тогда
		ДлительнаяОтправкаКлиентСервер.ВывестиОшибку(НСтр("ru = 'Организация не выбрана'"), ,"Организация");
		Возврат;
	КонецЕсли;
	
	СостояниеВозможностиОбмена = КонтекстЭДОКлиент.СостояниеВозможностиОбмена(ДанныеДляОбмена.МассивОрганизаций);
	
	Если СостояниеВозможностиОбмена.Состояние = 1 Тогда
		ОбновитьДанныеПродолжить(ДанныеДляОбмена.МассивОрганизаций);
	ИначеЕсли СостояниеВозможностиОбмена.Состояние <> 2 Тогда
		ПараметрыЦикла = Новый Структура;
		ПараметрыЦикла.Вставить("ВыбранныеОрганизации", ДанныеДляОбмена.МассивОрганизаций);
		СледующееОповещение = Новый ОписаниеОповещения("НастроитьОграниченияОбмена", ЭтотОбъект, ПараметрыЦикла);
		ОткрытьФормуНастройкиОбновления(Истина, СледующееОповещение);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиОбновленияКоманднаяПанель(Команда)
	
	КалендарьОтчетностиБРОКлиентПереопределяемый.ОбработкаКоманды(ЭтотОбъект, Команда);
	
КонецПроцедуры

&НаКлиенте
Процедура СвернутьВсе(Команда)
	
	ВсеГруппы = Истина;
	РазвернутьГруппы = Ложь;
	ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент.СвернутьНезначимоеНовое(ЭтотОбъект, ВсеГруппы,
		РазвернутьГруппы);
	
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьВсе(Команда)
	
	ВсеГруппы = Истина;
	РазвернутьГруппы = Истина;
	ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент.СвернутьНезначимоеНовое(ЭтотОбъект, ВсеГруппы,
		РазвернутьГруппы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьВПолномРазмере(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Раздел", "new-button");
	ПараметрыФормы.Вставить("Форма", Неопределено);
	ПараметрыФормы.Вставить("РежимОткрытияОкна", РежимОткрытияОкнаФормы.Независимый);
	ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент.ОткрытьРазделОтчетности(ПараметрыФормы);
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ПометитьПрочитанным(Команда)
	
	Результат = ПометитьПрочтенными();
	
	Для каждого ИзменившийсяОбъект Из Результат.СтавшиеПрочтенными Цикл
		Оповестить("Пометка прочтенным", , ИзменившийсяОбъект);
	КонецЦикла;
	
	Для каждого ИзменившийсяОбъект Из Результат.СтавшиеНепрочтенными Цикл
		Оповестить("Пометка непрочтенным", , ИзменившийсяОбъект);
	КонецЦикла;
	
	// Обновление динамического списка.
	Элементы.Новое.Обновить();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбновитьДанныеПродолжить(ВыбранныеОрганизации)
	
	НомерОбъекта = 0;
	АдресСведенийПоОшибкам = "";
	УстановитьВидимостьПанелиОшибокОбновления(ЭтотОбъект);
	
	ИнтерфейсыВзаимодействияБРОКлиент.ОтложитьАвтообмен();
	ДокументооборотСКОКлиент.ЗапоминаниеОшибок("Сброс");
	ЖурналРегистрацииКлиент.ДобавитьСообщениеДляЖурналаРегистрации(
		НСтр("ru = 'Электронный документооборот с контролирующими органами. Обмен'"),,
		НСтр("ru = 'Запуск обновления'"));
	
	ПараметрыДлительногоОбмена = ДлительнаяОтправкаКлиент.ПараметрыДлительногоОбмена();
	ПараметрыДлительногоОбмена.Организации = ВыбранныеОрганизации;
	ПараметрыДлительногоОбмена.ЭтоОбменИзФормы1СОтчетность = Истина;
	
	Если НЕ ДлительнаяОтправкаКлиент.ПоказатьФормуДлительногоОбмена(ПараметрыДлительногоОбмена) Тогда // Обмен из 1С-Отчетность.
		Возврат;
	КонецЕсли;
	
	ПодключитьОбработчикОжидания("Подключаемый_ОсуществитьОбменПоВыбраннымОрганизациям", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОсуществитьОбменПоВыбраннымОрганизациям()

	Если НомерОбъекта + 1 > ВыбранныеОрганизации.Количество() Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ОсуществитьОбменПоВыбраннымОрганизациямПослеНастройкиМЧДФНС",
			ЭтотОбъект);
		ДокументооборотСКОКлиент.НастроитьМЧДФНС(ОписаниеОповещения,, ВыбранныеОрганизации);
		
	Иначе
		
		// Получим очередную организацию для обмена
		ОрганизацияДляОбмена = ВыбранныеОрганизации[НомерОбъекта];
		
		ОписаниеОповещения = Новый ОписаниеОповещения(
			"ОсуществитьОбменПоВыбраннымОрганизациямЗавершение",
			ЭтотОбъект);
		
		КонтекстЭДОКлиент.ОсуществитьОбменПоОрганизации(
			ЭтотОбъект,
			ОрганизацияДляОбмена,
			ОписаниеОповещения);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОсуществитьОбменПоВыбраннымОрганизациямПослеНастройкиМЧДФНС(Результат, ДополнительныеПараметры) Экспорт
	
	ДлительнаяОтправкаКлиент.ОповеститьОЗавершенииОбмена(); // из формы 1С-Отчетность
	
	ПодключитьОбработчикОжидания("Подключаемый_ОбновитьНадписьВремяОбновления", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьНадписьВремяОбновления()
	
	НадписьВремяОбновления = ОбновитьНадписьВремяОбновления(ДатаПоследнегоОбновления);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОбновитьНадписьВремяОбновления(ДатаПоследнегоОбновления)
	
	ДатаПоследнегоОбновления = ЭлектронныйДокументооборотСКонтролирующимиОрганами.ДатаПоследнегоОбновленияСобытий();
	Возврат ЭлектронныйДокументооборотСКонтролирующимиОрганами.ПолучитьНадписьВремяОбновления(ДатаПоследнегоОбновления);
	
КонецФункции

&НаКлиенте
Процедура ОсуществитьОбменПоВыбраннымОрганизациямЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	НомерОбъекта = НомерОбъекта + 1;
	ПодключитьОбработчикОжидания("Подключаемый_ОсуществитьОбменПоВыбраннымОрганизациям", 0.1, Истина);
	
КонецПроцедуры

&НаСервере
Функция ПометитьПрочтенными(ВыделенныеСтроки = Неопределено)
	
	ВсеВыделенныеОбъекты = Новый Массив;
	СтавшиеПрочтенными = Новый Массив;
	СтавшиеНепрочтенными = Новый Массив;
	
	Если ВыделенныеСтроки = Неопределено Тогда
		Для каждого Строка Из Элементы.Новое.ВыделенныеСтроки Цикл
			СвойстваСтроки = Новое.НайтиПоИдентификатору(Строка);
			ВсеВыделенныеОбъекты.Добавить(СвойстваСтроки.Ссылка);
		КонецЦикла;
	Иначе
		Для каждого Строка Из ВыделенныеСтроки Цикл
			ВсеВыделенныеОбъекты.Добавить(Строка.Ссылка);
		КонецЦикла;
	КонецЕсли;
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ЖурналНовыхСобытий.Ссылка,
		|	НЕ ЖурналНовыхСобытий.Просмотрено КАК Непрочтенное
		|ИЗ
		|	РегистрСведений.ЖурналНовыхСобытий КАК ЖурналНовыхСобытий
		|ГДЕ
		|	ЖурналНовыхСобытий.Ссылка В(&Ссылки)");
	Запрос.УстановитьПараметр("Ссылки", ВсеВыделенныеОбъекты);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.Непрочтенное Тогда
			СтавшиеПрочтенными.Добавить(Выборка.Ссылка);
			ЭлектронныйДокументооборотСКонтролирующимиОрганами.УстановитьНепрочтенность(
				Выборка.Ссылка,
				Ложь);
		КонецЕсли;
	КонецЦикла;
	
	Результат = Новый Структура;
	Результат.Вставить("ВсеВыделенныеОбъекты", ВсеВыделенныеОбъекты);
	Результат.Вставить("СтавшиеПрочтенными", СтавшиеПрочтенными);
	Результат.Вставить("СтавшиеНепрочтенными", СтавшиеНепрочтенными);
	
	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьПанелиОшибокОбновления(Форма)
	
	Форма.Элементы.ОшибкиОбновления.Видимость = ЭтоАдресВременногоХранилища(Форма.АдресСведенийПоОшибкам);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуНастройкиОбновления(АвтоматическийВызов, СледующееОповещение = Неопределено)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("АвтоматическийВызов", АвтоматическийВызов);
	ОткрытьФорму(КонтекстЭДОКлиент.ПутьКОбъекту + ".Форма.НастройкаОграниченийОбмена", ПараметрыФормы, , , , , СледующееОповещение);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВсеОрганизации()
	
	Результат = Новый Структура;
	Результат.Вставить("ЕстьОграничения", Ложь);
	
	КонтекстСервера = ДокументооборотСКО.ПолучитьОбработкуЭДО();
	Если КонтекстСервера <> Неопределено Тогда
		МассивОрганизаций = КонтекстСервера.ВыбранныеОрганизацииДляОбмена();
		Результат.Вставить("ЕстьОграничения", Истина);
	Иначе
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	Организации.Ссылка КАК Организация
			|ИЗ
			|	Справочник.Организации КАК Организации
			|ГДЕ
			|	Организации.ПометкаУдаления = ЛОЖЬ";
	
		РезультатЗапроса = Запрос.Выполнить();
		ТаблицаОрганизаций = РезультатЗапроса.Выгрузить();
		
		МассивОрганизаций = ТаблицаОрганизаций.ВыгрузитьКолонку("Организация");
	КонецЕсли;
	
	Результат.Вставить("МассивОрганизаций", МассивОрганизаций);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ОтметитьДеревоПросмотренным()
	
	ЭлектронныйДокументооборотСКонтролирующимиОрганами.ОтметитьДеревоПросмотренным(Новое);
	
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьОбъект(Элемент)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		
		Ссылка = ТекущиеДанные.Ссылка;
		Если ЗначениеЗаполнено(Ссылка) Тогда
			ПоказатьЗначение(,Ссылка);
			Оповестить("Пометка прочтенным", , Ссылка);
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПоказатьКритическиеОшибкиПоСсылке(Ссылка)
	
	Если КонтекстЭДОКлиент = Неопределено Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибкиИнициализацииКонтекстаЭДО);
		Возврат;
	КонецЕсли;
	
	КонтекстЭДОКлиент.ПоказатьКритическиеОшибкиПоСсылке(Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьФормуСтатусовОтправкиИзСписка(Элемент)
	
	Если КонтекстЭДОКлиент = Неопределено Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибкиИнициализацииКонтекстаЭДО);
	КонецЕсли;
	
	КонтекстЭДОКлиент.ПоказатьФормуСтатусовОтправкиИзСписка(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиНаБлокНовогоИРаскрыть(Группа = Неопределено)
	
	СтрокиДерева = Новое.ПолучитьЭлементы();
	Для каждого СтрокаДерева Из СтрокиДерева Цикл
		Если СтрокаДерева.ЭтоЗаголовокБлока И (Группа = Неопределено ИЛИ СтрокаДерева.Группа = Группа) Тогда
			ВложенныеСтрокиДерева = СтрокаДерева.ПолучитьЭлементы();
			НашлиСтроку = Ложь;
			Для каждого ВложеннаяСтрокаДерева Из ВложенныеСтрокиДерева Цикл
				Если НЕ ВложеннаяСтрокаДерева.ЭтоЗаголовокБлока И (ЗначениеЗаполнено(ВложеннаяСтрокаДерева.Ссылка)
					ИЛИ ЗначениеЗаполнено(ВложеннаяСтрокаДерева.КонтролирующийОрган)) Тогда
					
					Элементы.Новое.ТекущаяСтрока = ВложеннаяСтрокаДерева.ПолучитьИдентификатор();
					НашлиСтроку = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			Если НашлиСтроку Тогда
				Прервать;
			КонецЕсли;
			
		ИначеЕсли Группа = Неопределено И
			(ЗначениеЗаполнено(СтрокаДерева.Ссылка) ИЛИ ЗначениеЗаполнено(СтрокаДерева.КонтролирующийОрган)) Тогда
			
			Элементы.Новое.ТекущаяСтрока = СтрокаДерева.ПолучитьИдентификатор();
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьКоличествоНовых(Форма)
	
	// обновление в форме согласно отборам
	СведенияОКоличестве = ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиентСервер.ОбновитьКоличествоНовых(
		Форма,,
		Форма.НовыеСобытияПоСтраницамЖурнала);
	
	// обновление панели со статистикой в заголовке таблицы
	Если Форма.НовыеСобытияПоСтраницамЖурнала Тогда
		СвойстваКоличестваВБлоках = Новый Соответствие;
		СвойстваКоличестваВБлоках[ПредопределенноеЗначение("Перечисление.ВидыДокументовВЖурнале.ТребованиеИлиУведомление")] =
			Новый Структура("ЭлементБлока, ТекстБлока, КоличествоВБлоке",
				Форма.Элементы.БлокиНовогоТребованияЗаголовок, НСтр("ru = 'Требования: %1'"), 0);
		СвойстваКоличестваВБлоках[ПредопределенноеЗначение("Перечисление.СтраницыЖурналаОтчетность.Отчеты")] =
			Новый Структура("ЭлементБлока, ТекстБлока, КоличествоВБлоке",
				Форма.Элементы.БлокиНовогоОтчетыЗаголовок, НСтр("ru = 'Отчеты: %1'"), 0);
		СвойстваКоличестваВБлоках[ПредопределенноеЗначение("Перечисление.СтраницыЖурналаОтчетность.Уведомления")] =
			Новый Структура("ЭлементБлока, ТекстБлока, КоличествоВБлоке",
				Форма.Элементы.БлокиНовогоУведомленияЗаголовок, НСтр("ru = 'Уведомления: %1'"), 0);
		СвойстваКоличестваВБлоках[ПредопределенноеЗначение("Перечисление.СтраницыЖурналаОтчетность.Сверки")] =
			Новый Структура("ЭлементБлока, ТекстБлока, КоличествоВБлоке",
				Форма.Элементы.БлокиНовогоСверкиЗаголовок, НСтр("ru = 'Сверки: %1'"), 0);
		СвойстваКоличестваВБлоках[ПредопределенноеЗначение("Перечисление.СтраницыЖурналаОтчетность.Письма")] =
			Новый Структура("ЭлементБлока, ТекстБлока, КоличествоВБлоке",
				Форма.Элементы.БлокиНовогоПисьмаЗаголовок, НСтр("ru = 'Письма: %1'"), 0);
		СвойстваКоличестваВБлоках[ПредопределенноеЗначение("Перечисление.СтраницыЖурналаОтчетность.Входящие")] =
			Новый Структура("ЭлементБлока, ТекстБлока, КоличествоВБлоке",
				Форма.Элементы.БлокиНовогоВходящиеЗаголовок, НСтр("ru = 'Входящие: %1'"), 0);
		СвойстваКоличестваВБлоках[ПредопределенноеЗначение("Перечисление.СтраницыЖурналаОтчетность.ВыплатыИПособия")] =
			Новый Структура("ЭлементБлока, ТекстБлока, КоличествоВБлоке",
				Форма.Элементы.БлокиНовогоВыплатыИПособияЗаголовок, ?(Форма.ЭтоНебольшойЭкран ИЛИ Форма.ЭтоРасшифровка,
					НСтр("ru = 'Выплаты и
					|пособия: %1'"), НСтр("ru = 'Выплаты и пособия: %1'")), 0);
		СвойстваКоличестваВБлоках[ПредопределенноеЗначение("Перечисление.ВидыДокументовВЖурнале.Рассылка")] =
			Новый Структура("ЭлементБлока, ТекстБлока, КоличествоВБлоке",
				Форма.Элементы.БлокиНовогоРассылкиЗаголовок, НСтр("ru = 'Рассылки: %1'"), 0);
		СвойстваКоличестваВБлоках["Прочтенные"] =
			Новый Структура("ЭлементБлока, ТекстБлока, КоличествоВБлоке",
				Форма.Элементы.БлокиНовогоПрочтенныеЗаголовок, НСтр("ru = 'Прочтенные: %1'"), 0);
		СвойстваКоличестваВБлоках[
			ПредопределенноеЗначение("Перечисление.ГруппыНовыхСобытийДокументооборотаСКонтролирующимиОрганами.ОбработанныеЗапросы")] =
			Новый Структура("ЭлементБлока, ТекстБлока, КоличествоВБлоке",
				Форма.Элементы.БлокиНовогоОбработанныеЗапросыЗаголовок, ?(Форма.ЭтоНебольшойЭкран ИЛИ Форма.ЭтоРасшифровка,
					НСтр("ru = 'Обработанные
					|запросы: %1'"), НСтр("ru = 'Обработанные запросы: %1'")), 0);
		СвойстваКоличестваВБлоках[
			ПредопределенноеЗначение("Перечисление.ГруппыНовыхСобытийДокументооборотаСКонтролирующимиОрганами.ЗавершенныеОтправки")] =
			Новый Структура("ЭлементБлока, ТекстБлока, КоличествоВБлоке",
				Форма.Элементы.БлокиНовогоЗавершенныеОтправкиЗаголовок, ?(Форма.ЭтоНебольшойЭкран ИЛИ Форма.ЭтоРасшифровка,
					НСтр("ru = 'Завершенные
					|отправки: %1'"), НСтр("ru = 'Завершенные отправки: %1'")), 0);
		
		СтрокиДерева = Форма.Новое.ПолучитьЭлементы();
		ИндексСтрокиДерева = 0;
		Пока ИндексСтрокиДерева < СтрокиДерева.Количество() Цикл
			СтрокаДерева = СтрокиДерева[ИндексСтрокиДерева];
			Если СтрокаДерева.ЭтоЗаголовокБлока Тогда
				КоличествоВБлоке = 0;
				ПозицияКоличества = СтрНайти(СтрокаДерева.ЗаголовокБлока, "(", НаправлениеПоиска.СКонца);
				Если ПозицияКоличества <> 0 Тогда
					КоличествоВБлокеСтрокой = Сред(СтрокаДерева.ЗаголовокБлока, ПозицияКоличества + 1);
					ПозицияЗавершенияКоличества = СтрНайти(КоличествоВБлокеСтрокой, ")", НаправлениеПоиска.СКонца);
					Если ПозицияЗавершенияКоличества <> 0 Тогда
						КоличествоВБлокеСтрокой = Лев(КоличествоВБлокеСтрокой, ПозицияЗавершенияКоличества - 1);
					КонецЕсли;
					ЛишниеСимволы = СтрСоединить(СтрРазделить(КоличествоВБлокеСтрокой, "0123456789"), "");
					КоличествоВБлокеСтрокой = СтрСоединить(СтрРазделить(КоличествоВБлокеСтрокой, ЛишниеСимволы), "");
					Если ЗначениеЗаполнено(КоличествоВБлокеСтрокой) Тогда
						ОписаниеТипа = Новый ОписаниеТипов("Число");
						КоличествоВБлоке = ОписаниеТипа.ПривестиЗначение(КоличествоВБлокеСтрокой);
					КонецЕсли;
				КонецЕсли;
				
				Если КоличествоВБлоке = 0 Тогда
					СтрокиДерева.Удалить(ИндексСтрокиДерева);
					Если ИндексСтрокиДерева < СтрокиДерева.Количество() И НЕ СтрокиДерева[ИндексСтрокиДерева].ЭтоЗаголовокБлока Тогда
						СтрокиДерева.Удалить(ИндексСтрокиДерева);
					КонецЕсли;
					
					Продолжить;
				КонецЕсли;
				
				СвойстваКоличестваВБлоке = СвойстваКоличестваВБлоках[СтрокаДерева.Группа];
				Если СвойстваКоличестваВБлоке <> Неопределено Тогда
					СвойстваКоличестваВБлоке.КоличествоВБлоке = КоличествоВБлоке;
				КонецЕсли;
			КонецЕсли;
			ИндексСтрокиДерева = ИндексСтрокиДерева + 1;
		КонецЦикла;
		
		Для каждого СвойстваКоличестваВБлокеКлючИЗначение Из СвойстваКоличестваВБлоках Цикл
			СвойстваКоличестваВБлоке = СвойстваКоличестваВБлокеКлючИЗначение.Значение;
			СвойстваКоличестваВБлоке.ЭлементБлока.Заголовок = СтрШаблон(
				СвойстваКоличестваВБлоке.ТекстБлока,
				?(СвойстваКоличестваВБлоке.КоличествоВБлоке > 99, "99+",
					Строка(СвойстваКоличестваВБлоке.КоличествоВБлоке)));
			СвойстваКоличестваВБлоке.ЭлементБлока.Гиперссылка = СвойстваКоличестваВБлоке.КоличествоВБлоке <> 0;
		КонецЦикла;
	КонецЕсли;
	Форма.Элементы.БлокиНовогоОбщая.Видимость = Форма.НовыеСобытияПоСтраницамЖурнала;
	
	// получение сведений об общем количестве без учета отборов
	Если ЗначениеЗаполнено(Форма.ОтборОрганизацияНовое) ИЛИ ЗначениеЗаполнено(Форма.ОтборГосорганНовое)
		ИЛИ ЗначениеЗаполнено(Форма.ОтборПериодНовое) Тогда
		СведенияОКоличестве = СведенияОКоличествеНовыхБезУчетаОтборов();
	КонецЕсли;
	
	// количество на кнопке перехода в новые сообщения
	ЭлементНовыеСообщения = Форма.Элементы.Найти("КалендарьОтчетностиНовыеСообщения");
	Если ЭлементНовыеСообщения <> Неопределено Тогда
		КоличествоНепрочитанных = СведенияОКоличестве.КоличествоНепрочитанных;
		ЭлементНовыеСообщения.Картинка = ?(КоличествоНепрочитанных = 0,
			БиблиотекаКартинок.КолоколБезСообшений, БиблиотекаКартинок.КолоколЕстьСообщения);
	КонецЕсли;
	
	Форма.КоличествоНовых = СведенияОКоличестве.КоличествоНовых;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СведенияОКоличествеНовыхБезУчетаОтборов()
	
	ДеревоНовыхСобытий = ЭлектронныйДокументооборотСКонтролирующимиОрганами.НовоеДеревоНовыхСобытий();
	ЭлектронныйДокументооборотСКонтролирующимиОрганами.ЗаполнитьДеревоНовое(ДеревоНовыхСобытий);
	Возврат ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиентСервер.ОбновитьКоличествоНовых(ДеревоНовыхСобытий);
	
КонецФункции

&НаСервере
Функция ЗаполнитьДеревоНовое(АдресДереваНовых = Неопределено)
	
	ЕстьИзмененияВНовыхСообщениях = Ложь;
	
	ОтборыВызова = Неопределено;
	Если НовыеСобытияПоСтраницамЖурнала И Элементы.ГруппаОтборовНовое.Видимость Тогда
		ОтборыВызова = Новый Структура;
		ОтборыВызова.Вставить("Организация", ОтборОрганизацияНовое);
		ОтборыВызова.Вставить("ВидКонтролирующегоОргана", ОтборГосорганНовое);
		ОтборыВызова.Вставить("ДатаНачала", НачалоПериодаНовое);
		ОтборыВызова.Вставить("ДатаОкончания", КонецПериодаНовое);
		ОтборыВызова.Вставить("ТолькоУказанныйПериод", ТолькоУказанныйПериодНовое);
	КонецЕсли;
	
	Если АдресДереваНовых = Неопределено Тогда
		ИнициаторСеанса = ?(ЭтоАвтообмен, Перечисления.ИнициаторыСеансовСвязиСКонтролирующимиОрганами.Автообмен,
			Неопределено);
		
		ДеревоНовое = РеквизитФормыВЗначение("Новое");
		
		ТекущиеСобытия = Новый Соответствие;
		Для каждого СтрокаДерева Из ДеревоНовое.Строки Цикл
			Если ЗначениеЗаполнено(СтрокаДерева.Ссылка) Тогда
				ТекущиеСобытия.Вставить(Строка(СтрокаДерева.Ссылка.УникальныйИдентификатор()) + СтрокаДерева.Статус, Истина);
			КонецЕсли;
			Для Каждого ПодСтрокаДерева Из СтрокаДерева.Строки Цикл
				Если ЗначениеЗаполнено(ПодСтрокаДерева.Ссылка) Тогда
					ТекущиеСобытия.Вставить(Строка(ПодСтрокаДерева.Ссылка.УникальныйИдентификатор()) + ПодСтрокаДерева.Статус, Истина);
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		
		ЭлектронныйДокументооборотСКонтролирующимиОрганами.ЗаполнитьДеревоНовое(ДеревоНовое, ИнициаторСеанса,, ОтборыВызова);
		
		Для каждого СтрокаДерева Из ДеревоНовое.Строки Цикл
			Если ЗначениеЗаполнено(СтрокаДерева.Ссылка) Тогда
				КлючПоиска = Строка(СтрокаДерева.Ссылка.УникальныйИдентификатор()) + СтрокаДерева.Статус;
				Если ТекущиеСобытия.Получить(КлючПоиска) = Неопределено Тогда
					ЕстьИзмененияВНовыхСообщениях = Истина;
					Прервать;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		ЗначениеВРеквизитФормы(ДеревоНовое, "Новое");
		
	Иначе
		ЗначениеВРеквизитФормы(ПолучитьИзВременногоХранилища(АдресДереваНовых), "Новое");
	КонецЕсли;
	
	ДатаПоследнегоОбновления = ЭлектронныйДокументооборотСКонтролирующимиОрганами.ДатаПоследнегоОбновленияСобытий(ИнициаторСеанса);
	НадписьВремяОбновления = ЭлектронныйДокументооборотСКонтролирующимиОрганами.ПолучитьНадписьВремяОбновления(ДатаПоследнегоОбновления);
	
	Если Не ЗначениеЗаполнено(ДатаПоследнегоОбновления) Тогда
		ДатаПоследнегоОбновления = ТекущаяУниверсальнаяДата();
	КонецЕсли;
	
	ДатаПоследнегоОбновления = МестноеВремя(ДатаПоследнегоОбновления);
	
	ОбновитьКоличествоНовых(ЭтаФорма);
	
	Возврат ЕстьИзмененияВНовыхСообщениях;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьНеобходимоРасшифровать(НеобходимоРасшифровать = Неопределено)
	
	КоличествоСообщенийВсегоНеобходимоРасшифровать = 0;
	Если НовыеСобытияПоСтраницамЖурнала И Элементы.ГруппаОтборовНовое.Видимость Тогда
		Если НеобходимоРасшифровать = Неопределено Тогда
			КонтекстЭДОСервер = ДокументооборотСКО.ПолучитьОбработкуЭДО();
			Если КонтекстЭДОСервер <> Неопределено Тогда
				НеобходимоРасшифровать = КонтекстЭДОСервер.ПолучитьСообщенияДляРасшифровки().НеобходимоРасшифровать;
			КонецЕсли;
		КонецЕсли;
		
		Если НеобходимоРасшифровать <> Неопределено Тогда
			ОписаниеТипаЧисло = Новый ОписаниеТипов("Число");
			КоличествоСообщенийТребования = ОписаниеТипаЧисло.ПривестиЗначение(
				НеобходимоРасшифровать.КоличествоСообщенийПоСтраницам[
				Перечисления.ВидыДокументовВЖурнале.ТребованиеИлиУведомление]);
			КоличествоСообщенийОтчеты = ОписаниеТипаЧисло.ПривестиЗначение(
				НеобходимоРасшифровать.КоличествоСообщенийПоСтраницам[Перечисления.СтраницыЖурналаОтчетность.Отчеты]);
			КоличествоСообщенийУведомления = ОписаниеТипаЧисло.ПривестиЗначение(
				НеобходимоРасшифровать.КоличествоСообщенийПоСтраницам[Перечисления.СтраницыЖурналаОтчетность.Уведомления]);
			КоличествоСообщенийПисьма = ОписаниеТипаЧисло.ПривестиЗначение(
				НеобходимоРасшифровать.КоличествоСообщенийПоСтраницам[Перечисления.СтраницыЖурналаОтчетность.Письма]);
			КоличествоСообщенийСверки = ОписаниеТипаЧисло.ПривестиЗначение(
				НеобходимоРасшифровать.КоличествоСообщенийПоСтраницам[Перечисления.СтраницыЖурналаОтчетность.Сверки]);
			КоличествоСообщенийВходящие = ОписаниеТипаЧисло.ПривестиЗначение(
				НеобходимоРасшифровать.КоличествоСообщенийПоСтраницам[Перечисления.СтраницыЖурналаОтчетность.Входящие]);
			КоличествоСообщенийВыплатыИПособия = ОписаниеТипаЧисло.ПривестиЗначение(
				НеобходимоРасшифровать.КоличествоСообщенийПоСтраницам[Перечисления.СтраницыЖурналаОтчетность.ВыплатыИПособия]);
			КоличествоСообщенийВсегоНеобходимоРасшифровать = КоличествоСообщенийТребования + КоличествоСообщенийОтчеты
				+ КоличествоСообщенийУведомления + КоличествоСообщенийСверки + КоличествоСообщенийПисьма
				+ КоличествоСообщенийВходящие + КоличествоСообщенийВыплатыИПособия;
			Элементы.НеобходимоРасшифроватьТребованияИтог.Заголовок = ?(КоличествоСообщенийТребования > 99, "99+",
				Формат(КоличествоСообщенийТребования, "ЧЦ=3; ЧН=; ЧГ="));
			Элементы.НеобходимоРасшифроватьОтчетыИтог.Заголовок = ?(КоличествоСообщенийОтчеты > 99, "99+",
				Формат(КоличествоСообщенийОтчеты, "ЧЦ=3; ЧН=; ЧГ="));
			Элементы.НеобходимоРасшифроватьУведомленияИтог.Заголовок = ?(КоличествоСообщенийУведомления > 99, "99+",
				Формат(КоличествоСообщенийУведомления, "ЧЦ=3; ЧН=; ЧГ="));
			Элементы.НеобходимоРасшифроватьСверкиИтог.Заголовок = ?(КоличествоСообщенийСверки > 99, "99+",
				Формат(КоличествоСообщенийСверки, "ЧЦ=3; ЧН=; ЧГ="));
			Элементы.НеобходимоРасшифроватьПисьмаИтог.Заголовок = ?(КоличествоСообщенийПисьма > 99, "99+",
				Формат(КоличествоСообщенийПисьма, "ЧЦ=3; ЧН=; ЧГ="));
			Элементы.НеобходимоРасшифроватьВходящиеИтог.Заголовок = ?(КоличествоСообщенийВходящие > 99, "99+",
				Формат(КоличествоСообщенийВходящие, "ЧЦ=3; ЧН=; ЧГ="));
			Элементы.НеобходимоРасшифроватьВыплатыИПособияИтог.Заголовок = ?(КоличествоСообщенийВыплатыИПособия > 99, "99+",
				Формат(КоличествоСообщенийВыплатыИПособия, "ЧЦ=3; ЧН=; ЧГ="));
			Элементы.НеобходимоРасшифроватьРасшифровать.Заголовок = СтрШаблон(
				НСтр("ru = 'Расшифровать (%1)'"),
				Формат(КоличествоСообщенийВсегоНеобходимоРасшифровать, "ЧЦ=3; ЧН=; ЧГ="));
		КонецЕсли;
	КонецЕсли;
	
	Элементы.НеобходимоРасшифроватьОбщая.Видимость = ПоказыватьНеобходимоРасшифровать
		И КоличествоСообщенийВсегоНеобходимоРасшифровать > 0;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНеобходимоРасшифроватьВФоне()
	
	ПодключитьОбработчикОжидания("Подключаемый_ЗаполнитьНеобходимоРасшифровать", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ЗаполнитьНеобходимоРасшифровать() Экспорт
	
	ОтключитьОбработчикОжидания("Подключаемый_ЗаполнитьНеобходимоРасшифровать");
	
	ПараметрыОперации = Новый Структура("ИмяОповещения", "ЗаполнитьНеобходимоРасшифровать");
	
	ОписаниеОповещения = Новый ОписаниеОповещения(
		"ОжидатьОкончанияФоновогоЗаданияРезультат",
		ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент,
		ПараметрыОперации);
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(Неопределено);
	ПараметрыОжидания.ВыводитьСообщения = Ложь;
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	
	ДлительнаяОперация = ЗаполнитьНеобходимоРасшифроватьПараметры();
	Если ДлительнаяОперация = Неопределено
		ИЛИ (ДлительнаяОперация.Статус <> "Выполняется"
			И ДлительнаяОперация.Статус <> "Выполнено") Тогда
		Возврат;
	КонецЕсли;
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОписаниеОповещения, ПараметрыОжидания);
	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьНеобходимоРасшифроватьПараметры()
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Заполнить количество требующих расшифровки сообщений'");
	ПараметрыВыполнения.ОжидатьЗавершение = Истина;
	
	Возврат ДлительныеОперации.ВыполнитьФункцию(
		ПараметрыВыполнения,
		"ЭлектронныйДокументооборотСКонтролирующимиОрганами.ЗаполнитьНеобходимоРасшифроватьВФоне");
	
КонецФункции

&НаКлиенте
Функция ПереопределитьОткрытие(Элемент)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		
		Ссылка = ТекущиеДанные.Ссылка;
	
		Переопределить = Ложь;
		
		Попытка
			МодульСверкаСФНС = ОбщегоНазначенияКлиент.ОбщийМодуль("СверкаСФНСКлиент");
		Исключение
		    МодульСверкаСФНС = Неопределено;
		КонецПопытки; 
		
		Если МодульСверкаСФНС <> Неопределено Тогда
			СтандартнаяОбработка = Истина;
			МодульСверкаСФНС.ФормаНовыхСобытий_ТаблицаНовоеПриОткрытии(ЭтотОбъект, Ссылка, СтандартнаяОбработка);
			
			Если НЕ СтандартнаяОбработка Тогда
				Переопределить = Истина;
			КонецЕсли;
				
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Переопределить;

КонецФункции

#КонецОбласти
