#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция ИмяФайлаИконкиСтатуса(Статус) Экспорт
	
	Результат = Новый Соответствие;
	Результат.Вставить(НеУстановлен, "");
	Результат.Вставить(ВыполненоУспешно, "status_ok.png");
	Результат.Вставить(ОперацияНеВыполнена, "status_fail.png");
	Результат.Вставить(ОжиданиеОперации, "status_wait.png");
	Результат.Вставить(Информация, "status_info.png");
	Возврат Результат[Статус];
	
КонецФункции

#КонецОбласти

#КонецЕсли