#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

#Область СтандартныеШаблоны

// Заполняет коллекцию стандартными поставляемыми шаблонами офисных документов.
//
// Параметры:
//   СтандартныеШаблоны - ТаблицаЗначений - коллекция для заполнения шаблонами
//   Назначение - ПеречислениеСсылка.НазначенияШаблоновПечатиОфисныхДокументов
//   
Процедура ЗаполнитьСтандартныеПоставляемыеШаблоны(СтандартныеШаблоны, Назначение = Неопределено) Экспорт
	
	СтандартныеПоставляемыеШаблоны = СтандартныеПоставляемыеШаблоны();
	Для Каждого ПоставляемыйШаблон Из СтандартныеПоставляемыеШаблоны Цикл
		
		Если ЗначениеЗаполнено(Назначение) И ПоставляемыйШаблон.Назначение <> Назначение Тогда
			Продолжить;
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(СтандартныеШаблоны.Добавить(), ПоставляемыйШаблон);
		
	КонецЦикла;
	
КонецПроцедуры

// Возвращает пустой макет двоичных данных файла в формате PDF.
//
// Возвращаемое значение:
//   ДвоичныеДанные - макет пустого PDF-файла
//
Функция ПустойМакетПросмотраPDF() Экспорт
	
	Возврат ПолучитьМакет("ПустойФайл_pdf");
	
КонецФункции

// Возвращает количество стандартных шаблонов. Если параметр Назначение не указан, возвращается общее количество.
// 
// Параметры:
//  Назначение - ПеречислениеСсылка.НазначенияШаблоновПечатиОфисныхДокументов
// 
// Возвращаемое значение:
//  Число 
Функция КоличествоСтандартныхШаблонов(Назначение = Неопределено) Экспорт
	
	СтандартныеШаблоны = СтандартныеПоставляемыеШаблоны();
	Если Назначение = Неопределено Тогда
		Возврат СтандартныеШаблоны.Количество();
	КонецЕсли;
	
	КоличествоШаблонов = 0;
	Для Каждого СтандартныйШаблон Из СтандартныеШаблоны Цикл
		Если СтандартныйШаблон.Назначение = Назначение Тогда
			КоличествоШаблонов = КоличествоШаблонов + 1;
		КонецЕсли;
	КонецЦикла;
	
	Возврат КоличествоШаблонов;
	
КонецФункции

Функция НазначенияСтандартныхШаблонов() Экспорт
	
	НазначенияШаблонов = Новый Массив;
	
	СтандартныеШаблоны = СтандартныеПоставляемыеШаблоны();
	Для Каждого Назначение Из Перечисления.НазначенияШаблоновПечатиОфисныхДокументов Цикл
		Для Каждого СтандартныйШаблон Из СтандартныеШаблоны Цикл
			Если СтандартныйШаблон.Назначение = Назначение Тогда
				Если НазначенияШаблонов.Найти(Назначение) = Неопределено Тогда
					НазначенияШаблонов.Добавить(Назначение);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат НазначенияШаблонов;
	
КонецФункции

#КонецОбласти

// Возвращает количество доступных шаблонов по назначению.
// 
// Параметры:
//  Назначение - ПеречислениеСсылка.НазначенияШаблоновПечатиОфисныхДокументов - 
// 
// Возвращаемое значение:
//  Число 
Функция КоличествоДоступныхШаблонов(Назначение) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЕстьNULL(Сумма(1), 0) КАК Количество
	|ИЗ
	|	Справочник.ШаблоныПечатиОфисныхДокументов КАК ШаблоныПечатиОфисныхДокументов
	|ГДЕ
	|	НЕ ШаблоныПечатиОфисныхДокументов.ПометкаУдаления
	|	И ШаблоныПечатиОфисныхДокументов.Используется
	|	И ШаблоныПечатиОфисныхДокументов.ФайлШаблон <> ЗНАЧЕНИЕ(Справочник.ШаблоныПечатиОфисныхДокументов.ПустаяСсылка)
	|	И ШаблоныПечатиОфисныхДокументов.Назначение = &Назначение";
	
	Запрос.УстановитьПараметр("Назначение", Назначение);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.Количество;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СтандартныеПоставляемыеШаблоны()
	
	СтандартныеШаблоны = Новый Массив;

	// Назначение: ДоговорКонтрагентаЗаказ
	
	НовыйШаблон = ШаблоныПечатиОфисныхДокументовКлиентСервер.НовыйОписаниеСтандартногоШаблона();
	НовыйШаблон.Наименование = НСтр("ru = 'Акт выполненных работ'");
	НовыйШаблон.Назначение  = Перечисления.НазначенияШаблоновПечатиОфисныхДокументов.ДоговорКонтрагентаЗаказ;
	НовыйШаблон.Объект      = "Справочник.ШаблоныПечатиОфисныхДокументов";
	НовыйШаблон.Макет       = "АктВыполненныхРабот_docx";
	НовыйШаблон.Изображение = "АктВыполненныхРабот_pdf";
	
	СтандартныеШаблоны.Добавить(НовыйШаблон);
	
	НовыйШаблон = ШаблоныПечатиОфисныхДокументовКлиентСервер.НовыйОписаниеСтандартногоШаблона();
	НовыйШаблон.Наименование = НСтр("ru = 'Договор оказания услуг'");
	НовыйШаблон.Назначение  = Перечисления.НазначенияШаблоновПечатиОфисныхДокументов.ДоговорКонтрагентаЗаказ;
	НовыйШаблон.Объект      = "Справочник.ШаблоныПечатиОфисныхДокументов";
	НовыйШаблон.Макет       = "ДоговорОказанияУслугВариант2_docx";
	НовыйШаблон.Изображение = "ДоговорОказанияУслугВариант2_pdf";
	
	СтандартныеШаблоны.Добавить(НовыйШаблон);	
	
	НовыйШаблон = ШаблоныПечатиОфисныхДокументовКлиентСервер.НовыйОписаниеСтандартногоШаблона();
	НовыйШаблон.Наименование = НСтр("ru = 'Договор купли-продажи'");
	НовыйШаблон.Назначение  = Перечисления.НазначенияШаблоновПечатиОфисныхДокументов.ДоговорКонтрагентаЗаказ;
	НовыйШаблон.Объект      = "Справочник.ШаблоныПечатиОфисныхДокументов";
	НовыйШаблон.Макет       = "ДоговорКуплиПродажиВариант2_docx";
	НовыйШаблон.Изображение = "ДоговорКуплиПродажиВариант2_pdf";
	
	СтандартныеШаблоны.Добавить(НовыйШаблон);	
	
	НовыйШаблон = ШаблоныПечатиОфисныхДокументовКлиентСервер.НовыйОписаниеСтандартногоШаблона();
	НовыйШаблон.Наименование = НСтр("ru = 'Счет-договор'");
	НовыйШаблон.Назначение  = Перечисления.НазначенияШаблоновПечатиОфисныхДокументов.ДоговорКонтрагентаЗаказ;
	НовыйШаблон.Объект      = "Справочник.ШаблоныПечатиОфисныхДокументов";
	НовыйШаблон.Макет       = "СчетДоговор_docx";
	НовыйШаблон.Изображение = "СчетДоговор_pdf";
	
	СтандартныеШаблоны.Добавить(НовыйШаблон);	
	
	// Назначение: КоммерческоеПредложение
	
	НовыйШаблон = ШаблоныПечатиОфисныхДокументовКлиентСервер.НовыйОписаниеСтандартногоШаблона();
	НовыйШаблон.Наименование = НСтр("ru = 'Коммерческое предложение'");
	НовыйШаблон.Назначение  = Перечисления.НазначенияШаблоновПечатиОфисныхДокументов.КоммерческоеПредложение;
	НовыйШаблон.Объект      = "Документ.ЗаказПокупателя";
	НовыйШаблон.Макет       = "КоммерческоеПредложениеПример_docx";
	НовыйШаблон.Изображение = "КоммерческоеПредложениеПример_pdf";
	
	СтандартныеШаблоны.Добавить(НовыйШаблон);		
	
	// Назначение: ДоговорКонтрагента
	
	НовыйШаблон = ШаблоныПечатиОфисныхДокументовКлиентСервер.НовыйОписаниеСтандартногоШаблона();
	НовыйШаблон.Наименование = НСтр("ru = 'Договор оказания услуг'");
	НовыйШаблон.Назначение  = Перечисления.НазначенияШаблоновПечатиОфисныхДокументов.ДоговорКонтрагента;
	НовыйШаблон.Объект      = "Справочник.ДоговорыКонтрагентов";
	НовыйШаблон.Макет       = "ДоговорОказанияУслугПример_docx";
	НовыйШаблон.Изображение = "ДоговорОказанияУслугПример_pdf";
	
	СтандартныеШаблоны.Добавить(НовыйШаблон);		
	
	НовыйШаблон = ШаблоныПечатиОфисныхДокументовКлиентСервер.НовыйОписаниеСтандартногоШаблона();
	НовыйШаблон.Наименование = НСтр("ru = 'Договор купли-продажи'");
	НовыйШаблон.Назначение  = Перечисления.НазначенияШаблоновПечатиОфисныхДокументов.ДоговорКонтрагента;
	НовыйШаблон.Объект      = "Справочник.ДоговорыКонтрагентов";
	НовыйШаблон.Макет       = "ДоговорКуплиПродажиПример_docx";
	НовыйШаблон.Изображение = "ДоговорКуплиПродажиПример_pdf";
	
	СтандартныеШаблоны.Добавить(НовыйШаблон);		
	
	Возврат СтандартныеШаблоны;
	
КонецФункции

#КонецОбласти

#КонецЕсли
