#Область СлужебныеПроцедурыИФункции

Функция СервисИспользуется() Экспорт
	
	Используется = ИнтернетПоддержкаПользователей.УслугаПодключена(ИдентификаторУслугиМониторингБанков())
		И ПравоДоступа("Чтение", Метаданные.РегистрыСведений.СобытияНадежностьБанков);
	
	Возврат Используется;
	
КонецФункции

Функция ИнформацияОКритичныхСобытиях(МассивБИК) Экспорт
	
	Результат = НоваяИнформацияОСобытиях();
	
	Результат.Используется = СервисИспользуется();
	Если НЕ Результат.Используется Тогда
		Возврат Результат;
	КонецЕсли;
	
	Если МассивБИК.Количество() = 0 Тогда
		Возврат Результат;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция НовоеСобытие() Экспорт

	Результат = Новый Структура;
	Результат.Вставить("Событие");
	Результат.Вставить("ТекстСобытия");
	Результат.Вставить("ДатаСобытия");
	Результат.Вставить("ДатаПоявленияСобытия");
	Результат.Вставить("Идентификатор");
	Результат.Вставить("Критичное");
	Результат.Вставить("ИсточникИнформации");
	Результат.Вставить("ТекстПояснения");
	Результат.Вставить("Показано");
	
	ДополнительнаяИнформация = Новый Структура;
	ДополнительнаяИнформация.Вставить("ЕстьОстатки", Истина);
	ДополнительнаяИнформация.Вставить("ЕстьСчетаЮридическихЛиц", Истина);
	ДополнительнаяИнформация.Вставить("ЕстьСчетаФизическихЛиц", Истина);
	Результат.Вставить("ДополнительнаяИнформация", ДополнительнаяИнформация);
	
	Возврат Результат;

КонецФункции

Функция НоваяИнформацияОСобытиях()

	Результат = Новый Структура;
	Результат.Вставить("Используется", Ложь);
	Результат.Вставить("Актуальность", Истина);
	Результат.Вставить("ПараметрыОбработчикаОжидания");
	Результат.Вставить("ПоследнийИдентификатор", 0);
	Результат.Вставить("События", Новый Соответствие); // Ключ - БИК, значение - см. НовоеСобытие.
	
	Возврат Результат;

КонецФункции

Функция ИдентификаторУслугиМониторингБанков()
	
	Возврат "1c-bank-monitoring";
	
КонецФункции

#КонецОбласти
