#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	Методы.Вставить("СформироватьДокументы", Истина);
КонецПроцедуры

#Область ФоновоеЗадание

Процедура СформироватьДокументы(Параметры, ВременноеХранилищеРезультата) Экспорт
	
	Результат = Новый Структура("ОплаченКартой", Ложь);
	Ошибки = Новый СписокЗначений;
	
	Если Не Параметры.Свойство("ПланДоставки") ИЛИ ТипЗнч(Параметры.ПланДоставки) <> Тип("ДеревоЗначений") Тогда
		Ошибка = НСтр("ru = 'Не задан план доставки'");
		Ошибки.Добавить(, Ошибка);
		Результат.Вставить("Ошибки", Ошибки);
		ПоместитьВоВременноеХранилище(Результат, ВременноеХранилищеРезультата);
		Возврат;
	КонецЕсли;
	
	ПланДоставки = Параметры.ПланДоставки;
	
	КоличествоСтрок = 0;
	Для каждого СтрокаДоставки Из ПланДоставки.Строки Цикл
	    Если СтрокаДоставки.СостояниеОтгрузкиИзменено Или СтрокаДоставки.СостояниеОплатыИзменено Тогда
			КоличествоСтрок = КоличествоСтрок + 1;
		КонецЕсли; 
	КонецЦикла;
	
	ОбновляемыеРеквизиты = Новый Соответствие;
	
	ИзмененныеМаршрутныеЛисты = Новый Соответствие;
	
	НомерСтроки = 0;
	Для каждого СтрокаДоставки Из ПланДоставки.Строки Цикл
		
		Если Не СтрокаДоставки.СостояниеОтгрузкиИзменено И Не СтрокаДоставки.СостояниеОплатыИзменено Тогда
			Продолжить;
		КонецЕсли; 
		
		СтруктураРеквизитов = Новый Структура;
		
		Если СтрокаДоставки.СостояниеОтгрузкиИзменено Тогда
			
			СоздатьОбновитьДокументыОтгрузки(СтрокаДоставки, ИзмененныеМаршрутныеЛисты, Ошибки);
			
			СтруктураРеквизитов.Вставить("СостояниеОтгрузкиИзменено", Ложь);
			СтруктураРеквизитов.Вставить("РасходнаяНакладная", СтрокаДоставки.РасходнаяНакладная);
			СтруктураРеквизитов.Вставить("РасходнаяНакладная", СтрокаДоставки.РасходнаяНакладная);
			Если СтрокаДоставки.СостояниеОтгрузки = Перечисления.СостоянияДоставкиЗаказа.Доставлен Тогда
				СтруктураРеквизитов.Вставить("МожноМенятьСостояниеОтгрузки", Ложь);
			КонецЕсли;
			 
		КонецЕсли; 
		
		Если СтрокаДоставки.СостояниеОплатыИзменено Тогда
			
			//@skip-check query-in-loop
			СоздатьОбновитьДокументыОплаты(СтрокаДоставки, Ошибки, Результат);
			
			СтруктураРеквизитов.Вставить("СостояниеОплатыИзменено", Ложь);
			Если СтрокаДоставки.СостояниеОплаты <> Перечисления.СостоянияОплатыЗаказа.НеОплачен Тогда
				СтруктураРеквизитов.Вставить("МожноМенятьСостояниеОплаты", Ложь);
			КонецЕсли; 
			
		КонецЕсли;
		
		ОбновляемыеРеквизиты.Вставить(СтрокаДоставки.Заказ, СтруктураРеквизитов);
		
		НомерСтроки = НомерСтроки + 1;
		ДлительныеОперации.СообщитьПрогресс(Окр(НомерСтроки / КоличествоСтрок * 100), СтрокаДоставки.ЗаказПредставление,
			ОбновляемыеРеквизиты);
		
	КонецЦикла;
	
	Для каждого КлючИЗначение Из ИзмененныеМаршрутныеЛисты Цикл
		МаршрутныйЛист = КлючИЗначение.Значение;
		Попытка
			Если МаршрутныйЛист.ПометкаУдаления Тогда
				МаршрутныйЛист.УстановитьПометкуУдаления(Ложь);
			КонецЕсли;
			МаршрутныйЛист.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			Информация = ИнформацияОбОшибке();
			СообщенияПользователю = ПолучитьСообщенияПользователю();
			Ошибка = СтрШаблон(НСтр("ru = 'Не удалось обновить данные маршрутного листа %1: %2'"), 
				СтрокаДоставки.МаршрутныйЛист, РекурсивноеОписаниеОшибки(Информация, СообщенияПользователю));
			Ошибки.Добавить(СтрокаДоставки.Заказ, Ошибка);
		КонецПопытки; 
	КонецЦикла; 
	
	Если Ошибки.Количество() > 0 Тогда
		Результат.Вставить("Ошибки", Ошибки);
	КонецЕсли;
	
	ПоместитьВоВременноеХранилище(Результат, ВременноеХранилищеРезультата);
	
КонецПроцедуры

Процедура СоздатьОбновитьДокументыОтгрузки(ДанныеДоставки, ИзмененныеМаршрутныеЛисты, Ошибки)
	
	Если Не ЗначениеЗаполнено(ДанныеДоставки.Заказ) Тогда
		Возврат;
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(ДанныеДоставки.МаршрутныйЛист) Тогда
		
		МаршрутныйЛист = ИзмененныеМаршрутныеЛисты.Получить(ДанныеДоставки.МаршрутныйЛист);
		Если МаршрутныйЛист = Неопределено Тогда
			МаршрутныйЛист = ДанныеДоставки.МаршрутныйЛист.ПолучитьОбъект();
			ИзмененныеМаршрутныеЛисты.Вставить(ДанныеДоставки.МаршрутныйЛист, МаршрутныйЛист);
		КонецЕсли; 
		
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("Заказ", ДанныеДоставки.Заказ);
		СтруктураОтбора.Вставить("РасходнаяНакладная", ДанныеДоставки.РасходнаяНакладная);
		Строки = МаршрутныйЛист.Заказы.НайтиСтроки(СтруктураОтбора);
		Для каждого СтрокаМаршрутногоЛиста Из Строки Цикл
			СтрокаМаршрутногоЛиста.Доставлен =
				ДанныеДоставки.СостояниеОтгрузки = Перечисления.СостоянияДоставкиЗаказа.Доставлен 
				Или ДанныеДоставки.СостояниеОтгрузки = Перечисления.СостоянияДоставкиЗаказа.ДоставленЧастично;
		КонецЦикла;
		
	КонецЕсли; 
	
	Если ДанныеДоставки.СостояниеОтгрузки = Перечисления.СостоянияДоставкиЗаказа.Доставлен
		И ЗначениеЗаполнено(ДанныеДоставки.РасходнаяНакладная) Тогда
		
		ИзменяемыйДокумент = ИзменяемыйДокумент(ДанныеДоставки.Возвраты);
		Если Не ЗначениеЗаполнено(ИзменяемыйДокумент) Тогда
			Возврат;
		КонецЕсли;
		
		ДокументВозврата = ИзменяемыйДокумент.ПолучитьОбъект();
		Попытка
			ДокументВозврата.УстановитьПометкуУдаления(Истина);
		Исключение
			Информация = ИнформацияОбОшибке();
			СообщенияПользователю = ПолучитьСообщенияПользователю();
			Ошибка = СтрШаблон(НСтр("ru = 'Не удалось отменить возврат по заказу %1: %2'"), 
				ДанныеДоставки.ЗаказПредставление, РекурсивноеОписаниеОшибки(Информация, СообщенияПользователю));
			Ошибки.Добавить(ДанныеДоставки.Заказ, Ошибка);
		КонецПопытки;
		
	ИначеЕсли ДанныеДоставки.СостояниеОтгрузки = Перечисления.СостоянияДоставкиЗаказа.НеДоставлен
		И ЗначениеЗаполнено(ДанныеДоставки.РасходнаяНакладная) Тогда
		
		ИзменяемыйДокумент = ИзменяемыйДокумент(ДанныеДоставки.Возвраты);
		Если ЗначениеЗаполнено(ИзменяемыйДокумент) Тогда
			ДокументВозврата = ИзменяемыйДокумент.ПолучитьОбъект();
		Иначе
			ДокументВозврата = Документы.ПриходнаяНакладная.СоздатьДокумент();
			ДокументВозврата.Дата = ТекущаяДатаСеанса();
			ДокументВозврата.Комментарий = "#" + НСтр("ru = 'Формирование документов доставки'");
		КонецЕсли; 
		ДокументВозврата.Заполнить(ДанныеДоставки.РасходнаяНакладная);
		Попытка
			ДокументВозврата.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			Информация = ИнформацияОбОшибке();
			СообщенияПользователю = ПолучитьСообщенияПользователю();
			Ошибка = СтрШаблон(НСтр("ru = 'Не удалось сформировать возврат по заказу %1: %2'"), 
				ДанныеДоставки.ЗаказПредставление, РекурсивноеОписаниеОшибки(Информация, СообщенияПользователю));
			Ошибки.Добавить(ДанныеДоставки.Заказ, Ошибка);
		КонецПопытки;
				
	ИначеЕсли ДанныеДоставки.СостояниеОтгрузки = Перечисления.СостоянияДоставкиЗаказа.ДоставленЧастично
		И ЗначениеЗаполнено(ДанныеДоставки.РасходнаяНакладная) Тогда
		
		ИзменяемыйДокумент = ИзменяемыйДокумент(ДанныеДоставки.Возвраты);
		Если ЗначениеЗаполнено(ИзменяемыйДокумент) Тогда
			ДокументВозврата = ИзменяемыйДокумент.ПолучитьОбъект();
		Иначе
			ДокументВозврата = Документы.ПриходнаяНакладная.СоздатьДокумент();
			ДокументВозврата.Дата = ТекущаяДатаСеанса();
			ДокументВозврата.Комментарий = "#" + НСтр("ru = 'Формирование документов доставки'");
			ДокументВозврата.Заполнить(ДанныеДоставки.РасходнаяНакладная);
		КонецЕсли; 
		
		ДокументВозврата.Запасы.Очистить();
		
		ДоставленныеТовары = Новый ТаблицаЗначений;
		ДоставленныеТовары.Колонки.Добавить("Номенклатура");
		ДоставленныеТовары.Колонки.Добавить("Характеристика");
		
		Для каждого СтрокаНоменклатуры Из ДанныеДоставки.Строки Цикл
			Если ТипЗнч(СтрокаНоменклатуры.Группировка) = Тип("СправочникСсылка.Номенклатура") 
				И СтрокаНоменклатуры.СостояниеОтгрузки = Перечисления.СостоянияДоставкиЗаказа.Доставлен Тогда

				НоваяСтрока = ДоставленныеТовары.Добавить();
				НоваяСтрока.Номенклатура = СтрокаНоменклатуры.Группировка;
				НоваяСтрока.Характеристика = СтрокаНоменклатуры.Характеристика;
				
			КонецЕсли;
		КонецЦикла;
		
		СтруктураОтбора.Очистить();
		Для каждого СтрокаРасход Из ДанныеДоставки.РасходнаяНакладная.Запасы Цикл
			СтруктураОтбора.Вставить("Номенклатура", СтрокаРасход.Номенклатура);
			СтруктураОтбора.Вставить("Характеристика", СтрокаРасход.Характеристика);
			Если ДоставленныеТовары.НайтиСтроки(СтруктураОтбора).Количество() > 0 Тогда
				Продолжить;
			КонецЕсли; 
			НоваяСтрока = ДокументВозврата.Запасы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаРасход);
		КонецЦикла;
		
		Если ДокументВозврата.Запасы.Количество() = 0 И ДокументВозврата.ЭтоНовый() Тогда
			Возврат;
		КонецЕсли; 

		Попытка
			Если ДокументВозврата.Запасы.Количество() = 0 Тогда
				ДокументВозврата.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			Иначе
				ДокументВозврата.Записать(РежимЗаписиДокумента.Проведение);
			КонецЕсли; 
		Исключение
			Информация = ИнформацияОбОшибке();
			СообщенияПользователю = ПолучитьСообщенияПользователю();
			Ошибка = СтрШаблон(НСтр("ru = 'Не удалось сформировать возврат по заказу %1: %2'"), 
				ДанныеДоставки.ЗаказПредставление, РекурсивноеОписаниеОшибки(Информация, СообщенияПользователю));
			Ошибки.Добавить(ДанныеДоставки.Заказ, Ошибка);
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура СоздатьОбновитьДокументыОплаты(ДанныеДоставки, Ошибки, Результат)
	
	Если Не ЗначениеЗаполнено(ДанныеДоставки.Заказ) Тогда
		Возврат;
	КонецЕсли; 
	
	Если ДанныеДоставки.СостояниеОплаты = Перечисления.СостоянияОплатыЗаказа.НеОплачен Тогда
		УдалитьНеоплаченныеЗаказыРасшифровкиПлатежа(ДанныеДоставки, Ошибки);		
	ИначеЕсли ДанныеДоставки.СостояниеОплаты = Перечисления.СостоянияОплатыЗаказа.ОплаченНаличными И ДанныеДоставки.Оплачено > 0 Тогда
		СоздатьДокументПоступленияОплаты(ДанныеДоставки, Ошибки, Результат, Истина);
	ИначеЕсли ДанныеДоставки.СостояниеОплаты=Перечисления.СостоянияОплатыЗаказа.ОплаченКартой И ДанныеДоставки.Оплачено > 0 Тогда
		СоздатьДокументПоступленияОплаты(ДанныеДоставки, Ошибки, Результат, Ложь);
	Иначе
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура СоздатьДокументПоступленияОплаты(ДанныеДоставки, Ошибки, Результат, ЭтоОплатаНаличными)

	Если ЭтоОплатаНаличными Тогда
		ДокументПоступленияОплаты = Документы.ПоступлениеВКассу.СоздатьДокумент();
	Иначе
		ДокументПоступленияОплаты = Документы.ОперацияПоПлатежнымКартам.СоздатьДокумент();
	КонецЕсли;
	
	ДокументПоступленияОплаты.Дата = ТекущаяДатаСеанса();
	ДокументПоступленияОплаты.Комментарий = "#" + НСтр("ru = 'Формирование документов доставки'");
	
	Попытка
		
		Если ЗначениеЗаполнено(ДанныеДоставки.РасходнаяНакладная) Тогда
			ДокументПоступленияОплаты.Заполнить(ДанныеДоставки.РасходнаяНакладная);
		Иначе
			ДокументПоступленияОплаты.Заполнить(ДанныеДоставки.Заказ);
		КонецЕсли;
		
		СуммаПлатежа = ДанныеДоставки.Оплачено;
		ВалютаУчета = Константы.ВалютаУчета.Получить();
		
		Если ДокументПоступленияОплаты.ВалютаДенежныхСредств <> ВалютаУчета Тогда
			СуммаПлатежа = РаботаСКурсамиВалют.ПересчитатьВВалюту(СуммаПлатежа, ВалютаУчета,
				ДокументПоступленияОплаты.ВалютаДенежныхСредств, ДокументПоступленияОплаты.Дата);
		КонецЕсли;
		
		Для каждого СтрокаТабличнойЧасти Из ДокументПоступленияОплаты.РасшифровкаПлатежа Цикл
			СтрокаТабличнойЧасти.СуммаРасчетов = ЦенообразованиеСервер.ПересчитатьИзВалютыВВалюту(
				СтрокаТабличнойЧасти.СуммаРасчетов,
				ДокументПоступленияОплаты.Курс,
				СтрокаТабличнойЧасти.Курс,
				ДокументПоступленияОплаты.Кратность,
				СтрокаТабличнойЧасти.Кратность);
		КонецЦикла;
		
		СвернутьТаблицуРасшифровкиПлатежа(ДокументПоступленияОплаты.РасшифровкаПлатежа, ЭтоОплатаНаличными);
		
		Если ЭтоОплатаНаличными Тогда
			ДокументПоступленияОплаты.Записать(РежимЗаписиДокумента.Проведение);
		Иначе
			ДокументПоступленияОплаты.Записать(РежимЗаписиДокумента.Запись);
			Результат.ОплаченКартой = Истина;			
		КонецЕсли;
		
	Исключение
		
		Информация = ИнформацияОбОшибке();
		СообщенияПользователю = ПолучитьСообщенияПользователю();
		Ошибка = СтрШаблон(НСтр("ru = 'Не удалось зафиксировать оплату заказа %1: %2'"), 
			ДанныеДоставки.ЗаказПредставление, РекурсивноеОписаниеОшибки(Информация, СообщенияПользователю));
		Если ДокументПоступленияОплаты.ЭтоНовый() Тогда
			Ошибки.Добавить(ДанныеДоставки.Заказ, Ошибка);
		Иначе
			Ошибки.Добавить(ДокументПоступленияОплаты.Ссылка, Ошибка);
		КонецЕсли;
		
	КонецПопытки;
		
КонецПроцедуры

Процедура СвернутьТаблицуРасшифровкиПлатежа(РасшифровкаПлатежа, ЭтоОплатаНаличными)
		
		КолонкиГруппировки = "";
		КолонкиСуммирования = "СуммаПлатежа,СуммаНДС";
		КолонкиДляПоиска = СтрРазделить(КолонкиСуммирования, ",");
		
		МетаданныеДокументаОплаты = ?(ЭтоОплатаНаличными,
			Метаданные.Документы.ПоступлениеВКассу.ТабличныеЧасти.РасшифровкаПлатежа.Реквизиты,
			Метаданные.Документы.ПоступлениеНаСчет.ТабличныеЧасти.РасшифровкаПлатежа.Реквизиты);
					
		Для Каждого Колонка Из МетаданныеДокументаОплаты Цикл
			Если КолонкиДляПоиска.Найти(Колонка.Имя) = Неопределено Тогда
				КолонкиГруппировки = КолонкиГруппировки + ?(ПустаяСтрока(КолонкиГруппировки), "", ", ") + Колонка.Имя;
			КонецЕсли;
		КонецЦикла;
		
		РасшифровкаПлатежа.Свернуть(КолонкиГруппировки, КолонкиСуммирования);
			
КонецПроцедуры

Процедура УдалитьНеоплаченныеЗаказыРасшифровкиПлатежа(ДанныеДоставки, Ошибки)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Заказ", ДанныеДоставки.Заказ);
	Запрос.УстановитьПараметр("Документ", ДанныеДоставки.РасходнаяНакладная);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПоступлениеВКассуРасшифровкаПлатежа.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ПоступлениеВКассу.РасшифровкаПлатежа КАК ПоступлениеВКассуРасшифровкаПлатежа
	|ГДЕ
	|	ПоступлениеВКассуРасшифровкаПлатежа.Заказ = &Заказ
	|	И ПоступлениеВКассуРасшифровкаПлатежа.Документ = &Документ
	|	И ПоступлениеВКассуРасшифровкаПлатежа.Ссылка.Проведен
	|	И ПоступлениеВКассуРасшифровкаПлатежа.Ссылка.Комментарий ПОДОБНО ""#%""
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоступлениеВКассуРасшифровкаПлатежа.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПоступлениеНаСчетРасшифровкаПлатежа.Ссылка
	|ИЗ
	|	Документ.ПоступлениеНаСчет.РасшифровкаПлатежа КАК ПоступлениеНаСчетРасшифровкаПлатежа
	|ГДЕ
	|	ПоступлениеНаСчетРасшифровкаПлатежа.Заказ = &Заказ
	|	И ПоступлениеНаСчетРасшифровкаПлатежа.Документ = &Документ
	|	И ПоступлениеНаСчетРасшифровкаПлатежа.Ссылка.Проведен
	|	И ПоступлениеНаСчетРасшифровкаПлатежа.Ссылка.Комментарий ПОДОБНО ""#%""
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоступлениеНаСчетРасшифровкаПлатежа.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОперацияПоПлатежнымКартамРасшифровкаПлатежа.Ссылка
	|ИЗ
	|	Документ.ОперацияПоПлатежнымКартам.РасшифровкаПлатежа КАК ОперацияПоПлатежнымКартамРасшифровкаПлатежа
	|ГДЕ
	|	ОперацияПоПлатежнымКартамРасшифровкаПлатежа.Заказ = &Заказ
	|	И ОперацияПоПлатежнымКартамРасшифровкаПлатежа.Документ = &Документ
	|	И ОперацияПоПлатежнымКартамРасшифровкаПлатежа.Ссылка.Проведен
	|	И ОперацияПоПлатежнымКартамРасшифровкаПлатежа.Ссылка.Комментарий ПОДОБНО ""#%""
	|
	|СГРУППИРОВАТЬ ПО
	|	ОперацияПоПлатежнымКартамРасшифровкаПлатежа.Ссылка";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("Заказ", ДанныеДоставки.Заказ);
	СтруктураОтбора.Вставить("Документ", ДанныеДоставки.РасходнаяНакладная);
	
	Пока Выборка.Следующий() Цикл
		
		ДокументПоступленияОплаты = Выборка.Ссылка.ПолучитьОбъект();
		СтрокиКУдалению = ДокументПоступленияОплаты.РасшифровкаПлатежа.НайтиСтроки(СтруктураОтбора);
		Для каждого УдаляемаяСтрока Из СтрокиКУдалению Цикл
			ДокументПоступленияОплаты.РасшифровкаПлатежа.Удалить(УдаляемаяСтрока);
		КонецЦикла;
		
		Попытка
			Если ДокументПоступленияОплаты.РасшифровкаПлатежа.Количество() = 0 Тогда
				ДокументПоступленияОплаты.УстановитьПометкуУдаления(Истина);
			Иначе
				ДокументПоступленияОплаты.Записать(РежимЗаписиДокумента.Проведение);
			КонецЕсли; 
		Исключение
			Информация = ИнформацияОбОшибке();
			СообщенияПользователю = ПолучитьСообщенияПользователю();
			Ошибка = СтрШаблон(НСтр("ru = 'Не отменить оплату заказа %1: %2'"), 
				ДанныеДоставки.ЗаказПредставление, РекурсивноеОписаниеОшибки(Информация, СообщенияПользователю));
			Ошибки.Добавить(Выборка.Ссылка, Ошибка);
		КонецПопытки;
		 
	КонецЦикла;
			
КонецПроцедуры

Функция ИзменяемыйДокумент(Источник)
	
	Если ТипЗнч(Источник) <> Тип("СписокЗначений") Тогда
		Возврат Неопределено;
	КонецЕсли; 
	
	МассивОбъектов = Источник.ВыгрузитьЗначения();
	//@skip-check bsl-legacy-check-string-literal
	ЗначенияРеквизитов = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(МассивОбъектов, "Комментарий");
	ПодходящиеОбъекты = Новый Массив;
	Для каждого КлючИЗначение Из ЗначенияРеквизитов Цикл
		Если Лев(КлючИЗначение.Значение, 1) = "#" Тогда
			ПодходящиеОбъекты.Добавить(КлючИЗначение.Ключ);
		КонецЕсли; 
	КонецЦикла;
	Если ПодходящиеОбъекты.Количество() = 1 Тогда
		Возврат ПодходящиеОбъекты[0];
	Иначе
		Возврат Неопределено;
	КонецЕсли; 
	
КонецФункции

Функция РекурсивноеОписаниеОшибки(Информация, СообщенияПользователю = Неопределено)
	
	Ошибка = ОбработкаОшибок.КраткоеПредставлениеОшибки(Информация) + ?(Информация.Причина = Неопределено, "",
		Символы.ПС + РекурсивноеОписаниеОшибки(Информация.Причина));
	Если СообщенияПользователю <> Неопределено Тогда
		Для каждого Сообщение Из СообщенияПользователю Цикл
			Ошибка = Ошибка + Символы.ПС + Сообщение.Текст;
		КонецЦикла; 
	КонецЕсли; 
	
	Возврат Ошибка;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли