
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СпособВыплаты = Параметры.СпособВыплаты;
	Если НЕ ЗначениеЗаполнено(СпособВыплаты) Тогда
		СпособВыплаты = Перечисления.ТипыДенежныхСредств.Безналичные;
	КонецЕсли;
	ЭтоВыплатаВКассу = (СпособВыплаты = Перечисления.ТипыДенежныхСредств.Наличные);
	
	ПлатежнаяВедомость = Параметры.ПлатежнаяВедомость;
	ЗаполнитьПоПлатежнойВедомости();
	
	ДатаДенежногоДокумента = ТекущаяДатаСеанса();
	Если НЕ ЗначениеЗаполнено(Объект.ПериодРегистрации) Тогда
		Объект.ПериодРегистрации = НачалоМесяца(ТекущаяДатаСеанса());
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
		ОрганизацияПоУмолчанию = ПерсональныеНастройкиРУНФ.Прочитать("ОсновнаяОрганизация");
		Если ЗначениеЗаполнено(ОрганизацияПоУмолчанию) Тогда
			Объект.Организация = ОрганизацияПоУмолчанию;
		КонецЕсли;
	КонецЕсли;
	ОрганизацияПриИзмененииНаСервере();
	
	ИспользоватьМногофирменныйУчет = ПолучитьФункциональнуюОпцию("ИспользоватьНесколькоОрганизаций");
	Если Не ИспользоватьМногофирменныйУчет И ЗначениеЗаполнено(Объект.Организация) Тогда
		Элементы.Организация.Вид = ВидПоляФормы.ПолеНадписи;
		Элементы.Организация.Гиперссылка = Истина;
	КонецЕсли;
	
	ОтображениеПериодаРегистрации = ЗарплатаИПерсоналКлиентСервер.ПредставлениеПериодаРегистрации(
		Объект.ПериодРегистрации);
	СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.Прочее;
	
	УстановитьВидимостьПоСпособуВыплаты(Элементы, ЭтоВыплатаВКассу, ЕстьРегламентированныйУчет);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СотрудникиДокументПланирования",
		"Видимость", ПравоДоступа("Чтение", Метаданные.Документы.РасходДСПлан));
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СотрудникиСоздатьДокументыПланирования",
		"Видимость", ПравоДоступа("Изменение", Метаданные.Документы.РасходДСПлан));
	
	ЕстьПометки = (Сотрудники.НайтиСтроки(Новый Структура("Пометка", Истина)).Количество() > 0);
	АдаптацияФормыТакси();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьКомандуПометок();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПлатежнаяВедомостьПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(ПлатежнаяВедомость) Тогда
		ЗаполнитьПоПлатежнойВедомости();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодРегистрацииРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	ЗарплатаИПерсоналКлиент.ПриРегулированииПериодаРегистрации(ЭтотОбъект, Направление);
	ЗарплатаИПерсоналКлиент.ПриИзмененииПериодаРегистрации(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодРегистрацииНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ЗарплатаИПерсоналКлиент.ОткрытьВыборПериодаРегистрации(Объект.ПериодРегистрации, Элементы.ПериодРегистрации);

КонецПроцедуры

&НаКлиенте
Процедура ПериодРегистрацииОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением,
	СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		Объект.ПериодРегистрации = ВыбранноеЗначение.НачалоПериода;
		ЗарплатаИПерсоналКлиент.ПриИзмененииПериодаРегистрации(ЭтотОбъект);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ОрганизацияПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СпособВыплатыПриИзменении(Элемент)
	ЭтоВыплатаВКассу = (СпособВыплаты = ПредопределенноеЗначение("Перечисление.ТипыДенежныхСредств.Наличные"));
	УстановитьВидимостьПоСпособуВыплаты(Элементы, ЭтоВыплатаВКассу, ЕстьРегламентированныйУчет);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСотрудники

&НаКлиенте
Процедура СотрудникиДокументПланированияПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТекущиеДанные.ДокументПланирования) Тогда
		ТекущиеДанные.ДокументПланированияСтатус = -1;
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные.ДокументПланированияСтатус = СтатусДокументаДляКартинки(ТекущиеДанные.ДокументПланирования);
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле = Элементы.СотрудникиДокументВыплаты Тогда
		
		ТекущиеДанные = Сотрудники.НайтиПоИдентификатору(ВыбраннаяСтрока);
		Если ТекущиеДанные = Неопределено ИЛИ НЕ ЗначениеЗаполнено(ТекущиеДанные.ДокументВыплаты) Тогда
			Возврат;
		КонецЕсли;
		
		ПоказатьЗначение( , ТекущиеДанные.ДокументВыплаты);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиОтметкаПриИзменении(Элемент)
	
	ЕстьПометки = (Сотрудники.НайтиСтроки(Новый Структура("Пометка", Истина)).Количество() > 0);
	ОбновитьКомандуПометок();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьДокументы(Команда)
	Реквизиты = РеквизитыДокументаДляОбработки();
	Если Реквизиты.Отказ Тогда
		ПоказатьПредупреждение( , НСтр("ru = 'Не заполнены обязательные реквизиты'"));
		Возврат;
	КонецЕсли;
	
	ДанныеСотрудников = ДанныеСотрудниковДляОбработки();
	Если ДанныеСотрудников.Количество() = 0 Тогда
		ПоказатьПредупреждение(, "Не выбрано ни одного сотрудника!");
		Возврат;
	КонецЕсли;
	
	ДлительнаяОперация = ЗапуститьСозданиеДокументовОплаты(УникальныйИдентификатор, Реквизиты, ДанныеСотрудников);
	ОжидатьСозданияДокументов(ДлительнаяОперация, "ДокументВыплаты");
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокументыПланирования(Команда)
	
	Реквизиты = РеквизитыДокументаДляОбработки();
	Если Реквизиты.Отказ Тогда
		ПоказатьПредупреждение( , НСтр("ru = 'Не заполнены обязательные реквизиты'"));
		Возврат;
	КонецЕсли;
	
	ДанныеСотрудников = ДанныеСотрудниковДляОбработки();
	Если ДанныеСотрудников.Количество() = 0 Тогда
		ПоказатьПредупреждение(, "Не выбрано ни одного сотрудника!");
		Возврат;
	КонецЕсли;
	
	ДлительнаяОперация = ЗапуститьСозданиеДокументовПланирования(УникальныйИдентификатор, Реквизиты, ДанныеСотрудников);
	ОжидатьСозданияДокументов(ДлительнаяОперация, "ДокументПланирования");
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСнятьПометки(Команда)
	
	ЕстьПометки = НЕ ЕстьПометки;
	Для Каждого Строка Из Сотрудники Цикл
		Строка.Пометка = ЕстьПометки;
	КонецЦикла;
	ОбновитьКомандуПометок();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура АдаптацияФормыТакси()
	
	ЭтоИнтерфейсТакси = Не ОбщегоНазначенияКлиентСервер.ЭтоВариантИнтерфейса85();
	
	Элементы.СотрудникиУстановитьСнятьПометки.Видимость = ЭтоИнтерфейсТакси;
	Элементы.СотрудникиОтметка.Видимость = ЭтоИнтерфейсТакси;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьКомандуПометок()
	
	Элементы.СотрудникиУстановитьСнятьПометки.Картинка = ?(ЕстьПометки,
		БиблиотекаКартинок.УстановитьВсе, БиблиотекаКартинок.СнятьВсе);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьПоСпособуВыплаты(Элементы, Знач ЭтоВыплатаВКассу, Знач ЕстьРегламентированныйУчет)
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "БанковскийСчет",
		"Видимость", НЕ ЭтоВыплатаВКассу);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Касса",
		"Видимость", ЭтоВыплатаВКассу);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СотрудникиБанковскийСчет",
		"Видимость", НЕ ЭтоВыплатаВКассу);
	
	УстановитьВидимостьВедомостейРегл(Элементы, ЭтоВыплатаВКассу, ЕстьРегламентированныйУчет);
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьВедомостейРегл(Элементы, ЭтоВыплатаВКассу, ЕстьРегламентированныйУчет)

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ВедомостьВБанк",
		"Видимость", НЕ ЭтоВыплатаВКассу И ЕстьРегламентированныйУчет);

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ВедомостьВКассу",
		"Видимость", ЭтоВыплатаВКассу И ЕстьРегламентированныйУчет);

КонецПроцедуры

&НаСервереБезКонтекста
Функция СтатусДокументаДляКартинки(Знач ДокументСсылка)
	
	ДанныеДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументСсылка, "Проведен, ПометкаУдаления");
	Возврат Обработки.СозданиеВыплатЗарплатыСотрудникам.СтатусДенежногоДокументаДляОтображения(ДокументСсылка,
		ДанныеДокумента.Проведен, ДанныеДокумента.ПометкаУдаления);
КонецФункции

&НаКлиенте
Функция РеквизитыДокументаДляОбработки()
	
	РеквизитыДокумента = Новый Структура;
	РеквизитыДокумента.Вставить("ТребуетсяЗаполнить", Новый Массив);
	
	Ошибки = Неопределено;
	Если НЕ ЗначениеЗаполнено(ДатаДенежногоДокумента) Тогда
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "ДатаДенежногоДокумента",
		НСтр("ru = 'Заполните дату денежного документ'"));
	КонецЕсли;
	РеквизитыДокумента.Вставить("Дата", ДатаДенежногоДокумента);
	ТекущаяДата = ОбщегоНазначенияКлиент.ДатаСеанса();
	Если НачалоДня(ДатаДенежногоДокумента) = НачалоДня(ТекущаяДата) Тогда
		РеквизитыДокумента.Дата = ТекущаяДата;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, " Объект.Организация",
		НСтр("ru = 'Выберите организацию'"));
	КонецЕсли;
	РеквизитыДокумента.Вставить("Организация", Объект.Организация);
	
	РеквизитыДокумента.Вставить("СпособВыплаты", СпособВыплаты);
	
	Если СпособВыплаты = ПредопределенноеЗначение("Перечисление.ТипыДенежныхСредств.Наличные") Тогда
		Если НЕ ЗначениеЗаполнено(Касса) Тогда
			ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "Касса",
			НСтр("ru = 'Укажите кассу, из которой будет произведена выплата'"));
		КонецЕсли;
	Иначе
		Если НЕ ЗначениеЗаполнено(БанковскийСчет) Тогда
			ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "БанковскийСчет",
			НСтр("ru = 'Укажите банковский счет, откуда будут перечислены средства'"));
		КонецЕсли;
	КонецЕсли;

	РеквизитыДокумента.Вставить("БанковскийСчет", БанковскийСчет);
	РеквизитыДокумента.Вставить("Касса", Касса);
	
	Если НЕ ЗначениеЗаполнено(Объект.ПериодРегистрации) Тогда
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "Объект.ПериодРегистрации",
		НСтр("ru = 'Выберите период регистрации - месяц, за который выплачивается зарплата'"));
	КонецЕсли;
	РеквизитыДокумента.Вставить("ПериодРегистрации", Объект.ПериодРегистрации);
	
	Если НЕ ЗначениеЗаполнено(ПлатежнаяВедомость) Тогда
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "ПлатежнаяВедомость",
		НСтр("ru = 'Выберите Платежную ведомость, в которой заполнена зарплата к выплате'"));
	КонецЕсли;
	РеквизитыДокумента.Вставить("ПлатежнаяВедомость", ПлатежнаяВедомость);
	
	РеквизитыДокумента.Вставить("ВедомостьВКассу", ВедомостьВКассу);
	РеквизитыДокумента.Вставить("ВедомостьВБанк", ВедомостьВБанк);
	РеквизитыДокумента.Вставить("Подразделение", Подразделение);
	РеквизитыДокумента.Вставить("Проект", Проект);
	РеквизитыДокумента.Вставить("Статья", СтатьяДвиженияДенежныхСредств);
	
	РеквизитыДокумента.Вставить("Отказ", Ложь);
	ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки, РеквизитыДокумента.Отказ);
	
	Возврат РеквизитыДокумента;
	
КонецФункции

&НаКлиенте
Функция ДанныеСотрудниковДляОбработки()
	
	ДанныеСотрудников = Новый Массив;
	Если ЭтоИнтерфейсТакси Тогда
		ВыбранныеСтроки = Сотрудники.НайтиСтроки(Новый Структура("Пометка", Истина));
		Для Каждого Строка Из ВыбранныеСтроки Цикл
			ДобавитьДанныеСтрокиСотрудника(Строка, ДанныеСотрудников);
		КонецЦикла;
	Иначе
		ВыбранныеСтроки = Элементы.Сотрудники.ПолучитьСтрокиДляОбработки();
		Для Каждого ИндексСтроки Из ВыбранныеСтроки Цикл
			Строка = Сотрудники.НайтиПоИдентификатору(ИндексСтроки);
			ДобавитьДанныеСтрокиСотрудника(Строка, ДанныеСотрудников);
		КонецЦикла;
	КонецЕсли;

	Если ВыбранныеСтроки.Количество() = 0 И Элементы.Сотрудники.ТекущаяСтрока <> Неопределено Тогда
		ДобавитьДанныеСтрокиСотрудника(Элементы.Сотрудники.ТекущиеДанные, ДанныеСотрудников);
	КонецЕсли;
	
	Возврат ДанныеСотрудников;
КонецФункции

&НаКлиенте
Процедура ДобавитьДанныеСтрокиСотрудника(Строка, ДанныеВыбранныхСотрудников)
	ПоляСтруктуры = "Сотрудник, БанковскийСчет, СуммаВыплаты, ДокументПланирования, ДокументВыплаты";
	
	Данные = Новый Структура(ПоляСтруктуры);
	ЗаполнитьЗначенияСвойств(Данные, Строка);
	ДанныеВыбранныхСотрудников.Добавить(Данные);
	
КонецПроцедуры

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
	
		ДанныеОрганизации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Организация,
			"БанковскийСчетПоУмолчанию, КассаПоУмолчанию");
		БанковскийСчет = ДанныеОрганизации.БанковскийСчетПоУмолчанию;
		Касса = ДанныеОрганизации.КассаПоУмолчанию;
		ЕстьРегламентированныйУчет = Справочники.Организации.НужноПоказыватьЭлементыБЗКБДляОрганизации(
			Объект.Организация);
	Иначе
		ЕстьРегламентированныйУчет = Ложь;
	КонецЕсли;
	УстановитьВидимостьВедомостейРегл(Элементы, ЭтоВыплатаВКассу, ЕстьРегламентированныйУчет);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоПлатежнойВедомости()
	
	Сотрудники.Очистить();
	
	ДанныеДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПлатежнаяВедомость,
		"Организация, ПериодРегистрации, СтруктурнаяЕдиница");
	
	Если Объект.Организация <> ДанныеДокумента.Организация Тогда 
		Объект.Организация = ДанныеДокумента.Организация;
		ОрганизацияПриИзмененииНаСервере();
	КонецЕсли;
	
	Объект.ПериодРегистрации = ДанныеДокумента.ПериодРегистрации;
	Подразделение = ДанныеДокумента.СтруктурнаяЕдиница;
		
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВедомостьНаВыплатуЗарплаты.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ВедомостьНаВыплатуЗарплаты КАК ВедомостьНаВыплатуЗарплаты
	|ГДЕ
	|	ВедомостьНаВыплатуЗарплаты.Организация = &Организация
	|	И ВедомостьНаВыплатуЗарплаты.ПериодРегистрации = &ПериодРегистрации
	|	И ВедомостьНаВыплатуЗарплаты.Проведен";
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("ПериодРегистрации", Объект.ПериодРегистрации);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() = 1 Тогда
		Выборка.Следующий();
		ВедомостьВБанк = Выборка.Ссылка;
	КонецЕсли;
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.ВедомостьНаВыплатуЗарплаты",
		"Документ.ВедомостьНаВыплатуЗарплатыВКассу");
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() = 1 Тогда
		Выборка.Следующий();
		ВедомостьВБанк = Выборка.Ссылка;
	КонецЕсли;

	ДокументыПланирования = Новый Соответствие;
	
	Запрос.УстановитьПараметр("ПлатежнаяВедомость", ПлатежнаяВедомость);
	Запрос.Текст = "ВЫБРАТЬ
	|	РасходДСПлан.Ссылка КАК ДокументПланирования,
	|	РасходДСПлан.Подотчетник КАК Сотрудник,
	|	РасходДСПлан.Проведен КАК Проведен
	|ИЗ
	|	Документ.РасходДСПлан КАК РасходДСПлан
	|ГДЕ
	|	РасходДСПлан.Ведомость = &ПлатежнаяВедомость
	|	И РасходДСПлан.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходДСПлан.ЗарплатаСотруднику)
	|	И РасходДСПлан.ПериодРегистрации = &ПериодРегистрации
	|	И НЕ РасходДСПлан.ПометкаУдаления";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ДанныеДокумента = Новый Структура("Документ, Статус");
		ДанныеДокумента.Документ = Выборка.ДокументПланирования;
		ДанныеДокумента.Статус = Обработки.СозданиеВыплатЗарплатыСотрудникам.СтатусДенежногоДокументаДляОтображения(
			ДанныеДокумента.Документ, Выборка.Проведен, Ложь);
		ДокументыПланирования.Вставить(Выборка.Сотрудник, ДанныеДокумента);
	КонецЦикла;

	ДокументыВыплаты = Новый Соответствие;
	Запрос.Текст = "ВЫБРАТЬ
	|	РасходДС.Ссылка КАК Документ,
	|	РасходДС.Подотчетник КАК Сотрудник,
	|	РасходДС.Проведен КАК Проведен
	|ИЗ
	|	Документ.РасходИзКассы КАК РасходДС
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РасходИзКассы.ВыплатаЗаработнойПлаты КАК РасходДСВедомости
	|		ПО РасходДС.Ссылка = РасходДСВедомости.Ссылка
	|		И РасходДС.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходИзКассы.ЗарплатаСотруднику)
	|		И РасходДС.ПериодРегистрации = &ПериодРегистрации
	|		И НЕ РасходДС.ПометкаУдаления
	|		И РасходДСВедомости.Ведомость = &ПлатежнаяВедомость
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РасходДС.Ссылка,
	|	РасходДС.Подотчетник,
	|	ЛОЖЬ
	|ИЗ
	|	Документ.ПлатежноеПоручение КАК РасходДС
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПлатежноеПоручение.ВыплатаЗаработнойПлаты КАК РасходДСВедомости
	|		ПО РасходДС.Ссылка = РасходДСВедомости.Ссылка
	|		И РасходДС.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПлатежноеПоручение.ЗарплатаСотруднику)
	|		И РасходДС.ПериодРегистрации = &ПериодРегистрации
	|		И НЕ РасходДС.ПометкаУдаления
	|		И РасходДСВедомости.Ведомость = &ПлатежнаяВедомость";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ДанныеДокумента = Новый Структура("Документ, Статус");
		ДанныеДокумента.Документ = Выборка.Документ;
		ДанныеДокумента.Статус = Обработки.СозданиеВыплатЗарплатыСотрудникам.СтатусДенежногоДокументаДляОтображения(
			Выборка.Документ, Выборка.Проведен, Ложь);
		ДокументыВыплаты.Вставить(Выборка.Сотрудник, ДанныеДокумента);
	КонецЦикла;

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СотрудникиВедомости.Сотрудник КАК Сотрудник,
	|	СотрудникиВедомости.СуммаПлатежа КАК СуммаВыплаты,
	|	Сотрудники.ФизическоеЛицо КАК ФизическоеЛицо,
	|	Сотрудники.ФизическоеЛицо.БанковскийСчетПоУмолчанию КАК БанковскийСчет,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Наличные) КАК СпособВыплаты
	|ИЗ
	|	Документ.ПлатежнаяВедомость.Сотрудники КАК СотрудникиВедомости
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
	|		ПО СотрудникиВедомости.Сотрудник = Сотрудники.Ссылка
	|		И СотрудникиВедомости.Ссылка = &ПлатежнаяВедомость";
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Сотрудники.Очистить();
	
	Пока Выборка.Следующий() Цикл

		НоваяСтрока = Сотрудники.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		
		НоваяСтрока.ДокументПланированияСтатус = -1;
		ДанныеДокумента = ДокументыПланирования.Получить(Выборка.Сотрудник);
		Если ДанныеДокумента <> Неопределено Тогда
			НоваяСтрока.ДокументПланирования = ДанныеДокумента.Документ;
			НоваяСтрока.ДокументПланированияСтатус = ДанныеДокумента.Статус;
		КонецЕсли;
		
		НоваяСтрока.ДокументВыплатыСтатус = -1;
		ДанныеДокумента = ДокументыВыплаты.Получить(Выборка.Сотрудник);
		Если ДанныеДокумента <> Неопределено Тогда
			НоваяСтрока.ДокументВыплаты = ДанныеДокумента.Документ;
			НоваяСтрока.ДокументВыплатыСтатус = ДанныеДокумента.Статус;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗапуститьСозданиеДокументовПланирования(Знач ИдентификаторФормы, Знач Реквизиты,
	Знач ВыплатыСотрудникам = Неопределено)
	
	Возврат ДлительныеОперации.ВыполнитьФункцию( ИдентификаторФормы,
		"Обработки.СозданиеВыплатЗарплатыСотрудникам.СоздатьДокументыПланирования",
		Реквизиты, ВыплатыСотрудникам);
	
КонецФункции

&НаСервереБезКонтекста
Функция ЗапуститьСозданиеДокументовОплаты(Знач ИдентификаторФормы, Знач Реквизиты,
	Знач ВыплатыСотрудникам = Неопределено)
	
	Возврат ДлительныеОперации.ВыполнитьФункцию(ИдентификаторФормы,
		"Обработки.СозданиеВыплатЗарплатыСотрудникам.СоздатьДокументыОплаты",
		Реквизиты, ВыплатыСотрудникам);
	
КонецФункции

&НаКлиенте
Процедура ОжидатьСозданияДокументов(ДлительнаяОперация, РеквизитДокумент)
	
	ПараметрыОповещения = Новый Структура;
	ПараметрыОповещения.Вставить("РеквизитДокумент", РеквизитДокумент);
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбработатьСозданиеДокументов", ЭтотОбъект, 
		ПараметрыОповещения);
		
	Если ДлительнаяОперация.Статус = "Выполняется" Тогда
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	Иначе
		ОбработатьСозданиеДокументов(ДлительнаяОперация, ПараметрыОповещения);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьСозданиеДокументов(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Ошибки = Неопределено;	
	Если Результат.Статус = "Ошибка" Тогда
		ШаблонОшибка = НСтр("ru = 'При создании документов возникла ошибка: %1'");
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "Сотрудники",
					СтрШаблон(ШаблонОшибка, Результат.КраткоеПредставлениеОшибки));
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" Тогда
		ШаблонОшибка = НСтр("ru = 'При создании документа для сотрудника %1 возникла ошибка: %2'");
		ДокументыСотрудников = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
		
		Для Каждого СтрокаСотрудник Из Сотрудники Цикл
			РезультатСотрудника = ДокументыСотрудников.Получить(СтрокаСотрудник.Сотрудник);
			Если РезультатСотрудника = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(РезультатСотрудника.Документ) Тогда
				СтрокаСотрудник[ДополнительныеПараметры.РеквизитДокумент] = РезультатСотрудника.Документ;
				СтрокаСотрудник[ДополнительныеПараметры.РеквизитДокумент + "Статус"] = РезультатСотрудника.Статус;
			КонецЕсли;
			
			Для Каждого ТекстОшибки Из РезультатСотрудника.Ошибки Цикл
				ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "Сотрудники",
					СтрШаблон(ШаблонОшибка, СтрокаСотрудник.Сотрудник, ТекстОшибки));
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки);
	
КонецПроцедуры

#КонецОбласти
