
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ПечатьДокументовУНФ.УстановитьОтображениеПодменюПечати(Элементы.ПодменюПечать);
	ПечатьДокументовУНФ.КорректировкаРазмещениеПодчиненнойГруппыКомандПечати(ЭтотОбъект, Элементы.ПодменюПечать,
		Элементы.ПодменюПечатьФаксимиле);
	
	ДинамическиеСпискиУНФ.ОтображатьТолькоВремяДляТекущейДаты(Список);
	
	УчетВалютныхОпераций = ПолучитьФункциональнуюОпцию("УчетВалютныхОпераций");
	
	// ПоложениеТаблицыДетали
	КлючОбъекта = СтрЗаменить(ИмяФормы, ".", "");
	ПанельДеталиРазвернута = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(КлючОбъекта, 
		"ПанельДеталиРазвернута", Истина);
	
	ПоложениеТаблицыДетали = ПерсональныеНастройкиРУНФ.Прочитать("ПоложениеТаблицыДеталиВДополнительныхРасходах");
	
	ЭтоМобильныйКлиент = ОбщегоНазначения.ЭтоМобильныйКлиент();
	Если ЭтоМобильныйКлиент Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, 
			"ФормаНастроитьФорму", "Видимость", Ложь);
		ПоложениеТаблицыДетали = Перечисления.ПоложениеТаблицыДетали.ВПравойПанели;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ПоложениеТаблицыДетали) Тогда
		ПоложениеТаблицыДетали = Перечисления.ПоложениеТаблицыДетали.ВПравойПанели;
	КонецЕсли;
	
	ЗаполнитьКартинкиСостоянийДокумента();
	НастроитьПоложениеПанелиДетали(ЭтотОбъект);
	// Конец ПоложениеТаблицыДетали
	
	ВремяЗадержкиОбработчиковОжидания = 0.3;
	
	//УНФ.ОтборыСписка
	УстановитьВидимостьОтборов();
	РаботаСОтборами.ОпределитьПорядокПредопределенныхОтборов(ЭтотОбъект);
	РаботаСОтборами.ВосстановитьНастройкиОтборов(ЭтотОбъект, Список);
	
	МассивИсключений = РаботаСОтборами.МассивИсключенийПоТипуДокумента("ДополнительныеРасходы");
	РаботаСОтборами.ЗаполнитьСписокВыбораОтборОплата(ЭтотОбъект, "ОтборОплата", Ложь, МассивИсключений);
	
	ЗаполнитьСписокВыбораОтборСостояниеОригинала();
	
	//Конец УНФ.ОтборыСписка
	
	// УНФ.ПанельКонтактнойИнформации
	КонтактнаяИнформацияПанельУНФ.ПриСозданииНаСервере(ЭтотОбъект, "КонтактнаяИнформация", "СписокКонтекстноеМеню");
	// Конец УНФ.ПанельКонтактнойИнформации
	
	// СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
	УчетОригиналовПервичныхДокументов.ПриСозданииНаСервере_ФормаСписка(ЭтотОбъект, Элементы.Список);
	// Конец СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
	
	// ЭДО
	УправлениеНебольшойФирмойЭлектронныеДокументыСервер.КомандыЭДО_ФормаСписка(ЭтотОбъект, Истина);
	// Конец ЭДО
	
	АдаптацияТакси();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ВремяЗадержкиОбработчиковОжидания = ДокументыУНФКлиент.ВремяЗадержкиОбработчиковОжидания();
	
	// ЭДО
	ОбменСКонтрагентамиКлиент.ПриОткрытии(ЭтотОбъект);
	// Конец ЭДО
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// УНФ.ПанельКонтактнойИнформации
	Если КонтактнаяИнформацияПанельУНФКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьПанельКонтактнойИнформации();
	КонецЕсли;
	// Конец УНФ.ПанельКонтактнойИнформации
	
	// СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
	УчетОригиналовПервичныхДокументовКлиент.ОбработчикОповещенияФормаСписка(ИмяСобытия, ЭтотОбъект, Элементы.Список);
	// Конец СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
	
	// ЭДО
	ПараметрыОповещенияЭДО = ОбменСКонтрагентамиКлиент.ПараметрыОповещенияЭДО_ФормаСписка();
	ПараметрыОповещенияЭДО.Форма = ЭтотОбъект;
	ПараметрыОповещенияЭДО.ИмяДинамическогоСписка = "Список";
	ОбменСКонтрагентамиКлиент.ОбработкаОповещения_ФормаСписка(ИмяСобытия, Параметр, Источник, ПараметрыОповещенияЭДО);
	// Конец ЭДО
	
	Если ИмяСобытия = "ОповещениеОбИзмененииДолга" Тогда
		Элементы.Список.Обновить();
	КонецЕсли;
	
	Если ИмяСобытия = "Запись_ДополнительныеРасходы"
		И ТипЗнч(Параметр) = Тип("ДокументСсылка.ДополнительныеРасходы") Тогда
		Если Параметр = Элементы.Список.ТекущаяСтрока Тогда
			ПроверитьОбновитьДеталиПоДокументу(Ложь);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если НЕ ЗавершениеРаботы Тогда
		//УНФ.ОтборыСписка
		СохранитьНастройкиОтборов();
		//Конец УНФ.ОтборыСписка
	КонецЕсли; 

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОтборКонтрагентОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьМеткуИОтборСписка("Контрагент", Элемент.Родитель.Имя, ВыбранноеЗначение);
	ВыбранноеЗначение = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборОрганизацияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьМеткуИОтборСписка("Организация", Элемент.Родитель.Имя, ВыбранноеЗначение);
	ВыбранноеЗначение = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборСостояниеОригиналаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)

	Если ВыбранноеЗначение = ПредопределенноеЗначение("Справочник.СостоянияОригиналовПервичныхДокументов.ПустаяСсылка") Тогда
		УстановитьМеткуИОтборСписка("СостояниеОригинала", Элемент.Родитель.Имя, ВыбранноеЗначение,
			УчетОригиналовПервичныхДокументовУНФКлиентСервер.СостояниеОригиналаНеизвестно());
	Иначе
		УстановитьМеткуИОтборСписка("СостояниеОригинала", Элемент.Родитель.Имя, ВыбранноеЗначение);
	КонецЕсли;

	ВыбранноеЗначение = Неопределено;

КонецПроцедуры

&НаКлиенте
Процедура ОтборОтветственныйОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьМеткуИОтборСписка("Ответственный", Элемент.Родитель.Имя, ВыбранноеЗначение);
	ВыбранноеЗначение = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборСкладОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьМеткуИОтборСписка("СтруктурнаяЕдиница", Элемент.Родитель.Имя, ВыбранноеЗначение);
	ВыбранноеЗначение = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборОплатаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
	Если ВыбранноеЗначение = "Без оплаты"
		Или ВыбранноеЗначение = "Оплачен частично"
		Или ВыбранноеЗначение = "Оплачен полностью" Тогда
		УстановитьМеткуИОтборСписка("СтатусОплаты", Элемент.Родитель.Имя, ВыбранноеЗначение);
	Иначе
		УстановитьМеткуИОтборСписка("НомерКартинкиОплаты", Элемент.Родитель.Имя, ВыбранноеЗначение);
	КонецЕсли;
	ВыбранноеЗначение = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьОткрытьДокументОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьТекущийДокумент(Элементы.Список.ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьПодСпискомОткрытьДокументОбработкаНавигационнойСсылки(Элемент,
	НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьТекущийДокумент(Элементы.Список.ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначокДеталиНажатие(Элемент)
	
	СвернутьРазвернутьПанельОтборов();
	ТекущаяСтраница = Элементы.Детали;
	Элементы.ПраваяПанельСтраницы.ТекущаяСтраница = ТекущаяСтраница;
	
	ПроверитьОбновитьДеталиПоДокументу(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ПраваяПанельСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	ОбновитьКИ = (Элементы.ПраваяПанельСтраницы.ТекущаяСтраница = Элементы.Контакты);
	ПроверитьОбновитьДеталиПоДокументу(ОбновитьКИ);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначокФильтрыНажатие(Элемент)
	
	СвернутьРазвернутьПанельОтборов();
	ТекущаяСтраница = Элементы.ФильтрыНастройкиИДопИнфо;
	Элементы.ПраваяПанельСтраницы.ТекущаяСтраница = ТекущаяСтраница;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначокКонтактыНажатие(Элемент)
	
	СвернутьРазвернутьПанельОтборов();
	ТекущаяСтраница = Элементы.Контакты;
	Элементы.ПраваяПанельСтраницы.ТекущаяСтраница = ТекущаяСтраница;
	
КонецПроцедуры

&НаКлиенте
Процедура ИндексФильтрыНажатие(Элемент, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	СвернутьРазвернутьПанельОтборов();
	ТекущаяСтраница = Элементы.ФильтрыНастройкиИДопИнфо;
	Элементы.ПраваяПанельСтраницы.ТекущаяСтраница = ТекущаяСтраница;

КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеПериодаНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	РаботаСОтборамиКлиент.ПредставлениеПериодаВыбратьПериод(ЭтотОбъект, "Список", "Дата");
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеПериодаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	РаботаСОтборамиКлиент.ПредставлениеПериодаВыбратьПериод(ЭтотОбъект, "Список", "Дата");
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеПериодаОчистка(Элемент, СтандартнаяОбработка)

	РаботаСОтборамиКлиент.СброситьОтборПоПериоду(ЭтотОбъект, "Список", "Дата");

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	// СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
	УчетОригиналовПервичныхДокументовКлиент.СписокВыбор(Поле.Имя, ЭтотОбъект, Элементы.Список, СтандартнаяОбработка);
	// Конец СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	КонтактнаяИнформацияПанельУНФКлиент.ПриАктивизацииДинамическогоСписка(ЭтотОбъект, Элемент, ТекущийКонтрагент,
		"Контрагент");
	
	ОбновитьДеталиДокумента = ВидимыДанныеДетали();
	
	Если ОбновитьДеталиДокумента Тогда
		ПодключитьОбработчикОжидания("СписокПриАктивизацииСтрокиОбработчик", ВремяЗадержкиОбработчиковОжидания, Истина);
	КонецЕсли;

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриНаведении(Элемент, Строка, Поле)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ОбменСКонтрагентамиКлиент.ПриНаведенииСтроки_ФормаСписка(ЭтотОбъект, Элемент, Строка);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентам
	
КонецПроцедуры

#Область ЗамерыПроизводительности

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	ОценкаПроизводительностиКлиент.ЗамерВремени("СозданиеФормы"
		+ РаботаСФормойДокументаКлиентСервер.ПолучитьИмяФормыСтрокой(ИмяФормы));
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломИзменения(Элемент, Отказ)
	
	ОценкаПроизводительностиКлиент.ЗамерВремени("ОткрытиеФормы"
		+ РаботаСФормойДокументаКлиентСервер.ПолучитьИмяФормыСтрокой(ИмяФормы));
	
КонецПроцедуры
	
&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	// СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
	УчетОригиналовПервичныхДокументов.ПриПолученииДанныхНаСервере(Строки);
	// Конец СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
	
КонецПроцедуры

#КонецОбласти


#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СвернутьПравуюПанель(Команда)
	СвернутьРазвернутьПанельОтборов();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьПоШаблону(Команда)
	
	ЗаполнениеОбъектовУНФКлиент.ПоказатьВыборШаблонаДляСозданияДокументаИзСписка("Документ.ДополнительныеРасходы",
		Список.КомпоновщикНастроек.Настройки.Отбор.Элементы, Элементы.Список.ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьОтборы(Команда)
	
	ИмяРеквизитаСписка = "Список";
	ИмяТЧДанныеМеток = "ДанныеМеток";
	ИмяТЧДанныеОтборов = "ДанныеОтборов";
	ИмяГруппыОтборов = "ГруппаОтборы";
	ИмяПредопределенныеОтборыПоУмолчанию = "ПредопределенныеОтборыПоУмолчанию";
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяРеквизитаСписка", ИмяРеквизитаСписка);
	ДополнительныеПараметры.Вставить("ИмяТЧДанныеМеток", ИмяТЧДанныеМеток);
	ДополнительныеПараметры.Вставить("ИмяТЧДанныеОтборов", ИмяТЧДанныеОтборов);
	ДополнительныеПараметры.Вставить("ИмяГруппыОтборов", ИмяГруппыОтборов);
	ДополнительныеПараметры.Вставить("ИмяПредопределенныеОтборыПоУмолчанию", ИмяПредопределенныеОтборыПоУмолчанию);
	
	РаботаСОтборамиКлиент.НастроитьОтборыНажатие(ЭтотОбъект, ПараметрыОткрытияФормыСНастройкамиОтборов(
		ДополнительныеПараметры), ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура СброситьВсеОтборы(Команда)
	РаботаСОтборамиКлиент.СброситьОтборПоПериоду(ЭтотОбъект, "Список", "Дата");
	СброситьВсеМеткиОтбораНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура НастроитьФорму(Команда)
	
	ОткрытьФормуНастройки(Истина);
	СтатистикаИспользованияФормКлиент.ПриИнтерактивномДействии(ЭтотОбъект, Элементы.ФормаНастроитьФорму, "Нажатие");

КонецПроцедуры

&НаКлиенте
Процедура СвернутьРазвернутьДетали(Команда)
	
	ПанельДеталиРазвернута = НЕ ПанельДеталиРазвернута;
	ОбработатьПанельПредпросмотра();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура СписокПриАктивизацииСтрокиОбработчик()
	
	ОбновитьКИ = ЭтотОбъект.КИ_НужноИзменитьДанныеПриАктивизацииСтрокиТаблицы;
	
	Если ОбновитьКИ ИЛИ ОбновитьДеталиДокумента Тогда
		ДанныеДеталиДокумента = ДанныеТекущегоДокумента();
		ОбновитьДанныеПравойПанели(ОбновитьКИ, ОбновитьДеталиДокумента, ДанныеДеталиДокумента);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеПравойПанели(ОбновитьКИ, ОбновитьДД, ДанныеДокумента)
	
	Если ОбновитьКИ Тогда
		КонтактнаяИнформацияПанельУНФ.ОбновитьДанныеПанели(ЭтотОбъект, ТекущийКонтрагент);
	КонецЕсли;
	
	Если ОбновитьДД Тогда
		ЗаполнитьПанельДетали(ДанныеДокумента);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуНастройки(ПередаватьВидДокумента)
	
	СтруктураПараметров = Новый Структура;
	
	Если ПередаватьВидДокумента Тогда
		СтруктураПараметров.Вставить("ВидДокумента", НСтр("ru = 'список дополнительных расходов'"));
	КонецЕсли;
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("ПоложениеТаблицыДеталиВДополнительныхРасходах",
		НСтр("ru = 'Положение таблицы ""Услуги""'"));
	
	СтруктураПараметров.Вставить("БылиВнесеныИзменения", Ложь);
	СтруктураПараметров.Вставить("ПоложениеТаблицыДеталиВДополнительныхРасходах",
		ПоложениеТаблицыДетали);
	СтруктураПараметров.Вставить("Заголовки", Заголовки);
		
	ОткрытьФорму("ОбщаяФорма.ШапкаТабличнаяЧасть", СтруктураПараметров, , , , , 
		Новый ОписаниеОповещения("ШапкаТабличнаяЧастьЗавершение", ЭтотОбъект));

КонецПроцедуры

&НаКлиенте
Процедура ШапкаТабличнаяЧастьЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Структура") И Результат.БылиВнесеныИзменения Тогда
		Если ПоложениеТаблицыДетали <> Результат.ПоложениеТаблицыДеталиВДополнительныхРасходах Тогда
			ПоложениеТаблицыДетали = Результат.ПоложениеТаблицыДеталиВДополнительныхРасходах;
			НастроитьПоложениеПанелиДетали(ЭтотОбъект);
			ДеталиВидимы = ВидимыДанныеДетали();
			Если ДеталиВидимы Тогда
				ДанныеДеталиДокумента = ДанныеТекущегоДокумента();
				ЗаполнитьПанельДетали(ДанныеДеталиДокумента);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#Область ПредпросмотрДокумента

&НаКлиенте
Процедура ПроверитьОбновитьДеталиПоДокументу(ОбновитьКИ)
	
	ОбновитьДетали = ВидимыДанныеДетали();
	Если ОбновитьКИ ИЛИ ОбновитьДетали Тогда
		ДанныеДеталиДокумента = ДанныеТекущегоДокумента();
		ОбновитьДанныеПравойПанели(ОбновитьКИ, ОбновитьДетали, ДанныеДеталиДокумента);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьТекущийДокумент(СсылкаНаДокумент)
	
	Если СсылкаНаДокумент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьЗначениеАсинх(СсылкаНаДокумент);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьПанельПредпросмотра()
	
	Если ПанельДеталиРазвернута Тогда
		КартинкаКоманды = БиблиотекаКартинок.СтрелкаРазвернутаяГруппа;
	Иначе
		КартинкаКоманды = БиблиотекаКартинок.СтрелкаСвернутаяГруппа;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СвернутьРазвернутьДетали", "Картинка",
			КартинкаКоманды);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаДеталиДокумента",
		"Видимость", ПанельДеталиРазвернута);
		
	ДанныеДеталиДокумента = ДанныеТекущегоДокумента();
	ЗаполнитьПанельДетали(ДанныеДеталиДокумента);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьПоложениеПанелиДетали(Форма)
	
	Элементы = Форма.Элементы;
	ДеталиВПравойПанели = Форма.ПоложениеТаблицыДетали = ПредопределенноеЗначение(
		"Перечисление.ПоложениеТаблицыДетали.ВПравойПанели");
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СодержаниеДокумента", "Видимость",
		ДеталиВПравойПанели);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаДеталиРеквизитыДокумента",
		"Видимость", Не ДеталиВПравойПанели);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаДетали", "Видимость",
		Не ДеталиВПравойПанели);
	
	ПанельДеталиРазвернута = Форма.ПанельДеталиРазвернута;
	
	Если ПанельДеталиРазвернута Тогда
		Элементы.СвернутьРазвернутьДетали.Картинка = БиблиотекаКартинок.СтрелкаРазвернутаяГруппа;
	Иначе
		Элементы.СвернутьРазвернутьДетали.Картинка = БиблиотекаКартинок.СтрелкаСвернутаяГруппа;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаДеталиДокумента", 
		"Видимость", ПанельДеталиРазвернута);
	
КонецПроцедуры

&НаКлиенте
Функция ВидимыДанныеДетали()
	
	Результат = Ложь;
	
	Если ТипЗнч(Элементы.Список.ТекущаяСтрока) = Тип("СтрокаГруппировкиДинамическогоСписка") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Элементы.Список.ТекущаяСтрока = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ДеталиВПравойПанели = ПоложениеТаблицыДетали = ПредопределенноеЗначение(
		"Перечисление.ПоложениеТаблицыДетали.ВПравойПанели");
	ТекущаяСтраницаДетали = Элементы.ПраваяПанельСтраницы.ТекущаяСтраница = Элементы.Детали;
	ПраваяПанельСвернута = Элементы.ПраваяПанельСвернутая.Видимость;

	Если ДеталиВПравойПанели И Не ПраваяПанельСвернута И ТекущаяСтраницаДетали
		ИЛИ Не ДеталиВПравойПанели И ПанельДеталиРазвернута
		ИЛИ Не ДеталиВПравойПанели И Не ПанельДеталиРазвернута И ТекущаяСтраницаДетали Тогда
			Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Заполняет структуру настроек для дополнительных полей правой панели
// Возвращаемое значение:
//  Структура:
//   * НомерКартинкиОплаты - Число
//   * ВалютаДокумента - Строка
//
&НаКлиенте
Функция ДанныеТекущегоДокумента()
	
	ДанныеСтроки = Элементы.Список.ТекущиеДанные;
	
	Если ДанныеСтроки = Неопределено Тогда 
		Возврат Неопределено;
	КонецЕсли;
	
	Результат = Новый Структура();
	Результат.Вставить("НомерКартинкиОплаты", ДанныеСтроки.НомерКартинкиОплаты);
	Результат.Вставить("ВалютаДокумента", Строка(ДанныеСтроки.ВалютаДокумента));
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьПанельДетали(СостоянияДокументов = Неопределено)
	
	ТекущийДокумент = Элементы.Список.ТекущаяСтрока;
	Если ТекущийДокумент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьЭлементыПравойПанелиДетали(СостоянияДокументов);
	
	ДеталиПодСписком = Элементы.ГруппаДетали.Видимость И ПанельДеталиРазвернута;
	ДеталиВПравойПанели = Не Элементы.ПраваяПанельСвернутая.Видимость
		И Элементы.ПраваяПанельСтраницы.ТекущаяСтраница = Элементы.Детали;
	
	Если Не (ДеталиПодСписком Или ДеталиВПравойПанели) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 100
	|	ДополнительныеРасходыРасходы.НомерСтроки КАК НомерСтроки,
	|	ДополнительныеРасходыРасходы.Номенклатура КАК Номенклатура,
	|	ДополнительныеРасходыРасходы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ДополнительныеРасходыРасходы.Цена КАК Цена,
	|	ДополнительныеРасходыРасходы.Всего КАК Всего,
	|	ДополнительныеРасходыРасходы.Содержание КАК Содержание,
	|	ДополнительныеРасходыРасходы.Количество КАК Количество
	|ИЗ
	|	Документ.ДополнительныеРасходы.Расходы КАК ДополнительныеРасходыРасходы
	|ГДЕ
	|	ДополнительныеРасходыРасходы.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(*) КАК КоличествоСтрок
	|ИЗ
	|	Документ.ДополнительныеРасходы.Расходы КАК ДополнительныеРасходыРасходы
	|ГДЕ
	|	ДополнительныеРасходыРасходы.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ТекущийДокумент);
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	ТаблицаЗапасы = МассивРезультатов[0].Выгрузить();
	НомерСтроки = 1;
	СодержаниеДокумента.Очистить();
	Для каждого СтрокаТаблицы Из ТаблицаЗапасы Цикл
		НоваяСтрокаСодержание = СодержаниеДокумента.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаСодержание, СтрокаТаблицы);
		НоваяСтрокаСодержание.НомерСтроки = НомерСтроки;
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла;
	
	ДанныеОКоличестве = МассивРезультатов[1].Выбрать();
	КоличествоСтрокВДокументе = 0;
	Если ДанныеОКоличестве.Следующий() Тогда
		КоличествоСтрокВДокументе = ДанныеОКоличестве.КоличествоСтрок;
	КонецЕсли;
	
	ВидимостьОткрытьДокумент = КоличествоСтрокВДокументе > 100;
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "НадписьОткрытьДокумент",
		"Видимость", ВидимостьОткрытьДокумент);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "НадписьПодСпискомОткрытьДокумент",
		"Видимость", ВидимостьОткрытьДокумент);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКартинкиСостоянийДокумента()
	
	КартинкиСостояний.Очистить();
	КартинкиСостояний.Добавить(0, "", , БиблиотекаКартинок.ОплаченПолностью);
	КартинкиСостояний.Добавить(1, "", , БиблиотекаКартинок.ОплаченЧастичноНеПросрочено);
	КартинкиСостояний.Добавить(2, "", , БиблиотекаКартинок.БезОплатыНеПросрочено);
	КартинкиСостояний.Добавить(3, "", , БиблиотекаКартинок.ОплаченЧастичноОжидаетсяСегодня);
	КартинкиСостояний.Добавить(4, "", , БиблиотекаКартинок.БезОплатыОжидаетсяСегодня);
	КартинкиСостояний.Добавить(5, "", , БиблиотекаКартинок.ОплаченЧастичноПросрочено);
	КартинкиСостояний.Добавить(6, "", , БиблиотекаКартинок.БезОплатыПросрочено);
	КартинкиСостояний.Добавить(7, "", , БиблиотекаКартинок.СПереплатой);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьЭлементыПравойПанелиДетали(ТекущиеДанные)
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НомерКартинкиОплаты = ТекущиеДанные.НомерКартинкиОплаты;
	КартинкаОплаты = ПолучитьКартинкуСостояния(НомерКартинкиОплаты);
	Элементы.ПроцентОплатыДетали.Картинка = КартинкаОплаты;
	
	Если УчетВалютныхОпераций Тогда
		ШаблонФорматаЧисла = "ЧДЦ=2; ЧФ='Ч %1'";
		ФорматЧисла = СтрШаблон(ШаблонФорматаЧисла, ТекущиеДанные.ВалютаДокумента);
		Элементы.СуммаОплатыОборотДетали.Формат = ФорматЧисла;
		Элементы.СуммаОплатыОборотДетали.ФорматРедактирования = ФорматЧисла;
		Элементы.СуммаДокументаДетали.Формат = ФорматЧисла;
		Элементы.СуммаДокументаДетали.ФорматРедактирования = ФорматЧисла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьКартинкуСостояния(НомерКартинки)
	
	Если НомерКартинки = -1 Тогда
		Результат = БиблиотекаКартинок.Пустая;
	Иначе
		Результат = КартинкиСостояний.НайтиПоЗначению(НомерКартинки).Картинка;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

&НаСервере
Процедура АдаптацияТакси()
	
	Интерфейс8_5 = ОбщегоНазначенияКлиентСервер.ЭтоВариантИнтерфейса85();
	ИнтерфейсТакси = Не Интерфейс8_5; 
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаГлобальныеКоманды", "Видимость",
		ИнтерфейсТакси);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ИндексФильтрыТакси", "Видимость",
		ИнтерфейсТакси);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПредставлениеПериодаТакси", "Видимость",
		ИнтерфейсТакси);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаСоздатьПоШаблону", "Видимость",
		ИнтерфейсТакси);
	
	Если ИнтерфейсТакси Тогда
		
		Элементы.Переместить(Элементы.ГруппаКомандыЭДО, КоманднаяПанель, Элементы.ГруппаФормаНастроитьФорму);
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаДетали",
			"ВертикальныйИнтервал", ИнтервалМеждуЭлементамиФормы.Авто);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаСостояниеОплаты",
			 "Группировка",ГруппировкаПодчиненныхЭлементовФормы.Вертикальная);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПроцентОплатыДетали",
			"МаксимальнаяШирина", 0);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПроцентОплатыДетали",
			"АвтоМаксимальнаяШирина", Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СуммаОплатыОборотДетали",
			"ПоложениеЗаголовка", ПоложениеЗаголовкаЭлементаФормы.Авто);

	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ИндексФильтры", "Видимость", Интерфейс8_5);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПредставлениеПериода", "Видимость",
		Интерфейс8_5);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Список", "ОтображатьКоманднуюПанель",
		Интерфейс8_5);
	
КонецПроцедуры

#Область ПанельКонтактнойИнформации

// УНФ.ПанельКонтактнойИнформации
//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ОбработатьАктивизациюСтрокиСписка()
	
	ОбновитьПанельКонтактнойИнформации();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПанельКонтактнойИнформации()
	
	ДанныеПанелиКИ = ДанныеПанелиКонтактнойИнформации(ТекущийКонтрагент);
	КонтактнаяИнформацияПанельУНФКлиент.ЗаполнитьДанныеПанелиКИ(ЭтотОбъект, ДанныеПанелиКИ);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДанныеПанелиКонтактнойИнформации(ВладелецКИ)
	
	Возврат КонтактнаяИнформацияПанельУНФ.ДанныеПанелиКонтактнойИнформации(ВладелецКИ);
	
КонецФункции

//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ДанныеПанелиКонтактнойИнформацииВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	КонтактнаяИнформацияПанельУНФКлиент.ДанныеПанелиКонтактнойИнформацииВыбор(ЭтотОбъект, Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка);
	
КонецПроцедуры

//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ДанныеПанелиКонтактнойИнформацииПриАктивизацииСтроки(Элемент)
	
	КонтактнаяИнформацияПанельУНФКлиент.ДанныеПанелиКонтактнойИнформацииПриАктивизацииСтроки(ЭтотОбъект, Элемент);
	
КонецПроцедуры

//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ДанныеПанелиКонтактнойИнформацииВыполнитьКоманду(Команда)
	
	КонтактнаяИнформацияПанельУНФКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, ТекущийКонтрагент);
	
КонецПроцедуры
// Конец УНФ.ПанельКонтактнойИнформации

#КонецОбласти

#Область ЗаполнениеСписковОтборов

&НаСервере
Процедура ЗаполнитьСписокВыбораОтборСостояниеОригинала()

	Элементы.ОтборСостояниеОригинала.СписокВыбора.Добавить(
		Справочники.СостоянияОригиналовПервичныхДокументов.ПустаяСсылка(),
		УчетОригиналовПервичныхДокументовУНФКлиентСервер.СостояниеОригиналаНеизвестно());

	Для Каждого ТекСостояние Из УчетОригиналовПервичныхДокументов.ИспользуемыеСостояния() Цикл
		Элементы.ОтборСостояниеОригинала.СписокВыбора.Добавить(ТекСостояние.Ссылка, ТекСостояние.Наименование);
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область Отборы

&НаСервере
Процедура УстановитьМеткуИОтборСписка(ИмяПоляОтбораСписка, ГруппаРодительМетки, ВыбранноеЗначение, ПредставлениеЗначения="")
	
	Если ГруппаРодительМетки = "ГруппаОтборОплата" Тогда
		ПредставлениеЗначения = РаботаСОтборами.СформироватьПредставлениеМеткиОплата(ВыбранноеЗначение);
		Если ИмяПоляОтбораСписка = "НомерКартинкиОплаты" Тогда
			ВыбранноеЗначение = РаботаСОтборами.НомерКартинкиПоСтатусуОплаты(ВыбранноеЗначение);
		КонецЕсли;
	ИначеЕсли ПредставлениеЗначения="" Тогда
		ПредставлениеЗначения=Строка(ВыбранноеЗначение);
	КонецЕсли;
	
	РаботаСОтборами.ПрикрепитьМеткуОтбора(ЭтотОбъект, ИмяПоляОтбораСписка, ГруппаРодительМетки, ВыбранноеЗначение, ПредставлениеЗначения);
	РаботаСОтборами.УстановитьОтборСписка(ЭтотОбъект, Список, ИмяПоляОтбораСписка);
	
КонецПроцедуры

//@skip-warning
&НаКлиенте
Процедура Подключаемый_МеткаОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки,
	СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	МеткаИД = Сред(Элемент.Имя, СтрДлина("Метка_") + 1);
	УдалитьМеткуОтбора(МеткаИД);
	
КонецПроцедуры

&НаСервере
Процедура УдалитьМеткуОтбора(МеткаИД)
	
	РаботаСОтборами.УдалитьМеткуОтбораСервер(ЭтотОбъект, Список, МеткаИД);

КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкиОтборов()
	
	РаботаСОтборами.СохранитьНастройкиОтборов(ЭтотОбъект);
	
	КлючОбъекта = СтрЗаменить(ИмяФормы, ".", "");
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(КлючОбъекта, 
		"ПанельДеталиРазвернута", ПанельДеталиРазвернута);
	
КонецПроцедуры

&НаКлиенте
Процедура СвернутьРазвернутьПанельОтборов()
	
	НовоеЗначениеВидимость = НЕ Элементы.ПраваяПанельСтраницы.Видимость;
	РаботаСОтборамиКлиент.СвернутьРазвернутьПанельОтборов(ЭтотОбъект, НовоеЗначениеВидимость);
	
КонецПроцедуры

&НаСервере
Функция ПараметрыОткрытияФормыСНастройкамиОтборов(ДополнительныеПараметры)
	
	Возврат РаботаСОтборами.ПараметрыДляОткрытияФормыСНастройкамиОтборов(ЭтотОбъект, ДополнительныеПараметры);
	
КонецФункции

&НаКлиенте
Процедура НастройкаОтборовЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НастройкаОтборовЗавершениеНаСервере(Результат.АдресВыбранныеОтборы, Результат.АдресУдаленныеОтборы, ДополнительныеПараметры);
	
КонецПроцедуры

&НаСервере
Процедура НастройкаОтборовЗавершениеНаСервере(АдресВыбранныеОтборы, АдресУдаленныеОтборы, ДополнительныеПараметры)
	
	Если ДополнительныеПараметры = Неопределено Тогда
		ИмяРеквизитаСписка = "Список";
		ИмяТЧДанныеМеток = "ДанныеМеток";
		ИмяТЧДанныеОтборов = "ДанныеОтборов";
	Иначе
		ИмяРеквизитаСписка = ДополнительныеПараметры.ИмяРеквизитаСписка;
		ИмяТЧДанныеМеток = ДополнительныеПараметры.ИмяТЧДанныеМеток;
		ИмяТЧДанныеОтборов = ДополнительныеПараметры.ИмяТЧДанныеОтборов;
	КонецЕсли;
	
	РаботаСОтборами.НастройкаОтборовЗавершение(ЭтотОбъект, АдресВыбранныеОтборы, АдресУдаленныеОтборы, ДополнительныеПараметры);
	
КонецПроцедуры

// @skip-warning
&НаКлиенте
Процедура Подключаемый_ОтборПриИзменении(Элемент)
	
	Подключаемый_ОтборПриИзмененииНаСервере(Элемент.Имя, Элемент.Родитель.Имя);
	
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ОтборПриИзмененииНаСервере(ЭлементИмя, ЭлементРодительИмя)
	
	РаботаСОтборами.Подключаемый_ОтборПриИзменении(ЭтотОбъект, ЭлементИмя, ЭлементРодительИмя);
	
КонецПроцедуры

// @skip-warning
&НаКлиенте
Процедура Подключаемый_ОтборОчистка(Элемент)
	
	Подключаемый_ОтборОчисткаНаСервере(Элемент.Имя, Элемент.Родитель.Имя);
	
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ОтборОчисткаНаСервере(ЭлементИмя, ЭлементРодительИмя)
	
	РаботаСОтборами.Подключаемый_ОтборОчистка(ЭтотОбъект, ЭлементИмя);

КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьОтборов()
	
	Если НЕ ПолучитьФункциональнуюОпцию("УчетПоНесколькимСкладам") Тогда
		Элементы.ОтборСклад.Видимость = Ложь;
		Элементы.ГруппаОтборСклад.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СброситьВсеМеткиОтбораНаСервере()
	РаботаСОтборами.УдалитьМеткиОтбораСервер(ЭтотОбъект, Список);
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиБиблиотек

// СтандартныеПодсистемы.ПодключаемыеКоманды
//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Элементы.Список);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Элементы.Список);
КонецПроцедуры

//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов

//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ОбновитьКомандыСостоянияОригинала()
	ОбновитьКомандыСостоянияОригинала();
КонецПроцедуры

&НаСервере
Процедура ОбновитьКомандыСостоянияОригинала()
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
КонецПроцедуры
//Конец СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов

// ЭДО

//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуЭДО(Команда)
	
	ЭлектронноеВзаимодействиеКлиент.ВыполнитьПодключаемуюКомандуЭДО(Команда, ЭтотОбъект, Элементы.Список);
	
КонецПроцедуры

//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ОбработчикОжиданияЭДО()
	
	ОбменСКонтрагентамиКлиент.ОбработчикОжиданияЭДО(ЭтотОбъект);
	
КонецПроцедуры

// Конец ЭДО

#КонецОбласти

#КонецОбласти