
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ИсключитьФизЛиц") Тогда
		ИсключитьФизЛиц = Параметры.ИсключитьФизЛиц;
	КонецЕсли;
	
	Если Параметры.Свойство("ПоказыватьНаДисплеиПокупателяQRMAX") Тогда
		ПоказыватьНаДисплеиПокупателяQRMAX = Параметры.ПоказыватьНаДисплеиПокупателяQRMAX;
	КонецЕсли;
	Если Параметры.Свойство("Организация") Тогда
		Организация = Параметры.Организация;
	КонецЕсли;
	Если Параметры.Свойство("УвеличенныйВариантМасштаба") Тогда
		УвеличенныйВариантМасштаба = Параметры.УвеличенныйВариантМасштаба;
	КонецЕсли;
	Если Параметры.Свойство("ИспользоватьПодтверждениеСтатусовПокупателяЧерезMAX") Тогда
		Элементы.АвторизоватьсяЧерезMAX.Видимость = Параметры.ИспользоватьПодтверждениеСтатусовПокупателяЧерезMAX;
	КонецЕсли;
	ТекущаяНастройкаРМКПокупатели = Параметры.ТекущаяНастройкаРМКПокупателя;
	Элементы.ФормаСоздатьПокупателя.Видимость = ТекущаяНастройкаРМКПокупатели;
	ОбщегоНазначенияРМКПереопределяемый.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокПокупателей

&НаКлиенте
Процедура СписокПокупателейВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ЗафиксироватьВыбор();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыбратьПокупателя(Команда)
	
	ЗафиксироватьВыбор();
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура АвторизоватьсяЧерезMAX(Команда)
	ОткрытьФормуПодтвержденияМесседжераMAX();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьПокупателя(Команда)
	Закрыть(Истина);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗафиксироватьВыбор()
	ТекущиеДанные = Элементы.СписокПокупателей.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Закрыть();
	Иначе
		ЗакрытьФормуВыбораКлиента(ТекущиеДанные.Покупатель);
	КонецЕсли;
КонецПроцедуры

#Область РаботаСМесседжеромMAX
&НаКлиенте
Процедура ОткрытьФормуПодтвержденияМесседжераMAX()
	Оповещение = Новый ОписаниеОповещения("ПослеПроверкиСтатусаПокупателяMAX", ЭтотОбъект);
	ПараметрыПроверки = МенеджерОборудованияКлиент.ПараметрыОткрытияФормыПолученияСтатусовВМакс();
	ПараметрыПроверки.ОтображатьQRКодНаДисплееПокупателя = ПоказыватьНаДисплеиПокупателяQRMAX;
	ПараметрыПроверки.Заголовок = СтрШаблон(НСтр("ru = 'Отканируйте QR в мессенджере MAX'"));
	ПараметрыПроверки.Вставить("Организация", Организация);
	ПараметрыПроверки.Вставить("РежимОткрытияФормы", "СканированиеКлиента");
	ПараметрыПроверки.Вставить("УвеличенныйВариантМасштаба", УвеличенныйВариантМасштаба);
	МенеджерОборудованияКлиент.ОткрытьФормуПолученияСтатусовВМакс(Оповещение, ЭтотОбъект, ПараметрыПроверки);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВыбранныеКатегории(Статусы)
	
	Если Статусы.Пенсионер Тогда
		НоваяСтрока = СписокПодтвержденихКатегорий.Добавить();
		НоваяСтрока.ЗначениеКатегории = ПредопределенноеЗначение("Перечисление.КатегорииГражданДляСкидок.Пенсионер");
	КонецЕсли;
	
	Если Статусы.Инвалид Тогда
		НоваяСтрока = СписокПодтвержденихКатегорий.Добавить();
		НоваяСтрока.ЗначениеКатегории = ПредопределенноеЗначение("Перечисление.КатегорииГражданДляСкидок.Инвалид");
	КонецЕсли;
	
	Если Статусы.Многодетный Тогда
		НоваяСтрока = СписокПодтвержденихКатегорий.Добавить();
		НоваяСтрока.ЗначениеКатегории = ПредопределенноеЗначение("Перечисление.КатегорииГражданДляСкидок.Многодетный");
	КонецЕсли;
	
	Если Статусы.Студент Тогда
		НоваяСтрока = СписокПодтвержденихКатегорий.Добавить();
		НоваяСтрока.ЗначениеКатегории = ПредопределенноеЗначение("Перечисление.КатегорииГражданДляСкидок.Студент");
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура НайтиКлиентаПоДаннымМесседжераMAX(Контрагент, НомерТелефонаМакс)
	ОбщегоНазначенияРМКПереопределяемый.НайтиКонтрагентаПоНомеруТелефона(НомерТелефонаМакс, Контрагент);
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ПослеПроверкиСтатусаПокупателяMAX(РезультатВызова, ДополнительныеПараметры) Экспорт
	
	Если РезультатВызова = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТипыРезультатаПроверки = МенеджерОборудованияКлиент.ТипРезультатаПроверкиСтатусаВМакс();
	Контрагент = Неопределено;
	Если РезультатВызова.Результат = ТипыРезультатаПроверки.СтатусПроверен Тогда
		
		Если РезультатВызова.Статусы.Взрослый И ПодтвержденныйВозрастПокупателя < 18 Тогда
			ПодтвержденныйВозрастПокупателя = 18;
		КонецЕсли;
		
		УстановитьВыбранныеКатегории(РезультатВызова.Статусы);
		НайтиКлиентаПоДаннымМесседжераMAX(Контрагент, РезультатВызова.Телефон);
		
	КонецЕсли;
	
	Если НЕ Контрагент = Неопределено Тогда
		ЗакрытьФормуВыбораКлиента(Контрагент);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФормуВыбораКлиента(Контрагент)
	РеквизитыПокупателя = Новый Структура;
	РеквизитыПокупателя.Вставить("Контрагент", Контрагент);
	МассивКатегорий = Новый Массив;
	Для Каждого СтрокаКатегории Из СписокПодтвержденихКатегорий Цикл
		МассивКатегорий.Добавить(СтрокаКатегории.ЗначениеКатегории);
	КонецЦикла;
	РеквизитыПокупателя.Вставить("СписокПодтвержденихКатегорий", МассивКатегорий);
	Закрыть(РеквизитыПокупателя);
КонецПроцедуры

#КонецОбласти