
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("АктивацияNFC",          АктивацияNFC);
	Параметры.Свойство("РежимКСО",              РежимКСО);
	Параметры.Свойство("ЗапретитьОткладывание", ЗапретитьОткладывание);
	Параметры.Свойство("РазрешитьОплатуВозвратБезПодтвержденияОтПлатежнойСистемы",
		РазрешитьОплатуВозвратБезПодтвержденияОтПлатежнойСистемы);
	Параметры.Свойство("Оплачивается",          Оплачивается);
	Параметры.Свойство("СпособОплаты",          ПлатежнаяСистема_СпособОплаты);
	
	ПлатежнаяСистема   = Параметры.ПлатежнаяСистема;
	ВидОперацииПродажа = Параметры.ВидОперацииПродажа;
	СуммаОперации      = Параметры.СуммаОперации;
	
	ВалютаПредставление = ОбщегоНазначенияРМК.ПредставлениеВалюты();
	
	ПереданныеПараметры = ИнтеграцияСПлатежнымиСистемамиРМККлиентСервер.ПараметрыИнициализации();
	ЗаполнитьЗначенияСвойств(ПереданныеПараметры, Параметры);
	
	ПечатьQRКодаДоступна = ПроверитьВозможностьПечатиQRКода(ПереданныеПараметры.ПодключаемоеОборудование);
	
	УстановитьЗаголовокФормыПоДаннымОперации(ПереданныеПараметры.НадписьЗаголовок);
	ЗапретитьОткладываниеПоДаннымОперации();
	
	Если Не Параметры.Свойство("РазрешитьОплатуВозвратБезПодтвержденияОтПлатежнойСистемы") Тогда
		РазрешитьОплатуВозвратБезПодтвержденияОтПлатежнойСистемы = 
			Пользователи.РолиДоступны("РазрешитьОплатуВозвратБезПодтвержденияОтПлатежнойСистемы");
	КонецЕсли;
	
	Если ВидОперацииПродажа Тогда
		ПереданныеПараметры.ДокументОплаты   = Параметры.Документ;
	Иначе
		ПереданныеПараметры.ДокументВозврата = Параметры.Документ;
		ПереданныеПараметры.ДокументОплаты   = Параметры.ДокументОплаты;
	КонецЕсли;
	
	ПереданныеПараметры.НомерДокумента = 1;
	
	Если Параметры.Свойство("ПлатежнаяСистема_ВидыОплат") Тогда
		НастройкиИнтеграции = Параметры.ПлатежнаяСистема_ВидыОплат.Выгрузить();
	Иначе
		НастройкиИнтеграции = ИнтеграцияСПлатежнымиСистемамиРМКСлужебный.НастройкиИнтеграции();
	КонецЕсли;
	
	Если ПлатежнаяСистема = ИнтеграцияСПлатежнымиСистемамиРМККлиентСервер.ПлатежнаяСистемаЮКасса() Тогда
		Отбор = Новый Структура(
			"ПлатежнаяСистема, Организация",
			Параметры.ПлатежнаяСистема,
			Параметры.Организация);
	ИначеЕсли ЗначениеЗаполнено(ПлатежнаяСистема_СпособОплаты) Тогда
		Отбор = Новый Структура(
			"ПлатежнаяСистема, Организация, ТорговыйОбъект, СпособОплаты",
			Параметры.ПлатежнаяСистема,
			Параметры.Организация,
			Параметры.Магазин,
			Параметры.СпособОплаты);
	Иначе
		Отбор = Новый Структура(
			"ПлатежнаяСистема, Организация, ТорговыйОбъект",
			Параметры.ПлатежнаяСистема,
			Параметры.Организация,
			Параметры.Магазин);
	КонецЕсли;
	НастройкиИнтеграции = НастройкиИнтеграции.Скопировать(Отбор);
	
	Если НастройкиИнтеграции <> Неопределено Тогда
		
		Если Оплачивается Тогда
			
			Если Не ВидОперацииПродажа Тогда
				ТекстОшибки = НСтр("ru = 'Документ возврата не может оплачиваться.'");
				Возврат;
			Иначе
				ОтложенныйДокумент = ПереданныеПараметры.ДокументОплаты;
			КонецЕсли;
			
			НастройкиИнтеграцииДокумента = ИнтеграцияСПлатежнымиСистемамиРМКВызовСервера.ПолучитьНастройкиИнтеграцииОтложенногоДокумента(
				ОтложенныйДокумент, ПлатежнаяСистема);
			
			Если НастройкиИнтеграцииДокумента.Количество() > 0 Тогда
				Отбор = Новый Структура("Интеграция", НастройкиИнтеграцииДокумента[0]);
				НастройкиИнтеграции = НастройкиИнтеграции.Скопировать(Отбор);
			Иначе
				ТекстОшибки = НСтр("ru = 'Не удалось определить настройки оплачиваемого документа.
										|Возможно оплачиваемый документ был отложен другим видом оплаты.'");
				Возврат;
			КонецЕсли;
			
		Иначе
			
			Если Не ВидОперацииПродажа Тогда
				
				Если ПлатежнаяСистема = ИнтеграцияСПлатежнымиСистемамиРМККлиентСервер.ПлатежнаяСистемаЮКасса() Тогда
					ТекстОшибки = НСтр("ru = 'Возврат платежной системой ЮKassa запрещен.'");
					Возврат;
				КонецЕсли;
				
				ПараметрыВозврата = ИнтеграцияСПлатежнымиСистемамиРМКВызовСервера.ПолучитьПараметрыДокументаОплаты(
					ПереданныеПараметры.ДокументОплаты);
				
				Если ЗначениеЗаполнено(ПараметрыВозврата.ВидОплатыВозврата) Тогда
					
					Отбор = Новый Структура("СпособОплаты, ИдентификаторПС",
						ПараметрыВозврата.СпособОплаты, ПараметрыВозврата.ИдентификаторПС);
					НастройкиИнтеграции = НастройкиИнтеграции.Скопировать(Отбор);
					
					Если НастройкиИнтеграции.Количество() > 0 Тогда
						ПлатежнаяСистемаОплаты = НастройкиИнтеграции[0].ПлатежнаяСистема;
						Если ПлатежнаяСистемаОплаты <> ПлатежнаяСистема Тогда
							ШаблонОшибки = НСтр("ru = 'Документ был оплачен платежной системой %1.
													|Возврат %2 недоступен.'");
							ТекстОшибки = СтрШаблон(ШаблонОшибки, ПлатежнаяСистемаОплаты, ПлатежнаяСистема);
							Возврат;
						КонецЕсли;
					КонецЕсли;
					
					ПлатежнаяСистема_ИдентификаторОплаты = ПараметрыВозврата.ИдентификаторОплаты;
					ПлатежнаяСистема_ИдентификаторПС     = ПараметрыВозврата.ИдентификаторПС;
					
					ЗаполнитьЗначенияСвойств(ПереданныеПараметры, ПараметрыВозврата);
					
				КонецЕсли;
				
				ЮридическоеЛицо = Ложь;
				ИнтеграцияСПлатежнымиСистемамиРМКПереопределяемый.КонтрагентДокументаЮридическоеЛицо(
					ЮридическоеЛицо, ПереданныеПараметры.ДокументВозврата);
				Если ЮридическоеЛицо Тогда
					ТекстОшибки = НСтр("ru='Возврат платежными системами для юридических лиц не поддерживается.'");
					Возврат;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если НастройкиИнтеграции.Количество() = 0 Тогда
		ТекстОшибки = ТекстОшибки = НСтр("ru = 'Не удалось определить настройки интеграции с платежной системой.'");
		Возврат;
	КонецЕсли;
	
	ПлатежнаяСистема_ВидыОплат.Загрузить(НастройкиИнтеграции);
	
	Если РежимКСО Тогда
		Если ПлатежнаяСистема_ВидыОплат.Количество() <> 1 Тогда
			ТекстОшибки = НСтр("ru = 'Не определен идентификатор оплаты платежной системы в режиме КСО.'");
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если ВидОперацииПродажа Тогда
		
		ШаблонДекорации = НСтр("ru = 'Сумма оплаты: %1 %2'");
		Элементы.ДекорацияСуммаЧека.Заголовок = СтрШаблон(
			ШаблонДекорации,
			Формат(СуммаОперации, "ЧДЦ=2; ЧН=0,00"),
			ВалютаПредставление);
			
	Иначе
		
		ШаблонДекорации = НСтр("ru = 'Сумма к возврату: %1 %2'");
		Элементы.ДекорацияСуммаКВозврату.Заголовок = СтрШаблон(
			ШаблонДекорации,
			Формат(СуммаОперации, "ЧДЦ=2; ЧН=0,00"),
			ВалютаПредставление);
		
		Для Каждого СтрокаВидОплаты Из ПлатежнаяСистема_ВидыОплат Цикл
			Элементы.ПлатежнаяСистема_ИдентификаторПС.СписокВыбора.Добавить(СтрокаВидОплаты.ИдентификаторПС, СтрокаВидОплаты.Представление);
		КонецЦикла;
		
	КонецЕсли;
	
	Если ПлатежнаяСистема_ВидыОплат.Количество() = 1 Тогда
		
		ПлатежнаяСистема_ВидОплаты       = ПлатежнаяСистема_ВидыОплат[0].ВидОплаты;
		ПлатежнаяСистема_ИдентификаторПС = ПлатежнаяСистема_ВидыОплат[0].ИдентификаторПС;
		ПлатежнаяСистема_СпособОплаты    = ПлатежнаяСистема_ВидыОплат[0].СпособОплаты;
		
		ПереданныеПараметры.Вставить("ВидОплатыПлатежнойСистемы",    ПлатежнаяСистема_ВидОплаты);
		ПереданныеПараметры.Вставить("ИдентификаторПС",              ПлатежнаяСистема_ИдентификаторПС);
		
	КонецЕсли;
	
	ОбщегоНазначенияРМКПереопределяемый.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ИнтеграцияСПлатежнымиСистемамиРМККлиент.ИнициализироватьПараметры(
		ЭтотОбъект,
		ПереданныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	ТекущийСлой = ИнтерфейсРМКСлужебныйКлиентСервер.ПолучитьТекущийСлойГруппы(
		Элементы.ГруппаСлоевПанелиДействийПлатежнойСистемы);
	
	ОткрытоБлокирующееОкно = Элементы.ГруппаВопросПредупреждение.Видимость
		Или Элементы.ГруппаВопросОтложитьЧек.Видимость
		Или Элементы.ГруппаПодтверждениеОплатыВозврата.Видимость;
	
	Если ИнтеграцияСПлатежнымиСистемамиРМККлиентСервер.ТекущаяСтраница(Элементы.ГруппаОшибка, ТекущийСлой) Тогда
		ПлатежнаяСистема_СанкционированноеЗакрытие = Истина;
	ИначеЕсли (ИнтеграцияСПлатежнымиСистемамиРМККлиентСервер.ТекущаяСтраница(Элементы.ГруппаЗавершение, ТекущийСлой)
		Или ОткрытоБлокирующееОкно) И Не ПлатежнаяСистема_СанкционированноеЗакрытие Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ИнтеграцияСПлатежнымиСистемамиРМККлиент.ОбработкаПрерыванияОперацииПлатежнойСистемы(ЭтотОбъект, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если Источник = "ПодключаемоеОборудование" И ВводДоступен() Тогда
		
		Если ИмяСобытия = "Штрихкод" Или ИмяСобытия = "ПолученШтрихкод" Или ИмяСобытия = "ScanData" Тогда
			
			Штрихкод = ?(Параметр[1] = Неопределено, Параметр[0], Параметр[1][1]);
			
			Если ИнтерфейсРМКСлужебныйКлиентСервер.ПолучитьТекущийСлойГруппы(
				Элементы.ГруппаСлоевПанелиДействийПлатежнойСистемы) = Элементы.ГруппаОсновнаяСтраница
				И Элементы.ГруппаВозврат.Видимость
				И Элементы.ИдентификаторОплаты.Видимость Тогда
				
				ПлатежнаяСистема_ИдентификаторОплаты = Штрихкод;
				ИдентификаторОплатыПриИзменении(Элементы.ИдентификаторОплаты);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПлатежнаяСистемаАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	ДанныеВыбора = Новый СписокЗначений;
	
	ИнтеграцияСПлатежнымиСистемамиРМКВызовСервера.ПодобратьПлатежнуюСистему(ДанныеВыбора, Текст);
	
	Если ДанныеВыбора.Количество() > 0 Тогда
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИдентификаторОплатыПриИзменении(Элемент)
	
	ПлатежнаяСистема_НоваяЗаявка.ИдентификаторОплаты = ПлатежнаяСистема_ИдентификаторОплаты;
	Элементы.ФормаВозвратПлатежа.Доступность = ЗначениеЗаполнено(ПлатежнаяСистема_НоваяЗаявка.ИдентификаторОплаты);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаСоздатьQRКод(Команда)
	
	Если ВидОперацииПродажа Тогда
		
		ТекущаяСтрока = Элементы.ВидыОплатПС.ТекущаяСтрока;
		
		Если ТекущаяСтрока = Неопределено Тогда
			
			ПоказатьПредупреждение(, НСтр("ru = 'Не выбран способ оплаты'"));
			Возврат;
			
		КонецЕсли;
		
		ПлатежнаяСистема_ВидОплаты       = ПлатежнаяСистема_ВидыОплат.НайтиПоИдентификатору(ТекущаяСтрока).ВидОплаты;
		ПлатежнаяСистема_ИдентификаторПС = ПлатежнаяСистема_ВидыОплат.НайтиПоИдентификатору(ТекущаяСтрока).ИдентификаторПС;
		ПлатежнаяСистема_СпособОплаты    = ПлатежнаяСистема_ВидыОплат.НайтиПоИдентификатору(ТекущаяСтрока).СпособОплаты;
		
		ПлатежнаяСистема_НоваяЗаявка.Вставить("ВидОплатыПлатежнойСистемы",    ПлатежнаяСистема_ВидОплаты);
		ПлатежнаяСистема_НоваяЗаявка.Вставить("ИдентификаторПС",              ПлатежнаяСистема_ИдентификаторПС);
		
		ИнтеграцияСПлатежнымиСистемамиРМККлиент.НастроитьФормуПоВидуОплаты(ЭтотОбъект);
		ИнтеграцияСПлатежнымиСистемамиРМККлиент.ЗапуститьФоновыеЗадания(ЭтотОбъект);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаВозвратПлатежа(Команда)
	
	Если ЗначениеЗаполнено(ПлатежнаяСистема_ИдентификаторОплаты) Тогда
		
		ИнтеграцияСПлатежнымиСистемамиРМККлиент.ВозвратОплаты(
			ЭтотОбъект,
			Новый Структура("ОповещениеЗавершитьОперацию", ОповещениеПриЗавершенииОперации()));
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПодтвердитьОплату(Команда)
	
	ОтобразитьОкноРучногоПодтвержденияОплатыВозврата();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПодтвердитьВозврат(Команда)
	
	ОтобразитьОкноРучногоПодтвержденияОплатыВозврата();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПовторить(Команда)
	
	Если ВидОперацииПродажа Тогда
		Если Оплачивается Тогда
			ПараметрыСтраницы = Новый Структура("ТекстДлительнойОперации",
				НСтр("ru = 'Получение подтверждения оплаты. Пожалуйста, подождите...'"));
			ИнтеграцияСПлатежнымиСистемамиРМККлиент.ПерейтиНаСтраницу(ЭтотОбъект, "ГруппаДлительнаяОперация", ПараметрыСтраницы);
		Иначе
			ИнтеграцияСПлатежнымиСистемамиРМККлиент.ПерейтиНаСтраницу(ЭтотОбъект, "ГруппаQRКод");
		КонецЕсли;
		ПодключитьОбработчикОжидания("ОпределитьСтатусОплаты", 0.1, Истина);
	Иначе
		ПараметрыСтраницы = Новый Структура("ТекстДлительнойОперации",
			НСтр("ru = 'Получение подтверждения возврата оплаты. Пожалуйста, подождите...'"));
		ИнтеграцияСПлатежнымиСистемамиРМККлиент.ПерейтиНаСтраницу(ЭтотОбъект, "ГруппаДлительнаяОперация", ПараметрыСтраницы);
		ПодключитьОбработчикОжидания("ОпределитьСтатусВозврата", 0.1, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтложить(Команда)
	
	ИнтеграцияСПлатежнымиСистемамиРМККлиент.ОтложитьЧек(
		ЭтотОбъект,
		ОповещениеПриЗавершенииОперации());
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтменитьОплату(Команда)
	
	ПрерватьОперациюСОтменой();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗакрытьОплату(Команда)
	
	ПлатежнаяСистема_СанкционированноеЗакрытие = Истина;
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗакрытьПринудительно(Команда)
	
	ПрерватьОперациюСОтменой();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтложитьПринудительно(Команда)
	
	ИнтерфейсРМКСлужебныйКлиентСервер.УстановитьТекущийСлойГруппы(Элементы.ГруппаПанельДействий);
	ИнтеграцияСПлатежнымиСистемамиРМККлиент.ОтложитьОперацию(
		ЭтотОбъект,
		ОповещениеПриЗавершенииОперации());
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПодтвердитьОплатуВозвратПринудительно(Команда)
	
	Если РазрешитьОплатуВозвратБезПодтвержденияОтПлатежнойСистемы Тогда
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("Форма",                       ЭтотОбъект);
		ДополнительныеПараметры.Вставить("ОповещениеЗавершитьОперацию", ОповещениеПриЗавершенииОперации());
		
		Если ВидОперацииПродажа Тогда
			ИнтеграцияСПлатежнымиСистемамиРМККлиент.ПодтвердитьОплату(
				ЭтотОбъект,
				ДополнительныеПараметры);
		Иначе
			ИнтеграцияСПлатежнымиСистемамиРМККлиент.ПодтвердитьВозврат(
				ЭтотОбъект,
				ДополнительныеПараметры);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПречек(Команда)
	
	ИнтеграцияСПлатежнымиСистемамиРМККлиент.ПечатьПречека(
		ЭтотОбъект, Истина, ПлатежнаяСистема_НоваяЗаявка.ПодключаемоеОборудование);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаИнструкция(Команда)
	
	Если ИнтерфейсРМКСлужебныйКлиентСервер.ПолучитьТекущийСлойГруппы(
		Элементы.ГруппаСлоевПанелиДействийПлатежнойСистемы) <> Элементы.ГруппаИнструкция Тогда
		ИнтеграцияСПлатежнымиСистемамиРМККлиент.ПерейтиНаСтраницу(ЭтотОбъект, "ГруппаИнструкция");
	Иначе
		ИнтеграцияСПлатежнымиСистемамиРМККлиент.ПерейтиНаСтраницу(ЭтотОбъект, ТекущийСлойГруппы);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаВернутьсяКОплате(Команда)
	
	ИнтерфейсРМКСлужебныйКлиентСервер.УстановитьТекущийСлойГруппы(Элементы.ГруппаПанельДействий);
	ИнтеграцияСПлатежнымиСистемамиРМККлиентСервер.НастроитьФормуПоИнтеграции(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ФоновыеОбработчики

&НаКлиенте
Процедура ПолучитьИдентификаторОплаты()
	
	ПечатьQRКода = Не РежимКСО И Не ИспользоватьКассовуюСсылку;
	ИнтеграцияСПлатежнымиСистемамиРМККлиент.ПолучитьИдентификаторОплаты(
		ЭтотОбъект,
		ПечатьQRКода);
	
КонецПроцедуры

&НаКлиенте
Процедура ОпределитьСтатусОплаты()
	
	КоличествоПовторов = ?(Оплачивается, 1, 3);
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ОповещениеЗавершитьОперацию", ОповещениеПриЗавершенииОперации());
	ДополнительныеПараметры.Вставить("КоличествоПовторов",          КоличествоПовторов);
	
	ИнтеграцияСПлатежнымиСистемамиРМККлиент.ОпределитьСтатусОплаты(
		ЭтотОбъект,
		ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ОпределитьСтатусВозврата()
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ОповещениеЗавершитьОперацию", ОповещениеПриЗавершенииОперации());
	
	ИнтеграцияСПлатежнымиСистемамиРМККлиент.ОпределитьСтатусВозврата(
		ЭтотОбъект,
		ДополнительныеПараметры);
	
КонецПроцедуры

#КонецОбласти

&НаСервереБезКонтекста
Функция ПроверитьВозможностьПечатиQRКода(Знач ПодключаемоеОборудование)
	
	Результат = Ложь;
	
	Если ЗначениеЗаполнено(ПодключаемоеОборудование)
		И Не ОбщегоНазначенияРМК.ПодключаемоеОборудованиеОблачнаяККТ(ПодключаемоеОборудование) Тогда
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура УстановитьЗаголовокФормыПоДаннымОперации(НадписьЗаголовок)
	
	Если Не ПустаяСтрока(НадписьЗаголовок) Тогда
		ЗаголовокФормы = НадписьЗаголовок;
	Иначе
		Если ПлатежнаяСистема = ИнтеграцияСПлатежнымиСистемамиРМККлиентСервер.ПлатежнаяСистемаСБП() Тогда
			ЗаголовокПлатежнойСистемы = НСтр("ru = 'СБП'");
		ИначеЕсли ПлатежнаяСистема = ИнтеграцияСПлатежнымиСистемамиРМККлиентСервер.ПлатежнаяСистемаЮКасса() Тогда
			ЗаголовокПлатежнойСистемы = НСтр("ru = 'ЮKassa'");
		ИначеЕсли ПлатежнаяСистема = ИнтеграцияСПлатежнымиСистемамиРМККлиентСервер.ПлатежнаяСистемаОзонПэй() Тогда
			ЗаголовокПлатежнойСистемы = НСтр("ru = 'Ozon Pay'");
		ИначеЕсли ПлатежнаяСистема = ИнтеграцияСПлатежнымиСистемамиРМККлиентСервер.ПлатежнаяСистемаЯндексПэй() Тогда
			ЗаголовокПлатежнойСистемы = НСтр("ru = 'Яндекс Пэй'");
		Иначе
			ЗаголовокПлатежнойСистемы = НСтр("ru = 'платежной системой'");
		КонецЕсли;
		ЗаголовокФормы = ?(ВидОперацииПродажа,
			СтрШаблон(НСтр("ru = 'Оплата %1'")),
			СтрШаблон(НСтр("ru = 'Возврат оплаты %1'"))) + ЗаголовокПлатежнойСистемы;
	КонецЕсли;
	
	ЭтотОбъект.Заголовок = ЗаголовокФормы;
	
КонецПроцедуры

&НаКлиенте
Функция ОповещениеПриЗавершенииОперации()
	
	Возврат Новый ОписаниеОповещения(
		"ЗавершитьОплатуВозвратПлатежнойСистемой",
		ЭтотОбъект);
	
КонецФункции

&НаСервере
Процедура ЗапретитьОткладываниеПоДаннымОперации()
	
	Если ПлатежнаяСистема = ИнтеграцияСПлатежнымиСистемамиРМККлиентСервер.ПлатежнаяСистемаЮКасса()
		Или Не ВидОперацииПродажа
		Или РежимКСО Тогда
		ЗапретитьОткладывание = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьОплатуВозвратПлатежнойСистемой(Действие, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если Действие = ИнтеграцияСПлатежнымиСистемамиРМККлиентСервер.ДействиеОтложитьОплату() Тогда
		
		ПодключитьОбработчикОжидания("ОтложитьОплачиваемыйЧекПлатежнойСистемой", 2, 1);
		
	ИначеЕсли Действие = ИнтеграцияСПлатежнымиСистемамиРМККлиентСервер.ДействиеОтменитьОплату() Тогда
		
		ПодключитьОбработчикОжидания("ОтменитьОплатуПлатежнойСистемой", 2, 1);
		
	ИначеЕсли Действие = ИнтеграцияСПлатежнымиСистемамиРМККлиентСервер.ДействиеЗавершитьОплату() Тогда
		
		ПодключитьОбработчикОжидания("ЗавершитьОплатуПлатежнойСистемой", 2, 1);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьОплатуПлатежнойСистемой()
	
	ПлатежнаяСистема_СанкционированноеЗакрытие = Истина;
	
	Если ВидОперацииПродажа Тогда
		Документ = ПлатежнаяСистема_НоваяЗаявка.ДокументОплаты;
	Иначе
		Документ = ПлатежнаяСистема_НоваяЗаявка.ДокументВозврата;
	КонецЕсли;
	
	Если ПлатежнаяСистема_НоваяЗаявка.БылоПодтверждениеПлатежнойСистемы Тогда
		
		ИдентификаторОплаты = ИнтеграцияСПлатежнымиСистемамиРМКВызовСервера.ПолучитьИдентификаторОплатыДокументаОперации(
			ПлатежнаяСистема_НоваяЗаявка.Интеграция,
			Документ);
		
		ИдентификаторОплаты = ?(Не ПустаяСтрока(ИдентификаторОплаты),
			ИдентификаторОплаты, ПлатежнаяСистема_НоваяЗаявка.СсылочныйНомер);
		
	Иначе
		ИдентификаторОплаты = "";
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("Действие",                      ИнтеграцияСПлатежнымиСистемамиРМККлиентСервер.ДействиеЗавершитьОплату());
	Результат.Вставить("ВидОплаты",                     ПлатежнаяСистема_ВидОплаты);
	Результат.Вставить("ИдентификаторОплаты",           ИдентификаторОплаты);
	Результат.Вставить("ИдентификаторПлатежнойСистемы", ПлатежнаяСистема_ИдентификаторПС);
	Результат.Вставить("СпособОплаты",                  ПлатежнаяСистема_СпособОплаты);
	Результат.Вставить("Сумма",                         СуммаОперации);
	Результат.Вставить("Документ",                      Документ);
	
	Закрыть(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьОплатуПлатежнойСистемой()
	
	ПлатежнаяСистема_СанкционированноеЗакрытие = Истина;
	
	Результат = Новый Структура;
	Результат.Вставить("Действие",  ИнтеграцияСПлатежнымиСистемамиРМККлиентСервер.ДействиеОтменитьОплату());
	Результат.Вставить("ВидОплаты", ПлатежнаяСистема_ВидОплаты);
	Закрыть(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтложитьОплачиваемыйЧекПлатежнойСистемой()
	
	ПлатежнаяСистема_СанкционированноеЗакрытие = Истина;
	
	Результат = Новый Структура;
	Результат.Вставить("Действие",      ИнтеграцияСПлатежнымиСистемамиРМККлиентСервер.ДействиеОтложитьОплату());
	Результат.Вставить("ОтложенныйЧек", ПлатежнаяСистема_НоваяЗаявка.ДокументОплаты);
	Результат.Вставить("ВидОплаты",     ПлатежнаяСистема_ВидОплаты);
	
	Закрыть(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура ПрерватьОперациюСОтменой()
	
	ПлатежнаяСистема_СанкционированноеЗакрытие = Истина;
	
	ПараметрыСтраницы = Новый Структура("ТекстДлительнойОперации",
		НСтр("ru = 'Отмена операции. Пожалуйста, подождите...'"));
	ИнтеграцияСПлатежнымиСистемамиРМККлиент.ПерейтиНаСтраницу(ЭтотОбъект, "ГруппаДлительнаяОперация", ПараметрыСтраницы);
	
	ИнтеграцияСПлатежнымиСистемамиРМККлиент.ОтменитьОперацию(
		ЭтотОбъект,
		ОповещениеПриЗавершенииОперации());
	
КонецПроцедуры

&НаКлиенте
Процедура ОтобразитьОкноРучногоПодтвержденияОплатыВозврата()
	
	Если ВидОперацииПродажа Тогда
		ОперацияШаблона = НСтр("ru = 'оплаты'");
	Иначе
		ОперацияШаблона = НСтр("ru = 'возврата'");
	КонецЕсли;
	
	ШаблонЗаголовка = НСтр("ru = 'Проверьте выполнение операции %1 в платежной системе.'");
	ЗаголовокИнформации = СтрШаблон(ШаблонЗаголовка, ОперацияШаблона);
	
	ШаблонПояснения = НСтр("ru = 'Операция %1 в платежной системе не выполнена!
									|Подтвердить операцию %1 принудительно?
									|
									|Сумма операции: %2 %3
									|
									|'");
	ТекстИнформации = СтрШаблон(ШаблонПояснения,
		ОперацияШаблона,
		СуммаОперации,
		ВалютаПредставление);
	
	ИнтеграцияСПлатежнымиСистемамиРМККлиент.ВывестиИнформацию(
		ЭтотОбъект,
		ЗаголовокИнформации,
		ТекстИнформации,
		"ГруппаПодтверждениеОплатыВозврата");
	
КонецПроцедуры

#КонецОбласти
