///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2026, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

///////////////////////////////////////////////////////////////////////////////////////////////////////
// Подсистема "ИнтернетПоддержкаПользователей.ПлатежныеСистемы.ЯндексПэй".
// ОбщийМодуль.ЯндексПэйСобытия.
//
// Серверные процедуры обработки событий платежной системы Яндекс Пэй:
//  - обработка событий настройки подключения;
//  - обработка события подготовки запроса токена;
//  - обработка события определения доступных команд в общем списке настроек.
//
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

// Определяет видимость подсистемы в общем списке настроек подключения к платежным системам, доступность изменения
// настроек и видимость кассовых ссылок.
// 
// Параметры:
//  ВидимостьПодсистемы - Булево - признак видимости подсистемы в списке. Не рекомендуется изменять данный параметр,
//    поскольку форма может открываться в режиме видимости только одной подсистемы.
//  ДоступностьНастроек - Булево - признак доступности для пользователя возможности изменения настроек подключения.
//  ВидимостьКассовыхСсылок - Булево - признак использования функциональности добавления кассовых ссылок в мастере
//    настройки подключения.
Процедура ПриПодготовкеПараметровФормыСпискаНастроек(
		ВидимостьПодсистемы,
		ДоступностьНастроек,
		ВидимостьКассовыхСсылок) Экспорт
	
	Если ВидимостьПодсистемы Тогда
		ДоступностьНастроек = ПлатежныеСистемы.НастройкаПодключенияДоступна();
		НастройкиЯндексПэй = ПлатежныеСистемыСлужебный.НастройкиПодключения(
			Перечисления.ПлатежныеСервисы.ЯндексПэй);
		ВидимостьКассовыхСсылок = НастройкиЯндексПэй.ИспользоватьНастройкуКассовыхСсылок;
	КонецЕсли;
	
КонецПроцедуры

// Вызывается при заполнении описания платежных систем.
// 
// Параметры:
//   ПлатежныеСистемы - см. НастройкиПлатежныхСистемПовтИсп.ОписаниеПлатежныхСервисов
//   
Процедура ПриДобавленииОписанияПлатежныхСервисов(ПлатежныеСистемы) Экспорт

	Описание = НастройкиПлатежныхСистемСлужебный.НовыйОписаниеПлатежнойСистемы(
		ПредопределенноеЗначение("Перечисление.ПлатежныеСервисы.ЯндексПэй"),
		"ИнтернетПоддержкаПользователей.ПлатежныеСистемы.ЯндексПэй",
		НСтр("ru = 'Яндекс Пэй'"),
		"ЛоготипЯндексПэйМонохромный",
		7);

	Описание.ЗаголовокСписка = НСтр("ru = 'Настройки подключения к Яндекс Пэй'");
	Описание.ЗаголовокПодключения = НСтр("ru = 'Подключение к Яндекс Пэй'");
	Описание.Логотип = "ЛоготипЯндексПэй";
	Описание.ИспользуетНазначениеПлатежа = Истина;
	
	// Значения по умолчанию, если не получится загрузить значения из сервиса
	ОписаниеПоУмолчанию = ЯндексПэйСлужебный.ОписаниеПоУмолчанию();
	ЗаполнитьЗначенияСвойств(Описание, ОписаниеПоУмолчанию);
	
	ПлатежныеСистемы.Вставить(
		НастройкиПлатежныхСистемКлиентСервер.ИмяПодсистемыЯндексПэй(),
		Описание);
	
КонецПроцедуры

// см. ПлатежныеСистемыСобытия.ПриПодготовкеЗапроса_tokens_request
// 
Процедура ПриПодготовкеЗапроса_tokens_request(ПараметрыАутентификации, ЗаписьДанныхСообщения) Экспорт
	
	Если ПараметрыАутентификации.ДанныеАутентификации = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗаписьДанныхСообщения.ЗаписатьИмяСвойства("userToken");
	ЗаписьДанныхСообщения.ЗаписатьЗначение(ПараметрыАутентификации.ДанныеАутентификации.Токен);
	
КонецПроцедуры

// Определяет список команд на общей форме настроек подключения к платежным системам, которые должны быть доступны
//  для строк, относящихся к подсистеме Яндекс Пэй.
//  В параметр ДоступныеКоманды могут быть добавлены любые имена команд, даже если их нет на форме.
// 
// Параметры:
//  КешПараметров - Структура - см. описание метода НастройкиПлатежныхСистемСобытия.ПриПодготовкеПараметровФормы
//  ВсеКоманды - Соответствие Из КлючИЗначение - описание кнопок формы:
//    * Ключ - Строка - имя элемента формы, с которым связана команда.
//    * Значение - Строка - имя команды.
//  ДоступныеКоманды - Массив Из Строка - имена команд, доступных для подсистемы Интернет-эквайринга.
//
Процедура ПриОпределенииДоступностиКомандСпискаНастроек(
		КешПараметров,
		ВсеКоманды,
		ДоступныеКоманды) Экспорт

	ИмяПодсистемы = НастройкиПлатежныхСистемКлиентСервер.ИмяПодсистемыЯндексПэй();

	Если КешПараметров.ДоступностьНастроек.Получить(ИмяПодсистемы) Тогда
		ДоступныеКоманды.Добавить("ОткрытьШаблоныНазначения");
	КонецЕсли;
	Если КешПараметров.ДоступностьКассовыхСсылок.Получить(ИмяПодсистемы) Тогда
		ДоступныеКоманды.Добавить("ОткрытьКассовыеСсылки");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
