////////////////////////////////////////////////////////////////////////////////
// ЕдиныйНалоговыйСчетИнтеграцияВызовСервераУНФ:
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

Функция ПараметрыФормыПлатежногоДокумента(Организация, ПериодРегистрации, СуммаДокумента) Экспорт
	
	ВидНалога = Перечисления.ВидыНалогов.ЕдиныйНалоговыйПлатеж;
	Налог     = Справочники.ВидыНалогов.НалогПоВиду(ВидНалога, Истина);
	ЭтоЕНП    = Налог = Справочники.ВидыНалогов.ЕдиныйНалоговыйПлатеж;
	
	Если ЭтоЕНП И ПлатежиВБюджетКлиентСервер.ДействуетПриказ58н(ПериодРегистрации) Тогда
		КПППлательщика = ПлатежиВБюджетКлиентСервер.НезаполненноеЗначение();
	Иначе
		КПППлательщика = Справочники.Организации.КППНаДату(Организация, ПериодРегистрации);
	КонецЕсли;
	
	ОписаниеПлатежа = Новый Структура;
	ОписаниеПлатежа.Вставить("Дата", ПериодРегистрации);
	ОписаниеПлатежа.Вставить("ПериодРегистрации", ПериодРегистрации);
	ОписаниеПлатежа.Вставить("ВидОперации", Перечисления.ВидыОперацийПлатежноеПоручение.ПеречислениеНалога);	
	ОписаниеПлатежа.Вставить("Налог", Налог);
	ОписаниеПлатежа.Вставить("ВидПеречисленияВБюджет", Перечисления.ВидыПеречисленийВБюджет.НалоговыйПлатеж);
	ОписаниеПлатежа.Вставить("Организация", Организация);
	ОписаниеПлатежа.Вставить("ИННПлательщика", Общегоназначения.ЗначениеРеквизитаОбъекта(Организация,"ИНН"));	
	ОписаниеПлатежа.Вставить("КПППлательщика", КПППлательщика);
	ОписаниеПлатежа.Вставить("СуммаДокумента", СуммаДокумента);
	ОписаниеПлатежа.Вставить("БанковскийСчет", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Организация, "БанковскийСчетПоУмолчанию"));
	ОписаниеПлатежа.Вставить("ВалютаДокумента", Константы.НациональнаяВалюта.Получить());
	ОписаниеПлатежа.Вставить("НазначениеПлатежа", Справочники.ВидыНалогов.НазначениеПлатежа(Налог));
	ОписаниеПлатежа.Вставить("СтатусСоставителя", "01");
	ОписаниеПлатежа.Вставить("КодОКАТО", ЕдиныйНалоговыйСчет.ОКТМОЕдиногоНалоговогоСчета());	
	ОписаниеПлатежа.Вставить("ПоказательНомера", ПлатежиВБюджетКлиентСервер.НезаполненноеЗначение());
	ОписаниеПлатежа.Вставить("ПоказательПериода", ПлатежиВБюджетКлиентСервер.НезаполненноеЗначение());
	ОписаниеПлатежа.Вставить("ИдентификаторПлатежа", ПлатежиВБюджетКлиентСервер.НезаполненноеЗначение());
	ОписаниеПлатежа.Вставить("КодБК", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Налог, "КодБК"));
	ОписаниеПлатежа.Вставить("ОчередностьПлатежа", 5);
	ОписаниеПлатежа.Вставить("ПоказательТипа", ПлатежиВБюджетКлиентСервер.НезаполненноеЗначение());
	ОписаниеПлатежа.Вставить("ПоказательОснования", ПлатежиВБюджетКлиентСервер.НезаполненноеЗначение());
	ОписаниеПлатежа.Вставить("Контрагент", Справочники.Контрагенты.ПустаяСсылка());	
	ОписаниеПлатежа.Вставить("ИННПолучателя", "");
	ОписаниеПлатежа.Вставить("КПППолучателя", "");
	ОписаниеПлатежа.Вставить("СчетКонтрагента", Справочники.БанковскиеСчета.ПустаяСсылка());
	ОписаниеПлатежа.Вставить("ТекстПолучателя", "");
	
	Документы.ПлатежноеПоручение.ЗаполнитьРеквизитыЕНП(ОписаниеПлатежа);	
	
	ПараметрыФормыПлатежногоДокумента = Новый Структура();
	ПараметрыФормыПлатежногоДокумента.Вставить("ЗначенияЗаполнения", ОписаниеПлатежа);
	
	Возврат ПараметрыФормыПлатежногоДокумента;
	
КонецФункции

#КонецОбласти