#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если ТипЗнч(Параметры.ОбъектыПечати) <> Тип("Массив") Или Параметры.ОбъектыПечати.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	СкрыватьФорму = Параметры.СкрыватьФорму;	
	ДействиеСФайлом = "СохранитьЛокально";
	ОбъектПечати = Параметры.ОбъектыПечати[0];

	ДанныеФайла = ШаблоныПечатиОфисныхДокументов.СФормироватьДокумент(ОбъектПечати, Параметры.ШаблонПечати,
		УникальныйИдентификатор);

	Если ДанныеФайла = Неопределено Тогда
		СообщенияПользователю = ПолучитьСообщенияПользователю(Ложь);
		Отказ = Истина;
		Возврат;
	Иначе
		СообщенияПользователю = ПолучитьСообщенияПользователю(Истина);
	КонецЕсли;

	Если СкрыватьФорму Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ДекорацияИмяФайла.Заголовок = ДанныеФайла.ИмяФайла;

	Элементы.ФорматФайлаDOCX.Видимость = ДанныеФайла.Расширение = "docx";
	Элементы.ФорматФайлаODT.Видимость = ДанныеФайла.Расширение = "odt";

	ИспользоватьПрисоединенныеФайлы = ПолучитьФункциональнуюОпцию("ИспользоватьПрисоединенныеФайлы");
	ЗаполнитьДействияСФайлом(ИспользоватьПрисоединенныеФайлы);
	Элементы.ДействиеСФайлом.Видимость = ИспользоватьПрисоединенныеФайлы;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если СкрыватьФорму Тогда
		Закрыть();
		ВыполнитьСохранениеФайла();		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СохранитьФайл(Команда)

	ВыполнитьСохранениеФайла();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции


&НаСервере
Процедура ЗаполнитьДействияСФайлом(ИспользоватьПрисоединенныеФайлы)
	
	Элементы.ДействиеСФайлом.СписокВыбора.Очистить();
	Элементы.ДействиеСФайлом.СписокВыбора.Добавить("СохранитьЛокально", НСтр("ru = 'Сохранить в папку на компьютер'"));
	
	Если ИспользоватьПрисоединенныеФайлы Тогда
		Элементы.ДействиеСФайлом.СписокВыбора.Добавить("СохранитьВПрисоединенныеФайлы",
			НСтр("ru = 'Присоединить к документу'"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьСохранениеФайла()

	Если ДействиеСФайлом = "СохранитьЛокально" Тогда

		ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершитьСохранениеФайла", ЭтотОбъект);
		ПараметрыСохраненияФайла = ПараметрыСохраненияФайла(ДанныеФайла.Расширение);
		ФайловаяСистемаКлиент.СохранитьФайл(ОписаниеОповещения, ДанныеФайла.СсылкаНаДвоичныеДанныеФайла,
			ДанныеФайла.ИмяФайла, ПараметрыСохраненияФайла);
			
		Если СообщенияПользователю <> Неопределено И СообщенияПользователю.Количество() > 0 Тогда
			Для Каждого СообщениеПользователю Из СообщенияПользователю Цикл
				ОбщегоНазначенияКлиент.СообщитьПользователю(СообщениеПользователю.Текст, СообщениеПользователю.КлючДанных,
					СообщениеПользователю.Поле, СообщениеПользователю.ПутьКДанным);
			КонецЦикла;
		КонецЕсли;

	ИначеЕсли ДействиеСФайлом = "СохранитьВПрисоединенныеФайлы" Тогда

		ПрисоединенныйФайл = ПрикрепитьГотовыйФайлКОбъектуПечати();

		ПараметрыОповещения = Новый Структура;
		ПараметрыОповещения.Вставить("Файл", ПрисоединенныйФайл);
		ПараметрыОповещения.Вставить("ЭтоНовый", Истина);
		Оповестить("Запись_Файл", ПараметрыОповещения, ПрисоединенныйФайл);

		РаботаСФайламиКлиент.ОткрытьФайл(ДанныеФайла);

		Закрыть();
		
	Иначе
		
		Возврат;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьСохранениеФайла(ПолученныеФайлы, ДополнительныеПараметры) Экспорт

	Если ПолученныеФайлы = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если ПолученныеФайлы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	ПолноеИмяФайла = ПолученныеФайлы[0].ПолноеИмя;

	Если Не ЗначениеЗаполнено(ПолноеИмяФайла) Тогда
		Возврат;
	КонецЕсли;

	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаНажатияНаОповещение", ЭтотОбъект,
		Новый Структура("ПолноеИмяФайла", ПолноеИмяФайла));

	ПоказатьОповещениеПользователя(
		НСтр("ru='Сохранение файла'"), ОписаниеОповещения, НСтр("ru='Открыть каталог'"));

	Закрыть();

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаНажатияНаОповещение(ДополнительныеПараметры) Экспорт

	Если ДополнительныеПараметры = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ПолноеИмяФайла = Неопределено;
	ДополнительныеПараметры.Свойство("ПолноеИмяФайла", ПолноеИмяФайла);

	Если Не ЗначениеЗаполнено(ПолноеИмяФайла) Тогда
		Возврат;
	КонецЕсли;

	ФайловаяСистемаКлиент.ОткрытьПроводник(ПолноеИмяФайла);

КонецПроцедуры

&НаСервере
Функция ПрикрепитьГотовыйФайлКОбъектуПечати()

	ПараметрыФайла = Новый Структура;
	ПараметрыФайла.Вставить("Автор",                       Пользователи.ТекущийПользователь());
	ПараметрыФайла.Вставить("ВладелецФайлов",              ОбъектПечати);
	ПараметрыФайла.Вставить("ИмяБезРасширения",            ДанныеФайла.Наименование);
	ПараметрыФайла.Вставить("РасширениеБезТочки",          ДанныеФайла.Расширение);
	ПараметрыФайла.Вставить("ВремяИзмененияУниверсальное", ДанныеФайла.ДатаМодификацииУниверсальная);

	ПрисоединенныйФайл = РаботаСФайлами.ДобавитьФайл(ПараметрыФайла, ДанныеФайла.СсылкаНаДвоичныеДанныеФайла);

	ДополнительныеПараметры = РаботаСФайламиКлиентСервер.ПараметрыДанныхФайла();
	ДополнительныеПараметры.ИдентификаторФормы = УникальныйИдентификатор;
	ДополнительныеПараметры.ПолучатьСсылкуНаДвоичныеДанные = Истина;

	ДанныеФайла = РаботаСФайлами.ДанныеФайла(ПрисоединенныйФайл, ДополнительныеПараметры);

	Возврат ПрисоединенныйФайл;

КонецФункции

&НаКлиенте
Функция ПараметрыСохраненияФайла(РасширениеФайла)

	Если РасширениеФайла = "docx" Тогда
		ТекстФильтра = НСтр("ru='Документ Word|*.docx;'");
	ИначеЕсли РасширениеФайла = "odt" Тогда
		ТекстФильтра = НСтр("ru='Текстовый документ ODF (.odt)|*.odt;'");
	Иначе
		ТекстФильтра = "";
	КонецЕсли;

	Если ПустаяСтрока(ТекстФильтра) Тогда
		Возврат Неопределено;
	КонецЕсли;

	ПараметрыСохраненияФайла = ФайловаяСистемаКлиент.ПараметрыСохраненияФайла();
	ПараметрыСохраненияФайла.Диалог.Расширение = РасширениеФайла;
	ПараметрыСохраненияФайла.Диалог.Фильтр = ТекстФильтра;
	Возврат ПараметрыСохраненияФайла;

КонецФункции

#КонецОбласти