////////////////////////////////////////////////////////////////////////////////
// ЕдиныйНалоговыйСчетЛичныйКабинетКлиентПереопределяемый:
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

Процедура ТаблицаПлатежиВыбор(Форма, Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

Процедура ТаблицаОтчетыВыбор(Форма, Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

Процедура ТаблицаНачисленияВыбор(Форма, Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка) Экспорт
КонецПроцедуры

Процедура ТаблицаТаблицаУплатыВыбор(Форма, Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка) Экспорт
КонецПроцедуры

Процедура ТаблицаПениШтрафыВыбор(Форма, Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка) Экспорт
КонецПроцедуры

Процедура ТаблицаОперацииЕНПДеревоСверкиВыбор(Форма, Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

Процедура СверкаСальдоЕНСПоДаннымУчета(Форма, Элемент, СтандартнаяОбработка) Экспорт
	СтандартнаяОбработка = Ложь;
	
	ФормаРегистра = ПолучитьФорму("РегистрНакопления.РасчетыПоЕдиномуНалоговомуСчету.ФормаСписка");
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Поле",          "Организация");
	ПараметрыОтбора.Вставить("Значение",      Форма.Объект.Организация);
	ПараметрыОтбора.Вставить("ВидСравнения",  ВидСравненияКомпоновкиДанных.Равно);
	ПараметрыОтбора.Вставить("Использование", Истина);
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ВПользовательскиеНастройки", Истина);
	ДополнительныеПараметры.Вставить("ЗаменятьСуществующий",       Истина);
	
	ЕдиныйНалоговыйСчетИнтеграцияКлиентУНФ.ДобавитьОтбор(ФормаРегистра.Список.КомпоновщикНастроек, ПараметрыОтбора, ДополнительныеПараметры);
		
	ФормаРегистра.Открыть();
КонецПроцедуры

Процедура СверкаСальдоЕНППоДаннымУчета(Форма, Элемент, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

#КонецОбласти

