///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2026, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	Для Каждого НастройкаОплаты Из Объект.НастройкиОплаты Цикл
		Если НастройкаОплаты.СпособОплаты = Перечисления.СпособыОплатыОнлайнЗаказов.СБПc2b Тогда
			НастройкаПодключенияКСБПc2b = НастройкаОплаты.НастройкаПодключения;
			ПриниматьОплатуСБПc2b = НастройкаОплаты.Используется;
		ИначеЕсли НастройкаОплаты.СпособОплаты = Перечисления.СпособыОплатыОнлайнЗаказов.СБПb2b Тогда
			НастройкаПодключенияКСБПb2b = НастройкаОплаты.НастройкаПодключения;
			ПриниматьОплатуСБПb2b = НастройкаОплаты.Используется;
		ИначеЕсли НастройкаОплаты.СпособОплаты = Перечисления.СпособыОплатыОнлайнЗаказов.ИнтернетЭквайринг Тогда
			НастройкаПодключенияКИнтернетЭквайрингу = НастройкаОплаты.НастройкаПодключения;
			ПриниматьОплатуИнтернетЭквайринг = НастройкаОплаты.Используется;
		ИначеЕсли НастройкаОплаты.СпособОплаты = Перечисления.СпособыОплатыОнлайнЗаказов.ОзонПэй Тогда
			НастройкаПодключенияКОзонПэй = НастройкаОплаты.НастройкаПодключения;
			ПриниматьОплатуОзонПэй = НастройкаОплаты.Используется;
		ИначеЕсли НастройкаОплаты.СпособОплаты = Перечисления.СпособыОплатыОнлайнЗаказов.ЯндексПэй Тогда
			НастройкаПодключенияКЯндексПэй = НастройкаОплаты.НастройкаПодключения;
			ПриниматьОплатуЯндексПэй = НастройкаОплаты.Используется;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		Объект.Используется = Истина;
		Объект.ПоРеквизитамОтФизЛиц = Истина;
		Объект.ПоРеквизитамОтЮрЛиц = Истина;
		
		Если ЗначениеЗаполнено(Объект.Организация)
			И ПустаяСтрока(Объект.Наименование) Тогда
			Объект.Наименование = Строка(Объект.Организация);
		КонецЕсли;
		
		ЭтоНоваяНастройка = Истина;
		
	КонецЕсли;
	
	НастройкаОнлайнЗаказовДоступна = ОнлайнЗаказыСлужебный.НастройкаОнлайнЗаказовДоступна();
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ИнтернетПоддержкаПользователей.ПлатежныеСистемы.БазоваяФункциональностьПлатежныхСистем") Тогда
		МодульПлатежныеСистемыСлужебный = ОбщегоНазначения.ОбщийМодуль("ПлатежныеСистемыСлужебный");
		ЧтениеНастроекПлатежныхСистемДоступно = МодульПлатежныеСистемыСлужебный.ЧтениеНастроекДоступно();
	КонецЕсли;
	
	Если Параметры.ЗапретИзмененияОрганизации Тогда
		Элементы.Организация.Вид = ВидПоляФормы.ПолеНадписи;
	КонецЕсли;
	
	УстановитьВидимостьДоступность();
	УправлениеЭлементамиФормыПоДанным();
	УстановитьДоступностьНастроекОплатФискализации();
	
	РезультатПроверкиШаблонов = Неопределено;
	ИспользоватьШаблоныСообщений = ОнлайнЗаказыСлужебный.ИспользоватьШаблоныСообщений();
	
	Если ИспользоватьШаблоныСообщений Тогда
		РезультатПроверкиШаблонов = ОнлайнЗаказыСлужебный.ВсеШаблоныСозданы();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если ПриниматьОплатуСБПc2b
		И Не ЗначениеЗаполнено(НастройкаПодключенияКСБПc2b) Тогда
		
		ОбщегоНазначения.СообщитьПользователю(
			НСтр("ru = 'Не заполнена настройка подключения к СБП.'"),
			,
			"НастройкаПодключенияКСБПc2b",
			,
			Отказ);
		
	КонецЕсли;
	
	Если ПриниматьОплатуИнтернетЭквайринг
		И Не ЗначениеЗаполнено(НастройкаПодключенияКИнтернетЭквайрингу) Тогда
		
		ОбщегоНазначения.СообщитьПользователю(
			НСтр("ru = 'Не заполнена настройка подключения к Интернет-эквайрингу.'"),
			,
			"НастройкаПодключенияКИнтернетЭквайрингу",
			,
			Отказ);
		
	КонецЕсли;
	
	Если ПриниматьОплатуОзонПэй
		И Не ЗначениеЗаполнено(НастройкаПодключенияКОзонПэй) Тогда
		
		ОбщегоНазначения.СообщитьПользователю(
			НСтр("ru = 'Не заполнена настройка подключения к Ozon Pay.'"),
			,
			"НастройкаПодключенияКОзонПэй",
			,
			Отказ);
		
	КонецЕсли;
	
	Если ПриниматьОплатуЯндексПэй
		И Не ЗначениеЗаполнено(НастройкаПодключенияКЯндексПэй) Тогда
		
		ОбщегоНазначения.СообщитьПользователю(
			НСтр("ru = 'Не заполнена настройка подключения к Яндекс Пэй.'"),
			,
			"НастройкаПодключенияКЯндексПэй",
			,
			Отказ);
		
	КонецЕсли;
	
	Если Объект.ФискализироватьОнлайнЗаказы
		И Не ЗначениеЗаполнено(Объект.НастройкаПодключенияКОблачнойКассе) Тогда
		
		ОбщегоНазначения.СообщитьПользователю(
			НСтр("ru = 'Не заполнена настройка облачной кассы.'"),
			,
			"Объект.НастройкаПодключенияКОблачнойКассе",
			,
			Отказ);
		
	КонецЕсли;
	
	Если ПриниматьОплатуСБПb2b
		И Не ЗначениеЗаполнено(НастройкаПодключенияКСБПb2b) Тогда
		
		ОбщегоНазначения.СообщитьПользователю(
			НСтр("ru = 'Не заполнена настройка подключения к СБП.'"),
			,
			"НастройкаПодключенияКСБПb2b",
			,
			Отказ);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОрганизацияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ПредставлениеНеРедактировалось = Объект.Наименование = Строка(Объект.Организация);
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	Если ПредставлениеНеРедактировалось Тогда
		Объект.Наименование = Строка(Объект.Организация);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияПредупреждениеОбработкаНавигационнойСсылки(
		Элемент,
		НавигационнаяСсылкаФорматированнойСтроки,
		СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "operation:resendSettings" Тогда
		
		Если Не ЗначениеЗаполнено(Объект.Ссылка)
			Или Модифицированность Тогда
			ЗадатьВопросОЗаписи("ПовторнаяОтправка");
		Иначе
			ОбновитьНастройкуВСервисе();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#Область ОплатаСБПc2b

&НаКлиенте
Процедура ПриниматьОплатуСБПc2bПриИзменении(Элемент)
	
	УстановитьИспользованиеСпособаОплаты(
		ПредопределенноеЗначение("Перечисление.СпособыОплатыОнлайнЗаказов.СБПc2b"),
		ПриниматьОплатуСБПc2b);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПодключенияКСБПc2bПриИзменении(Элемент)
	
	ПриИзмененииНастройкиОплаты(
		ПредопределенноеЗначение("Перечисление.СпособыОплатыОнлайнЗаказов.СБПc2b"),
		НастройкаПодключенияКСБПc2b);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПодключенияКСБПc2bНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОнлайнЗаказыКлиентСобытия.ПриВыбореНастройкиПодключения(
		ЭтотОбъект,
		Новый ОписаниеОповещения("ПослеВыбораНастройкиПодключенияСБПc2b", ЭтотОбъект),
		ПредопределенноеЗначение("Перечисление.СпособыОплатыОнлайнЗаказов.СБПc2b"));
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПодключенияКСБПc2bСоздание(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Не ОбщегоНазначенияКлиент.ПодсистемаСуществует("ИнтернетПоддержкаПользователей.НастройкиПлатежныхСистем") Тогда
		Возврат;
	КонецЕсли;
	
	ОнлайнЗаказыКлиентСобытия.ПриПодключенииПлатежнойСистемы(
		ПредопределенноеЗначение("Перечисление.СпособыОплатыОнлайнЗаказов.СБПc2b"),
		Новый ОписаниеОповещения(
			"СозданиеНастройкиПодключенияКСБПc2bЗавершение",
			ЭтотОбъект));
	
КонецПроцедуры

#КонецОбласти

#Область ИнтернетЭквайринг

&НаКлиенте
Процедура ПриниматьОплатуИнтернетЭквайрингПриИзменении(Элемент)
	
	УстановитьИспользованиеСпособаОплаты(
		ПредопределенноеЗначение("Перечисление.СпособыОплатыОнлайнЗаказов.ИнтернетЭквайринг"),
		ПриниматьОплатуИнтернетЭквайринг);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПодключенияКИнтернетЭквайрингуПриИзменении(Элемент)
	
	ПриИзмененииНастройкиОплаты(
		ПредопределенноеЗначение("Перечисление.СпособыОплатыОнлайнЗаказов.ИнтернетЭквайринг"),
		НастройкаПодключенияКИнтернетЭквайрингу);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПодключенияКИнтернетЭквайрингуНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОнлайнЗаказыКлиентСобытия.ПриВыбореНастройкиПодключения(
		ЭтотОбъект,
		Новый ОписаниеОповещения("ПослеВыбораНастройкиПодключенияИнтернетЭквайринга", ЭтотОбъект),
		ПредопределенноеЗначение("Перечисление.СпособыОплатыОнлайнЗаказов.ИнтернетЭквайринг"))
		
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПодключенияКИнтернетЭквайрингуСоздание(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Не ОбщегоНазначенияКлиент.ПодсистемаСуществует("ИнтернетПоддержкаПользователей.НастройкиПлатежныхСистем") Тогда
		Возврат;
	КонецЕсли;
	
	ОнлайнЗаказыКлиентСобытия.ПриПодключенииПлатежнойСистемы(
		ПредопределенноеЗначение("Перечисление.СпособыОплатыОнлайнЗаказов.ИнтернетЭквайринг"),
		Новый ОписаниеОповещения(
			"СозданиеНастройкиПодключенияКИнтернетЭквайрингуЗавершение",
			ЭтотОбъект));
	
КонецПроцедуры

#КонецОбласти

#Область ОзонПэй

&НаКлиенте
Процедура ПриниматьОплатуОзонПэйПриИзменении(Элемент)
	
	УстановитьИспользованиеСпособаОплаты(
		ПредопределенноеЗначение("Перечисление.СпособыОплатыОнлайнЗаказов.ОзонПэй"),
		ПриниматьОплатуОзонПэй);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПодключенияКОзонПэйПриИзменении(Элемент)
	
	ПриИзмененииНастройкиОплаты(
		ПредопределенноеЗначение("Перечисление.СпособыОплатыОнлайнЗаказов.ОзонПэй"),
		НастройкаПодключенияКОзонПэй);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПодключенияКОзонПэйНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОнлайнЗаказыКлиентСобытия.ПриВыбореНастройкиПодключения(
		ЭтотОбъект,
		Новый ОписаниеОповещения("ПослеВыбораНастройкиПодключенияОзонПэй", ЭтотОбъект),
		ПредопределенноеЗначение("Перечисление.СпособыОплатыОнлайнЗаказов.ОзонПэй"));
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПодключенияКОзонПэйСоздание(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Не ОбщегоНазначенияКлиент.ПодсистемаСуществует("ИнтернетПоддержкаПользователей.НастройкиПлатежныхСистем") Тогда
		Возврат;
	КонецЕсли;
	
	ОнлайнЗаказыКлиентСобытия.ПриПодключенииПлатежнойСистемы(
		ПредопределенноеЗначение("Перечисление.СпособыОплатыОнлайнЗаказов.ОзонПэй"),
		Новый ОписаниеОповещения(
			"СозданиеНастройкиПодключенияКОзонПэйЗавершение",
			ЭтотОбъект));
	
КонецПроцедуры

#КонецОбласти

#Область ЯндексПэй

&НаКлиенте
Процедура ПриниматьОплатуЯндексПэйПриИзменении(Элемент)
	
	УстановитьИспользованиеСпособаОплаты(
		ПредопределенноеЗначение("Перечисление.СпособыОплатыОнлайнЗаказов.ЯндексПэй"),
		ПриниматьОплатуЯндексПэй);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПодключенияКЯндексПэйПриИзменении(Элемент)
	
	ПриИзмененииНастройкиОплаты(
		ПредопределенноеЗначение("Перечисление.СпособыОплатыОнлайнЗаказов.ЯндексПэй"),
		НастройкаПодключенияКЯндексПэй);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПодключенияКЯндексПэйНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОнлайнЗаказыКлиентСобытия.ПриВыбореНастройкиПодключения(
		ЭтотОбъект,
		Новый ОписаниеОповещения("ПослеВыбораНастройкиПодключенияЯндексПэй", ЭтотОбъект),
		ПредопределенноеЗначение("Перечисление.СпособыОплатыОнлайнЗаказов.ЯндексПэй"));
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПодключенияКЯндексПэйСоздание(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Не ОбщегоНазначенияКлиент.ПодсистемаСуществует("ИнтернетПоддержкаПользователей.НастройкиПлатежныхСистем") Тогда
		Возврат;
	КонецЕсли;
	
	ОнлайнЗаказыКлиентСобытия.ПриПодключенииПлатежнойСистемы(
		ПредопределенноеЗначение("Перечисление.СпособыОплатыОнлайнЗаказов.ЯндексПэй"),
		Новый ОписаниеОповещения(
			"СозданиеНастройкиПодключенияКЯндексПэйЗавершение",
			ЭтотОбъект));
	
КонецПроцедуры

#КонецОбласти

#Область ПоРеквизитам

&НаКлиенте
Процедура ПоРеквизитамОтФизЛицПриИзменении(Элемент)
	
	ПослеИзмененияИспользованияОплатФискализации();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоРеквизитамОтЮрЛицПриИзменении(Элемент)
	
	ПослеИзмененияИспользованияОплатФискализации();
	
КонецПроцедуры

#КонецОбласти

#Область ОплатаСБПb2b

&НаКлиенте
Процедура ПриниматьОплатуСБПb2bПриИзменении(Элемент)
	
	УстановитьИспользованиеСпособаОплаты(
		ПредопределенноеЗначение("Перечисление.СпособыОплатыОнлайнЗаказов.СБПb2b"),
		ПриниматьОплатуСБПb2b);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПодключенияКСБПb2bПриИзменении(Элемент)
	
	ПриИзмененииНастройкиОплаты(
		ПредопределенноеЗначение("Перечисление.СпособыОплатыОнлайнЗаказов.СБПb2b"),
		НастройкаПодключенияКСБПb2b);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПодключенияКСБПb2bНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОнлайнЗаказыКлиентСобытия.ПриВыбореНастройкиПодключения(
		ЭтотОбъект,
		Новый ОписаниеОповещения("ПослеВыбораНастройкиПодключенияСБПb2b", ЭтотОбъект),
		ПредопределенноеЗначение("Перечисление.СпособыОплатыОнлайнЗаказов.СБПb2b"));
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПодключенияКСБПb2bСоздание(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Не ОбщегоНазначенияКлиент.ПодсистемаСуществует("ИнтернетПоддержкаПользователей.НастройкиПлатежныхСистем") Тогда
		Возврат;
	КонецЕсли;
	
	ОнлайнЗаказыКлиентСобытия.ПриПодключенииПлатежнойСистемы(
		ПредопределенноеЗначение("Перечисление.СпособыОплатыОнлайнЗаказов.СБПb2b"),
		Новый ОписаниеОповещения(
			"СозданиеНастройкиПодключенияКСБПb2bЗавершение",
			ЭтотОбъект));
	
КонецПроцедуры

#КонецОбласти

#Область ОблачнаяКасса

&НаКлиенте
Процедура ФискализироватьОнлайнЗаказыПриИзменении(Элемент)
	
	ПослеИзмененияИспользованияОплатФискализации();
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПодключенияКОблачнойКассеПриИзменении(Элемент)
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПодключенияКОблачнойКассеНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОнлайнЗаказыКлиентСобытия.ПриВыбореОблачнойКассы(
		ЭтотОбъект,
		Новый ОписаниеОповещения("ПослеВыбораНастройкиПодключенияКОблачнойКассе", ЭтотОбъект),
		Объект.Организация);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьНастройку(Команда)
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ЗакрытьПослеЗаписи", Ложь);
	ДополнительныеПараметры.Вставить("ВидОбрабатываемойКоманды", "ЗаписатьНастройку");
	
	ПередИнициализациейЗаписиОбъекта(ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ЗакрытьПослеЗаписи", Истина);
	ДополнительныеПараметры.Вставить("ВидОбрабатываемойКоманды", "ЗаписатьИЗакрыть");
	
	ПередИнициализациейЗаписиОбъекта(ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьСтраницуЗаказа(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка)
		Или Модифицированность Тогда
		ЗадатьВопросОЗаписи("ВнешнийВидСтраницы");
	Иначе
		НастроитьВнешнийВидСтраницы();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьВСервис(Команда)
	
	Если Модифицированность Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru = 'Перед обновлением настроек в сервисе необходимо записать изменения.'"));
		Возврат;
	ИначеЕсли Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru = 'Необходимо записать настройку подключения.'"));
		Возврат;
	КонецЕсли;
	
	ОбновитьНастройкуВСервисе();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ВыборНастройки

&НаКлиенте
Процедура ЗадатьВопросОЗаписи(ВидОбрабатываемойКоманды)
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ЗакрытьПослеЗаписи", Ложь);
	ДополнительныеПараметры.Вставить("ВидОбрабатываемойКоманды", ВидОбрабатываемойКоманды);
	
	Оповещение = Новый ОписаниеОповещения(
		"ПослеОтветаНаВопросОЗаписи",
		ЭтотОбъект,
		ДополнительныеПараметры);
		
	Кнопки = Новый СписокЗначений;
	Кнопки.Добавить(КодВозвратаДиалога.Да, "Записать");
	Кнопки.Добавить(КодВозвратаДиалога.Отмена, "Отмена");
	
	ПоказатьВопрос(
		Оповещение,
		НСтр("ru = 'Для продолжения необходимо записать настройку подключения.'"),
		Кнопки);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеОтветаНаВопросОЗаписи(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ПередИнициализациейЗаписиОбъекта(ДополнительныеПараметры);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СпособыОплаты

&НаСервере
Процедура ПослеИзмененияИспользованияОплатФискализации()
	
	УстановитьДоступностьНастроекОплатФискализации();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьИспользованиеСпособаОплаты(СпособОплаты, Использование)
	
	Модифицированность = Истина;
	
	Отбор = Новый Структура;
	Отбор.Вставить("СпособОплаты", СпособОплаты);
	
	НайденныеЗначения = Объект.НастройкиОплаты.НайтиСтроки(Отбор);
	
	Для Каждого НайденноеЗначение Из НайденныеЗначения Цикл
		
		НайденноеЗначение.Используется = Использование;
		
	КонецЦикла;
	
	ПослеИзмененияИспользованияОплатФискализации();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииНастройкиОплаты(СпособОплаты, НоваяНастройкаОплаты)
	
	Модифицированность = Истина;
	
	Отбор = Новый Структура;
	Отбор.Вставить("СпособОплаты", СпособОплаты);
	
	НайденныеЗначения = Объект.НастройкиОплаты.НайтиСтроки(Отбор);
	
	Для Каждого НайденноеЗначение Из НайденныеЗначения Цикл
		
		Если ЗначениеЗаполнено(НоваяНастройкаОплаты) Тогда
			НайденноеЗначение.НастройкаПодключения = НоваяНастройкаОплаты;
		Иначе
			Объект.НастройкиОплаты.Удалить(НайденноеЗначение);
		КонецЕсли;
		
	КонецЦикла;
	
	Если НайденныеЗначения.Количество() = 0
		И ЗначениеЗаполнено(НоваяНастройкаОплаты) Тогда
		НастройкаОплаты = Объект.НастройкиОплаты.Добавить();
		НастройкаОплаты.СпособОплаты = СпособОплаты;
		НастройкаОплаты.НастройкаПодключения = НоваяНастройкаОплаты;
		НастройкаОплаты.Используется = Истина;
	КонецЕсли;
	
	ПослеИзмененияИспользованияОплатФискализации();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораНастройкиПодключенияСБПc2b(
		НастройкаПодключения,
		ДополнительныеПараметры) Экспорт
	
	Если НастройкаПодключения <> Неопределено Тогда
		
		НастройкаПодключенияКСБПc2b = НастройкаПодключения;
		
		ПриИзмененииНастройкиОплаты(
			ПредопределенноеЗначение("Перечисление.СпособыОплатыОнлайнЗаказов.СБПc2b"),
			НастройкаПодключения);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораНастройкиПодключенияИнтернетЭквайринга(
		НастройкаПодключения,
		ДополнительныеПараметры) Экспорт
	
	Если НастройкаПодключения <> Неопределено Тогда
		
		НастройкаПодключенияКИнтернетЭквайрингу = НастройкаПодключения;
		
		ПриИзмененииНастройкиОплаты(
			ПредопределенноеЗначение("Перечисление.СпособыОплатыОнлайнЗаказов.ИнтернетЭквайринг"),
			НастройкаПодключения);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораНастройкиПодключенияОзонПэй(
		НастройкаПодключения,
		ДополнительныеПараметры) Экспорт
	
	Если НастройкаПодключения <> Неопределено Тогда
		
		НастройкаПодключенияКОзонПэй = НастройкаПодключения;
		
		ПриИзмененииНастройкиОплаты(
			ПредопределенноеЗначение("Перечисление.СпособыОплатыОнлайнЗаказов.ОзонПэй"),
			НастройкаПодключения);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораНастройкиПодключенияСБПb2b(
		НастройкаПодключения,
		ДополнительныеПараметры) Экспорт
	
	Если НастройкаПодключения <> Неопределено Тогда
		
		НастройкаПодключенияКСБПb2b = НастройкаПодключения;
		
		ПриИзмененииНастройкиОплаты(
			ПредопределенноеЗначение("Перечисление.СпособыОплатыОнлайнЗаказов.СБПb2b"),
			НастройкаПодключения);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СозданиеНастройкиПодключенияКСБПc2bЗавершение(
		Результат,
		ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Результат) Тогда
		НастройкаПодключенияКСБПc2b = Результат;
		ПриИзмененииНастройкиОплаты(
			ПредопределенноеЗначение("Перечисление.СпособыОплатыОнлайнЗаказов.СБПc2b"),
			НастройкаПодключенияКСБПc2b);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СозданиеНастройкиПодключенияКИнтернетЭквайрингуЗавершение(
		Результат,
		ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Результат) Тогда
		НастройкаПодключенияКИнтернетЭквайрингу = Результат;
		ПриИзмененииНастройкиОплаты(
			ПредопределенноеЗначение("Перечисление.СпособыОплатыОнлайнЗаказов.ИнтернетЭквайринг"),
			НастройкаПодключенияКИнтернетЭквайрингу);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СозданиеНастройкиПодключенияКОзонПэйЗавершение(
		Результат,
		ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Результат) Тогда
		НастройкаПодключенияКОзонПэй = Результат;
		ПриИзмененииНастройкиОплаты(
			ПредопределенноеЗначение("Перечисление.СпособыОплатыОнлайнЗаказов.ОзонПэй"),
			НастройкаПодключенияКОзонПэй);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СозданиеНастройкиПодключенияКЯндексПэйЗавершение(
		Результат,
		ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Результат) Тогда
		НастройкаПодключенияКЯндексПэй = Результат;
		ПриИзмененииНастройкиОплаты(
			ПредопределенноеЗначение("Перечисление.СпособыОплатыОнлайнЗаказов.ЯндексПэй"),
			НастройкаПодключенияКЯндексПэй);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СозданиеНастройкиПодключенияКСБПb2bЗавершение(
		Результат,
		ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Результат) Тогда
		НастройкаПодключенияКСБПb2b = Результат;
		ПриИзмененииНастройкиОплаты(
			ПредопределенноеЗначение("Перечисление.СпособыОплатыОнлайнЗаказов.СБПb2b"),
			НастройкаПодключенияКСБПb2b);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораНастройкиПодключенияЯндексПэй(
		НастройкаПодключения,
		ДополнительныеПараметры) Экспорт
	
	Если НастройкаПодключения <> Неопределено Тогда
		
		НастройкаПодключенияКЯндексПэй = НастройкаПодключения;
		
		ПриИзмененииНастройкиОплаты(
			ПредопределенноеЗначение("Перечисление.СпособыОплатыОнлайнЗаказов.ЯндексПэй"),
			НастройкаПодключения);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОблачнаяКасса

&НаКлиенте
Процедура ПослеВыбораНастройкиПодключенияКОблачнойКассе(
		НастройкаПодключения,
		ДополнительныеПараметры) Экспорт
	
	Если НастройкаПодключения <> Неопределено Тогда
		Модифицированность = Истина;
		Объект.НастройкаПодключенияКОблачнойКассе = НастройкаПодключения;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ШаблоныСообщений

&НаКлиенте
Процедура ПослеОтветаНаВопросОСозданииШаблонов(Результат, Параметры) Экспорт
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ЗакрытьПослеЗаписи", Ложь);
	ДополнительныеПараметры.Вставить("ВидОбрабатываемойКоманды", "");
	ЗаполнитьЗначенияСвойств(ДополнительныеПараметры, Параметры);
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		СозданныеШаблоны = СоздатьПредопределенныеШаблоныСообщений();
		
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(
			РезультатПроверкиШаблонов.Шаблоны,
			СозданныеШаблоны);
		РезультатПроверкиШаблонов.ВсеШаблоны = Истина;
		
		Если Не ДополнительныеПараметры.ЗакрытьПослеЗаписи Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(
				НСтр("ru = 'Предопределенные шаблоны созданы.'"));
		КонецЕсли;
		
	КонецЕсли;
	
	ИнициализироватьЗаписьОбъекта(ДополнительныеПараметры);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СоздатьПредопределенныеШаблоныСообщений()
	
	ОнлайнЗаказыСлужебный.УстановитьИспользованиеШаблоновСообщений();
	Возврат ОнлайнЗаказыСлужебный.СоздатьПредопределенныеШаблоныСообщенийПроверкаПодсистем();
	
КонецФункции

#КонецОбласти

#Область ОбновлениеНастройкиВСервисе

&НаКлиенте
Процедура ПередИнициализациейЗаписиОбъекта(ДополнительныеПараметры)
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	Если РезультатПроверкиШаблонов <> Неопределено
		И Не РезультатПроверкиШаблонов.ВсеШаблоны Тогда
		
		Оповещение = Новый ОписаниеОповещения(
			"ПослеОтветаНаВопросОСозданииШаблонов",
			ЭтотОбъект,
			ДополнительныеПараметры);
		
		ПоказатьВопрос(
			Оповещение,
			НСтр("ru = 'Создать шаблоны сообщений для автоматического заполнения на основании данных документов?'"),
			РежимДиалогаВопрос.ДаНет);
			
	Иначе
		ИнициализироватьЗаписьОбъекта(ДополнительныеПараметры);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИнициализироватьЗаписьОбъекта(ДополнительныеПараметры)
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
	ПараметрыОжидания.ТекстСообщения = НСтр("ru = 'Выполняется запись и отправка в сервис настройки онлайн-заказов.'");
	
	РезультатВыполнения = ЗаписатьОбъектЗапускЗадания();
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения(
		"ЗаписатьОбъектЗавершение",
		ЭтотОбъект,
		ДополнительныеПараметры);
	
	Если РезультатВыполнения.Статус = "Выполнено" Или РезультатВыполнения.Статус = "Ошибка" Тогда
		ЗаписатьОбъектЗавершение(
			РезультатВыполнения,
			ДополнительныеПараметры);
		Возврат;
	КонецЕсли;
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(
		РезультатВыполнения,
		ОповещениеОЗавершении,
		ПараметрыОжидания);
	
КонецПроцедуры

&НаСервере
Функция ЗаписатьОбъектЗапускЗадания()
	
	ОбъектРеквизит = РеквизитФормыВЗначение("Объект");
	РезультатЗаписи = ОнлайнЗаказыСлужебный.ЗаписатьОбъектНастройкиПодключения(
		ОбъектРеквизит,
		Ложь);
	
	Если РезультатЗаписи.ОшибкаЗаписи Тогда
		Возврат Новый Структура(
			"Статус, АдресРезультата",
			"Выполнено",
			ПоместитьВоВременноеХранилище(РезультатЗаписи, УникальныйИдентификатор));
	КонецЕсли;
	
	ЗначениеВДанныеФормы(
		ОбъектРеквизит,
		Объект);
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(
		УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания
		= НСтр("ru = 'Запись и отправка в сервис настройки онлайн-заказов.'");
	
	РезультатВыполнения = ДлительныеОперации.ВыполнитьФункцию(
		ПараметрыВыполнения,
		"ОнлайнЗаказыСлужебный.ИнициализироватьОбновлениеНастройки",
		РезультатЗаписи.НастройкаПодключения,
		РезультатЗаписи,
		ЭтоНоваяНастройка);
	
	Возврат РезультатВыполнения;
	
КонецФункции

&НаКлиенте
Процедура ЗаписатьОбъектЗавершение(
		Результат,
		ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" Тогда
		
		РезультатЗаписи = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
		
		Если РезультатЗаписи.ОшибкаЗаписи Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(РезультатЗаписи.СообщениеОбОшибке);
			Возврат;
		КонецЕсли;
		
		Прочитать();
		УправлениеЭлементамиФормыПоДанным();
		
		Если РезультатЗаписи.ОшибкаОтправкиВСервис Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(РезультатЗаписи.СообщениеОбОшибке);
			Возврат;
		КонецЕсли;
		
		Если ОписаниеОповещенияОЗакрытии <> Неопределено
			И ОписаниеОповещенияОЗакрытии.ДополнительныеПараметры <> Неопределено Тогда
			ОписаниеОповещенияОЗакрытии.ДополнительныеПараметры.Вставить(
				"НастройкаПодключенияКОнлайнЗаказам",
				Объект.Ссылка);
			ОписаниеОповещенияОЗакрытии.ДополнительныеПараметры.Вставить(
				"ИзмененыНастройкиСтраницы",
				РезультатЗаписи.ИзмененыНастройкиСтраницы);
		КонецЕсли;
		
		Модифицированность = Ложь;
		ЭтоНоваяНастройка = Ложь;
		
		Если ДополнительныеПараметры.ЗакрытьПослеЗаписи Тогда
			Закрыть(Истина);
			Возврат;
		КонецЕсли;
		
		Если ДополнительныеПараметры.ВидОбрабатываемойКоманды = "ВнешнийВидСтраницы" Тогда
			НастроитьВнешнийВидСтраницы();
		КонецЕсли;
		
	ИначеЕсли Результат.Статус = "Ошибка" Тогда
		
		ДанныеОшибки = ОбщегоНазначенияКлиентСервер.УточнениеИсключения(
			Результат.ИнформацияОбОшибке,
			НСтр("ru = 'Ошибка записи и отправки в сервис настройки онлайн-заказов.'"));
		
		ПоказатьПредупреждение(
			Неопределено,
			ДанныеОшибки.Текст);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНастройкуВСервисе()
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
	ПараметрыОжидания.ТекстСообщения = НСтр("ru = 'Обновление настройки онлайн-заказов в сервисе.'");
	
	РезультатВыполнения = ОбновитьНастройкуВСервисеЗапускЗадания();
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения(
		"ОбновитьНастройкуВСервисеЗавершение",
		ЭтотОбъект);
		
	Если РезультатВыполнения.Статус = "Выполнено" Или РезультатВыполнения.Статус = "Ошибка" Тогда
		ОбновитьНастройкуВСервисеЗавершение(
			РезультатВыполнения,
			Неопределено);
		Возврат;
	КонецЕсли;
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(
		РезультатВыполнения,
		ОповещениеОЗавершении,
		ПараметрыОжидания);
	
КонецПроцедуры

&НаСервере
Функция ОбновитьНастройкуВСервисеЗапускЗадания()
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(
		УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания
		= НСтр("ru = 'Обновление настроек онлайн-заказов в сервисе.'");
	
	РезультатВыполнения = ДлительныеОперации.ВыполнитьФункцию(
		ПараметрыВыполнения,
		"ОнлайнЗаказыСлужебный.ИнициализироватьОбновлениеНастройки",
		Объект.Ссылка,
		,
		ЭтоНоваяНастройка);
	
	Возврат РезультатВыполнения;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьНастройкуВСервисеЗавершение(
		Результат,
		ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" Тогда
		
		РезультатОперации = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
		
		Если РезультатОперации.ОшибкаОтправкиВСервис Тогда
			ПоказатьПредупреждение(
				Неопределено,
				РезультатОперации.СообщениеОбОшибке);
		Иначе
			ПоказатьПредупреждение(
				Неопределено,
				НСтр("ru = 'Настройки успешно обновлены.'"));
		КонецЕсли;
		
	ИначеЕсли Результат.Статус = "Ошибка" Тогда
		
		ДанныеОшибки = ОбщегоНазначенияКлиентСервер.УточнениеИсключения(
			Результат.ИнформацияОбОшибке,
			НСтр("ru = 'Ошибка обновления настройки онлайн-заказов в сервисе.'"));
		
		ПоказатьПредупреждение(
			Неопределено,
			ДанныеОшибки.Текст);
		
	КонецЕсли;
	
	Прочитать();
	УправлениеЭлементамиФормыПоДанным();
	
КонецПроцедуры

#КонецОбласти

#Область НастройкаВнешнегоВидаСтраницы

&НаКлиенте
Процедура НастроитьВнешнийВидСтраницы()
	
	Результат = URLНастройкиПодключения(Объект.Ссылка);
	
	Если Результат.КодОшибки = ОнлайнЗаказыКлиент.КодОшибкиДанныеАутентификацииИППНеЗаполнены() Тогда
		Если ИнтернетПоддержкаПользователейКлиент.ДоступноПодключениеИнтернетПоддержки() Тогда
			ИнтернетПоддержкаПользователейКлиент.ПодключитьИнтернетПоддержкуПользователей(
				Новый ОписаниеОповещения("ПриЗавершенииПодключенияИнтернетПоддержки", ЭтотОбъект),
				ЭтотОбъект);
		Иначе
			ПоказатьПредупреждение(
				,
				НСтр("ru = 'Необходимо подключить Интернет-поддержку пользователей.
				|Обратитесь к администратору системы.'"));
		КонецЕсли;
	ИначеЕсли ПустаяСтрока(Результат.КодОшибки) Тогда
		ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку(Результат.URLНастройкиПодключения);
	Иначе
		ПоказатьПредупреждение(
			,
			Результат.СообщениеОбОшибке);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция URLНастройкиПодключения(Знач НастройкаПодключения)
	
	Возврат ОнлайнЗаказыСлужебный.URLНастройкиПодключения(НастройкаПодключения);
	
КонецФункции

#КонецОбласти

#Область Прочее

&НаСервере
Процедура УстановитьВидимостьДоступность()
	
	Элементы.НастроитьСтраницуЗаказа.Доступность = НастройкаОнлайнЗаказовДоступна;
	Элементы.ФормаОбновитьНастройки.Доступность = НастройкаОнлайнЗаказовДоступна;
	Элементы.ФормаЗаписатьНастройку.Доступность = НастройкаОнлайнЗаказовДоступна;
	Элементы.ФормаЗаписатьИЗакрыть.Доступность = НастройкаОнлайнЗаказовДоступна;
	Элементы.ГруппаПодключениеКСБПc2b.Доступность = НастройкаОнлайнЗаказовДоступна;
	Элементы.ГруппаПодключениеЭквайринг.Доступность = НастройкаОнлайнЗаказовДоступна;
	Элементы.ГруппаПодключениеОзонПэй.Доступность = НастройкаОнлайнЗаказовДоступна;
	Элементы.ГруппаПодключениеЯндексПэй.Доступность = НастройкаОнлайнЗаказовДоступна;
	Элементы.ГруппаПоБанковскимРеквизитамФизЛица.Доступность = НастройкаОнлайнЗаказовДоступна;
	Элементы.ГруппаПодключениеКОблачнойКассе.Доступность = НастройкаОнлайнЗаказовДоступна;
	Элементы.ГруппаПодключениеКСБПb2b.Доступность = НастройкаОнлайнЗаказовДоступна;
	Элементы.ГруппаПоБанковскимРеквизитамЮрЛица.Доступность = НастройкаОнлайнЗаказовДоступна;
	
	Если Параметры.РежимФормы = "ОтправкаURLОнлайнЗаказов" Тогда
		Элементы.Используется.Видимость = Ложь;
	КонецЕсли;
	
	УстановитьВидимостьПредставлениеСБП();
	УстановитьВидимостьПредставлениеИнтернетЭквайринга();
	УстановитьВидимостьПредставлениеОблачнойФискализации();
	УстановитьПредставлениеДекорацииПредупреждение();
	УстановитьВидимостьПредставлениеОзонПэй();
	УстановитьВидимостьПредставлениеЯндексПэй();
	
КонецПроцедуры

&НаСервере
Процедура УправлениеЭлементамиФормыПоДанным()
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Элементы.ГруппаПредупреждение.Видимость = Объект.ОшибкаСинхронизации;
	Иначе
		Элементы.ГруппаПредупреждение.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьНастроекОплатФискализации()
	
	Элементы.НастройкаПодключенияКСБПc2b.Доступность = ПриниматьОплатуСБПc2b;
	Элементы.НастройкаПодключенияКОзонПэй.Доступность = ПриниматьОплатуОзонПэй;
	Элементы.НастройкаПодключенияКЯндексПэй.Доступность = ПриниматьОплатуЯндексПэй;
	Элементы.НастройкаПодключенияКИнтернетЭквайрингу.Доступность = ПриниматьОплатуИнтернетЭквайринг;
	Элементы.НастройкаПодключенияКОблачнойКассе.Доступность = Объект.ФискализироватьОнлайнЗаказы;
	
	Элементы.НастройкаПодключенияКСБПb2b.Доступность = ПриниматьОплатуСБПb2b;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьПредставлениеСБП()
	
	ЧтениеНастроекСБПДоступно = Ложь;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ИнтернетПоддержкаПользователей.СистемаБыстрыхПлатежей.БазоваяФункциональностьСБП") Тогда
		МодульСистемаБыстрыхПлатежейСлужебный = ОбщегоНазначения.ОбщийМодуль("СистемаБыстрыхПлатежейСлужебный");
		ЧтениеНастроекСБПДоступно = МодульСистемаБыстрыхПлатежейСлужебный.ЧтениеНастроекДоступно();
	КонецЕсли;
	
	Если Не ЧтениеНастроекСБПДоступно
		Или Не ОбщегоНазначения.ПодсистемаСуществует("ИнтернетПоддержкаПользователей.СистемаБыстрыхПлатежей.ПереводыСБПc2b") Тогда
		Элементы.ГруппаПодключениеКСБПc2b.Видимость = Ложь;
	Иначе
		
		Если Не ЗначениеЗаполнено(НастройкаПодключенияКСБПc2b) Тогда
			НастройкаПодключенияКСБПc2b =
				ПредопределенноеЗначение("Справочник.НастройкиПодключенияКСистемеБыстрыхПлатежей.ПустаяСсылка");
		КонецЕсли;
		
		Элементы.НастройкаПодключенияКСБПc2b.ПараметрыВыбора = ПараметрыВыбораОплаты(
			Перечисления.СпособыОплатыОнлайнЗаказов.СБПc2b);
		
	КонецЕсли;
	
	Если Не ЧтениеНастроекСБПДоступно
		Или Не ОбщегоНазначения.ПодсистемаСуществует("ИнтернетПоддержкаПользователей.СистемаБыстрыхПлатежей.ПереводыСБПb2b") Тогда
		Элементы.ГруппаПодключениеКСБПb2b.Видимость = Ложь;
	Иначе
		
		Если Не ЗначениеЗаполнено(НастройкаПодключенияКСБПb2b) Тогда
			НастройкаПодключенияКСБПb2b =
				ПредопределенноеЗначение("Справочник.НастройкиПодключенияКСистемеБыстрыхПлатежей.ПустаяСсылка");
		КонецЕсли;
		
		Элементы.НастройкаПодключенияКСБПb2b.ПараметрыВыбора = ПараметрыВыбораОплаты(
			Перечисления.СпособыОплатыОнлайнЗаказов.СБПb2b);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьПредставлениеИнтернетЭквайринга()
	
	ЧтениеНастроекИнтернетЭквайрингаДоступно = Ложь;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ИнтернетПоддержкаПользователей.ИнтернетЭквайринг") Тогда
		МодульИнтернетЭквайрингСлужебный = ОбщегоНазначения.ОбщийМодуль("ИнтернетЭквайрингСлужебный");
		ЧтениеНастроекИнтернетЭквайрингаДоступно = МодульИнтернетЭквайрингСлужебный.ЧтениеНастроекДоступно();
	КонецЕсли;
	
	Элементы.ГруппаПодключениеЭквайринг.Видимость = ЧтениеНастроекИнтернетЭквайрингаДоступно;
	
	Если ЧтениеНастроекИнтернетЭквайрингаДоступно
		И Не ЗначениеЗаполнено(НастройкаПодключенияКИнтернетЭквайрингу)Тогда
		НастройкаПодключенияКИнтернетЭквайрингу =
			ПредопределенноеЗначение("Справочник.НастройкиПодключенияКИнтернетЭквайрингу.ПустаяСсылка");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьПредставлениеОзонПэй()
	
	Если ЧтениеНастроекПлатежныхСистемДоступно
		И ОбщегоНазначения.ПодсистемаСуществует("ИнтернетПоддержкаПользователей.ПлатежныеСистемы.ОзонПэй") Тогда
		
		Элементы.ГруппаПодключениеОзонПэй.Видимость = Истина;
		
		Если Не ЗначениеЗаполнено(НастройкаПодключенияКОзонПэй) Тогда
			НастройкаПодключенияКОзонПэй =
				ПредопределенноеЗначение("Справочник.НастройкиПодключенияКПлатежнымСистемам.ПустаяСсылка");
		КонецЕсли;
		
	Иначе
		Элементы.ГруппаПодключениеОзонПэй.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьПредставлениеОблачнойФискализации()
	
	ЧтениеНастроекОблачныхКассДоступно = Ложь;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ИнтернетПоддержкаПользователей.ОблачныеКассы") Тогда
		МодульОблачныеКассы = ОбщегоНазначения.ОбщийМодуль("ОблачныеКассы");
		ЧтениеНастроекОблачныхКассДоступно = МодульОблачныеКассы.ЧтениеНастроекПодключенияДоступно();
	КонецЕсли;
	
	Элементы.ГруппаПодключениеКОблачнойКассе.Видимость = ЧтениеНастроекОблачныхКассДоступно;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПредставлениеДекорацииПредупреждение()
	
	ЧастиСтрок = Новый Массив;
	ЧастиСтрок.Добавить(НСтр("ru = 'Не удалось обновить данные в сервисе.'"));
	
	Если НастройкаОнлайнЗаказовДоступна Тогда
		ЧастиСтрок.Добавить(" ");
		ЧастиСтрок.Добавить(
			Новый ФорматированнаяСтрока(
				НСтр("ru = 'Повторить отправку'")
				,
				,
				,
				,
				"operation:resendSettings"));
	КонецЕсли;
	
	Элементы.ДекорацияПредупреждение.Заголовок = Новый ФорматированнаяСтрока(ЧастиСтрок);
	
КонецПроцедуры

&НаСервере
Функция ПараметрыВыбораОплаты(СпособОплаты)
	
	Возврат ОнлайнЗаказыСлужебный.ПараметрыВыбораОплаты(СпособОплаты);
	
КонецФункции

&НаКлиенте
Процедура ПриЗавершенииПодключенияИнтернетПоддержки(ДанныеАутентификации, ДопПараметры) Экспорт
	
	Если ДанныеАутентификации <> Неопределено Тогда
		НастроитьВнешнийВидСтраницы();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьПредставлениеЯндексПэй()
	
	Если ЧтениеНастроекПлатежныхСистемДоступно
		И ОбщегоНазначения.ПодсистемаСуществует("ИнтернетПоддержкаПользователей.ПлатежныеСистемы.ЯндексПэй") Тогда
		
		Элементы.ГруппаПодключениеЯндексПэй.Видимость = Истина;
		
		Если Не ЗначениеЗаполнено(НастройкаПодключенияКЯндексПэй) Тогда
			НастройкаПодключенияКЯндексПэй =
				ПредопределенноеЗначение("Справочник.НастройкиПодключенияКПлатежнымСистемам.ПустаяСсылка");
		КонецЕсли;
		
	Иначе
		Элементы.ГруппаПодключениеЯндексПэй.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

