#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Функция определяет организацию, кассу и валюту выбранного эквайрингового терминала.
//
// Параметры:
//  ЭквайринговыйТерминал - СправочникСсылка.ЭквайринговыеТерминалы - Ссылка на эквайринговый терминал
//
// Возвращаемое значение:
//	Структура - Организация, Касса и Валюта эквайрингового терминала
//
Функция ПолучитьРеквизитыЭквайринговогоТерминала(ЭквайринговыйТерминал) Экспорт
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЭквайринговыеТерминалы.Организация КАК Организация,
	|	ЭквайринговыеТерминалы.Касса КАК Касса
	|ИЗ
	|	Справочник.СпособыОплаты КАК ЭквайринговыеТерминалы
	|ГДЕ
	|	ЭквайринговыеТерминалы.Ссылка = &ЭквайринговыйТерминал
	|");
	
	Запрос.УстановитьПараметр("ЭквайринговыйТерминал", ЭквайринговыйТерминал);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Организация = Выборка.Организация;
		Касса = Выборка.Касса;
	Иначе
		Организация = Неопределено;
		Касса = Неопределено;
	КонецЕсли;
	
	СтруктураРеквизитов = Новый Структура("Организация, Касса",
		Организация,
		Касса);
	
	Возврат СтруктураРеквизитов;
	
КонецФункции // ПолучитьРеквизитыЭквайринговогоТерминала()

// Функция определяет эквайринговый терминал по выбранной кассе.
//
// Возвращает эквайринговый терминал, если найден один эквайринговый терминал.
// Возвращает Неопределено, если эквайринговый терминал не найден или эквайринговых терминалов больше одного.
//
// Параметры:
//  Организация - СправочникСсылка.Кассы (СправочникСсылка.КассыККМ) - Ссылка на кассу
//
// Возвращаемое значение:
//	СправочникСсылка.СпособыОплаты - Найденный эквайринговый терминал
//
Функция ПолучитьЭквайринговыйТерминалПоУмолчанию(Касса) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 2
	|	ЭквайринговыеТерминалы.Ссылка КАК ЭквайринговыйТерминал,
	|	ВЫБОР
	|		КОГДА ЭквайринговыеТерминалы.Ссылка = &ОсновнойЭквайринговыйТерминал
	|			ТОГДА 1
	|		ИНАЧЕ 2
	|	КОНЕЦ КАК Приоритет
	|ИЗ
	|	Справочник.СпособыОплаты КАК ЭквайринговыеТерминалы
	|ГДЕ
	|	ЭквайринговыеТерминалы.Касса = &Касса
	|	И ЭквайринговыеТерминалы.Тип = &ТипЭТ
	|	И НЕ ЭквайринговыеТерминалы.ПометкаУдаления
	|	И НЕ ЭквайринговыеТерминалы.Недействителен
	|УПОРЯДОЧИТЬ ПО
	|	Приоритет");
	
	Запрос.УстановитьПараметр("Касса", Касса);
	Запрос.УстановитьПараметр("ТипЭТ", Перечисления.ТипыСпособовОплат.Эквайринг);
	ОсновнойТерминал = ПерсональныеНастройкиРУНФ.Прочитать("ОсновнойЭквайринговыйТерминал");
	Запрос.УстановитьПараметр("ОсновнойЭквайринговыйТерминал", ОсновнойТерминал);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() = 1 Тогда
		Выборка.Следующий();
		ЭквайринговыйТерминал = Выборка.ЭквайринговыйТерминал;
	Иначе
		ЭквайринговыйТерминал = Неопределено;
		Пока Выборка.Следующий() Цикл
			Если Выборка.Приоритет = 1 Тогда
				ЭквайринговыйТерминал = Выборка.ЭквайринговыйТерминал;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат ЭквайринговыйТерминал;

КонецФункции // ПолучитьЭквайринговыйТерминалПоУмолчанию()

// Функция определяет эквайринговый терминал по выбранной кассе.
//
// Возвращает эквайринговый терминал, если найден один эквайринговый терминал.
// Возвращает Неопределено, если эквайринговый терминал не найден или эквайринговых терминалов больше одного.
//
// Параметры:
//  Организация - СправочникСсылка.Кассы (СправочникСсылка.КассыККМ) - Ссылка на кассу
//
// Возвращаемое значение:
//	СправочникСсылка.СпособыОплаты - Найденный эквайринговый терминал
//
Функция ПолучитьЭквайринговыйТерминалПоУмолчаниюДляОперацииЭквайринга(БанковскийСчет, Организация, Эквайрер = Неопределено) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 2
	|	ЭквайринговыеТерминалы.Ссылка КАК ЭквайринговыйТерминал,
	|	ВЫБОР
	|		КОГДА ЭквайринговыеТерминалы.Ссылка = &ОсновнойЭквайринговыйТерминал
	|			ТОГДА 1
	|		ИНАЧЕ 2
	|	КОНЕЦ КАК Приоритет
	|ИЗ
	|	Справочник.СпособыОплаты КАК ЭквайринговыеТерминалы
	|ГДЕ
	|	НЕ ЭквайринговыеТерминалы.ПометкаУдаления
	|	И ЭквайринговыеТерминалы.Тип = &ТипЭТ
	|	И (&БанковскийСчетЭквайринг = ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ПустаяСсылка)
	|			ИЛИ ЭквайринговыеТерминалы.БанковскийСчетЭквайринг = &БанковскийСчетЭквайринг)
	|	И (&Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ИЛИ ЭквайринговыеТерминалы.Организация = &Организация)
	|	И (&Эквайрер = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ИЛИ &Эквайрер = НЕОПРЕДЕЛЕНО
	|			ИЛИ ЭквайринговыеТерминалы.Эквайрер = &Эквайрер)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Приоритет");
	
	Запрос.УстановитьПараметр("БанковскийСчетЭквайринг", БанковскийСчет);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Эквайрер", Эквайрер);
	Запрос.УстановитьПараметр("ТипЭТ", Перечисления.ТипыСпособовОплат.Эквайринг);
	ОсновнойТерминал = ПерсональныеНастройкиРУНФ.Прочитать("ОсновнойЭквайринговыйТерминал");
	Запрос.УстановитьПараметр("ОсновнойЭквайринговыйТерминал", ОсновнойТерминал);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() = 1 Тогда
		Выборка.Следующий();
		ЭквайринговыйТерминал = Выборка.ЭквайринговыйТерминал;
	Иначе
		ЭквайринговыйТерминал = Неопределено;
		Пока Выборка.Следующий() Цикл
			Если Выборка.Приоритет = 1 Тогда
				ЭквайринговыйТерминал = Выборка.ЭквайринговыйТерминал;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат ЭквайринговыйТерминал;

КонецФункции // ПолучитьЭквайринговыйТерминалПоУмолчанию()

// Процедура получения списка видов платежных карт, обслуживаемых по договору эквайринга
//
// Параметры:
//  ЭквайринговыйТерминал - СправочникСсылка.ЭквайринговыеТерминалы - Ссылка на эквайринговый терминал
//
// Возвращаемое значение:
//	Массив - Массив видов платежных карт
//
Функция ВидыПлатежныхКарт(ЭквайринговыйТерминал) Экспорт
	
	МассивВидовПлатежныхКарт = Новый Массив;
	
	Если ЗначениеЗаполнено(ЭквайринговыйТерминал) Тогда
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВидыПлатежныхКарт.ВидПлатежнойКарты КАК ВидПлатежнойКарты
		|ИЗ
		|	Справочник.СпособыОплаты.ВидыПлатежныхКарт КАК ВидыПлатежныхКарт
		|ГДЕ
		|	ВидыПлатежныхКарт.Ссылка = &Ссылка");
		
		Запрос.УстановитьПараметр("Ссылка", ЭквайринговыйТерминал);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			МассивВидовПлатежныхКарт.Добавить(Выборка.ВидПлатежнойКарты);
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат МассивВидовПлатежныхКарт;
	
КонецФункции // ВидыПлатежныхКарт()

// Процедура получения списка видов платежных карт с процентами комиссий, обслуживаемых по договору эквайринга
//
// Параметры:
//  ЭквайринговыйТерминал - СправочникСсылка.СпособыОплаты - Ссылка на эквайринговый терминал
//  ПлатежнаяСистема - Неопределено, ПеречислениеСсылка.ТипыПлатежнойСистемыККТ - платежная система
//
// Возвращаемое значение:
//  ТаблицаЗначений - Таблица видов платежных карт с процентами комиссий:
//   * ВидПлатежнойКарты - Строка - вид платежной карты;
//   * ПроцентКомиссии - Число - процент комиссии;
//   * ПроцентКомиссииПриОтмене - Число - процент комиссии при отмене;
//   * ПроцентКомиссииПриВозврате - Число - процент комиссии при возврате.
//
Функция ВидыПлатежныхКартИПроцентыКомиссии(ЭквайринговыйТерминал, ПлатежнаяСистема = Неопределено) Экспорт
	
	ТаблицаВидовПлатежныхКартИПроцентовКомиссии = Новый ТаблицаЗначений;
	
	Если ЗначениеЗаполнено(ЭквайринговыйТерминал) Тогда
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВидыПлатежныхКарт.ВидПлатежнойКарты КАК ВидПлатежнойКарты,
		|	ВЫБОР
		|		КОГДА ВидыПлатежныхКарт.Ссылка.Договор.РасчетКомиссииВОтчетеЭквайера
		|			ТОГДА 0
		|		ИНАЧЕ ВидыПлатежныхКарт.ПроцентКомиссии
		|	КОНЕЦ КАК ПроцентКомиссии,
		|	ВЫБОР
		|		КОГДА ВидыПлатежныхКарт.Ссылка.Договор.РасчетКомиссииВОтчетеЭквайера
		|			ТОГДА 0
		|		ИНАЧЕ ВидыПлатежныхКарт.ПроцентКомиссииПриОтмене
		|	КОНЕЦ КАК ПроцентКомиссииПриОтмене,
		|	ВЫБОР
		|		КОГДА ВидыПлатежныхКарт.Ссылка.Договор.РасчетКомиссииВОтчетеЭквайера
		|			ТОГДА 0
		|		ИНАЧЕ ВидыПлатежныхКарт.ПроцентКомиссииПриВозврате
		|	КОНЕЦ КАК ПроцентКомиссииПриВозврате
		|ИЗ
		|	Справочник.СпособыОплаты.ВидыПлатежныхКарт КАК ВидыПлатежныхКарт
		|ГДЕ
		|	ВидыПлатежныхКарт.Ссылка = &Ссылка");
		
		Если ПлатежнаяСистема <> Неопределено Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВидыПлатежныхКарт.Ссылка = &Ссылка",
			"ВидыПлатежныхКарт.Ссылка = &Ссылка
			|	И ВидыПлатежныхКарт.ПлатежнаяСистема = &ПлатежнаяСистема");
			Запрос.УстановитьПараметр("ПлатежнаяСистема", ПлатежнаяСистема);
		КонецЕсли;
		
		Запрос.УстановитьПараметр("Ссылка", ЭквайринговыйТерминал);
		
		ТаблицаВидовПлатежныхКартИПроцентовКомиссии = Запрос.Выполнить().Выгрузить();
		
	КонецЕсли;
	
	Возврат ТаблицаВидовПлатежныхКартИПроцентовКомиссии;
	
КонецФункции // ВидыПлатежныхКарт()

Процедура ПометитьНаУдалениеТерминалыСДоговором(Договор) Экспорт
	
	НачатьТранзакцию();
	
	МассивТерминалов = ЭквайринговыеОперацииСервер.ПолучитьТерминалыПоДоговору(Договор);
	Для Каждого Терминал Из МассивТерминалов Цикл
		Если Не Терминал.ПометкаУдаления Тогда
			ТерминалОбъект = Терминал.ПолучитьОбъект();
			ТерминалОбъект.УстановитьПометкуУдаления(Истина);
		КонецЕсли;
	КонецЦикла;
	
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры

// Функция возвращает вид платежной карты по умолчанию
//
// Параметры:
//  ТипСпособаОплаты - ПеречислениеСсылка.ТипыСпособовОплат	 - Тип способа оплаты
// 
// Возвращаемое значение:
//  Строка - Вид платежной карты
//
Функция ВидПлатежнойКартыПоУмолчанию(ТипСпособаОплаты) Экспорт
	
	Если ТипСпособаОплаты = Перечисления.ТипыСпособовОплат.СБП Тогда
		ВидПлатежнойКарты = ИнтеграцияСПлатежнымиСистемамиУНФКлиентСервер.ВидПлатежнойКартыСБП();
	ИначеЕсли ТипСпособаОплаты = Перечисления.ТипыСпособовОплат.ЮKassa Тогда
		ВидПлатежнойКарты = ИнтеграцияСПлатежнымиСистемамиУНФКлиентСервер.ВидПлатежнойКартыЮКасса();
	ИначеЕсли ТипСпособаОплаты = Перечисления.ТипыСпособовОплат.ЯндексПэй Тогда
		ВидПлатежнойКарты = ИнтеграцияСПлатежнымиСистемамиУНФКлиентСервер.ВидПлатежнойКартыЯндексПэй();
	ИначеЕсли ТипСпособаОплаты = Перечисления.ТипыСпособовОплат.Кредит Тогда
		ВидПлатежнойКарты = ИнтеграцияСПлатежнымиСистемамиУНФКлиентСервер.ВидПлатежнойКартыКредит();
	Иначе
		ВидПлатежнойКарты = "";
	КонецЕсли;
	
	Возврат ВидПлатежнойКарты;
	
КонецФункции

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// Параметры:
//   Ограничение - см. УправлениеДоступомПереопределяемый.ПриЗаполненииОграниченияДоступа.Ограничение.
//
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)
	|	И( ЗначениеРазрешено(Касса)
	|	ИЛИ ЗначениеРазрешено(Касса)
	|	)И ЗначениеРазрешено(БанковскийСчетЭквайринг)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// СтандартныеПодсистемы.ЗапретРедактированияРеквизитовОбъектов

// Функция возвращает список имен «ключевых» реквизитов.
//
Функция ПолучитьБлокируемыеРеквизитыОбъекта() Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить("Тип");
	
	Возврат Результат;
	
КонецФункции

// Конец СтандартныеПодсистемы.ЗапретРедактированияРеквизитовОбъектов

#КонецОбласти

Функция ДанныеКонтрагентаПлатформаЦифровогоРубля(Создавать = Ложь) Экспорт
	
	Результат = Новый Структура("Ссылка", Неопределено);
	
	ДанныеЦБ = ЦифровойРубль.РеквизитыОператораПлатформыЦифровогоРубля();
	ДанныеЦБ.Вставить("НаименованиеПолное", ДанныеЦБ.Наименование);
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Контрагенты.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Справочник.Контрагенты КАК Контрагенты
	                      |ГДЕ
	                      |	Контрагенты.ИНН = &ИНН
	                      |	И Контрагенты.КПП = &КПП
	                      |	И НЕ Контрагенты.ПометкаУдаления");
	
	Запрос.УстановитьПараметр("ИНН", ДанныеЦБ.ИНН);
	Запрос.УстановитьПараметр("КПП", ДанныеЦБ.КПП);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Результат.Ссылка = Выборка.Ссылка;
	Иначе	
		Если Создавать Тогда
			УстановитьПривилегированныйРежим(Истина);
			ДанныеЦБ.Вставить("ПрочиеОтношения", Истина);
			КонтрагентЦБ = Справочники.Контрагенты.СоздатьКонтрагента(ДанныеЦБ);
			УстановитьПривилегированныйРежим(Ложь);
			Результат.Ссылка = КонтрагентЦБ;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ДоговорКонтрагентаПлатформаЦифровогоРубля(Организация, Контрагент, Создавать = Ложь) Экспорт
	
	Результат = Неопределено;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ДоговорыКонтрагентов.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	                      |ГДЕ
	                      |	ДоговорыКонтрагентов.Владелец = &Владелец
	                      |	И ДоговорыКонтрагентов.Организация = &Организация
	                      |	И ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора
	                      |	И ДоговорыКонтрагентов.ЭтоДоговорЭквайринга
	                      |	И НЕ ДоговорыКонтрагентов.ПометкаУдаления");
	
	Запрос.УстановитьПараметр("Владелец", Контрагент);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ВидДоговора", Перечисления.ВидыДоговоров.Прочее);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Результат = Выборка.Ссылка;
	Иначе	
		Если Создавать Тогда
			УстановитьПривилегированныйРежим(Истина);
			ДоговорПоУмолчанию = Справочники.ДоговорыКонтрагентов.ПоКонтрагентуПоОрганизации(
				Контрагент, Организация, Перечисления.ВидыДоговоров.Прочее);
				
			Если ЗначениеЗаполнено(ДоговорПоУмолчанию) Тогда
				Договор = ДоговорПоУмолчанию.ПолучитьОбъект();
			Иначе
				Договор = Справочники.ДоговорыКонтрагентов.СоздатьЭлемент();
				Договор.Наименование = НСтр("ru = 'Основной договор'");
				Договор.Владелец = Контрагент;
				Договор.Организация = Организация;
				Договор.ВалютаРасчетов = УправлениеНебольшойФирмойПовтИсп.ПолучитьНациональнуюВалюту();
				Договор.ВидДоговора = Перечисления.ВидыДоговоров.Прочее;
				Договор.СпособЗачетаПредоплатыПоУмолчанию = Контрагент.СпособЗачетаПредоплатыПоУмолчанию;
				Договор.СпособРазнесенияОплатыПоУмолчанию = Контрагент.СпособРазнесенияОплатыПоУмолчанию;
			КонецЕсли;
				
			Договор.ЭтоДоговорЭквайринга = Истина;
			Договор.КонтрольВзаиморасчетовЭквайринг = Истина;
			Договор.Записать();
			УстановитьПривилегированныйРежим(Ложь);
			Результат = Договор.Ссылка;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СпособыОплатыПоДоговоруИТипуОплаты(Организация, Контрагент, Договор, ТипОплаты) Экспорт
	
	ВидОплаты = Справочники.СпособыОплаты.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Контрагент",	 Контрагент);
	Запрос.УстановитьПараметр("Договор",	 Договор);
	Запрос.УстановитьПараметр("ТипОплаты",	 ТипОплаты);
	
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	СпособыОплаты.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.СпособыОплаты КАК СпособыОплаты
	|ГДЕ
	|	СпособыОплаты.Организация = &Организация
	|	И СпособыОплаты.Эквайрер = &Контрагент
	|	И СпособыОплаты.Договор = &Договор
	|	И СпособыОплаты.Тип = &ТипОплаты
	|	И НЕ СпособыОплаты.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка УБЫВ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ВидОплаты = Выборка.Ссылка;
	КонецЕсли;
	
	Возврат ВидОплаты;
	
КонецФункции

Функция СпособыОплатыЦР(Организация) Экспорт
	
	ВидОплаты = Справочники.СпособыОплаты.ПустаяСсылка();
	
	ДанныеБанка = ДанныеКонтрагентаПлатформаЦифровогоРубля();
	
	Контрагент = ДанныеБанка.Ссылка;
	ДоговорКонтрагента = Неопределено;
	
	Если ЗначениеЗаполнено(Контрагент) Тогда
		Договор = ДоговорКонтрагентаПлатформаЦифровогоРубля(Организация, Контрагент);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Договор) Тогда
		Тип = Перечисления.ТипыСпособовОплат.ЦифровойРубль;
		ВидОплаты = СпособыОплатыПоДоговоруИТипуОплаты(Организация, Контрагент, Договор, Тип);
	КонецЕсли;
	
	Возврат ВидОплаты;
	
КонецФункции

#КонецОбласти

#КонецЕсли
