///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2026, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

///////////////////////////////////////////////////////////////////////////////////////////////////////
// Подсистема "ИнтернетПоддержкаПользователей.ПлатежныеСистемы.ЯндексПэй".
// ОбщийМодуль.ЯндексПэйСлужебный.
//
// Серверные процедуры работы с платежной системой Яндекс Пэй:
//  - описание сервиса для формы настройки подключения;
//  - выполнение оплаты и возвратов оплаты;
//  - получение списка кассовых ссылок
//  - активация и деактивация кассовой ссылки;
//  - заполнение заказа на оплату для подсистемы Онлайн-Заказы;
//  - получение актуальной корзины.
// 
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

#Область НастройкиПодключения

// Формирует декларативное описание реквизитов аутентификации в сервисах Яндекс Пэй.
//
// Возвращаемое значение:
//  Массив из см. ПлатежныеСистемыСлужебный.НовыйОписаниеРеквизитов
//
Функция РеквизитыНастройкиАутентификации() Экспорт
	
	Результат = Новый Массив();	// Массив из см. ПлатежныеСистемыСлужебный.НовыйОписаниеРеквизитов
	
	// Токен
	ОписаниеРеквизита = ПлатежныеСистемыСлужебный.НовыйОписаниеРеквизитов(
		"Токен",
		НСтр("ru = 'Токен пользователя (User-Token)'"),
		ОбщегоНазначения.ОписаниеТипаСтрока(100));
	ОписаниеРеквизита.РежимПароля = Истина;
	ОписаниеРеквизита.Подсказка = НСтр("ru = 'Токен пользователя из личного кабинета'");
	ОписаниеРеквизита.ПроверкаЗаполнения = Истина;
	
	Результат.Добавить(ОписаниеРеквизита);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ОписаниеПодсистемы

// Получает данные подсказки для платежной системе из сервиса.
//
// Параметры:
//  ОписанияПлатежныхСистем - см. ПлатежныеСистемыСервис.ОписанияПлатежныхСистем
// 
// Возвращаемое значение:
//  см. ПлатежныеСистемыСлужебный.ПодсказкиПлатежнойСистемы
//
Функция ПодсказкиПлатежнойСистемы(ОписанияПлатежныхСистем) Экспорт
	
	Результат = ПлатежныеСистемыСлужебный.НовыйРезультатОперации();
	Результат.Вставить("Описание", "");
	Результат.Вставить("Подключение", "");
	
	ОписаниеСистемы = ОписанияПлатежныхСистем.Получить(Перечисления.ПлатежныеСервисы.ЯндексПэй);
	Если ОписаниеСистемы = Неопределено Тогда
		ОписаниеСистемы = ОписаниеПоУмолчанию();
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(Результат, ОписаниеСистемы);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ПрикладныеОперации

// См. ПлатежныеСистемы.АктивироватьКассовуюСсылку
//
Функция АктивироватьКассовуюСсылку(
		НастройкаПодключения,
		ПараметрыКассовойСсылки,
		ДокументОперации,
		ДополнительныеПараметры = Неопределено) Экспорт
	
	// Подготовка данных для отправки на портал
	ДанныеЗаказа = ДанныеЗаказаНаОплату(
		ДокументОперации,
		НастройкаПодключения,
		ДополнительныеПараметры);
	
	ТекстОшибки = НСтр("ru = 'Не удалось активировать кассовую ссылку.'");
	
	ПроверкаЗаказа = ПроверитьДанныеЗаказа(ДанныеЗаказа.ЗаказНаОплату, ТекстОшибки);
	
	Если Не ПустаяСтрока(ПроверкаЗаказа.КодОшибки) Тогда
		ПроверкаЗаказа.Вставить("ПлатежнаяСсылка", "");
		ПроверкаЗаказа.Вставить("ИдентификаторОперации", "");
		Возврат ПроверкаЗаказа;
	КонецЕсли;
	
	// Записываем в регистр только если это не тестовая активация ссылки.
	ВнутреннийИдентификатор = ОпределитьИдентификаторЗаказаНаОплату(
		ДокументОперации,
		НастройкаПодключения,
		ПараметрыКассовойСсылки.КлючСсылки,
		ДанныеЗаказа.ЗаказНаОплату.Сумма);

	Если ЗначениеЗаполнено(ВнутреннийИдентификатор.КодОшибки) Тогда
		Результат = ПлатежныеСистемыСлужебный.НовыйРезультатОперации();
		Результат.Вставить("ПлатежнаяСсылка", "");
		Результат.Вставить("ИдентификаторОперации", "");
		ЗаполнитьЗначенияСвойств(Результат, ВнутреннийИдентификатор);
		Возврат Результат;
	КонецЕсли;
	
	ДанныеЗаказа.Идентификатор = ВнутреннийИдентификатор.Идентификатор;
	
	Результат = ЯндексПэйСервис.АктивироватьКассовуюСсылку(
		НастройкаПодключения,
		ПараметрыКассовойСсылки.КлючСсылки,
		ДанныеЗаказа);
	
	Если ЗначениеЗаполнено(Результат.КодОшибки) Тогда
		ПлатежныеСистемыСлужебный.ЗаписатьОшибкуВРегистр(
			ДокументОперации,
			Результат.КодОшибки);
		Возврат Результат;
	КонецЕсли;
	
	// Сохраняем sale-token
	ОбновляемыеДанные = ПлатежныеСистемыСлужебный.НовыйОбновляемыеДанныеОперации();
	ОбновляемыеДанные.ИдентификаторОперации = Результат.ИдентификаторОперации;
	ОбновляемыеДанные.СтатусОперации = НастройкиПлатежныхСистемКлиентСервер.СтатусОперацииВыполняется();
	ОбновляемыеДанные.ПлатежнаяСсылка = Результат.ПлатежнаяСсылка;
	ОбновляемыеДанные.СуммаОперации = ДанныеЗаказа.ЗаказНаОплату.Сумма;
	ОбновляемыеДанные.ДатаДействияСсылки =
		ТекущаяДатаСеанса()
		+ ДанныеЗаказа.ЗаказНаОплату.ВремяДействияСсылки
		+ 15;
	
	РегистрыСведений.ИдентификаторыПлатежныхСистем.ЗаписатьДанныеОперации(
		ДокументОперации,
		ОбновляемыеДанные);
	
	Возврат Результат;
	
КонецФункции

// См. ПлатежныеСистемы.ДинамическаяСсылка
//
Функция ДинамическаяСсылка(
		ДокументОперации,
		НастройкаПодключения,
		ДополнительныеПараметры = Неопределено) Экспорт
	
	Результат = ПлатежныеСистемыСлужебный.НовыйРезультатОперации();
	Результат.Вставить("ПлатежнаяСсылка", "");
	Результат.Вставить("ИдентификаторОперации", "");
	
	// Подготовка данных для отправки на портал
	ДанныеЗаказа = ДанныеЗаказаНаОплату(
		ДокументОперации,
		НастройкаПодключения,
		ДополнительныеПараметры);
	
	ТекстОшибки = НСтр("ru = 'Не удалось получить платежную ссылку.'");
	
	ПроверкаЗаказа = ПроверитьДанныеЗаказа(ДанныеЗаказа.ЗаказНаОплату, ТекстОшибки);
	
	Если Не ПустаяСтрока(ПроверкаЗаказа.КодОшибки) Тогда
		ЗаполнитьЗначенияСвойств(Результат, ПроверкаЗаказа);
		Возврат Результат;
	КонецЕсли;
	
	ВнутреннийИдентификатор = ОпределитьИдентификаторЗаказаНаОплату(
		ДокументОперации,
		НастройкаПодключения,
		"",
		ДанныеЗаказа.ЗаказНаОплату.Сумма);

	Если ЗначениеЗаполнено(ВнутреннийИдентификатор.КодОшибки) Тогда
		ЗаполнитьЗначенияСвойств(Результат, ВнутреннийИдентификатор);
		Возврат Результат;
	КонецЕсли;
	
	ДанныеЗаказа.Идентификатор = ВнутреннийИдентификатор.Идентификатор;
	
	РезультатОперации = ЯндексПэйСервис.ДинамическаяСсылка(
		НастройкаПодключения,
		ДанныеЗаказа);
		
	Если ЗначениеЗаполнено(РезультатОперации.КодОшибки) Тогда
		ПлатежныеСистемыСлужебный.ЗаписатьОшибкуВРегистр(
			ДокументОперации,
			РезультатОперации.КодОшибки);
		Возврат РезультатОперации;
	КонецЕсли;
	
	ОбновляемыеДанные = ПлатежныеСистемыСлужебный.НовыйОбновляемыеДанныеОперации();
	ОбновляемыеДанные.ИдентификаторОперации = РезультатОперации.ИдентификаторОперации;
	ОбновляемыеДанные.СтатусОперации = НастройкиПлатежныхСистемКлиентСервер.СтатусОперацииВыполняется();
	ОбновляемыеДанные.ПлатежнаяСсылка = РезультатОперации.ПлатежнаяСсылка;
	ОбновляемыеДанные.СуммаОперации = ДанныеЗаказа.ЗаказНаОплату.Сумма;
	ОбновляемыеДанные.ДатаДействияСсылки =
		ТекущаяДатаСеанса()
		+ ДанныеЗаказа.ЗаказНаОплату.ВремяДействияСсылки
		+ 15;
	
	РегистрыСведений.ИдентификаторыПлатежныхСистем.ЗаписатьДанныеОперации(
		ДокументОперации,
		ОбновляемыеДанные);
	
	Возврат РезультатОперации;
	
КонецФункции

// Выполняет отключение динамической ссылки.
// Считается, что платежная ссылка успешно отключена, если КодОшибки содержит пустую строку.
// 
// Параметры:
//  ДокументОплаты - ОпределяемыйТип.ДокументОперацииПлатежнойСистемы - документ, отражающий операцию оплаты.
//  ДанныеОперации - см. ПлатежныеСистемы.ДанныеОперации
//  
// Возвращаемое значение:
//  см. ПлатежныеСистемыСлужебный.НовыйРезультатОперации.
// 
Функция ОтменитьДинамическуюСсылку(ДокументОплаты, ДанныеОперации) Экспорт
	
	Результат = ПлатежныеСистемыСлужебный.НовыйРезультатОперации();
	
	Если Не ЗначениеЗаполнено(ДанныеОперации.ИдентификаторОперации) Тогда
		
		// Если банк не смог создать операцию, то у записи регистра будет пустое поле
		// ИдентификаторОперации. Если выполняется запрос на отмену такой операции, то
		// нет смысла выполнять дополнительные проверки, просто устанавливаем нужный статус.
		ОбновляемыеДанные = ПлатежныеСистемыСлужебный.НовыйОбновляемыеДанныеОперации();
		ОбновляемыеДанные.СтатусОперации = НастройкиПлатежныхСистемКлиентСервер.СтатусОперацииОтменена();
		РегистрыСведений.ИдентификаторыПлатежныхСистем.ЗаписатьДанныеОперации(
			ДокументОплаты,
			ОбновляемыеДанные);
		
		Возврат Результат;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеОперации.СтатусОперации)
		И ДанныеОперации.СтатусОперации <> НастройкиПлатежныхСистемКлиентСервер.СтатусОперацииВыполняется() Тогда
		
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Отмена платежной ссылки доступна только для операций в статусе ""Выполняется"",
			|""Отменена"", ""Отказ"" либо если статус операции неизвестен.
			|Текущий статус операции: %1'"),
			ДанныеОперации.СтатусОперации);
		Результат.КодОшибки = НастройкиПлатежныхСистемСлужебный.КодОшибкиНеверныйФорматЗапроса();
		Результат.СообщениеОбОшибке = ТекстОшибки;
		Результат.ИнформацияОбОшибке = ТекстОшибки;
		Возврат Результат;
		
	КонецЕсли;
	
	РезультатПроверки = ПлатежныеСистемы.СтатусОперации(ДокументОплаты, 3);
	
	Если ЗначениеЗаполнено(РезультатПроверки.КодОшибки) Тогда
		
		// Ошибка при обновлении статуса.
		Результат.КодОшибки = НастройкиПлатежныхСистемСлужебный.КодОшибкиНеизвестнаяОшибка();
		ТекстОшибки = НСтр("ru = 'Не удалось отменить операцию.
			|Не удалось получить актуальный статус операции.
			|Подробности см. в журнале регистрации.'");
		Результат.СообщениеОбОшибке = ТекстОшибки;
		Результат.ИнформацияОбОшибке = ТекстОшибки;
		
	ИначеЕсли ЗначениеЗаполнено(РезультатПроверки.СтатусОперации)
		И РезультатПроверки.СтатусОперации <> НастройкиПлатежныхСистемКлиентСервер.СтатусОперацииВыполняется() Тогда
		
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Изменился статус операции. Отмена невозможна.
			|Текущий статус операции: %1'"),
			РезультатПроверки.СтатусОперации);
		Результат.КодОшибки = НастройкиПлатежныхСистемСлужебный.КодОшибкиНеверныйФорматЗапроса();
		Результат.СообщениеОбОшибке = ТекстОшибки;
		Результат.ИнформацияОбОшибке = ТекстОшибки;
		Возврат Результат;
		
	КонецЕсли;
	
	// Ветка обработки статуса пусто либо Выполняется.
	РезультатОперации = ЯндексПэйСервис.ОтменитьДинамическуюСсылку(
		ДанныеОперации.НастройкаПодключения,
		ДанныеОперации.ИдентификаторОперации);
	
	Если ЗначениеЗаполнено(РезультатОперации.КодОшибки) Тогда
		Возврат РезультатОперации;
	КонецЕсли;
	
	ОбновляемыеДанные = ПлатежныеСистемыСлужебный.НовыйОбновляемыеДанныеОперации();
	ОбновляемыеДанные.СтатусОперации = НастройкиПлатежныхСистемКлиентСервер.СтатусОперацииОтменена();
	РегистрыСведений.ИдентификаторыПлатежныхСистем.ЗаписатьДанныеОперации(
		ДокументОплаты,
		ОбновляемыеДанные);
			
	Возврат Результат;
	
КонецФункции

// См. ПлатежныеСистемы.ВозвратОплаты
// 
Функция ВозвратОплаты(
		ДокументВозврата,
		ДокументОплаты,
		НастройкаПодключения,
		ДополнительныеПараметры) Экспорт
	
	Результат = ПлатежныеСистемыСлужебный.НовыйРезультатСтатусОперации();
	СписокСвойствОшибки = "КодОшибки,СообщениеОбОшибке,ИнформацияОбОшибке";
	
	// Подготовка данных для отправки на портал
	ДанныеЗаказа = ДанныеЗаказаНаВозврат(
		ДокументВозврата,
		ДокументОплаты,
		НастройкаПодключения,
		ДополнительныеПараметры);
	
	ТекстОшибки = НСтр("ru = 'Не удалось выполнить возврат.'");
	
	ПроверкаЗаказа = ПроверитьДанныеЗаказа(
		ДанныеЗаказа.ЗаказНаВозврат,
		ТекстОшибки,
		Истина);
	Если Не ПустаяСтрока(ПроверкаЗаказа.КодОшибки) Тогда
		ЗаполнитьЗначенияСвойств(Результат, ПроверкаЗаказа, СписокСвойствОшибки);
		Возврат Результат;
	КонецЕсли;
	
	ВнутреннийИдентификатор = ОпределитьИдентификаторЗаказаНаВозврат(
		ДокументВозврата,
		ДокументОплаты,
		НастройкаПодключения,
		ДанныеЗаказа);

	Если ЗначениеЗаполнено(ВнутреннийИдентификатор.КодОшибки) Тогда
		ЗаполнитьЗначенияСвойств(Результат, ВнутреннийИдентификатор);
		Возврат Результат;
	КонецЕсли;
	
	Если ВнутреннийИдентификатор.ОперацияВыполнена Тогда
		Результат.СтатусОперации = НастройкиПлатежныхСистемКлиентСервер.СтатусОперацииВыполнена();
		Результат.ПараметрыОперации.ДатаОперации = ВнутреннийИдентификатор.ДанныеОперации.ДатаОперации;
		Результат.ПараметрыОперации.ИдентификаторОперации = ВнутреннийИдентификатор.ДанныеОперации.Идентификатор;
		Результат.ПараметрыОперации.ИдентификаторОплаты = ВнутреннийИдентификатор.ДанныеОперации.ИдентификаторОплаты;
		Результат.ПараметрыОперации.СуммаОперации = ВнутреннийИдентификатор.ДанныеОперации.СуммаОперации;
		Результат.ПараметрыОперации.ТипОперации = ВнутреннийИдентификатор.ДанныеОперации.ТипОперации;
		Возврат Результат;
	КонецЕсли;
		
	ДанныеЗаказа.Идентификатор = ВнутреннийИдентификатор.Идентификатор;
	ДанныеЗаказа.ИдентификаторОплаты = ВнутреннийИдентификатор.ИдентификаторОплаты;
	
	Если ДанныеЗаказа.КодОшибки = НастройкиПлатежныхСистемСлужебный.КодОшибкиОперацияВыполняется()
		Или ДанныеЗаказа.КодОшибки = НастройкиПлатежныхСистемСлужебный.КодОшибкиОперацияВыполнена() Тогда
		
		ДанныеОперации = ПлатежныеСистемыСлужебный.ДанныеОперации(ДокументВозврата);
		
		Результат.СтатусОперации = ДанныеОперации.СтатусОперации;
		Результат.ПараметрыОперации.ИдентификаторОперации = ДанныеОперации.ИдентификаторОперации;
		Результат.ПараметрыОперации.ИдентификаторОплаты = ДанныеОперации.ИдентификаторОплаты;
		Результат.ПараметрыОперации.ТипОперации = ПлатежныеСистемыКлиентСервер.ТипОперацииВозврат();
		Результат.ПараметрыОперации.ДатаОперации = ДанныеОперации.ДатаОперации;
		Результат.ПараметрыОперации.СуммаОперации = ДанныеОперации.СуммаОперации;
		
		Возврат Результат;
		
	ИначеЕсли Не ПустаяСтрока(ДанныеЗаказа.КодОшибки) Тогда
		ЗаполнитьЗначенияСвойств(Результат, ДанныеЗаказа, СписокСвойствОшибки);
		Возврат Результат;
	КонецЕсли;
	
	РезультатВозврата = ЯндексПэйСервис.ВозвратОплаты(
		ДанныеЗаказа,
		НастройкаПодключения);
	Если ПустаяСтрока(РезультатВозврата.КодОшибки) Тогда
		
		ЗаполнитьЗначенияСвойств(
			Результат,
			РезультатВозврата,
			"СтатусОперации");
		ЗаполнитьЗначенияСвойств(
			Результат.ПараметрыОперации,
			РезультатВозврата.ПараметрыОперации);
		
		ДанныеОперации = ПлатежныеСистемыСлужебный.НовыйОбновляемыеДанныеОперации();
		ДанныеОперации.СтатусОперации = Результат.СтатусОперации;
		ДанныеОперации.ИдентификаторОперации = Результат.ПараметрыОперации.ИдентификаторОперации;
		ДанныеОперации.ДатаОперации = Результат.ПараметрыОперации.ДатаОперации;
		ДанныеОперации.СуммаОперации = Результат.ПараметрыОперации.СуммаОперации;
		
		РегистрыСведений.ИдентификаторыПлатежныхСистем.ЗаписатьДанныеОперации(ДокументВозврата, ДанныеОперации);
		
	Иначе
		ПлатежныеСистемыСлужебный.ЗаписатьОшибкуВРегистр(
			ДокументВозврата,
			РезультатВозврата.КодОшибки);
		ЗаполнитьЗначенияСвойств(
			Результат,
			РезультатВозврата,
			СписокСвойствОшибки);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ОнлайнЗаказы

// Выполняет подготовку параметров оплаты заказа для записи в соответствующие подсистемы.
//
// Параметры:
//  ДанныеЗаказа - Структура - Содержит данные заказа:
//    * ИдентификаторЗаказа - Строка - Идентификатор онлайн-заказа;
//    * Статус - Строка - Статус онлайн-заказа;
//    * СуммаЗаказа - Число - Сумма онлайн-заказа;
//    * СпособОплаты - ПеречислениеСсылка.СпособыОплатыОнлайнЗаказов - Способ оплаты онлайн-заказа;
//    * ДатаОплаты - Дата - дата получения данных об оплате сервисом;
//    * КонтрольнаяСумма - Строка - Значение контрольной суммы заказа;
//    * ВерсияКонтрольнойСуммы - Число - Версия расчета контрольной суммы заказа;
//    * ОплатаСБП - Структура, Неопределено - Содержит данные операции СБП, в том случае когда
//      значение Свойства СпособОплаты = Перечисления.СпособыОплатыОнлайнЗаказов.СБПc2b:
//       ** Идентификатор - Строка - идентификатор операции;
//       ** ИдентификаторОплаты - Строка - идентификатор оплаты в СБП;
//       ** ИдентификаторПлатежнойСистемы - Строка - идентификатор оплаты в Системе быстрых платежей;
//       ** ДатаОперации - Дата - фактическая дата оплаты в UTC;
//       ** ИдентификаторМерчанта - Строка - идентификатор мерчанта в Системе быстрых платежей;
//       ** НазначениеПлатежа - Строка - назначение платежа;
//    * ОплатаИнтернетЭквайринг - Структура, Неопределено - Содержит данные операции, в том случае когда
//      значение свойства СпособОплаты = Перечисления.СпособыОплатыОнлайнЗаказов.ИнтернетЭквайринг:
//       ** Идентификатор - Строка - идентификатор операции;
//       ** ИдентификаторОплаты - Строка - идентификатор операции оплаты;
//       ** ИдентификаторОперации - Строка - идентификатор текущей операции;
//       ** ДатаОперации - Дата - фактическая дата оплаты в UTC;
//       ** ИдентификаторМерчанта - Строка - идентификатор мерчанта;
//       ** НазначениеПлатежа - Строка - назначение платежа;
//    * ОплатаОзонПэй - Структура, Неопределено - Содержит данные операции, в том случае когда
//        значение Свойства СпособОплаты = Перечисления.СпособыОплатыОнлайнЗаказов.ОзонПэй:
//       ** Идентификатор - Строка - идентификатор операции;
//       ** ИдентификаторОплаты - Строка - идентификатор операции оплаты;
//       ** ИдентификаторОперации - Строка - идентификатор текущей операции;
//       ** ДатаОперации - Дата - фактическая дата оплаты в UTC;
//       ** СпособОплаты - Строка - способ оплаты. Доступные значения определяются методами
//            общего модуля ПлатежныеСистемыКлиентСервер.
//    * ОплатаЯндексПэй - Структура, Неопределено - Содержит данные операции оплаты, в том случае когда
//        значение Свойства СпособОплаты = Перечисления.СпособыОплатыОнлайнЗаказов.ЯндексПэй:
//       ** ИдентификаторОплаты - Строка - идентификатор операции оплаты;
//       ** ИдентификаторОперации - Строка - идентификатор текущей операции;
//       ** ДатаОперации - Дата - фактическая дата оплаты в UTC.
//  НастройкаПодключения - СправочникСсылка.НастройкиПодключенияКПлатежнымСистемам, Неопределено - Настройка
//    подключения указанная в настройке страницы онлайн-заказов, Неопределено в том случае, если настройка не
//    определена.
//  ПараметрыОплаты - Соответствие Из КлючИЗначение - Содержит параметры оплат в разрезе ее способов.
//
Процедура ЗаполнитьПараметрыОплаты(
	ДанныеЗаказа,
	НастройкаПодключения,
	ПараметрыОплаты) Экспорт
	
	ПараметрыОплатыЯндексПэй = ЗаполнитьПараметрыОперации(
		ДанныеЗаказа.ОплатаЯндексПэй,
		ДанныеЗаказа.СуммаЗаказа,
		НастройкиПлатежныхСистемКлиентСервер.СтатусОперацииВыполнена(),
		НастройкаПодключения);
	
	ПараметрыОплаты.Вставить(
		"ЯндексПэй",
		ПараметрыОплатыЯндексПэй);
	
КонецПроцедуры

// Возвращает данные оплат по документам платежей.
//
// Параметры:
//  ДокументыОпераций - Массив Из ОпределяемыйТип.ДокументОперацииПлатежнойСистемы - документы операций.
//
// Возвращаемое значение:
//  Соответствие Из КлючИЗначение - данные оплат по документам:
//   * Ключ - ОпределяемыйТип.ДокументОперацииПлатежнойСистемы - документ операции.
//   * Значение - см. ЗаполнитьПараметрыОперации
//              - Неопределено - если для документа операции не удалось найти данные.
//
Функция ДанныеОпераций(ДокументыОпераций) Экспорт
	
	ДанныеОпераций = ПлатежныеСистемыСлужебный.ДанныеОпераций(ДокументыОпераций);
	
	Результат = Новый Соответствие;
	
	Выборка = ДанныеОпераций.Выбрать();
	
	Для Каждого ДокументОперации Из ДокументыОпераций Цикл
	
		Если Выборка.НайтиСледующий(Новый Структура("ДокументОперации", ДокументОперации)) = Ложь Тогда

			Результат.Вставить(
				ДокументОперации,
				Неопределено);
		Иначе
			
			ПараметрыОперации = ЗаполнитьПараметрыОперации(
				Выборка,
				Выборка.СуммаОперации,
				Выборка.СтатусОперации,
				Выборка.НастройкаПодключения);
			
			Результат.Вставить(
				ДокументОперации,
				ПараметрыОперации);
				
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Проверяет правильно заполнения строки корзины при формировании заказа в подсистеме Онлайн-заказы.
// 
// Параметры:
//  СтрокаКорзины - СтрокаТаблицыЗначений - строка таблицы товаров.
// 
// Возвращаемое значение:
//  Строка - описание ошибки. Если ошибок нет, то возвращается пустая строка.
// 
Функция ОшибкаСтрокиКорзиныОнлайнЗаказы(СтрокаКорзины) Экспорт
	
	Возврат ОшибкиСтрокиКорзины(
		СтрокаКорзины.ИдентификаторСтроки,
		СтрокаКорзины.Количество,
		0,
		СтрокаКорзины.СуммаСоСкидкой,
		СтрокаКорзины.Наименование,
		"");
	
КонецФункции

// Проверяет правильно заполнения общей суммы товаров в корзине при использовании в
//  сторонних подсистемах.
// 
// Параметры:
//  СуммаКорзины - Число - Общая сумма товаров.
// 
// Возвращаемое значение:
//  Строка - описание ошибки. Если ошибок нет, то возвращается пустая строка.
// 
Функция ОшибкаСуммаКорзиныВнешний(СуммаКорзины) Экспорт
	
	Возврат ОшибкаСуммаКорзины(СуммаКорзины);
	
КонецФункции

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

// Возвращает служебный идентификатор для обозначения работы с кассовой ссылкой.
// 
// Возвращаемое значение:
//  Строка - тип ссылки.
//  
Функция ТипСсылкиДинамическая() Экспорт
	
	Возврат "Динамическая";
	
КонецФункции

// Преобразует идентификатор операции из формата Яндекс Пэй во внутренний формат.
// 
// Параметры:
//  ИдентификаторОплаты - Строка - идентификатор в формате Яндекс Пэй.
//  ТипОперации - Строка - тип операции, в результате которой получен идентификатор - Кассовая или 
//    Динамическая ссылка.
//
// Возвращаемое значение:
//  Строка - результат преобразования.
//    
Функция КодироватьИдентификаторОплаты(
		ИдентификаторОплаты,
		ТипОперации) Экспорт
	
	Если ТипОперации = ТипСсылкиДинамическая() Тогда
		ТипСсылки = "d";
	ИначеЕсли ТипОперации = ТипСсылкиКассовая() Тогда
		ТипСсылки = "s";
	Иначе
		ТипСсылки = ТипОперации;
	КонецЕсли;
	
	Результат = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'YaPay|%1|%2'"),
		ТипСсылки,
		ИдентификаторОплаты);
		
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбщегоНазначения

// Возвращает служебный идентификатор для обозначения работы с кассовой ссылкой.
// 
// Возвращаемое значение:
//  Строка - тип ссылки.
//  
Функция ТипСсылкиКассовая() Экспорт
	
	Возврат "Кассовая";
	
КонецФункции

// Декодирует идентификатор операции из внутреннего формата в формат Яндекс Пэй.
// 
// Параметры:
//  ИдентификаторОплаты - Строка - идентификатор во внутреннем формате.
//  ТекстОшибки - Строка - первая строка сообщения об ошибке.
//  ОжидаемыйТипОперации - Строка - если тип операции после декодирования будет отличатся от указанного,
//    то возникнет ошибка.
//
// Возвращаемое значение:
//  Структура:
//    * КодОшибки - Строка - строковый код возникшей ошибки, который может быть обработан вызывающим методом.
//    * СообщениеОбОшибке - Строка, ФорматированнаяСтрока - сообщение об ошибке для пользователя.
//    * ИнформацияОбОшибке - Строка, ФорматированнаяСтрока - сообщение об ошибке для администратора.
//    * ТипОперации - Строка - тип операции, полученный из идентификатора.
//    * ИдентификаторОплаты - Строка - идентификатор оплаты в формате Яндекс Пэй.
//    
Функция ДекодироватьИдентификаторОплаты(
		ИдентификаторОплаты,
		ТекстОшибки,
		ОжидаемыйТипОперации = "") Экспорт
	
	Результат = ПлатежныеСистемыСлужебный.НовыйРезультатОперации();
	Результат.Вставить("ТипОперации", "");
	Результат.Вставить("ИдентификаторОплаты", "");
		
	Результат.КодОшибки = НастройкиПлатежныхСистемСлужебный.КодОшибкиНеверныйФорматЗапроса();
	Результат.СообщениеОбОшибке = НСтр("ru = 'Идентификатор оплаты имеет ошибочный формат.'");
	Результат.ИнформацияОбОшибке = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = '%1
				|
				|Идентификатор оплаты имеет ошибочный формат.
				|
				|Техническая информация об ошибке:
				|Платежная система: Яндекс Пэй
				|Переданный идентификатор: %2'"),
		ТекстОшибки,
		ИдентификаторОплаты);
		
	ЧастиИдентификатора = СтрРазделить(ИдентификаторОплаты, "|");
	Если ЧастиИдентификатора.Количество() < 3 Тогда
		Возврат Результат;
	КонецЕсли;
	
	Если ЧастиИдентификатора[0] <> "YaPay" Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат.ТипОперации = ЧастиИдентификатора[1];
	Если Результат.ТипОперации = "d" Тогда
		Результат.ТипОперации = ТипСсылкиДинамическая();
	ИначеЕсли Результат.ТипОперации = "s" Тогда
		Результат.ТипОперации = ТипСсылкиКассовая();
	КонецЕсли;
	
	Если Результат.Количество() = 3 Тогда
		Результат.ИдентификаторОплаты = ЧастиИдентификатора[2];
	Иначе
		// Теоретически, в идентификатора, который приходит от банка может быть символ-разделитель.
		// В связи с этим, идентификатор может оказаться разбит на части.
		// Поэтому собираем оставшиеся значения в одно.
		ЧастиИдентификатора.Удалить(0); // Удаляем 2 первых элемента
		ЧастиИдентификатора.Удалить(0);
		Результат.ИдентификаторОплаты = СтрСоединить(ЧастиИдентификатора, "|");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Результат.ТипОперации)
		И ЗначениеЗаполнено(Результат.ИдентификаторОплаты) Тогда
			
		Если ЗначениеЗаполнено(ОжидаемыйТипОперации)
			И ОжидаемыйТипОперации <> Результат.ТипОперации Тогда
			
			Результат.ИнформацияОбОшибке = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = '%1
						|
						|Идентификатор оплаты имеет ошибочный формат.
						|
						|Техническая информация об ошибке:
						|Платежная система: Яндекс Пэй
						|Переданный идентификатор: %2
						|Полученный тип идентификатора: %3
						|Ожидаемый тип идентификатора: %4'"),
						
				ТекстОшибки,
				ИдентификаторОплаты,
				Результат.ТипОперации,
				ОжидаемыйТипОперации);
			
		Иначе
			
			Результат.КодОшибки = "";
			Результат.СообщениеОбОшибке = "";
			Результат.ИнформацияОбОшибке = "";
			
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Формирует пустую таблицу для заполнения корзины товаров.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Данные корзины:
//    * ИдентификаторНоменклатуры - Строка - идентификатор номенклатуры. Максимальная длина 2048.
//        При указании строк длиннее максимального значения вызвано исключение.
//        Важно: в рамках одной корзины не должно быть строк с одинаковым идентификатором.
//    * ПредставлениеНоменклатуры - Строка - представление номенклатуры. Максимальная длина 2048.
//        Строки длиннее максимального значения обрезаются.
//    * Количество - Число - количество товара в заказе, с точностью до тысячных. Максимальное значение 1000000.
//        При указании большего значения будет вызвано исключение.
//    * Цена - Число - цена за единицу товара. Максимальное значение 1000000.
//        При указании большего значения будет вызвано исключение.
//    * Сумма - Число - сумма позиции. Максимальное значение 1000000.
//        При указании большего значения будет вызвано исключение.
//    * Описание - Строка - Произвольное описание товара. Максимальная длина 2048.
//        Строки длиннее максимального значения обрезаются.
Функция НовыйКорзина()

	Результат = Новый ТаблицаЗначений;
	
	ТипСтрока = Новый ОписаниеТипов("Строка");
	ТипДеньги = ОбщегоНазначения.ОписаниеТипаЧисло(15, 2);
	
	Результат.Колонки.Добавить("ИдентификаторНоменклатуры", ТипСтрока);
	Результат.Колонки.Добавить("ПредставлениеНоменклатуры", ТипСтрока);
	Результат.Колонки.Добавить("Количество", ОбщегоНазначения.ОписаниеТипаЧисло(15, 3));
	Результат.Колонки.Добавить("Цена", ТипДеньги);
	Результат.Колонки.Добавить("Сумма", ТипДеньги);
	Результат.Колонки.Добавить("Описание", ТипСтрока);
	
	Возврат Результат;
	
КонецФункции

// Формирует пустое описание данных заказа.
// 
// Возвращаемое значение:
//  Структура - Новый данные заказа:
//   * ДатаОперации - Дата - Дата операции.
//   * Комментарий - Строка - Комментарий операции.
//   * ВремяДействияСсылки - Число - время действия ссылки на оплату в секундах. Значение по умолчанию - 600.
//       Максимальное значение = 1200. При указании значения больше, оно будет сокращено до максимального.
//       Значение меньше 1 игнорируется (будет использовано значение по умолчанию).
//   * ОтложенноеПолучениеСтатуса - Булево - признак загрузки статуса оплаты регламентным заданием.
//   * ПараметрыОплаты - Неопределено - используется для заполнения параметров оплаты.
//       см. ПлатежныеСистемыСлужебный.ПараметрыОплаты.
//   * Корзина - см. НовыйКорзина.
//   * Сумма - Число - общая сумма товаров в заказе. Максимальное значение 1000000.
//
Функция НовыйЗаказНаОплату()
	
	Результат = Новый Структура;
	Результат.Вставить("ДатаОперации", Дата(1, 1, 1));
	Результат.Вставить("Комментарий", "");
	Результат.Вставить("ВремяДействияСсылки", 600);
	Результат.Вставить("ОтложенноеПолучениеСтатуса", Ложь);
	Результат.Вставить("ПараметрыОплаты", Неопределено);
	Результат.Вставить("Корзина", НовыйКорзина());
	Результат.Вставить("Сумма", 0);
	
	Возврат Результат;
	
КонецФункции

// см. ЯндексПэй.АктуальнаяКорзина
// 
Функция АктуальнаяКорзина(
		НастройкаПодключения,
		ДокументОплаты) Экспорт
	
	ПлатежныеСистемыСлужебный.ПроверитьПраваНаВыполнениеОперации();
	
	Результат = ПлатежныеСистемыСлужебный.НовыйРезультатОперации();
	Результат.Вставить("СтатусОперации", "");
	Результат.Вставить("Корзина", ЯндексПэй.НовыйАктуальнаяКорзина());

	РезультатПроверки = ПлатежныеСистемыСлужебный.ПроверитьНастройкуПодключения(
		НастройкаПодключения);
	Если Не ПустаяСтрока(РезультатПроверки.КодОшибки) Тогда
		ЗаполнитьЗначенияСвойств(
			Результат,
			РезультатПроверки,
			"КодОшибки,СообщениеОбОшибке,ИнформацияОбОшибке");
		Возврат Результат;
	КонецЕсли;

	Если ТипЗнч(ДокументОплаты) = Тип("Строка") Тогда
		
		ПараметрыСтатуса = Новый Структура;
		
		ПараметрыСтатуса.Вставить("ИдентификаторОперации", ДокументОплаты);
		ПараметрыСтатуса.Вставить("ИдентификаторОплаты", "");
		ПараметрыСтатуса.Вставить("СуммаОперации", 0);
		ПараметрыСтатуса.Вставить("ТипОперации", ПлатежныеСистемыКлиентСервер.ТипОперацииОплата());
		
	Иначе
		
		ПараметрыСтатуса = ПлатежныеСистемы.ДанныеОперации(ДокументОплаты);
		
		Если ПараметрыСтатуса = Неопределено Тогда
			Результат.КодОшибки = НастройкиПлатежныхСистемСлужебный.КодОшибкиНеверныйФорматЗапроса();
			Результат.СообщениеОбОшибке = НСтр("ru = 'Не найдена операция по указанному документу.'");
			Результат.ИнформацияОбОшибке = Результат.СообщениеОбОшибке;
			Возврат Результат;
		КонецЕсли;
		
	КонецЕсли;
	
	ЗапросСтатуса = ЯндексПэйСервис.СтатусОперации(
		ПараметрыСтатуса,
		НастройкаПодключения,
		Истина);
		
	Если Не ПустаяСтрока(ЗапросСтатуса.КодОшибки) Тогда
		ЗаполнитьЗначенияСвойств(
			Результат,
			ЗапросСтатуса,
			"КодОшибки,СообщениеОбОшибке,ИнформацияОбОшибке");
		Возврат Результат;
	КонецЕсли;
	
	Результат.СтатусОперации = ЗапросСтатуса.СтатусОперации;
	Результат.Корзина = ЗапросСтатуса.ПараметрыОперации.Корзина;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ОфлайнСсылки

// Формирует данные заказа на оплату.
// 
// Возвращаемое значение:
//  см. НовыйДанныеЗаказаНаОплату
//
Функция ДанныеЗаказаНаОплату(ДокументОперации, НастройкаПодключения, ДополнительныеПараметры)
	
	Результат = НовыйДанныеЗаказаНаОплату();
	
	Результат.ЗаказНаОплату.ПараметрыОплаты = ПлатежныеСистемыСлужебный.ПараметрыОплаты(
		ДокументОперации,
		НастройкаПодключения);

	ИнтеграцияПодсистемБИП.ПриФормированииЗаказаНаОплатуЯндексПэй(
		ДокументОперации,
		Результат.ЗаказНаОплату,
		НастройкаПодключения,
		ДополнительныеПараметры);
	ЯндексПэйПереопределяемый.ПриФормированииЗаказаНаОплату(
		ДокументОперации,
		Результат.ЗаказНаОплату,
		НастройкаПодключения,
		ДополнительныеПараметры);
	
	Возврат Результат;
	
КонецФункции

// Конструктор пустого описания заказа на оплату.
// 
// Возвращаемое значение:
//  Структура - описание заказа на оплату:
//   * КодОшибки - Строка - строковый код возникшей ошибки, который может быть обработан вызывающим методом.
//   * СообщениеОбОшибке - Строка, ФорматированнаяСтрока - сообщение об ошибке для пользователя.
//   * ИнформацияОбОшибке - Строка, ФорматированнаяСтрока - сообщение об ошибке для администратора.
//   * ЗаказНаОплату - см. НовыйЗаказНаОплату.
//   * Идентификатор - Строка - внутренний идентификатор заказа на оплату.
//   * КоличествоПопыток - Число -  количество неудачно выполненных операций.
//   * ОперацияВыполнена - Булево - Истина, если ранее отправленная операция была выполнена в платежной системе.
//
Функция НовыйДанныеЗаказаНаОплату()
	
	Результат = ПлатежныеСистемыСлужебный.НовыйРезультатОперации();
	Результат.Вставить("ЗаказНаОплату", НовыйЗаказНаОплату());
	Результат.Вставить("Идентификатор", "");
	Результат.Вставить("КоличествоПопыток", 0);
	Результат.Вставить("ОперацияВыполнена", Ложь);
	
	Возврат Результат;
	
КонецФункции

// Выполняет проверку заполнения корзины на соответствие требованиям Яндекс Пэй
// 
// Параметры:
//  ДанныеЗаказа - Структура - см. НовыйЗаказНаОплату или НовыйЗаказНаВозврат.
//  ТекстОшибки - Строка - первая строка для ошибки в журнале регистрации.
//  ЭтоВозврат - Булево - Истина, если проверяется заказ на возврат.
// 
// Возвращаемое значение:
//  Структура - результат проверки:
//    * КодОшибки - Строка - строковый код возникшей ошибки, который может быть обработан вызывающим методом.
//    * СообщениеОбОшибке - Строка, ФорматированнаяСтрока - сообщение об ошибке для пользователя.
//    * ИнформацияОбОшибке - Строка, ФорматированнаяСтрока - сообщение об ошибке для администратора.
//
Функция ПроверитьДанныеЗаказа(ДанныеЗаказа, ТекстОшибки, ЭтоВозврат = Ложь)
	
	Результат = ПлатежныеСистемыСлужебный.НовыйРезультатОперации();
	
	Если ДанныеЗаказа = Неопределено Тогда
		Результат.КодОшибки          = НастройкиПлатежныхСистемСлужебный.КодОшибкиНеверныйФорматЗапроса();
		Результат.СообщениеОбОшибке  = НСтр("ru = 'Не были получены данные заказа'");
		Результат.ИнформацияОбОшибке = Результат.СообщениеОбОшибке;
		Возврат Результат;
	КонецЕсли;
	
	Ошибки = Новый Массив;
	ОшибкиКорзина = Новый Массив;
	
	Для Каждого Товар Из ДанныеЗаказа.Корзина Цикл
		
		ОшибкиСтрока = ОшибкиСтрокиКорзины(
			Товар.ИдентификаторНоменклатуры,
			Товар.Количество,
			Товар.Цена,
			Товар.Сумма,
			Товар.ПредставлениеНоменклатуры,
			Товар.Описание);
		
		Если ЗначениеЗаполнено(ОшибкиСтрока) Тогда
			ОшибкиКорзина.Добавить(ОшибкиСтрока);
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЭтоВозврат Тогда
		СуммаКорзины = ДанныеЗаказа.СуммаВозврата;
	Иначе
		СуммаКорзины = ДанныеЗаказа.Сумма;
	КонецЕсли;
	
	ОшибкаСуммаКорзины = ОшибкаСуммаКорзины(СуммаКорзины);
	Если ЗначениеЗаполнено(ОшибкаСуммаКорзины) Тогда
		Ошибки.Добавить(ОшибкаСуммаКорзины);
	КонецЕсли;
	
	Если ОшибкиКорзина.Количество() > 0 Тогда
		ОписаниеОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Есть ошибки в списке товаров:
			|%1'"),
			СтрСоединить(ОшибкиКорзина));
		Ошибки.Добавить(ОписаниеОшибки);
	КонецЕсли;
	
	Если Не ЭтоВозврат Тогда
		Если ДанныеЗаказа.ВремяДействияСсылки > 1200 Тогда
			ДанныеЗаказа.ВремяДействияСсылки = 1200;
		ИначеЕсли ДанныеЗаказа.ВремяДействияСсылки <= 0 Тогда
			ДанныеЗаказа.ВремяДействияСсылки = 600; // по умолчанию из описания API Яндекс Пэй.
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДанныеЗаказа.ДатаОперации) Тогда
		Ошибки.Добавить(НСтр("ru = 'Не указана дата операции.'"));
	КонецЕсли;
	
	Если Ошибки.Количество() > 0 Тогда
		
		ИнформацияОбОшибке = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = '%1
					|
					|Корзина товаров заполнена с ошибками:
					|
					|%2
					|
					|Техническая информация об ошибке:
					|Платежная система: Яндекс Пэй'"),
			ТекстОшибки,
			СтрСоединить(Ошибки, Символы.ПС));
		
		ПлатежныеСистемыСлужебный.ЗаписатьИнформациюВЖурналРегистрации(
			ИнформацияОбОшибке,
			Истина);
	
		Результат.КодОшибки          = НастройкиПлатежныхСистемСлужебный.КодОшибкиНеверныйФорматЗапроса();
		Результат.СообщениеОбОшибке  = НСтр("ru = 'Корзина товаров заполнена с ошибками'");
		Результат.ИнформацияОбОшибке = ИнформацияОбОшибке;

	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ОнлайнЗаказы

// Подготавливает и возвращает параметры операции для передачи в отложенный обработчик.
//
// Параметры:
//  ДанныеОперации - Структура, ВыборкаИзРезультатаЗапроса - Содержит данные операции:
//    * Идентификатор - Строка - идентификатор операции;
//    * ИдентификаторОплаты - Строка - идентификатор операции оплаты;
//    * ИдентификаторОперации - Строка - идентификатор текущей операции;
//    * ДатаОперации - Дата - фактическая дата оплаты в UTC;
//  СуммаОперации - Число - сумма операции.
//  СтатусОперации - Строка - текущий статус операции.
//  НастройкаПодключения - СправочникСсылка.НастройкиПодключенияКПлатежнымСистемам - настройка подключения.
//
// Возвращаемое значение:
// Структура - Содержит данные операции, в том случае когда
//     СпособОплаты = Перечисления.СпособыОплатыОнлайнЗаказов.ЯндексПэй:
//   * НастройкаПодключения - СправочникСсылка.НастройкиПодключенияКПлатежнымСистемам - настройка подключения.
//   * РезультатОбработки - Структура - содержит результаты обработки статуса операции:
//     ** СтатусОперации - Строка - текущее состояние операции оплаты. Возможные значения:
//         # "Выполняется" - подтверждение оплаты не получено;
//         # "Отменена" - оплата по ранее сформированной ссылке невозможна;
//         # "Выполнена" - участник Интернет-эквайринга подтвердил оплату;
//         # "Отклонена" - оплата по ранее сформированной ссылке невозможна;
//         # "Ошибка" - неизвестный статус операции.
//     ** ПараметрыОперации - см. ПлатежныеСистемыСлужебный.НовыйОбновляемыеДанныеОперации.
//     ** СообщениеОбОшибке - Строка - информация об ошибке
//
Функция ЗаполнитьПараметрыОперации(
		ДанныеОперации,
		СуммаОперации,
		СтатусОперации,
		НастройкаПодключения)
	
	ПараметрыОперации = ПлатежныеСистемыСлужебный.НовыйОбновляемыеДанныеОперации();
	
	ПараметрыОперации.ИдентификаторОплаты = ДанныеОперации.ИдентификаторОплаты;
	ПараметрыОперации.ИдентификаторОперации  = ДанныеОперации.ИдентификаторОперации;
	ПараметрыОперации.СтатусОперации = СтатусОперации;
	ПараметрыОперации.СуммаОперации = СуммаОперации;
	ПараметрыОперации.ДатаОперации = ДанныеОперации.ДатаОперации;
	ПараметрыОперации.ДатаЗапросаСтатуса = ТекущаяДатаСеанса();
	
	РезультатОбработки = Новый Структура;
	РезультатОбработки.Вставить("ПараметрыОперации", ПараметрыОперации);
	РезультатОбработки.Вставить("СообщениеОбОшибке", "");
	РезультатОбработки.Вставить("СтатусОперации", СтатусОперации);

	ПараметрыОплаты = Новый Структура(
		"НастройкаПодключения, РезультатОбработки",
		НастройкаПодключения,
		РезультатОбработки);
	
	Возврат ПараметрыОплаты;
	
КонецФункции

#КонецОбласти

#Область Оплаты

// Формирует новый идентификатор заказа на оплату или получает существующий.
//
// Параметры:
//  ДокументОплаты - ОпределяемыйТип.ДокументОперацииПлатежнойСистемы - документ, который отражает оплату в
//    информационной базе.
//  НастройкаПодключения - СправочникСсылка.НастройкиПодключенияКПлатежнымСистемам - настройка подключения к сервису.
//  КассоваяСсылка - Строка - идентификатор (ключ) кассовой ссылки. Пустая строка для динамических ссылок.
//  СуммаОперации - Число - сумма корзины.
//
// Возвращаемое значение:
//  Структура:
//    * КодОшибки - Строка - строковый код возникшей ошибки.
//        Возможные значения см. НастройкиПлатежныхСистемСлужебный.ПереопределитьКодОшибкиСервиса.
//    * СообщениеОбОшибке - Строка, ФорматированнаяСтрока - сообщение об ошибке для пользователя.
//    * ИнформацияОбОшибке - Строка, ФорматированнаяСтрока - сообщение об ошибке для администратора.
//    * Идентификатор - Строка - внутренний идентификатор операции.
//    * ОтменитьСуществующую - Булево - признак того, что есть операция в статусе Выполняется, которую
//      нужно предварительно отменить.
//
Функция ОпределитьИдентификаторЗаказаНаОплату(
		ДокументОплаты,
		НастройкаПодключения,
		КассоваяСсылка,
		СуммаОперации)

	Результат = ПлатежныеСистемыСлужебный.НовыйРезультатОперации();
	Результат.Вставить("Идентификатор", "");
	Результат.Вставить("ОтменитьСуществующую", Ложь);
	
	ДанныеОперации = ПлатежныеСистемы.ДанныеОперации(ДокументОплаты);
	
	// Первая итерация, дополнительных проверок не требуется.
	Если ДанныеОперации = Неопределено
		Или Не ЗначениеЗаполнено(ДанныеОперации.ИдентификаторОперации) Тогда
		Результат.Идентификатор = РегистрыСведений.ИдентификаторыПлатежныхСистем.НовыйВнутреннийИдентификаторОперации(
			ДокументОплаты,
			НастройкаПодключения,
			Истина,
			,
			,
			КассоваяСсылка);
		Возврат Результат;
	КонецЕсли;
	
	ДопустимыеСтатусы = Новый Массив;
	ДопустимыеСтатусы.Добавить(НастройкиПлатежныхСистемКлиентСервер.СтатусОперацииОтменена());
	ДопустимыеСтатусы.Добавить(НастройкиПлатежныхСистемКлиентСервер.СтатусОперацииОшибка());
	ДопустимыеСтатусы.Добавить(НастройкиПлатежныхСистемКлиентСервер.СтатусОперацииОтклонена());
	
	Если ДопустимыеСтатусы.Найти(ДанныеОперации.СтатусОперации) <> Неопределено Тогда
		// Если операция в статусе Отмена, Ошибка или Отклонена, то можно сформировать новую
		// независимо от ранее использованных параметров.
		Результат.Идентификатор = РегистрыСведений.ИдентификаторыПлатежныхСистем.НовыйВнутреннийИдентификаторОперации(
			ДокументОплаты,
			НастройкаПодключения,
			Истина,
			,
			Истина,
			КассоваяСсылка);
		Возврат Результат;
		
	КонецЕсли;
	
	Если ДанныеОперации.НастройкаПодключения = НастройкаПодключения
		И ДанныеОперации.КассоваяСсылка = КассоваяСсылка
		И ДанныеОперации.ТипОперации = ПлатежныеСистемыКлиентСервер.ТипОперацииОплата()
		И ДанныеОперации.СуммаОперации = СуммаОперации Тогда
		
		// Если все параметры совпадают, то можно выполнить повторный запрос операции.
		// будет возвращен тот же sale_token
		
		Результат.Идентификатор = ДанныеОперации.Идентификатор;
		Возврат Результат;
		
	КонецЕсли;
	
	ПроверкаСтатусаВРегистре = ПроверитьСтатусОперацииПриПолученииИдентификатора(
		ДокументОплаты,
		ДанныеОперации,
		ДопустимыеСтатусы);
	
	Если ЗначениеЗаполнено(ПроверкаСтатусаВРегистре.КодОшибки) Тогда
		ЗаполнитьЗначенияСвойств(
			Результат,
			ПроверкаСтатусаВРегистре);
		Возврат Результат;
	КонецЕсли;
	
	Если ПроверкаСтатусаВРегистре.СоздатьНовыйИдентификатор Тогда
		Результат.Идентификатор = РегистрыСведений.ИдентификаторыПлатежныхСистем.НовыйВнутреннийИдентификаторОперации(
			ДокументОплаты,
			НастройкаПодключения,
			Истина,
			,
			Истина,
			КассоваяСсылка);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ВозвратОплаты

// Формирует и заполняет новое описание запроса на возврат оплаты и определяет внутренний идентификатор заказа.
//
// Параметры:
//  ДокументВозврата - ОпределяемыйТип.ДокументОперацииПлатежнойСистемы - документ, который отражает возврат оплаты в
//    информационной базе.
//  ДокументОплаты - ОпределяемыйТип.ДокументОперацииПлатежнойСистемы - документ, который отражает оплату в
//                     информационной базе.
//                 - Строка - строковый идентификатор документа оплаты. Может использоваться, если заказ
//                     на оплату был сформирован в другой базе.
//  НастройкаПодключения - СправочникСсылка.НастройкиПодключенияКПлатежнымСистемам - настройка подключения к сервису.
//  ДополнительныеПараметры - Структура, Неопределено - дополнительные настройки формирования заказа на возврат оплаты.
//
// Возвращаемое значение:
//  Структура - содержит результат подготовки заказа на возврат оплаты:
//    * КодОшибки - Строка - строковый код возникшей ошибки.
//        Возможные значения см. НастройкиПлатежныхСистемСлужебный.ПереопределитьКодОшибкиСервиса
//    * СообщениеОбОшибке - Строка, ФорматированнаяСтрока - сообщение об ошибке для пользователя.
//    * ИнформацияОбОшибке - Строка, ФорматированнаяСтрока - сообщение об ошибке для администратора.
//    * ЗаказНаВозврат - Неопределено - ошибка формирования данных заказа на возврат оплаты.
//                     - см. НовыйЗаказНаВозврат
//    * Идентификатор - Строка - внутренний идентификатор заказа на оплату.
//    * ИдентификаторОплаты - Строка - идентификатор операции в платежной системе.
//    * КоличествоПопыток - Число -  количество неудачно выполненных операций.
//
Функция ДанныеЗаказаНаВозврат(
		ДокументВозврата,
		ДокументОплаты,
		НастройкаПодключения,
		ДополнительныеПараметры)
	
	Результат = ПлатежныеСистемыСлужебный.НовыйРезультатОперации();
	Результат.Вставить("ЗаказНаВозврат", Неопределено);
	Результат.Вставить("Идентификатор", "");
	Результат.Вставить("ИдентификаторОплаты", "");
	Результат.Вставить("КоличествоПопыток", 0);
	
	ЗаказНаВозврат = НовыйЗаказНаВозврат();
		
	ИнтеграцияПодсистемБИП.ПриФормированииЗаказаНаВозвратЯндексПэй(
		ДокументВозврата,
		ДокументОплаты,
		ЗаказНаВозврат,
		НастройкаПодключения,
		ДополнительныеПараметры);
	ЯндексПэйПереопределяемый.ПриФормированииЗаказаНаВозврат(
		ДокументВозврата,
		ДокументОплаты,
		ЗаказНаВозврат,
		НастройкаПодключения,
		ДополнительныеПараметры);
	
	Результат.ЗаказНаВозврат = ЗаказНаВозврат;
	
	Возврат Результат;
	
КонецФункции

// Описание нового объекта заказа на возврат.
// Заполняется в методе см. ЯндексПэйПереопределяемый.ПриФормированииЗаказаНаВозврат.
//
// Возвращаемое значение:
//  Структура:
//    * ДатаОперации - Дата - дата операции возврата.
//    * СуммаВозврата - Число - сумма к возврату.
//    * Корзина - См. НовыйКорзина.
//
Функция НовыйЗаказНаВозврат()
	
	Результат = Новый Структура();
	Результат.Вставить("ДатаОперации" , Дата(1, 1, 1));
	Результат.Вставить("СуммаВозврата", 0);
	Результат.Вставить("Корзина", НовыйКорзина());
	
	Возврат Результат;
	
КонецФункции

// Формирует новые идентификаторы заказа на возврат оплаты или получает существующие.
//
// Параметры:
//  ДокументВозврата - ОпределяемыйТип.ДокументОперацииПлатежнойСистемы - документ, который отражает возврат оплаты в
//    информационной базе.
//  ДокументОплаты - ОпределяемыйТип.ДокументОперацииПлатежнойСистемы - документ, который отражает оплату в
//                     информационной базе.
//                 - Строка - строковый идентификатор операции оплаты, если она была выполнена в другой базе.
//  НастройкаПодключения - СправочникСсылка.НастройкиПодключенияКПлатежнымСистемам - настройка подключения к сервису.
//  ДанныеЗаказа - см. ДанныеЗаказаНаВозврат
//
// Возвращаемое значение:
//  Структура:
//    * КодОшибки - Строка - строковый код возникшей ошибки.
//        Возможные значения см. НастройкиПлатежныхСистемСлужебный.ПереопределитьКодОшибкиСервиса.
//    * СообщениеОбОшибке - Строка, ФорматированнаяСтрока - сообщение об ошибке для пользователя.
//    * ИнформацияОбОшибке - Строка, ФорматированнаяСтрока - сообщение об ошибке для администратора.
//    * Идентификатор - Строка - внутренний идентификатор операции.
//    * ИдентификаторОплаты - Строка - идентификатор оплаты в платежной системе.
//    * КоличествоПопыток - Число - количество неудачно выполненных операций.
//    * ОперацияВыполнена - Булево - Истина, если операция находится в статусе Выполнена.
//    * ДанныеОперации - см. ПлатежныеСистемы.ДанныеОперации.
//
Функция ОпределитьИдентификаторЗаказаНаВозврат(
		ДокументВозврата,
		ДокументОплаты,
		НастройкаПодключения,
		ДанныеЗаказа)
	
	Результат = ПлатежныеСистемыСлужебный.НовыйРезультатОперации();
	Результат.Вставить("Идентификатор", "");
	Результат.Вставить("ИдентификаторОплаты", "");
	Результат.Вставить("КоличествоПопыток", 0);
	Результат.Вставить("ОперацияВыполнена", Ложь);
	
	ДанныеОперации = ПлатежныеСистемы.ДанныеОперации(ДокументВозврата);
	
	Результат.Вставить("ДанныеОперации", ДанныеОперации);
	
	Если ТипЗнч(ДокументОплаты) = Тип("Строка") Тогда
		
		ТекстОшибки = НСтр("ru = 'Определение идентификатора заказа на возврат.'");
		
		ДекодироватьИдентификатор = ДекодироватьИдентификаторОплаты(
			ДокументОплаты,
			ТекстОшибки);
		Если Не ПустаяСтрока(ДекодироватьИдентификатор.КодОшибки) Тогда
			ЗаполнитьЗначенияСвойств(
				Результат,
				ДекодироватьИдентификатор,
				"КодОшибки,СообщениеОбОшибке,ИнформацияОбОшибке");
			Возврат Результат;
		КонецЕсли;
		
		Результат.ИдентификаторОплаты = ДокументОплаты;
		КассоваяСсылка = ?(
			ДекодироватьИдентификатор.ТипОперации = ТипСсылкиКассовая(),
			"Неизвестно",
			"");
	Иначе
		ДанныеОперацииОплаты = ПлатежныеСистемы.ДанныеОперации(ДокументОплаты);
		Результат.ИдентификаторОплаты = ДанныеОперацииОплаты.ИдентификаторОперации;
		КассоваяСсылка = ДанныеОперацииОплаты.КассоваяСсылка;
	КонецЕсли;
	
	// Первая итерация, дополнительных проверок не требуется.
	// Если не заполнен ИдентификаторОперации, значит при предыдущей операции возникли ошибки
	// и данные не получены из банка. В любом случае необходимо использовать новый идентификатор.
	Если ДанныеОперации = Неопределено
		Или Не ЗначениеЗаполнено(ДанныеОперации.ИдентификаторОперации) Тогда
		Результат.Идентификатор = РегистрыСведений.ИдентификаторыПлатежныхСистем.НовыйВнутреннийИдентификаторОперации(
			ДокументВозврата,
			НастройкаПодключения,
			Ложь,
			Результат.ИдентификаторОплаты,
			,
			КассоваяСсылка);
		Возврат Результат;
	КонецЕсли;
	
	ДопустимыеСтатусы = Новый Массив;
	ДопустимыеСтатусы.Добавить(НастройкиПлатежныхСистемКлиентСервер.СтатусОперацииОтменена());
	ДопустимыеСтатусы.Добавить(НастройкиПлатежныхСистемКлиентСервер.СтатусОперацииОшибка());
	ДопустимыеСтатусы.Добавить(НастройкиПлатежныхСистемКлиентСервер.СтатусОперацииОтклонена());
	
	Если ДопустимыеСтатусы.Найти(ДанныеОперации.СтатусОперации) <> Неопределено Тогда
		// Если операция в статусе Отмена, Ошибка или Отклонена, то можно сформировать новую
		// независимо от ранее использованных параметров. Даже если по данному документу
		// ранее была выполнена операция оплаты, а не возврата.
		Результат.Идентификатор = РегистрыСведений.ИдентификаторыПлатежныхСистем.НовыйВнутреннийИдентификаторОперации(
			ДокументОплаты,
			НастройкаПодключения,
			Ложь,
			Результат.ИдентификаторОплаты,
			Истина,
			КассоваяСсылка);
		Возврат Результат;
		
	КонецЕсли;
	
	Если ДанныеОперации.НастройкаПодключения = НастройкаПодключения
		И ДанныеОперации.ТипОперации = ПлатежныеСистемыКлиентСервер.ТипОперацииВозврат()
		И ДанныеОперации.СуммаОперации = ДанныеЗаказа.ЗаказНаВозврат.СуммаВозврата
		И ДанныеОперации.ИдентификаторОплаты = Результат.ИдентификаторОплаты Тогда
		
		// На данный момент у Яндекса нет идемпотентности при возвратах, поэтому дополнительно
		// проверяем статус: если Выполнено, то не должно быть повторного запроса к сервису.
		
		Результат.Идентификатор = ДанныеОперации.Идентификатор;
		Результат.ОперацияВыполнена = 
			(ДанныеОперации.СтатусОперации = НастройкиПлатежныхСистемКлиентСервер.СтатусОперацииВыполнена());
		Возврат Результат;
		
	КонецЕсли;
		
	ПроверкаСтатусаВРегистре = ПроверитьСтатусОперацииПриПолученииИдентификатора(
		ДокументВозврата,
		ДанныеОперации,
		ДопустимыеСтатусы);
	
	Если ЗначениеЗаполнено(ПроверкаСтатусаВРегистре.КодОшибки) Тогда
		ЗаполнитьЗначенияСвойств(
			Результат,
			ПроверкаСтатусаВРегистре);
		Возврат Результат;
	КонецЕсли;
	
	Если ПроверкаСтатусаВРегистре.СоздатьНовыйИдентификатор Тогда
		Результат.Идентификатор = РегистрыСведений.ИдентификаторыПлатежныхСистем.НовыйВнутреннийИдентификаторОперации(
			ДокументОплаты,
			НастройкаПодключения,
			Ложь,
			Результат.ИдентификаторОплаты,
			Истина,
			КассоваяСсылка);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Проверяет можно ли использовать идентификатор операции на основе данных о ее текущем статусе.
// В случае, если операция находится в недопустимом для изменения статусе, то будут заполнены
// поля с описанием ошибки.
//
// Возвращаемое значение:
//  Структура:
//    * КодОшибки - Строка - строковый код возникшей ошибки.
//        Возможные значения см. НастройкиПлатежныхСистемСлужебный.ПереопределитьКодОшибкиСервиса.
//    * СообщениеОбОшибке - Строка, ФорматированнаяСтрока - сообщение об ошибке для пользователя.
//    * ИнформацияОбОшибке - Строка, ФорматированнаяСтрока - сообщение об ошибке для администратора.
//    * СоздатьНовыйИдентификатор - Булево - Истина, если нужно создать новый идентификатор, Ложь если можно
//        использовать текущий.
Функция ПроверитьСтатусОперацииПриПолученииИдентификатора(ДокументОперации, ДанныеОперации, ДопустимыеСтатусы)
	
	Результат = ПлатежныеСистемыСлужебный.НовыйРезультатОперации();
	Результат.Вставить("СоздатьНовыйИдентификатор", Ложь);
	
	Если ДанныеОперации.СтатусОперации = НастройкиПлатежныхСистемКлиентСервер.СтатусОперацииВыполнена() Тогда
		
		Результат.КодОшибки = НастройкиПлатежныхСистемСлужебный.КодОшибкиОперацияВыполнена();
		Результат.СообщениеОбОшибке = НСтр("ru = 'По данному документу уже выполнена операция с другими параметрами.
			|Создание новой операции невозможно.'");
		Результат.ИнформацияОбОшибке = Результат.СообщениеОбОшибке;
		
	ИначеЕсли ДанныеОперации.СтатусОперации = НастройкиПлатежныхСистемКлиентСервер.СтатусОперацииВыполняется() Тогда
		
		// На текущий момент операция возврата является синхронной, но Яндекс планирует сделать ее асинхронной.
		// Поэтому оставляем общую обработку для оплаты и возврата.
		// Если по какой-то причине для возврата сюда все же зашли, то будет ошибка проверки статуса,
		// так как для возвратов у Яндекса нет такого метода.
		
		// Проверяем не изменился ли статус операции.
		РезультатПроверки = ПлатежныеСистемы.СтатусОперации(ДокументОперации, 3);
		
		Если ЗначениеЗаполнено(РезультатПроверки.КодОшибки) Тогда
			
			// Ошибка при обновлении статуса.
			Результат.КодОшибки = НастройкиПлатежныхСистемСлужебный.КодОшибкиНеизвестнаяОшибка();
			Результат.СообщениеОбОшибке = НСтр("ru = 'По данному документу уже сформирована операция с другими параметрами.
				|Не удалось проверить статус операции.
				|Создание новой операции невозможно.
				|Подробности см. в журнале регистрации'");
			Результат.ИнформацияОбОшибке = Результат.СообщениеОбОшибке;
			
		ИначеЕсли РезультатПроверки.СтатусОперации = НастройкиПлатежныхСистемКлиентСервер.СтатусОперацииВыполняется() Тогда
			
			// Статус так и остался Выполняется
			Результат.КодОшибки = НастройкиПлатежныхСистемСлужебный.КодОшибкиОперацияВыполняется();
			Результат.СообщениеОбОшибке = НСтр("ru = 'По данному документу уже сформирована операция с другими параметрами.
				|Перед создание новой операции необходимо отменить предыдущую.'");
			Результат.ИнформацияОбОшибке = Результат.СообщениеОбОшибке;
		
		ИначеЕсли ДопустимыеСтатусы.Найти(РезультатПроверки.СтатусОперации) <> Неопределено Тогда
			
			// Если после проверки статус стал Ошибка, Отмена или Отклонена,
			// то можно создать новую операцию
			Результат.СоздатьНовыйИдентификатор = Истина;
			
		Иначе
			
			// Любой другой статус.
			Результат.КодОшибки = НастройкиПлатежныхСистемСлужебный.КодОшибкиНеизвестнаяОшибка();
			Результат.СообщениеОбОшибке = НСтр("ru = 'По данному документу уже сформирована операция с другими параметрами.
				|Создание новой операции невозможно.'");
			Результат.ИнформацияОбОшибке = Результат.СообщениеОбОшибке;
			
		КонецЕсли;
	
	Иначе
		
		Результат.КодОшибки = НастройкиПлатежныхСистемСлужебный.КодОшибкиНеизвестнаяОшибка();
		Результат.СообщениеОбОшибке = НСтр("ru = 'По данному документу уже сформирована операция с другими параметрами.
			|Создание новой операции невозможно.'");
		Результат.ИнформацияОбОшибке = Результат.СообщениеОбОшибке;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ОписаниеПодсистемы

// Формирует описание настроек подключения по умолчанию.
// 
// Возвращаемое значение:
//  Структура:
//    * Описание - Строка, ФорматированнаяСтрока - текст описания платежной системы.
//    * Подключение - Строка, ФорматированнаяСтрока - текст подсказки о платежной системе.
//    
Функция ОписаниеПоУмолчанию() Экспорт
	
	Результат = Новый Структура;
	
	Результат.Вставить(
		"Описание",
		СтроковыеФункции.ФорматированнаяСтрока(
			НСтр("ru = '<b>Яндекс Пэй</b> - платежный сервис, разработанный Яндексом, предназначенный для быстрых и безопасных покупок в интернете и офлайн-точках продаж. Сервис позволяет пользователям оплачивать товары и услуги без ручного ввода данных банковской карты при каждой покупке.
			|Система интегрируется с банками и торговыми площадками, обеспечивая мгновенные транзакции и высокий уровень безопасности. Основная цель сервиса – сделать процесс оплаты простым и понятным. За покупки предусмотрен кешбэк. Есть возможность использовать сплит – оформлять покупки в рассрочку без процентов.
			|
			|<a href=""https://pay.yandex.ru/business/payments/qr"">Подробнее о сервисе</a>'")));

	Результат.Вставить(
		"Подключение",
		СтроковыеФункции.ФорматированнаяСтрока(
			НСтр("ru = 'Для подключения к Яндекс Пэй заполните настройки. Получить данные для настройки можно в <a href=""https://console.pay.yandex.ru/settings"">личном кабинете Яндекс</a>'")));
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ПрочиеСлужебныеПроцедурыИФункции

// Проверяет строку корзины на соответствие требованиям Яндекса и возвращает описание ошибок.
//
// Параметры:
//  ИдентификаторНоменклатуры - Строка - идентификатор товара.
//  Количество - Число - количество товара.
//  Цена - Число - цена за единицу.
//  Сумма - Число - общая сумма по строке.
//  ПредставлениеНоменклатуры - Строка - представление товара.
//  Описание - Строка - описание товара.
//
// Возвращаемое значение:
//  Строка - описание ошибок заполнения или пустая строка, если ошибок нет
//
Функция ОшибкиСтрокиКорзины(
		ИдентификаторНоменклатуры,
		Количество,
		Цена,
		Сумма,
		ПредставлениеНоменклатуры,
		Описание)
	
	Результат = "";
	
	МаксимальнаяДлинаСтроки = 2048;
	МаксимальноеЧисло = МаксимальноеЧислоЯндексПэй();
	ОшибкиСтрока = Новый Массив;
	
	Если СтрДлина(ИдентификаторНоменклатуры) > МаксимальнаяДлинаСтроки Тогда
		ОшибкиСтрока.Добавить("Идентификатор номенклатуры");
	КонецЕсли;
	Если Количество > МаксимальноеЧисло Тогда
		ОшибкиСтрока.Добавить("Количество");
	КонецЕсли;
	Если Цена > МаксимальноеЧисло Тогда
		ОшибкиСтрока.Добавить("Цена");
	КонецЕсли;
	Если Сумма > МаксимальноеЧисло Тогда
		ОшибкиСтрока.Добавить("Сумма");
	КонецЕсли;
	
	ПредставлениеНоменклатуры = Лев(ПредставлениеНоменклатуры, МаксимальнаяДлинаСтроки);
	Описание = Лев(Описание, МаксимальнаяДлинаСтроки);
	
	Если ОшибкиСтрока.Количество() > 0 Тогда
		Результат = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Ошибки в заполнении полей [%1] для номенклатуры %2 (%3)'"),
			СтрСоединить(ОшибкиСтрока, ","),
			ПредставлениеНоменклатуры,
			ИдентификаторНоменклатуры);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Проверяет, что сумма корзины не превышает максимально допустимое значение.
//
// Параметры:
//  СуммаКорзины - Число - проверяемая сумма.
//
// Возвращаемое значение:
//  Строка - текст ошибки, если сумма превышает лимит; пустая строка,
//    если проверка пройдена успешно.
//    
Функция ОшибкаСуммаКорзины(СуммаКорзины)

	Если СуммаКорзины > МаксимальноеЧислоЯндексПэй() Тогда
		Возврат СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Общая сумма товаров не должна превышать %1'"),
				МаксимальноеЧислоЯндексПэй());
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

// Возвращает максимально допустимое значение числовых полей
//
// Возвращаемое значение:
//  Число - максимально допустимое значение.
//
Функция МаксимальноеЧислоЯндексПэй()
	
	Возврат 1000000;
	
КонецФункции

#КонецОбласти

#КонецОбласти