&НаКлиенте
Процедура рзп_ЗатратыЗаполнитьПроекты(Команда)

	Если Объект.Затраты.Количество() <> 0 Тогда

		ТекстВопроса = НСтр("ru = 'Затраты будут разложены по проектам.'") + Символы.ПС;
		ТекстВопроса = ТекстВопроса + НСтр("ru = 'Табличная часть ""Распределение расходов"" будет очищена.'")
			+ Символы.ПС;
		ТекстВопроса = ТекстВопроса + НСтр("ru = 'Продолжить выполнение операции?'");

		ПоказатьВопрос(Новый ОписаниеОповещения("рзп_ЗатратыЗаполнитьПроектыЗавершение", ЭтотОбъект), ТекстВопроса,
			РежимДиалогаВопрос.ДаНет, 0);
		Возврат;

	КонецЕсли;

	рзп_ЗатратыЗаполнитьПроектыФрагмент();

КонецПроцедуры

&НаКлиенте
Процедура рзп_ЗатратыЗаполнитьПроектыЗавершение(Результат, ДополнительныеПараметры) Экспорт

	Ответ = Результат;

	Если Ответ = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	рзп_ЗатратыЗаполнитьПроектыФрагмент();

КонецПроцедуры

&НаКлиенте
Процедура рзп_ЗатратыЗаполнитьПроектыФрагмент()

	рзп_ЗаполнитьТабличнуюЧастьЗатратыПоПроектам();
	УстановитьИндексыРежимовПросмотров();

КонецПроцедуры

&НаСервере
Процедура рзп_ЗаполнитьТабличнуюЧастьЗатратыПоПроектам()
	
	Документ = РеквизитФормыВЗначение("Объект");
	Документ.рзп_ВыполнитьЗаполнениеПроектовЗатрат();
	ЗначениеВРеквизитФормы(Документ, "Объект");
	
	ОбновитьОтображениеПрослеживаемости();
	НоменклатураВДокументахСервер.ЗаполнитьПризнакиИспользованияХарактеристик(Объект);
	
КонецПроцедуры
