&НаСервере
&После("ПриСозданииНаСервере")
Процедура рзп_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	рзп_ДобавитьКнопкуЗаполнитьПроекты();
	
КонецПроцедуры

&НаСервере
Процедура рзп_ДобавитьКнопкуЗаполнитьПроекты()
	
	ИмяКоманды = "рзп_ЗатратыЗаполнитьПроекты";
	Если Команды.Найти(ИмяКоманды) <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	КомандаФормы = Команды.Добавить(ИмяКоманды);
	КомандаФормы.Заголовок = НСтр("ru = 'Заполнить проекты'");
	КомандаФормы.Подсказка = НСтр("ru = 'Разложить затраты по проектам амортизации и перемещений запасов'");
	КомандаФормы.Действие = ИмяКоманды;
	КомандаФормы.ИзменяетСохраняемыеДанные = Истина;
	
	Кнопка = Элементы.Добавить(ИмяКоманды, Тип("КнопкаФормы"), Элементы.ЗатратыКоманднаяПанель);
	Кнопка.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
	Кнопка.ИмяКоманды = ИмяКоманды;
	Кнопка.ПропускатьПриВводе = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура рзп_ЗатратыЗаполнитьПроекты(Команда)

	Если Объект.Затраты.Количество() <> 0 Тогда

		ТекстВопроса = НСтр("ru = 'Затраты будут разложены по проектам.'") + Символы.ПС;
		ТекстВопроса = ТекстВопроса + НСтр("ru = 'Табличная часть ""Распределение расходов"" будет очищена.'")
			+ Символы.ПС;
		ТекстВопроса = ТекстВопроса + НСтр("ru = 'Продолжить выполнение операции?'");

		ПоказатьВопрос(Новый ОписаниеОповещения("рзп_ЗатратыЗаполнитьПроектыЗавершение", ЭтотОбъект), ТекстВопроса,
			РежимДиалогаВопрос.ДаНет, 0);
		Возврат;

	КонецЕсли;

	рзп_ЗатратыЗаполнитьПроектыФрагмент();

КонецПроцедуры

&НаКлиенте
Процедура рзп_ЗатратыЗаполнитьПроектыЗавершение(Результат, ДополнительныеПараметры) Экспорт

	Ответ = Результат;

	Если Ответ = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	рзп_ЗатратыЗаполнитьПроектыФрагмент();

КонецПроцедуры

&НаКлиенте
Процедура рзп_ЗатратыЗаполнитьПроектыФрагмент()

	рзп_ЗаполнитьТабличнуюЧастьЗатратыПоПроектам();
	УстановитьИндексыРежимовПросмотров();

КонецПроцедуры

&НаСервере
Процедура рзп_ЗаполнитьТабличнуюЧастьЗатратыПоПроектам()
	
	Документ = РеквизитФормыВЗначение("Объект");
	Документ.рзп_ВыполнитьЗаполнениеПроектовЗатрат();
	ЗначениеВРеквизитФормы(Документ, "Объект");
	
	ОбновитьОтображениеПрослеживаемости();
	НоменклатураВДокументахСервер.ЗаполнитьПризнакиИспользованияХарактеристик(Объект);
	
КонецПроцедуры
