
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2022, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Процедура заполняет магазин на основании кассы ккм.
// Параметры:
//  КассаККМ - ОпределяемыйТип.КассаККМРМК - касса для получения значения магазина
//  
// Возвращаемые параметры:
//  Магазин - ОпределяемыйТип.ТорговыйОбъектРМК - магазин необходимый для формы оплаты платежной системой
//
Процедура ЗаполнитьМагазинПоКассеККМ(Магазин, КассаККМ) Экспорт
	
	ИнтеграцияСПлатежнымиСистемамиУНФ.ЗаполнитьМагазинПоКассеККМ(Магазин, КассаККМ);
	
КонецПроцедуры

// Устарела из-за изменения интерфейса настроек кассового qr-кода. настройки выведены в отдельную форму
// Процедура настраивает форму помощника кассового места
// Параметры:
//  Форма - форма нового РМК
//  КассаККМ - ОпределяемыйТип.КассаККМРМК - настраиваемая касса
//
Процедура НастроитьФормуПомощникаПодключенияСБП(Форма, КассаККМ) Экспорт
	
	
КонецПроцедуры

// Процедура заполняет доступные права для текущего пользователя.
// Параметры:
//  Форма - форма нового РМК
//
Процедура ЗаполнитьТаблицуРолейПользователя(Форма) Экспорт
	
	ИнтеграцияСПлатежнымиСистемамиУНФ.ЗаполнитьТаблицуРолейПользователя(Форма);
	
КонецПроцедуры

// Определяет необходимость вывода подключения кассового QR-кода в форме настроек рабочего места кассира.
//
// Параметры:
//  ПлатежнаяСистема - Строка - ИнтеграцияСПлатежнымиСистемамиРМККлиентСервер.ПлатежнаяСистемаСБП,
//                              ИнтеграцияСПлатежнымиСистемамиРМККлиентСервер.ПлатежнаяСистемаЯндексПэй.
//  ОсновнаяКассаККМ - ОпределяемыйТип.КассаККМРМК - касса для подключения кассового qr-кода.
//
Процедура НастроитьПодключениеКассовойСсылкиВНастройкеРабочегоМеста(ПлатежнаяСистема, ОсновнаяКассаККМ) Экспорт
	



	
КонецПроцедуры

// Определяет настройки кассового qr-кода.
//
// Параметры:
//  КассаККМРМК - ОпределяемыйТип.КассаККМРМК - касса по которой необходимо определить кассовый qr-код;
//  ПлатежнаяСистема - Строка - платежная система, кассовые ссылки которой необходимо получить,
//                     возможны значения "СБП", "ЯндексПэй";
//  СпособыОплатыРМК - Соответствие Из КлючИЗначение - соответствие кассовых кодов в разрезе способов оплаты РМК:
//    *Ключ - СпособОплатыРМК - ОпределяемыйТип.СпособОплатыРМК
//    *Значение - Структура - данные кассовой ссылки
//      ** КассоваяСсылка - Строка - ссылка, по которой будет выполнятся оплата.
//      ** ИдентификаторОплаты - Строка - идентификатор зарегистрированной ссылки.
//
Процедура ПолучитьНастройкиКассовогоQRКода(КассаККМРМК, ПлатежнаяСистема, СпособыОплатыРМК) Экспорт
	
	ИнтеграцияСПлатежнымиСистемамиУНФ.ПолучитьНастройкиКассовогоQRКода(
		КассаККМРМК,
		ПлатежнаяСистема,
		СпособыОплатыРМК);
	
КонецПроцедуры

// Формирование изображения идентификатора оплаты (QR-кода).
//
// Параметры: 
//  СтруктураQRКода - Структура - информация о QR-коде:
//    *ИдентификаторQRКода - Строка - строковый идентификатор QRКода;
//    *КартинкаQRКода - Base64 - картинка QR-кода
//    *ДанныеQRКода - Строка - адрес хранилища данных QR-кода.
//  ТорговаяТочка - СправочникСсылка.НастройкиПодключенияКСистемеБыстрыхПлатежей -
//                  настройка интеграции с платежной системой;
//  QRКод - Строка - идентификатор оплаты;
//  УникальныйИдентификатор - УникальныйИдентификатор - идентификатор для установки поля данные qr-кода;
//
//
Процедура СформироватьДанныеQRКода(СтруктураQRКода, ТорговаяТочка, QRКод, УникальныйИдентификатор) Экспорт
	
	СтруктураQRКода = ИнтеграцияСПлатежнымиСистемамиУНФ.СформироватьДанныеQRКода(
		ТорговаяТочка,
		QRКод,
		УникальныйИдентификатор);
	
КонецПроцедуры

// Определяет доступность операций для торговой точки. В сценариях оплаты
// различных платежных систем существуют отличия, поэтому ряд операций могут
// быть запрещены для выполнения. Метод следует использовать для настройки
// элементов форм оплаты и возвратов и получение общих настроек интеграции.
//
// Параметры:
//  НастройкиИнтеграции - Структура - информация о доступных операциях:
//    *СрокЖизниQRКода - Булево - признак доступности установки максимального
//                       срока действия QR-кода;
//    *ПлатежнаяСсылка - Булево - признак доступности использования платежной ссылки
//                       для выполнения оплаты;
//    *ДоступенВыборУчастникаВозвратаСБП - Булево - признак доступности возврата оплаты
//                                         в платежную систему отличную от исходной. Для
//                                         получения списка доступных платежных систем следует 
//                                         использовать метод ПереводыСБПc2b.НастройкиВозвратаОплаты;
//    *Идентификатор - Строка - строковый идентификатор платежной системы или участника СБП;
//    *СинонимСистемы - Строка - синоним платежной системы для печати.
//    
//  Интеграция - СправочникСсылка.НастройкиПодключенияКСистемеБыстрыхПлатежей -
//                  настройка выполнения операции платежной системы.
//  ПараметрыНастройки - Структура - информация о доступных операциях:
//    *КассаККМ - ОпределяемыйТип.КассаККМРМК - касса ккм;
//    *ДокументОплаты - ДокументСсылка - документ основание оплаты по которому необходимо определить доступность участников возврата СБП.
//
Процедура ЗаполнитьНастройкиИнтеграцииПлатежнойСистемы(НастройкиИнтеграции, Интеграция, ПараметрыНастройки) Экспорт
	
	ИнтеграцияСПлатежнымиСистемамиУНФ.ЗаполнитьНастройкиИнтеграцииПлатежнойСистемы(
		НастройкиИнтеграции,
		Интеграция,
		ПараметрыНастройки);
	
КонецПроцедуры

// Формирование QR-кода для оплаты в платежной системе.
//
// Параметры:
//  ПараметрыПроцедуры - Структура - параметры выполнения длительной операции;
//  АдресРезультата - Строка - адрес результата операции во временном хранилище.
//
Процедура ИдентификаторОплатыВПлатежнойСистеме(ПараметрыПроцедуры, АдресРезультата) Экспорт
	
	ИнтеграцияСПлатежнымиСистемамиУНФ.ИдентификаторОплатыВПлатежнойСистеме(ПараметрыПроцедуры, АдресРезультата);
	
КонецПроцедуры

// Определяет статус оплаты в платежной системе.
//
// Параметры:
//  ДокументОплаты - ОпределяемыйТип.ДокументОплатыБИП - документ, который отражает
//                    продажу в информационной базе;
//
// Возвращаемое значение:
//  Структура
//
Процедура СтатусОплатыВПлатежнойСистеме(ПараметрыПроцедуры, АдресРезультата) Экспорт
	
	ИнтеграцияСПлатежнымиСистемамиУНФ.СтатусОплатыВПлатежнойСистеме(ПараметрыПроцедуры, АдресРезультата);
	
КонецПроцедуры

// Формирование возврата оплаты в платежной системе.
//
// Параметры:
//  ПараметрыПроцедуры - Структура - параметры выполнения длительной операции;
//  АдресРезультата - Строка - адрес результата операции во временном хранилище.
//
Процедура ВозвратОплаты(ПараметрыПроцедуры, АдресРезультата) Экспорт
	
	ИнтеграцияСПлатежнымиСистемамиУНФ.ВозвратОплаты(ПараметрыПроцедуры, АдресРезультата);
	
КонецПроцедуры

// Производит получение статуса возврата по документу.
//
// Параметры:
//  ПараметрыПроцедуры - Структура - параметры выполнения длительной операции;
//  АдресРезультата - Строка - адрес результата операции во временном хранилище.
//
Процедура СтатусВозвратОплаты(ПараметрыПроцедуры, АдресРезультата) Экспорт
	
	ИнтеграцияСПлатежнымиСистемамиУНФ.СтатусВозвратОплаты(ПараметрыПроцедуры, АдресРезультата);
	
КонецПроцедуры

// Подтверждает возврат в платежной системе.
//
// Параметры:
//  РезультатОперации - Структура - см.  - см. ПереводыСБПc2b.ПодтвердитьВозврат.
//
//  ДокументВозврата - ОпределяемыйТип.ДокументОперацииСБП - документ, который отражает
//                   оплату в информационной базе;
//  Интеграция - СправочникСсылка.НастройкиПодключенияКСистемеБыстрыхПлатежей -
//                  настройка выполнения операции платежной системы.
//
Процедура ПодтвердитьВозврат(РезультатОперации, ДокументВозврата, Интеграция) Экспорт
	
	РезультатОперации = ИнтеграцияСПлатежнымиСистемамиУНФ.ПодтвердитьВозврат(ДокументВозврата, Интеграция);
	
КонецПроцедуры

// Возвращает структуру пустой ссылки на документ оплаты
//
// Параметры:
//  СтруктураНовойСсылки - Структура - информация о QR-коде:
//    *ЧекККМВОбработке - ДокументСсылка - пустая ссылка на документ чекККМ.
//    *НовыйЧек - Булево - признак, что это новая ссылка
//
//  СсылкаНаВозврат - булево - признак, что нужно вернуть ссылку на документ возврата
//
Процедура ЗаполнитьСсылкуНовогоЧекаККМ(СтруктураНовойСсылки, СсылкаНаВозврат = Ложь) Экспорт
	
	СтруктураНовойСсылки = ИнтеграцияСПлатежнымиСистемамиУНФ.ПолучитьСсылкуНовогоЧекаККМ(СсылкаНаВозврат);
	
КонецПроцедуры

// Возвращает структуру чека оплаты для автоматического выполнения возврата
//
// Параметры:
//  ПараметрыВозврата - Структура - информация о QR-коде:
//    *ИдентификаторОплаты - строка - идентификатор оплаты
//    *ВидОплатыВозврата - ОпределяемыйТип.ВидОплатыРМК - на вид оплаты возврата
//    *СпособОплаты - ОпределяемыйТип.СпособОплатыПлатежныхСистемРМК - способ оплаты документа оплаты
//    *Организация - ОпределяемыйТип.ОрганизацияРМК - организация возврата
//    *ИдентификаторПС - строка - идентификатор платежной системы
//
//  ДокументОплаты - документ основание оплаты.
//  
Процедура ЗаполнитьПараметрыДокументаОплаты(ПараметрыВозврата, ДокументОплаты) Экспорт
	
	ПараметрыВозврата = ИнтеграцияСПлатежнымиСистемамиУНФ.ПолучитьПараметрыДокументаОплаты(ДокументОплаты);
	
КонецПроцедуры

// Отменяет все выполняемые действия с операций платежной системой на форме
//
// Параметры:
//  ПараметрыОтмены - Структура - параметры выполнения длительной операции;
//  	*ДокументОплаты - ОпределяемыйТип.ДокументОплатыБИП - документ, который отражает
//                    продажу в информационной базе;
//  	*Интеграция - СправочникСсылка.НастройкиПодключенияКСистемеБыстрыхПлатежей -
//                  настройка интеграции с платежной системой;
//  	*НастройкиТорговойТочки - Структура - информация о доступных операциях:
//  	*ИдентификаторЗаданияФормированияQRКода - УникальныйИдентификатор - идентификатор 
//  																   длительной операции по формированию qr-кода
//  	*ИдентификаторЗаданияПроверкиСтатуса - УникальныйИдентификатор    - идентификатор 
//  															       длительной операции по проверки статуса оплаты
//  	*ИдентификаторЗаданияВозврата - УникальныйИдентификатор           - идентификатор 
//  АдресРезультата - Строка - адрес результата операции во временном хранилище.
//
Процедура ОтменитьОперациюВФоне(ПараметрыОтмены, АдресРезультата) Экспорт
	
	ИнтеграцияСПлатежнымиСистемамиУНФ.ОтменитьОперациюВФоне(ПараметрыОтмены, АдресРезультата);
	
КонецПроцедуры

// Заполняет текст запроса для получения настроек интеграции оплат из указанного регистра.
//
// Параметры:
//  ТекстЗапроса - Строка - заполняемый текст запроса;
//  ИмяРегистра - Строка - имя регистра из которого необходимо отобрать настройки интеграции оплат.
//
Процедура ТекстЗапросаНастройкиИнтеграции(ТекстЗапроса, ИмяРегистра) Экспорт
	
	ТекстЗапроса = ИнтеграцияСПлатежнымиСистемамиУНФ.ТекстЗапросаНастройкиИнтеграции(
		Неопределено,
		ИмяРегистра);
	
КонецПроцедуры

// Заполняет текст запроса для получения всех существующих настроек интеграции оплат.
//
// Параметры:
//  ТекстЗапроса - Строка - заполняемый текст запроса.
//
Процедура ЗаполнитьТекстЗапросаНастройкиИнтеграции(ТекстЗапроса) Экспорт
	
	ИнтеграцияСПлатежнымиСистемамиУНФ.ЗаполнитьТекстЗапросаНастройкиИнтеграции(ТекстЗапроса);
	
КонецПроцедуры

// Заполняет подбор платежных систем при возврате СБП
//
// Параметры:
//  ДанныеПоиска - СписокЗначений - данные подбора 
//  Наименование - строка - введенные символы для автоподбора
//
Процедура ПодобратьПлатежнуюСистему(ДанныеПоиска, Наименование) Экспорт
	
	ИнтеграцияСПлатежнымиСистемамиУНФ.ПодобратьПлатежнуюСистему(ДанныеПоиска, Наименование);
	
КонецПроцедуры

// Проверяет является ли контрагент в документе юридическим лицом
//
// Параметры:
//  ЮридическоеЛицо - Булево - возвращаемый параметр
//  Документ - ДокументСсылка - документ у которого проверяется контрагент
//
Процедура КонтрагентДокументаЮридическоеЛицо(ЮридическоеЛицо, Документ) Экспорт
	
	ЮридическоеЛицо = ИнтеграцияСПлатежнымиСистемамиУНФ.КонтрагентДокументаЮридическоеЛицо(Документ);
	
КонецПроцедуры

// Проверяет является ли ВидОплаты видом оплаты платежной системы
//
// Параметры:
//  ОплатаПлатежнойСистемы - Булево - возвращаемый параметр
//  ВидОплаты - СправочникВидОплаты - документ по которому происходит поиск параметра ДокументОплаты
//
Процедура ВидОплатыПлатежнойСистемы(ОплатаПлатежнойСистемы, ВидОплаты) Экспорт
	
	ОплатаПлатежнойСистемы = ИнтеграцияСПлатежнымиСистемамиУНФ.ВидОплатыПлатежнойСистемы(ВидОплаты);
	
КонецПроцедуры

// Формирование строку, в которое добавляются все необходимые идентификаторы
// платежных систем для выполнения возврата оплаты.
//
// Параметры:
//  ИдентификаторОплаты - Строка - набор идентификаторов операции оплаты, которые должны быть переданы при возврате.
//
//  Интеграция - ОпределяемыйТип.НастройкиИнтеграцииСБПРМК,
//               ОпределяемыйТип.НастройкиИнтеграцииСПлатежнымиСистемамиРМК -
//               настройка интеграции с платежной системой.
//  ДокументОперации - ОпределяемыйТип.ДокументОперацииСБП,
//                     ОпределяемыйТип.ДокументОперацииПлатежнойСистемы - документ, который отражает
//                   оплату в информационной базе.
//
Процедура ПолучитьИдентификаторОплатыДокументаОперации(ИдентификаторОплаты, Интеграция, ДокументОперации) Экспорт
	
	ИдентификаторОплаты = ИнтеграцияСПлатежнымиСистемамиУНФ.ПолучитьИдентификаторОплатыДокументаОперации(
		Интеграция,
		ДокументОперации);
	
КонецПроцедуры

// Заполняет настройки интеграции по которым были выполнены платежные операции документа
//
// Параметры:
//  НастройкиИнтеграции - Массив Из ОпределяемыйТип.НастройкиИнтеграцииСБПРМК,
//                                  ОпределяемыйТип.НастройкиИнтеграцииСПлатежнымиСистемамиРМК -
//    возвращаемые настройки подключения, по которым были выполнены операции документа.
//  ОтложенныйДокумент - ДокументСсылка - отложенный документ по которому необходимо получить настройки
//  ПлатежнаяСистема - Строка - платежная система по которой необходиммо определить настройки интеграции отложенного документа,
//                             см. ИнтеграцияСПлатежнымиСистемамиРМККлиентСервер.ПлатежнаяСистемаСБП
//                             см. ИнтеграцияСПлатежнымиСистемамиРМККлиентСервер.ПлатежнаяСистемаЯндексПэй
//
Процедура ПолучитьНастройкиИнтеграцииОтложенногоДокумента(НастройкиИнтеграции, ОтложенныйДокумент, ПлатежнаяСистема) Экспорт
	
	ИнтеграцияСПлатежнымиСистемамиУНФ.ПолучитьНастройкиИнтеграцииОтложенногоДокумента(
		НастройкиИнтеграции,
		ОтложенныйДокумент,
		ПлатежнаяСистема);
	
КонецПроцедуры

#КонецОбласти
