
#Область СлужебныйПрограммныйИнтерфейс    

// Функция выполняет проверку сумм фискальных строк,
// осуществляя форматно-логический контроль чека.
// Функция переопределяется методом ФорматноЛогическийКонтрольПереопределяемый.ПровестиФорматноЛогическийКонтроль.
//
// Параметры:
//   ОбщиеПараметры - Структура - Полученная ранее методом ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыОперацииФискализацииЧека,
//                    и заполненная данными чека.
//                    Содержит параметры для контроля:
//                      СпособФорматноЛогическогоКонтроля - ПеречислениеСсылка.СпособыФорматноЛогическогоКонтроля - если не заполнена,
//                                                         то контроль не выполняется,
//                      ДопустимоеРасхождениеФорматноЛогическогоКонтроля - Число - по умолчанию установленное 54-ФЗ отклонение - 0.01.
//
//   ПодключаемоеОборудование - СправочникСсылка.ПодключаемоеОборудование - Не обязательный
//                              Если заполнено оборудование и не заполнен способ контроля в общих параметрах,
//                              то способ контроля и допустимое расхождение получаются из подключаемого оборудования.
//
Процедура ПровестиФорматноЛогическийКонтроль(ОбщиеПараметры, ПодключаемоеОборудование = Неопределено) Экспорт
	
	ФорматноЛогическийКонтроль.ПровестиФорматноЛогическийКонтроль(ОбщиеПараметры, ПодключаемоеОборудование);
	
КонецПроцедуры

// Функция выполняет проверку сумм фискальных строк,
// осуществляя форматно-логический контроль чека.
//
// Параметры:
//  ОбщиеПараметры - Структура
//
// Возвращаемое значение:
//  Булево
//
Функция НуженФорматноЛогическийКонтроль(ОбщиеПараметры) Экспорт
	
	Возврат ФорматноЛогическийКонтроль.НуженФорматноЛогическийКонтроль(ОбщиеПараметры);
	
КонецФункции

#КонецОбласти
