#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	Для Каждого ЭлементСтратегии из СтратегияЗаполнения() Цикл
		Методы.Вставить(ЭлементСтратегии.Значение);
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыЗаполнения

// Заполняет реквизиты и табличную часть документа на основании данных заказа поставщика.
//
// Параметры:
//   ДанныеЗаполнения - Структура - содержит ссылку на документ-основание и данные для заполнения
Процедура ЗаполнитьПоЗаказуПоставщику(ДанныеЗаполнения) Экспорт
	
	ДокументОснование = ДанныеЗаполнения.Ссылка;
	Организация = ДанныеЗаполнения.Организация;
	Контрагент = ДанныеЗаполнения.Контрагент;
	ДанныеКонтрагента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Контрагент, "НаименованиеПолное,Наименование");
	НаПолучениеОт = ?(ЗначениеЗаполнено(ДанныеКонтрагента.НаименованиеПолное), ДанныеКонтрагента.НаименованиеПолное,
		ДанныеКонтрагента.Наименование);

	Договор = ДанныеЗаполнения.Договор;
	
	Если ЗначениеЗаполнено(ДанныеЗаполнения.Ссылка)
		И НЕ (ПустаяСтрока(ДанныеЗаполнения.Ссылка.НомерВходящегоДокумента)
				ИЛИ ПустаяСтрока(ДанныеЗаполнения.Ссылка.ДатаВходящегоДокумента)) Тогда
		
		ПоДокументу = СтрШаблон(НСтр("ru ='Счет на оплату покупателя №%1 от %2'"), СокрЛП(
			ДанныеЗаполнения.Ссылка.НомерВходящегоДокумента), СокрЛП(ДанныеЗаполнения.Ссылка.ДатаВходящегоДокумента));
		
	Иначе
		
		ПоДокументу = ДанныеЗаполнения.Ссылка;
		
	КонецЕсли;
	
	НаПолучениеОт = ДанныеЗаполнения.Контрагент.НаименованиеПолное;
	БанковскийСчет = ДанныеЗаполнения.Организация.БанковскийСчетПоУмолчанию;
	ДатаДействия = ТекущаяДатаСеанса() + 5 * 24 * 60 * 60;
	
	// Заполнение табличной части документа.
	Запасы.Очистить();
	
	Для каждого СтрокаТабличнойЧасти Из ДанныеЗаполнения.Запасы Цикл
		
		Если СтрокаТабличнойЧасти.Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Запас
			Или СтрокаТабличнойЧасти.Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.ПодарочныйСертификат
		Тогда
			
			НоваяСтрока = Запасы.Добавить();
			НоваяСтрока.НаименованиеТовара = СтрокаТабличнойЧасти.Номенклатура.НаименованиеПолное;
			НоваяСтрока.ЕдиницаИзмерения = СтрокаТабличнойЧасти.ЕдиницаИзмерения;
			НоваяСтрока.Количество = СтрокаТабличнойЧасти.Количество;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Заполняет реквизиты и табличную часть доверенности на основании данных счета на оплату поставщика.
//
// Параметры:
//   ДанныеЗаполнения - Структура - содержит информацию о документе-основании и его заполнении
Процедура ЗаполнитьПоСчетуНаОплатуПоставщика(ДанныеЗаполнения) Экспорт
	
	ДокументОснование = ДанныеЗаполнения.Ссылка;
	Организация = ДанныеЗаполнения.Организация;
	Контрагент = ДанныеЗаполнения.Контрагент;
	ДанныеКонтрагента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Контрагент, "НаименованиеПолное,Наименование");
	НаПолучениеОт = ?(ЗначениеЗаполнено(ДанныеКонтрагента.НаименованиеПолное), ДанныеКонтрагента.НаименованиеПолное,
		ДанныеКонтрагента.Наименование);
	Договор = ДанныеЗаполнения.Договор;
	
	Если ЗначениеЗаполнено(ДанныеЗаполнения.Ссылка)
		И НЕ (ПустаяСтрока(ДанныеЗаполнения.Ссылка.НомерВходящегоДокумента)
				ИЛИ ПустаяСтрока(ДанныеЗаполнения.Ссылка.ДатаВходящегоДокумента)) Тогда
		
		ПоДокументу = СтрШаблон(НСтр("ru ='Счет на оплату покупателя №%1 от %2'"), СокрЛП(
			ДанныеЗаполнения.Ссылка.НомерВходящегоДокумента), СокрЛП(ДанныеЗаполнения.Ссылка.ДатаВходящегоДокумента));
		
	Иначе
		
		ПоДокументу = ДанныеЗаполнения.Ссылка;
		
	КонецЕсли;
	
	НаПолучениеОт = ДанныеЗаполнения.Контрагент.НаименованиеПолное;
	БанковскийСчет = ДанныеЗаполнения.Организация.БанковскийСчетПоУмолчанию;
	ДатаДействия = ТекущаяДатаСеанса() + 5 * 24 * 60 * 60;
	
	// Заполнение табличной части документа.
	Запасы.Очистить();
	
	Для каждого СтрокаТабличнойЧасти Из ДанныеЗаполнения.Запасы Цикл
		
		Если СтрокаТабличнойЧасти.Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Запас Тогда
			
			НоваяСтрока = Запасы.Добавить();
			НоваяСтрока.НаименованиеТовара = СтрокаТабличнойЧасти.Номенклатура.НаименованиеПолное;
			НоваяСтрока.ЕдиницаИзмерения = СтрокаТабличнойЧасти.ЕдиницаИзмерения;
			НоваяСтрока.Количество = СтрокаТабличнойЧасти.Количество;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытий

// Процедура - обработчик события ОбработкаЗаполнения.
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ДатаДействия = ТекущаяДатаСеанса() + 10 * (24 * 60 * 60);
	
	СтратегияЗаполнения = СтратегияЗаполнения();
	ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения, СтратегияЗаполнения);
	
КонецПроцедуры // ОбработкаЗаполнения()

// Процедура - обработчик события ПередЗаписью объекта.
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ОбменДаннымиСобытияУНФ.ПропуститьДозаполнениеДокумента(ЭтотОбъект, РежимЗаписи) Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнениеОбъектовУНФ.ЗаполнитьДоговорПоУмолчанию(ЭтотОбъект);
	
КонецПроцедуры // ПередЗаписью()

// Процедура - обработчик события ОбработкаПроверкиЗаполнения объекта.
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ЗаполнениеОбъектовУНФ.УдалитьПроверяемыйРеквизитДоговор(ПроверяемыеРеквизиты, ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СтратегияЗаполнения()
	Результат = Новый Соответствие;
	Результат[Тип("ДокументСсылка.ЗаказПоставщику")] = "ЗаполнитьПоЗаказуПоставщику";
	Результат[Тип("ДокументСсылка.СчетНаОплатуПоставщика")] = "ЗаполнитьПоСчетуНаОплатуПоставщика";
	Возврат Результат;
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли