#Область СлужебныйПрограммныйИнтерфейс

#Область ФормированиеДанныхККТ

// Сформировать XML для запроса КМ.
// 
// Параметры:
//  ПараметрыОперации - Структура - Параметры операции.  
// 
// Возвращаемое значение:
//   Строка
//
Функция СформироватьXMLДляЗапросаКМ(ПараметрыОперации, РевизияИнтерфейса = 0) Экспорт
	
	Возврат МенеджерОборудованияМаркировкаСлужебныйКлиентСервер.
		СформироватьXMLДляЗапросаКМ(ПараметрыОперации, РевизияИнтерфейса);
	
КонецФункции

// Получить результаты запроса КМ из XML пакета.
// 
// Параметры:
//  ДанныеXML - Строка - XML.
// 
// Возвращаемое значение:
//  Структура - Получить результаты запроса КМИз XMLПакета:
//   * КодМаркировкиПроверен - Булево -
//   * РезультатПроверки - Булево -
Функция РезультатыЗапросаКМИзXMLПакета(ДанныеXML) Экспорт
	
	Возврат МенеджерОборудованияМаркировкаСлужебныйКлиентСервер.
		РезультатыЗапросаКМИзXMLПакета(ДанныеXML);
	
КонецФункции

// Получить результаты запроса ОИСМ КМ из XML пакета.
// 
// Параметры:
//  ДанныеXML - Строка - XML.
//  Параметры - Неопределено - Параметры
// 
// Возвращаемое значение:
//  Неопределено, Структура - Получить результаты ОИСМКМИз XMLПакета:
//   * ИдентификаторЗапроса - УникальныйИдентификатор.
//   * СтатусРезультата - ПеречислениеСсылка.СтатусРезультатаЗапросаКМ.
//   * РезультатПроверкиОИСМ - Булево -
//   * КодРезультатаПроверкиОИСМ - Число -
//   * РезультатПроверкиОИСМПредставление - Строка -
//   * РезультатПроверкиСведенийОТоваре - Булево
//   * РезультатПроверкиСведенийОТовареПФ - Булево
//   * КодОбработкиЗапроса - Число
//   * СтатусОбработкиЗапроса - ПеречислениеСсылка.СтатусОбработкиЗапросаКМ.
//   * СтатусТовара - Неопределено -
Функция РезультатыОИСМКМИзXMLПакета(ДанныеXML, Параметры = Неопределено) Экспорт
	
	Возврат МенеджерОборудованияМаркировкаСлужебныйКлиентСервер.
		РезультатыОИСМКМИзXMLПакета(ДанныеXML, Параметры);
	
КонецФункции

#КонецОбласти

#КонецОбласти