
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если Справочники.НастройкиАвторизацииМакс.ИспользуетсяБезопасноеХранилищеТокенаАвторизацииМакс()
		И ЗначениеЗаполнено(ТокенАвторизации) Тогда
		Если Ссылка.Пустая() Тогда
			Возврат;
		КонецЕсли;
		Справочники.НастройкиАвторизацииМакс.ЗаписатьТокенАвторизацииМаксВБезопасноеХранилище(
			Ссылка, ТокенАвторизации);
		ТокенАвторизации = "";
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	
	Справочники.НастройкиАвторизацииМакс.УдалитьТокенАвторизацииМаксИзБезопасногоХранилища(Ссылка);
	
КонецПроцедуры

#КонецОбласти
