///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2026, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// Подсистема "Маг1С"
// ОбщийМодуль.Маг1СКлиент
//
// Все клиентские процедуры и функции для работы с mag1c
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Обработчик команды запуска процедуры проверки наличия и установки расширения mag1c
// Можно использовать в командах, создаваемых в конфигурации
//
Процедура ОткрытьФормуМастераУстановитьРасширение() Экспорт
	
	ПараметрыБазы = Маг1СВызовСервера.ПараметрыБазы();
	Если ПараметрыБазы.УжеУстановлено Тогда
		ОткрытьФормуМастера();
		ОбновитьИнтерфейс();
		Возврат;
	КонецЕсли;
	
	УстановитьРасширениеКлиент(ПараметрыБазы);
	
КонецПроцедуры

// Устанавливает расширение без доп. действий
//
Процедура УстановитьРасширение() Экспорт
	
	ПараметрыБазы = Маг1СВызовСервера.ПараметрыБазы();
	Если ПараметрыБазы.УжеУстановлено Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьРасширениеКлиент(ПараметрыБазы);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ПриНачалеРаботыСистемы() Экспорт
	Если СтрНайти(ПараметрЗапуска, "RunMag1cWizard") <> 0 Тогда
		ОткрытьФормуМастера();
	КонецЕсли;
КонецПроцедуры

// Открывает форму установки расширения в сервисе 1С:Плюс
//
Процедура ОткрытьУстановитьРасширениеMag1cВСервисеПлюс()
	
	ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку(ПлюсСервисКлиентСервер.АдресСервиса()+"/applications/catalog?state=ExtPublicId%3D"+"mag1c");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОткрытьФормуМастера()
	
	Попытка
		МодульМаг1СИнтеграцияСлужебныйКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("Маг1СИнтеграцияСлужебныйКлиент");
		МодульМаг1СИнтеграцияСлужебныйКлиент.ОбработкаКомандыОткрытьФормуПолученияИнформацииПоПрофилю();
	Исключение
		ПоказатьПредупреждение(,НСтр("ru = 'Расширение mag1c не запущено.'"));
	КонецПопытки;
	
КонецПроцедуры

Процедура УстановитьРасширениеКлиент(ПараметрыБазы) 
	
	Если ПараметрыБазы.АутентификацияИППВыполнена Тогда
		УстановитьРасширениеКлиентЗавершение(,ПараметрыБазы);
	Иначе
		ОписаниеОповещения = Новый ОписаниеОповещения("УстановитьРасширениеКлиентЗавершение", ЭтотОбъект, ПараметрыБазы);
		ИнтернетПоддержкаПользователейКлиент.ПодключитьИнтернетПоддержкуПользователей(ОписаниеОповещения);
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьРасширениеКлиентЗавершение(Результат = Истина, ПараметрыБазы = Неопределено) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДатаНачалаОперации = ТекущаяДата();
	РезультатАвторизации = Маг1СВызовСервера.ВыполнитьАвторизациюВСервисеМаг1С(ПараметрыБазы);
	ДатаОкончанияОперации = ТекущаяДата();
	
	СписокКнопок = Новый СписокЗначений;
	Тексты = Новый Массив;
	
	Если РезультатАвторизации.КодВозврата = 200 Тогда
		Если ПараметрыБазы.СервисПлюсДоступен Тогда
			ОткрытьУстановитьРасширениеMag1cВСервисеПлюс();
			Возврат;
		ИначеЕсли ПараметрыБазы.РазделениеВключено Тогда
			Текст = СтроковыеФункцииКлиент.ФорматированнаяСтрока(НСтр("ru = 'Для работы с сервисом mag1c необходимо установить расширение из каталога расширений.'"));
			Тексты.Добавить(Текст);
			Тексты.Добавить(Символы.ПС);
			Тексты.Добавить(Символы.ПС);
			
			СписокКнопок = Новый СписокЗначений();
			СписокКнопок.Добавить("ПерейтиВКаталогРасширений", НСтр("ru = 'Перейти к установке расширения'"));
		Иначе
			Текст = СтроковыеФункцииКлиент.ФорматированнаяСтрока(НСтр("ru = 'К сожалению, при начале работы с сервисом mag1c что-то пошло не так((( Подробности - в журнале регистрации.'"));
			Тексты.Добавить(Текст);
			Тексты.Добавить(Символы.ПС);
			Тексты.Добавить(Символы.ПС);
			
			СписокКнопок.Добавить("СообщитьВТехподдержку", НСтр("ru = 'Сообщить в техподдержку'"));
			СписокКнопок.Добавить("ОткрытьЖурналРегистрации", НСтр("ru = 'Открыть журнал регистрации'"));
		КонецЕсли;
	Иначе
		Текст = НСтр("ru = 'Не удалось аутентифицироваться в сервисе mag1c. Код ошибки - %1. %2'");
		Текст = СтроковыеФункцииКлиент.ФорматированнаяСтрока(Текст, РезультатАвторизации.КодВозврата, РезультатАвторизации.СообщениеОбОшибке);
		Тексты.Добавить(Текст);
		Тексты.Добавить(Символы.ПС);
		Тексты.Добавить(Символы.ПС);
		
		СписокКнопок.Добавить("СообщитьВТехподдержку", НСтр("ru = 'Сообщить в техподдержку'"));
		СписокКнопок.Добавить("ОткрытьЖурналРегистрации", НСтр("ru = 'Открыть журнал регистрации'"));
	КонецЕсли;
	
	ПараметрыДиалога = Новый Структура;
	ПараметрыДиалога.Вставить("ПараметрыБазы", ПараметрыБазы);
	ПараметрыДиалога.Вставить("ДатаНачалаОперации", ДатаНачалаОперации);
	ПараметрыДиалога.Вставить("ДатаОкончанияОперации", ДатаОкончанияОперации);
	ПараметрыДиалога.Вставить("СообщениеОбОшибке", РезультатАвторизации.СообщениеОбОшибке);
	
	ТекстПредупреждения = Новый ФорматированнаяСтрока(Тексты);
	Если СписокКнопок.Количество() = 0 Тогда
		ПоказатьПредупреждение(,ТекстПредупреждения);
	Иначе
		ПоказатьВопрос(Новый ОписаниеОповещения("ОтветНаВопросПриУстановкеРасширения", ЭтотОбъект, ПараметрыДиалога),
						ТекстПредупреждения,
						СписокКнопок);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОтветНаВопросПриУстановкеРасширения(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = "ОткрытьЖурналРегистрации" Тогда
		ПоказатьФормуЖурналаРегистрации(ДополнительныеПараметры.ДатаНачалаОперации, ДополнительныеПараметры.ДатаОкончанияОперации);
	ИначеЕсли Результат = "СообщитьВТехподдержку" Тогда
		ОтправитьСообщениеВТехПоддержку(ДополнительныеПараметры.СообщениеОбОшибке, ДополнительныеПараметры);
	ИначеЕсли Результат = "ПерейтиВКаталогРасширений" Тогда
		КаталогРасширенийКлиент.ОткрытьОбъектРасширения(Маг1СКлиентСерверПереопределяемый.ИдентификаторРасширения());
	КонецЕсли;
	
КонецПроцедуры

Процедура ПоказатьФормуЖурналаРегистрации(ДатаНачала, ДатаОкончания)
	
	ИмяФормыЖурналаРегистрации = "Обработка.ЖурналРегистрации.Форма";
	
	Отбор = Новый Структура;
	Отбор.Вставить("ДатаНачала", ДатаНачала);
	Отбор.Вставить("ДатаОкончания", ДатаОкончания);
	Отбор.Вставить("Уровень", "Ошибка");
	
	ОткрытьФорму(ИмяФормыЖурналаРегистрации, Отбор, ЭтотОбъект);
	
КонецПроцедуры

Процедура ОтправитьСообщениеВТехПоддержку(СообщениеОбОшибке, ПараметрыОперации)
	
	Тема = НСтр("ru = 'Проблема при установке расширения mag1c'");
	
	Текст = НСтр("ru = 'ИНН организации: <Укажите ИНН вашей организации>'"); 
	
	Текст = Текст + Символы.ПС + НСтр("ru = 'При установке расширения mag1c возникла следующая проблема: '");
	
	Текст = Текст + Символы.ПС +  СообщениеОбОшибке + Символы.ПС  + Символы.ПС;
	
	Если ПараметрыОперации.ПараметрыБазы.ЗначениеРазделителяСеанса <> 0 Тогда
		Текст = Текст + Символы.ПС + НСтр("ru = 'Область данных: %ЗначениеРазделителяСеанса'");
	КонецЕсли;
	
	Текст = Текст + Символы.ПС + НСтр("ru = 'Идентификатор информационной базы: %ИдентификаторИБ'");
	
	Текст = СтрЗаменить(Текст, "%Версия", ПараметрыОперации.ПараметрыБазы.ВерсияРасширения);
	Текст = СтрЗаменить(Текст, "%ЗначениеРазделителяСеанса", ПараметрыОперации.ПараметрыБазы.ЗначениеРазделителяСеанса);
	Текст = СтрЗаменить(Текст, "%ИдентификаторИБ", ПараметрыОперации.ПараметрыБазы.ИдентификаторИБ);
	
	Попытка
		ОбщегоНазначенияКлиент.ОбщийМодуль("СообщенияВСлужбуТехническойПоддержкиКлиент");
		ЕстьМодульСообщенияВСлужбуТехническойПоддержкиКлиент = Истина;
	Исключение
		ЕстьМодульСообщенияВСлужбуТехническойПоддержкиКлиент = Ложь;
	КонецПопытки;
	
	Если Не ЕстьМодульСообщенияВСлужбуТехническойПоддержкиКлиент Тогда
		ОбщийМодульИнтернетПоддержкаПользователейКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ИнтернетПоддержкаПользователейКлиент");
		
		НастройкиСоединенияССерверами = ОбщийМодульИнтернетПоддержкаПользователейКлиент.НастройкиСоединенияССерверами();
		
		ОбщийМодульИнтернетПоддержкаПользователейКлиент.ОтправитьСообщениеВТехПоддержку(
			Тема,
			Текст,
			,
			,
			Новый Структура("Логин, НастройкиСоединенияССерверами",
				ПараметрыОперации.ПараметрыБазы.ЛогинИПП,
				НастройкиСоединенияССерверами));
	Иначе
		ОбщийМодульСообщенияВСлужбуТехническойПоддержкиКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("СообщенияВСлужбуТехническойПоддержкиКлиент");
		
		ДанныеСообщения = Новый Структура;
		ДанныеСообщения.Вставить("Тема", Тема);
		ДанныеСообщения.Вставить("Сообщение", Текст);
		ДанныеСообщения.Вставить("Получатель", "webIts");
		
		ПараметрыЖурналаРегистрации = Новый Структура;
		ПараметрыЖурналаРегистрации.Вставить("ДатаНачала", ПараметрыОперации.ДатаНачалаОперации);
		ПараметрыЖурналаРегистрации.Вставить("ДатаОкончания", ПараметрыОперации.ДатаОкончанияОперации);
		ПараметрыЖурналаРегистрации.Вставить("Уровень", "Ошибка");
		ПараметрыЖурналаРегистрации.Вставить("События", Неопределено);
		ПараметрыЖурналаРегистрации.Вставить("Метаданные", Неопределено);
		ДанныеСообщения.Вставить("ЖурналРегистрации", ПараметрыЖурналаРегистрации);
		
		Попытка
			ОбщийМодульСообщенияВСлужбуТехническойПоддержкиКлиентСервер = ОбщегоНазначенияКлиент.ОбщийМодуль("СообщенияВСлужбуТехническойПоддержкиКлиентСервер");
			ДанныеСообщенияШаблон = ОбщийМодульСообщенияВСлужбуТехническойПоддержкиКлиентСервер.ДанныеСообщения();
			ЗаполнитьЗначенияСвойств(ДанныеСообщенияШаблон,ДанныеСообщения);
			ДанныеСообщения = ДанныеСообщенияШаблон;
		Исключение
		КонецПопытки;
		
		ОбщийМодульСообщенияВСлужбуТехническойПоддержкиКлиент.ОтправитьСообщение(ДанныеСообщения);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
