#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	УстановитьУсловноеОформление();

	Если Не Пользователи.ЭтоПолноправныйПользователь() Тогда
		Элементы.Эквайрер.Видимость = Ложь;
		Элементы.Договор.Видимость = Ложь;
	КонецЕсли;

	Если Параметры.РежимПлатежнойСистемы Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Касса", "Видимость", Ложь);
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список, "Недействителен", Ложь, , , Не Элементы.ПоказыватьНедействительные.Пометка);
	
	АдаптацияФормыТакси();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПоказыватьНедействительные(Команда)
	
	Элементы.ПоказыватьНедействительные.Пометка = Не Элементы.ПоказыватьНедействительные.Пометка;
		
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список, "Недействителен", Ложь, , , Не Элементы.ПоказыватьНедействительные.Пометка);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	РаботаСФормой.УстановитьУсловноеОформлениеНедействительных(Список);
КонецПроцедуры

&НаСервере
Процедура АдаптацияФормыТакси() 
	
	Если ОбщегоНазначенияКлиентСервер.ЭтоВариантИнтерфейса85() Тогда
		Возврат;
	КонецЕсли;
	
	КнопкаПоказатьНедействительные = Элементы.Найти("ПоказыватьНедействительные");
	Если КнопкаПоказатьНедействительные <> Неопределено Тогда
		Элементы.Переместить(КнопкаПоказатьНедействительные, КоманднаяПанель);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти