////////////////////////////////////////////////////////////////////////////////
// ЕдиныйНалоговыйСчетИнтеграцияФормыПереопределяемый:
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

Процедура ПоддерживаетсяВводПлатежныхДокументов(ЕстьПлатежныеДокументы, Организация) Экспорт
	
	ЕдиныйНалоговыйСчетИнтеграцияУНФ.ПоддерживаетсяВводПлатежныхДокументов(ЕстьПлатежныеДокументы, Организация);
	
КонецПроцедуры

#КонецОбласти
