#Область ПрограммныйИнтерфейс

#Область РаспределениеПродаж

Процедура ПроверитьПредупредитьОРаспределении(Идентификатор) Экспорт
	
	Если РабочееМестоКассираВызовСервера.НадоПредупредитьОРаспределенииПоЗаказам(Идентификатор) Тогда
		ТекстПредупреждения = НСтр("ru = 'Продажа по заказу покупателя может быть разбита на несколько чеков. Если получились чеки с разными организациями и сброшен флаг ""По компании"", то разбиение не выполняется.'");
		ПоказатьПредупреждение(, ТекстПредупреждения);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПредпросмотрЧека

Процедура ПредпросмотрЧекаДенежныхДокументов(Параметры, Владелец, ИдентификаторУстройства) Экспорт
	
	Если ИдентификаторУстройства <> Неопределено Тогда
		
		ПараметрыРегистрации = РабочееМестоКассираВызовСервера.ПолучитьПараметрыРегистрацииККТ(ИдентификаторУстройства);
		
		Если ПараметрыРегистрации.Свойство("ОрганизацияНазвание") Тогда
			Параметры.Вставить("ОрганизацияНазвание", ПараметрыРегистрации.ОрганизацияНазвание);
		КонецЕсли;
		
		Если ПараметрыРегистрации.Свойство("АдресРасчетов") Тогда
			Параметры.Вставить("АдресРасчетов", ПараметрыРегистрации.АдресРасчетов);
		КонецЕсли;
		
		Если ПараметрыРегистрации.Свойство("ОрганизацияИНН") Тогда
			Параметры.Вставить("ОрганизацияИНН", ПараметрыРегистрации.ОрганизацияИНН);
		КонецЕсли;
		
		Параметры = РабочееМестоКассираВызовСервера.ШаблонЧека(Параметры, Неопределено, Неопределено, ИдентификаторУстройства);
		ОсновныеПараметры = Параметры;
		ОписаниеОшибки = "";
		Если НЕ РабочееМестоКассираВызовСервера.ВыполненаПроверкаОбязательностиИПравильностиЗаполненияТэгов(ОсновныеПараметры, ИдентификаторУстройства, ОписаниеОшибки) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(ОписаниеОшибки);
		КонецЕсли;
		ИсправленыОсновныеПараметры = Ложь;
		РабочееМестоКассираВызовСервера.ПривестиДанныеКТребуемомуФормату(ОсновныеПараметры, ИсправленыОсновныеПараметры);
		Если ИсправленыОсновныеПараметры Тогда
			Параметры = ОсновныеПараметры;
		КонецЕсли;
		
	КонецЕсли;
	
	Разделитель = "------------------------------------------------";
	КУдалению = "================================================";
	ШиринаЧека = 48;
	ТекстЧека = РабочееМестоКассираВызовСервера.СформироватьТекстЧека(Параметры, ШиринаЧека);
	ТекстЧека = СтрЗаменить(ТекстЧека, КУдалению, "");
	Позиция1 = СтрНайти(ТекстЧека, Разделитель);
	Позиция2 = СтрНайти(ТекстЧека, Разделитель,, Позиция1 + 1);
	Позиция3 = СтрНайти(ТекстЧека, Разделитель,, Позиция2 + 1);
	Шапка = Лев(ТекстЧека, Позиция1 - 1);
	Состав = Сред(ТекстЧека, Позиция1 + 49, Позиция2 - Позиция1 - 50);
	Итог = Сред(ТекстЧека, Позиция2 + 49, Позиция3 - Позиция2 - 49);
	Подвал = Сред(ТекстЧека, Позиция3 + 49);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РеквизитыЧека", Шапка + Итог + Подвал);
	ПараметрыФормы.Вставить("СоставЧека", Состав);
	ПараметрыФормы.Вставить("Документ", Параметры.ДокументОснование);
	ПараметрыФормы.Вставить("КоличествоСтрок", Параметры.ПозицииЧека.Количество());
	
	ОткрытьФорму("ОбщаяФорма.ПредпросмотрЧека", ПараметрыФормы, Владелец,,,,, РежимБлокировкиПриОткрытииОкнаФормы.БлокироватьВладельца);
	
КонецПроцедуры

#КонецОбласти

#Область ПроверкаФизлицаКассира

// Определяет сотрудника пользователя и открывает форму элемента справочника
//
// Параметры:
//  Форма - УправляемаяФорма - форма, в которой пробивается чек
//
Процедура ОткрытьФормуСотрудника(Форма) Экспорт
	
	РеквизитыДокумента = УправлениеНебольшойФирмойКлиентСервер.СформироватьСтруктуруДляПроверкиКассира();
	ЗаполнитьЗначенияСвойств(РеквизитыДокумента, Форма.Объект);
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(
		Форма, "КассаДляПроверкиОтветственного")
		И ЗначениеЗаполнено(Форма.КассаДляПроверкиОтветственного) Тогда
		
		РеквизитыДокумента.КассаККМ = Форма.КассаДляПроверкиОтветственного;
		
	КонецЕсли;
	Реквизиты = РабочееМестоКассираВызовСервера.ПолучитьРеквизитыКассира(РеквизитыДокумента);
	Сотрудник = Реквизиты.Сотрудник;
	
	Если ТипЗнч(Сотрудник) <> Тип("СправочникСсылка.Сотрудники") Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Произошла ошибка'"));
		Возврат;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("УстановитьВидимостьПредупрежденияОКассире", Форма);
	ПараметрыОткрытия = Новый Структура("Ключ", Сотрудник);
	
	ОткрытьФорму(
		"Справочник.Сотрудники.ФормаОбъекта",
		ПараметрыОткрытия,
		Форма,,,,
		Оповещение,
		РежимБлокировкиПриОткрытииОкнаФормы.БлокироватьВладельца);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
