
#Область ПрограммныйИнтерфейс

// Функция показывает является ли текущая конфигурация конфигурацией УправлениеНебольшойФирмой
// 
// Параметры:
//  ОбластьДанных             - Число, Неопределено - номер области данных или Неопределено для неразделенных значений
//                                или при работе в коробке;
// Возвращаемое значение:
//  Булево - признак является ли текущая конфигурация конфигурацией УправлениеНебольшойФирмой
//
Функция ЭтоУНФ(ОбластьДанных = Неопределено) Экспорт
	
	Возврат ВозможностиПриложения.ЭтоУНФ();
	
КонецФункции

// Функция показывает является ли текущая конфигурация конфигурацией Розница
// 
// Параметры:
//  ОбластьДанных             - Число, Неопределено - номер области данных или Неопределено для неразделенных значений
//                                или при работе в коробке;
// Возвращаемое значение:
//  Булево - признак является ли текущая конфигурация конфигурацией Розница
//
Функция ЭтоРозница(ОбластьДанных = Неопределено) Экспорт
	
	Возврат ВозможностиПриложения.ЭтоРозница();
	
КонецФункции

// Позволяет определить есть ли среди реквизитов табличной части документа
// реквизит с переданным именем.
//
// Параметры:
//  ИмяРеквизита - строковое имя искомого реквизита,
//  МетаданныеДокумента - объект описания метаданных документа, среди реквизитов которого производится поиск.
//  ИмяТабЧасти  - строковое имя табличной части документа, среди реквизитов которого производится поиск
//
// Возвращаемое значение:
//  Булево - нашли реквизит с таким именем, Ложь - не нашли.
//
Функция ЕстьРеквизитТабЧастиДокумента(ИмяРеквизита, МетаданныеДокумента, ИмяТабЧасти) Экспорт

    ТабЧасть = МетаданныеДокумента.ТабличныеЧасти.Найти(ИмяТабЧасти);

    Если ТабЧасть = Неопределено Тогда // Нет такой таб. части в документе
        Возврат Ложь;

    Иначе
        Возврат НЕ (ТабЧасть.Реквизиты.Найти(ИмяРеквизита) = Неопределено);

    КонецЕсли;

КонецФункции // ЕстьРеквизитТабЧастиДокумента()

// Добавить во временную таблицу.
// 
// Параметры:
//  МенеджерВременныхТаблиц - МенеджерВременныхТаблиц - Менеджер временных таблиц
//  ИмяСуществующейТаблицы - Строка - Имя существующей таблицы в менеджере временных таблиц
//  ТаблицаДобавляемыхСтрок - ТаблицаЗначений - Таблица добавляемых строк. Колонки и их типы должны 
//												соответствовать временной таблице.
Процедура ДобавитьСтрокиВоВременнуюТаблицу(МенеджерВременныхТаблиц, ИмяСуществующейТаблицы, ТаблицаДобавляемыхСтрок) Экспорт
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	ОписаниеСуществующейТаблицы = МенеджерВременныхТаблиц.Таблицы[ИмяСуществующейТаблицы];
	ПоляВыборки = Новый Массив;
	ТипизированнаяТаблица = Новый ТаблицаЗначений();
	Для Каждого КолонкаВТ Из ОписаниеСуществующейТаблицы.Колонки Цикл
		ТипизированнаяТаблица.Колонки.Добавить(КолонкаВТ.Имя, КолонкаВТ.ТипЗначения);
		ПоляВыборки.Добавить("ТЗ." + КолонкаВТ.Имя + " КАК " + КолонкаВТ.Имя);
	КонецЦикла;
	Для Каждого СтрокаДобавить Из ТаблицаДобавляемыхСтрок Цикл
		ЗаполнитьЗначенияСвойств(ТипизированнаяТаблица.Добавить(), СтрокаДобавить);
	КонецЦикла;
	
	ТекстЗапроса = 
	"Выбрать 
	|	%ПоляВыборки
	|Добавить %ИмяСуществующейТаблицы
	|Из &ДобавляемаяТаблица Как ТЗ";
	РазделительПолей = "," + Символы.ПС + Символы.Таб;
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%ИмяСуществующейТаблицы", ИмяСуществующейТаблицы);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%ПоляВыборки", СтрСоединить(ПоляВыборки, РазделительПолей));
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("ДобавляемаяТаблица", ТипизированнаяТаблица);
	Запрос.Выполнить();		
КонецПроцедуры

// Проверяет, используется ли касса ККМ в отчетах о розничных продажах
//
// Параметры:
//   КассаККМ - СправочникСсылка.КассыККМ - касса ККМ, использование которой проверяется
//
// Возвращаемое значение:
//   Булево - Истина, если касса ККМ используется хотя бы в одном отчете о розничных продажах, иначе Ложь
Функция КассаККМИспользуетсяВРозничныхПродажах(КассаККМ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ОтчетОРозничныхПродажах.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ОтчетОРозничныхПродажах КАК ОтчетОРозничныхПродажах
		|ГДЕ
		|	ОтчетОРозничныхПродажах.КассаККМ = &КассаККМ";
	
	Запрос.УстановитьПараметр("КассаККМ", КассаККМ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Возврат Выборка.Следующий();
	
КонецФункции

#КонецОбласти
