#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтоИнтерфейсТакси = Не ОбщегоНазначенияКлиентСервер.ЭтоВариантИнтерфейса85();
	
	Если Параметры.Свойство("Розница") Тогда
	
		СписокЗначений = Новый СписокЗначений;
		СписокЗначений.Добавить(Перечисления.ТипыСтруктурныхЕдиниц.Розница);
		СписокЗначений.Добавить(Перечисления.ТипыСтруктурныхЕдиниц.РозницаСуммовойУчет);
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,
			"СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы", СписокЗначений, ВидСравненияКомпоновкиДанных.ВСписке);
	
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.Список.КоманднаяПанель;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды 
	ПечатьДокументовУНФ.УстановитьОтображениеПодменюПечати(Элементы.ПодменюПечать);
	
	ДинамическиеСпискиУНФ.ОтображатьТолькоВремяДляТекущейДаты(Список);
	
	// ПоложениеТаблицыДетали
	КлючОбъекта = СтрЗаменить(ИмяФормы, ".", "");
	ПанельДеталиРазвернута = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(КлючОбъекта, 
		"ПанельДеталиРазвернута", Истина);
	
	ПоложениеТаблицыДетали = ПерсональныеНастройкиРУНФ.Прочитать("ПоложениеТаблицыДеталиВИнвентаризацияхЗапасов");
	
	ЭтоМобильныйКлиент = ОбщегоНазначения.ЭтоМобильныйКлиент();
	Если ЭтоМобильныйКлиент Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, 
			"ФормаНастроитьФорму", "Видимость", Ложь);
		ПоложениеТаблицыДетали = Перечисления.ПоложениеТаблицыДетали.ВПравойПанели;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ПоложениеТаблицыДетали) Тогда
		ПоложениеТаблицыДетали = Перечисления.ПоложениеТаблицыДетали.ВПравойПанели;
	КонецЕсли;
	
	НастроитьПоложениеПанелиДетали(ЭтотОбъект);
	// Конец ПоложениеТаблицыДетали
	
	// УНФ.ОтборыСписка
	УстановитьВидимостьОтборов();
	РаботаСОтборами.ОпределитьПорядокПредопределенныхОтборов(ЭтотОбъект);
	РаботаСОтборами.ВосстановитьНастройкиОтборов(ЭтотОбъект, Список);
	
	ВремяЗадержкиОбработчиковОжидания = 0.3;
	
	// ОбратнаяСвязь
	ОбратнаяСвязь.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ОбратнаяСвязь
	
	АдаптацияФормыТакси();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если НЕ ЗавершениеРаботы Тогда
		// УНФ.ОтборыСписка
		СохранитьНастройкиОтборов();
		// Конец УНФ.ОтборыСписка
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ВремяЗадержкиОбработчиковОжидания = ДокументыУНФКлиент.ВремяЗадержкиОбработчиковОжидания();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_ИнвентаризацияЗапасов" И ТипЗнч(Параметр) = Тип("ДокументСсылка.ИнвентаризацияЗапасов") Тогда
		Если Параметр = Элементы.Список.ТекущаяСтрока Тогда
			ПроверитьОбновитьДеталиПоДокументу();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ЗначокФильтрыНажатие(Элемент)
	
	СвернутьРазвернутьПанельОтборов();
	ТекущаяСтраница = Элементы.ФильтрыНастройкиИДопИнфо;
	Элементы.ПраваяПанельСтраницы.ТекущаяСтраница = ТекущаяСтраница;
	
КонецПроцедуры

&НаКлиенте
Процедура ИндексФильтрыНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СвернутьРазвернутьПанельОтборов();
	ТекущаяСтраница = Элементы.ФильтрыНастройкиИДопИнфо;
	Элементы.ПраваяПанельСтраницы.ТекущаяСтраница = ТекущаяСтраница;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначокДеталиНажатие(Элемент)
	
	СвернутьРазвернутьПанельОтборов();
	ТекущаяСтраница = Элементы.Детали;
	Элементы.ПраваяПанельСтраницы.ТекущаяСтраница = ТекущаяСтраница;
	
	ПроверитьОбновитьДеталиПоДокументу();
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьОткрытьДокументОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки,
	СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьТекущийДокумент(Элементы.Список.ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьПодСпискомОткрытьДокументОбработкаНавигационнойСсылки(Элемент,
	НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьТекущийДокумент(Элементы.Список.ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеПериодаТаксиНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	РаботаСОтборамиКлиент.ПредставлениеПериодаВыбратьПериод(ЭтотОбъект, "Список", "Дата");
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеПериодаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	РаботаСОтборамиКлиент.ПредставлениеПериодаВыбратьПериод(ЭтотОбъект, "Список", "Дата");
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеПериодаОчистка(Элемент, СтандартнаяОбработка)
	
	РаботаСОтборамиКлиент.СброситьОтборПоПериоду(ЭтотОбъект, "Список", "Дата");
	
КонецПроцедуры

&НаКлиенте
Процедура ПраваяПанельСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	ПроверитьОбновитьДеталиПоДокументу();
	
КонецПроцедуры

#Область Отборы

//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_МеткаОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки,
	СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;

	МеткаИД = Сред(Элемент.Имя, СтрДлина("Метка_") + 1);
	УдалитьМеткуОтбора(МеткаИД);

КонецПроцедуры

//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ОтборПриИзменении(Элемент)
	
	Подключаемый_ОтборПриИзмененииНаСервере(Элемент.Имя, Элемент.Родитель.Имя);
	
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ОтборПриИзмененииНаСервере(ЭлементИмя, ЭлементРодительИмя)
	
	РаботаСОтборами.Подключаемый_ОтборПриИзменении(ЭтотОбъект, ЭлементИмя, ЭлементРодительИмя);
	
КонецПроцедуры

//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ОтборОчистка(Элемент)
	
	Подключаемый_ОтборОчисткаНаСервере(Элемент.Имя, Элемент.Родитель.Имя);
	
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ОтборОчисткаНаСервере(ЭлементИмя, ЭлементРодительИмя)
	
	РаботаСОтборами.Подключаемый_ОтборОчистка(ЭтотОбъект, ЭлементИмя);

КонецПроцедуры

&НаКлиенте
Процедура ОтборСкладОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьМеткуИОтборСписка("СтруктурнаяЕдиница", Элемент.Родитель.Имя, ВыбранноеЗначение);
	ВыбранноеЗначение = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборОрганизацияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)

	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;

	УстановитьМеткуИОтборСписка("Организация", Элемент.Родитель.Имя, ВыбранноеЗначение);
	ВыбранноеЗначение = Неопределено;

КонецПроцедуры

&НаКлиенте
Процедура ОтборОтклоненияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)

	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;

	УстановитьМеткуИОтборСписка("Отклонения", Элемент.Родитель.Имя, ВыбранноеЗначение);
	ВыбранноеЗначение = Неопределено;

КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	ОбновитьДеталиДокумента = ВидимыДанныеДетали();
	
	Если ОбновитьДеталиДокумента Тогда
		ПодключитьОбработчикОжидания("СписокПриАктивизацииСтрокиОбработчик", ВремяЗадержкиОбработчиковОжидания, Истина);
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриНаведении(Элемент, Строка, Поле)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

#Область ЗамерыПроизводительности

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	ОценкаПроизводительностиКлиент.ЗамерВремени("СозданиеФормы"
		+ РаботаСФормойДокументаКлиентСервер.ПолучитьИмяФормыСтрокой(ИмяФормы));
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломИзменения(Элемент, Отказ)
	
	ОценкаПроизводительностиКлиент.ЗамерВремени("ОткрытиеФормы"
		+ РаботаСФормойДокументаКлиентСервер.ПолучитьИмяФормыСтрокой(ИмяФормы));
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьПоШаблону(Команда)
	
	ЗаполнениеОбъектовУНФКлиент.ПоказатьВыборШаблонаДляСозданияДокументаИзСписка(
	"Документ.ИнвентаризацияЗапасов",
	Список.КомпоновщикНастроек.Настройки.Отбор.Элементы,
	Элементы.Список.ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьОтборы(Команда)
	
	ИмяРеквизитаСписка = "Список";
	ИмяТЧДанныеМеток = "ДанныеМеток";
	ИмяТЧДанныеОтборов = "ДанныеОтборов";
	ИмяГруппыОтборов = "ГруппаОтборы";
	ИмяПредопределенныеОтборыПоУмолчанию = "ПредопределенныеОтборыПоУмолчанию";
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяРеквизитаСписка", ИмяРеквизитаСписка);
	ДополнительныеПараметры.Вставить("ИмяТЧДанныеМеток", ИмяТЧДанныеМеток);
	ДополнительныеПараметры.Вставить("ИмяТЧДанныеОтборов", ИмяТЧДанныеОтборов);
	ДополнительныеПараметры.Вставить("ИмяГруппыОтборов", ИмяГруппыОтборов);
	ДополнительныеПараметры.Вставить("ИмяПредопределенныеОтборыПоУмолчанию", ИмяПредопределенныеОтборыПоУмолчанию);
	
	РаботаСОтборамиКлиент.НастроитьОтборыНажатие(ЭтотОбъект, ПараметрыОткрытияФормыСНастройкамиОтборов(ДополнительныеПараметры), ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура СброситьВсеОтборы(Команда)
	РаботаСОтборамиКлиент.СброситьОтборПоПериоду(ЭтотОбъект, "Список", "Дата");
	СброситьВсеМеткиОтбораНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СвернутьПравуюПанель(Команда)
	
	СвернутьРазвернутьПанельОтборов();
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьФорму(Команда)
	
	ОткрытьФормуНастройки(Истина);
	СтатистикаИспользованияФормКлиент.ПриИнтерактивномДействии(ЭтотОбъект, Элементы.ФормаНастроитьФорму, "Нажатие");

КонецПроцедуры

&НаКлиенте
Процедура СвернутьРазвернутьДетали(Команда)
	
	ПанельДеталиРазвернута = НЕ ПанельДеталиРазвернута;
	ОбработатьПанельПредпросмотра();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура НастройкаОтборовЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НастройкаОтборовЗавершениеНаСервере(Результат.АдресВыбранныеОтборы, Результат.АдресУдаленныеОтборы, ДополнительныеПараметры);
	
КонецПроцедуры

&НаСервере
Процедура НастройкаОтборовЗавершениеНаСервере(АдресВыбранныеОтборы, АдресУдаленныеОтборы, ДополнительныеПараметры)
	
	РаботаСОтборами.НастройкаОтборовЗавершение(ЭтотОбъект, АдресВыбранныеОтборы, АдресУдаленныеОтборы);
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкиОтборов()
	
	РаботаСОтборами.СохранитьНастройкиОтборов(ЭтотОбъект);
	
	КлючОбъекта = СтрЗаменить(ИмяФормы, ".", "");
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(КлючОбъекта, 
		"ПанельДеталиРазвернута", ПанельДеталиРазвернута);
	
КонецПроцедуры

&НаСервере
Процедура УдалитьМеткуОтбора(МеткаИД)
	
	РаботаСОтборами.УдалитьМеткуОтбораСервер(ЭтотОбъект, Список, МеткаИД);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьМеткуИОтборСписка(ИмяПоляОтбораСписка, ГруппаРодительМетки, ВыбранноеЗначение, ПредставлениеЗначения="")
	
	Если ГруппаРодительМетки = "ГруппаОтборОплата" Тогда
		ПредставлениеЗначения = РаботаСОтборами.СформироватьПредставлениеМеткиОплата(ВыбранноеЗначение);
		Если ИмяПоляОтбораСписка = "НомерКартинкиОплаты" Тогда
			ВыбранноеЗначение = РаботаСОтборами.НомерКартинкиПоСтатусуОплаты(ВыбранноеЗначение);
		КонецЕсли;
	ИначеЕсли ПредставлениеЗначения="" Тогда
		ПредставлениеЗначения=Строка(ВыбранноеЗначение);
	КонецЕсли;
	
	РаботаСОтборами.ПрикрепитьМеткуОтбора(ЭтотОбъект, ИмяПоляОтбораСписка, ГруппаРодительМетки, ВыбранноеЗначение, ПредставлениеЗначения);
	РаботаСОтборами.УстановитьОтборСписка(ЭтотОбъект, Список, ИмяПоляОтбораСписка);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьОтборов()
	
	Если НЕ ПолучитьФункциональнуюОпцию("УчетПоНесколькимСкладам") Тогда
		Элементы.ОтборСклад.Видимость = Ложь;
		Элементы.ГруппаОтборСклад.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СброситьВсеМеткиОтбораНаСервере()
	РаботаСОтборами.УдалитьМеткиОтбораСервер(ЭтотОбъект, Список);
КонецПроцедуры

&НаСервере
Функция ПараметрыОткрытияФормыСНастройкамиОтборов(ДополнительныеПараметры)
	
	Возврат РаботаСОтборами.ПараметрыДляОткрытияФормыСНастройкамиОтборов(ЭтотОбъект, ДополнительныеПараметры);
	
КонецФункции

#Область ОбратнаяСвязь

&НаКлиенте
Процедура Подключаемый_ОбратнаяСвязьБольшеНеПоказывать(Команда)
	
	ОбратнаяСвязьКлиент.ОбратнаяСвязьБольшеНеПоказывать(ЭтотОбъект, Истина);
	ВосстановитьПравуюПанельПослеОпроса();
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбратнаяСвязьПройтиСейчас(Команда)
	
	ПараметрыФормы = Новый Структура("ИнтерактивноеОткрытие", Ложь);
	ОбработкаЗавершения = Новый ОписаниеОповещения("ОпросНачалоРаботыЗавершение", ЭтотОбъект);
	ОткрытьФорму("Обработка.ОбратнаяСвязь.Форма.ОпросНачалоРаботы", ПараметрыФормы, , , , , ОбработкаЗавершения);
	ВосстановитьПравуюПанельПослеОпроса();
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбратнаяСвязьОтложить(Команда)
	
	ОбратнаяСвязьКлиент.ОбратнаяСвязьОтложить(ЭтотОбъект);
	ВосстановитьПравуюПанельПослеОпроса();
	
КонецПроцедуры

&НаКлиенте
Процедура ОпросНачалоРаботыЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Структура") И Результат.Свойство("ОпросЗавершен") Тогда
		Если Результат.ОпросЗавершен Тогда
			ОбратнаяСвязьКлиент.ОбратнаяСвязьБольшеНеПоказывать(ЭтотОбъект);
			ВосстановитьПравуюПанельПослеОпроса();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВосстановитьПравуюПанельПослеОпроса() Экспорт
	
	ИмяРеквизитаНачальноеСостояниеПравойПанели = "ОбратнаяСвязь_НачальноеСостояниеПравойПанели";
	ИмяРеквизитаПоказыватьОпрос = "ОбратнаяСвязь_ПоказыватьОпрос";
	ЭтотОбъект[ИмяРеквизитаПоказыватьОпрос] = Ложь;
	Если ЭтотОбъект[ИмяРеквизитаНачальноеСостояниеПравойПанели] Тогда
		СвернутьРазвернутьПанельОтборов();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиБиблиотек

// СтандартныеПодсистемы.ПодключаемыеКоманды
//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Элементы.Список);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Элементы.Список);
КонецПроцедуры

//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область ПереводНа85

&НаСервере
Процедура АдаптацияФормыТакси()
	
	Если Не ЭтоИнтерфейсТакси Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.Переместить(Элементы.ГруппаСоздать, КоманднаяПанель, Элементы.ГруппаВажныеКоманды);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаДетали",
		"ВертикальныйИнтервал", ИнтервалМеждуЭлементамиФормы.Авто);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтрокиОбработчик()
	
	Если ОбновитьДеталиДокумента Тогда
		ОбновитьДанныеПравойПанели(ОбновитьДеталиДокумента);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеПравойПанели(ОбновитьДД)
	
	Если ОбновитьДД Тогда
		ЗаполнитьПанельДетали();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуНастройки(ПередаватьВидДокумента)
	
	СтруктураПараметров = Новый Структура;
	
	Если ПередаватьВидДокумента Тогда
		СтруктураПараметров.Вставить("ВидДокумента", НСтр("ru = 'список инвентаризаций запасов'"));
	КонецЕсли;
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("ПоложениеТаблицыДеталиВИнвентаризацияхЗапасов",
		НСтр("ru = 'Положение таблицы ""Запасы""'"));
	
	СтруктураПараметров.Вставить("БылиВнесеныИзменения", Ложь);
	СтруктураПараметров.Вставить("ПоложениеТаблицыДеталиВИнвентаризацияхЗапасов",
		ПоложениеТаблицыДетали);
	СтруктураПараметров.Вставить("Заголовки", Заголовки);
		
	ОткрытьФорму("ОбщаяФорма.ШапкаТабличнаяЧасть", СтруктураПараметров, , , , , 
		Новый ОписаниеОповещения("ШапкаТабличнаяЧастьЗавершение", ЭтотОбъект));

КонецПроцедуры

&НаКлиенте
Процедура ШапкаТабличнаяЧастьЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Структура") И Результат.БылиВнесеныИзменения Тогда
		Если ПоложениеТаблицыДетали <> Результат.ПоложениеТаблицыДеталиВИнвентаризацияхЗапасов Тогда
			ПоложениеТаблицыДетали = Результат.ПоложениеТаблицыДеталиВИнвентаризацияхЗапасов;
			НастроитьПоложениеПанелиДетали(ЭтотОбъект);
			ДеталиВидимы = ВидимыДанныеДетали();
			Если ДеталиВидимы Тогда
				ЗаполнитьПанельДетали();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#Область ПредпросмотрДокумента

&НаКлиенте
Процедура ПроверитьОбновитьДеталиПоДокументу()
	
	ОбновитьДетали = ВидимыДанныеДетали();
	Если ОбновитьДетали Тогда
		ОбновитьДанныеПравойПанели(ОбновитьДетали);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьТекущийДокумент(СсылкаНаДокумент)
	
	Если СсылкаНаДокумент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьЗначениеАсинх(СсылкаНаДокумент);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьПанельПредпросмотра()
	
	Если ПанельДеталиРазвернута Тогда
		КартинкаКоманды = БиблиотекаКартинок.СтрелкаРазвернутаяГруппа;
	Иначе
		КартинкаКоманды = БиблиотекаКартинок.СтрелкаСвернутаяГруппа;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СвернутьРазвернутьДетали", "Картинка",
			КартинкаКоманды);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаДеталиДокумента",
		"Видимость", ПанельДеталиРазвернута);
		
	ЗаполнитьПанельДетали();
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьПоложениеПанелиДетали(Форма)
	
	Элементы = Форма.Элементы;
	ДеталиВПравойПанели = Форма.ПоложениеТаблицыДетали = ПредопределенноеЗначение(
		"Перечисление.ПоложениеТаблицыДетали.ВПравойПанели");
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СодержаниеДокумента", "Видимость",
		ДеталиВПравойПанели);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаДеталиРеквизитыДокумента",
		"Видимость", Не ДеталиВПравойПанели);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаДетали", "Видимость",
		Не ДеталиВПравойПанели);
	
	ПанельДеталиРазвернута = Форма.ПанельДеталиРазвернута;
	
	Если ПанельДеталиРазвернута Тогда
		Элементы.СвернутьРазвернутьДетали.Картинка = БиблиотекаКартинок.СтрелкаРазвернутаяГруппа;
	Иначе
		Элементы.СвернутьРазвернутьДетали.Картинка = БиблиотекаКартинок.СтрелкаСвернутаяГруппа;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаДеталиДокумента", 
		"Видимость", ПанельДеталиРазвернута);
	
КонецПроцедуры

&НаКлиенте
Функция ВидимыДанныеДетали()
	
	Результат = Ложь;
	
	Если ТипЗнч(Элементы.Список.ТекущаяСтрока) = Тип("СтрокаГруппировкиДинамическогоСписка") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Элементы.Список.ТекущаяСтрока = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ДеталиВПравойПанели = ПоложениеТаблицыДетали = ПредопределенноеЗначение(
		"Перечисление.ПоложениеТаблицыДетали.ВПравойПанели");
	ТекущаяСтраницаДетали = Элементы.ПраваяПанельСтраницы.ТекущаяСтраница = Элементы.Детали;
	ПраваяПанельСвернута = Элементы.ПраваяПанельСвернутая.Видимость;

	Если ДеталиВПравойПанели И Не ПраваяПанельСвернута И ТекущаяСтраницаДетали
		ИЛИ Не ДеталиВПравойПанели И ПанельДеталиРазвернута
		ИЛИ Не ДеталиВПравойПанели И Не ПанельДеталиРазвернута И ТекущаяСтраницаДетали Тогда
			Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьПанельДетали()
	
	ТекущийДокумент = Элементы.Список.ТекущаяСтрока;
	Если ТекущийДокумент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДеталиПодСписком = Элементы.ГруппаДетали.Видимость И ПанельДеталиРазвернута;
	ДеталиВПравойПанели = Не Элементы.ПраваяПанельСвернутая.Видимость
		И Элементы.ПраваяПанельСтраницы.ТекущаяСтраница = Элементы.Детали;
	
	Если Не (ДеталиПодСписком Или ДеталиВПравойПанели) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 100
	|	ИнвентаризацияЗапасовЗапасы.НомерСтроки КАК НомерСтроки,
	|	ИнвентаризацияЗапасовЗапасы.Номенклатура КАК Номенклатура,
	|	ИнвентаризацияЗапасовЗапасы.Характеристика КАК Характеристика,
	|	ИнвентаризацияЗапасовЗапасы.Партия КАК Партия,
	|	ИнвентаризацияЗапасовЗапасы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ИнвентаризацияЗапасовЗапасы.Цена КАК Цена,
	|	ИнвентаризацияЗапасовЗапасы.Сумма КАК Сумма,
	|	ИнвентаризацияЗапасовЗапасы.СуммаУчет КАК СуммаУчет,
	|	ИнвентаризацияЗапасовЗапасы.КоличествоУчет КАК КоличествоУчет,
	|	ИнвентаризацияЗапасовЗапасы.Количество КАК Количество
	|ИЗ
	|	Документ.ИнвентаризацияЗапасов.Запасы КАК ИнвентаризацияЗапасовЗапасы
	|ГДЕ
	|	ИнвентаризацияЗапасовЗапасы.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(*) КАК КоличествоСтрок
	|ИЗ
	|	Документ.ИнвентаризацияЗапасов.Запасы КАК ИнвентаризацияЗапасовЗапасы
	|ГДЕ
	|	ИнвентаризацияЗапасовЗапасы.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ИнвентаризацияЗапасовЗапасы.Излишки) КАК Излишки,
	|	СУММА(ИнвентаризацияЗапасовЗапасы.Недостача) КАК Недостача
	|ИЗ
	|	Документ.ИнвентаризацияЗапасов.Запасы КАК ИнвентаризацияЗапасовЗапасы
	|ГДЕ
	|	ИнвентаризацияЗапасовЗапасы.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ТекущийДокумент);
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	ТаблицаЗапасы = МассивРезультатов[0].Выгрузить();
	НомерСтроки = 1;
	СодержаниеДокумента.Очистить();
	Для каждого СтрокаТаблицы Из ТаблицаЗапасы Цикл
		НоваяСтрокаСодержание = СодержаниеДокумента.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаСодержание, СтрокаТаблицы);
		НоваяСтрокаСодержание.НомерСтроки = НомерСтроки;
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла;
	
	ДанныеОКоличестве = МассивРезультатов[1].Выбрать();
	КоличествоСтрокВДокументе = 0;
	Если ДанныеОКоличестве.Следующий() Тогда
		КоличествоСтрокВДокументе = ДанныеОКоличестве.КоличествоСтрок;
	КонецЕсли;
	
	Итоги = МассивРезультатов[2].Выбрать();
	Если Итоги.Следующий() Тогда
		ДеталиИзлишки = Итоги.Излишки;
		ДеталиНедостача = Итоги.Недостача;
	КонецЕсли;
	
	ВидимостьОткрытьДокумент = КоличествоСтрокВДокументе > 100;
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "НадписьОткрытьДокумент",
		"Видимость", ВидимостьОткрытьДокумент);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "НадписьПодСпискомОткрытьДокумент",
		"Видимость", ВидимостьОткрытьДокумент);
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура СвернутьРазвернутьПанельОтборов()
	
	НовоеЗначениеВидимость = НЕ Элементы.ПраваяПанельСтраницы.Видимость;
	РаботаСОтборамиКлиент.СвернутьРазвернутьПанельОтборов(ЭтотОбъект, НовоеЗначениеВидимость);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
