
#Область СлужебныйПрограммныйИнтерфейс

Функция НастройкиИнтеграцииПлатежнойСистемы(Интеграция, ПараметрыНастройки = Неопределено) Экспорт
	
	НастройкиИнтеграции = ИнтеграцияСПлатежнымиСистемамиРМККлиентСервер.НовыйНастройкиИнтеграцииПлатежнойСистемы();
	ИнтеграцияСПлатежнымиСистемамиРМКПереопределяемый.ЗаполнитьНастройкиИнтеграцииПлатежнойСистемы(
		НастройкиИнтеграции,
		Интеграция,
		ПараметрыНастройки);
	
	Возврат НастройкиИнтеграции;
	
КонецФункции

Функция ПолучитьМагазинПоКассеККМ(КассаККМ) Экспорт
	
	Магазин = Неопределено;
	
	ИнтеграцияСПлатежнымиСистемамиРМКПереопределяемый.ЗаполнитьМагазинПоКассеККМ(Магазин, КассаККМ);
	
	Возврат Магазин;
	
КонецФункции

Функция ПолучитьПараметрыДокументаОплаты(ЧекККМПродажа) Экспорт
	
	ПараметрыВозврата = Новый Структура("ВидОплатыВозврата");
	
	ИнтеграцияСПлатежнымиСистемамиРМКПереопределяемый.ЗаполнитьПараметрыДокументаОплаты(ПараметрыВозврата, ЧекККМПродажа);
	
	Возврат ПараметрыВозврата;
	
КонецФункции

Функция ПолучитьНастройкиИнтеграцииОтложенногоДокумента(ДокументОперации, ПлатежнаяСистема) Экспорт
	
	НастройкиИнтеграции = Новый Массив;
	
	ИнтеграцияСПлатежнымиСистемамиРМКПереопределяемый.ПолучитьНастройкиИнтеграцииОтложенногоДокумента(
		НастройкиИнтеграции,
		ДокументОперации,
		ПлатежнаяСистема);
	
	Возврат НастройкиИнтеграции;
	
КонецФункции

Процедура СформироватьДанныеQRКода(СтруктураКода, Интеграция, Идентификатор, УникальныйИдентификатор) Экспорт
	
	СтруктураКода = Новый Структура;
	СтруктураКода.Вставить("ИдентификаторQRКода", Идентификатор);
	СтруктураКода.Вставить("КартинкаQRКода",      Неопределено);
	СтруктураКода.Вставить("ДанныеQRКода",        ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор));
	
	ИнтеграцияСПлатежнымиСистемамиРМКПереопределяемый.СформироватьДанныеQRКода(
		СтруктураКода,
		Интеграция,
		Идентификатор,
		УникальныйИдентификатор);
	
КонецПроцедуры

Функция ПолучитьИдентификаторОплаты(ЗаявкаНаОплату, УникальныйИдентификатор) Экспорт
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Формирование идентификатора оплаты.'");
	
	Если Не ЗначениеЗаполнено(ЗаявкаНаОплату.ДокументОплаты) Тогда
		
		СтруктураНовойСсылки= Новый Структура("ЧекККМВОбработке");
		ИнтеграцияСПлатежнымиСистемамиРМКПереопределяемый.ЗаполнитьСсылкуНовогоЧекаККМ(СтруктураНовойСсылки);
		
		ЗаявкаНаОплату.ДокументОплаты = СтруктураНовойСсылки.ЧекККМВОбработке;
		
	КонецЕсли;
	
	РезультатВыполнения = ДлительныеОперации.ВыполнитьФункцию(
		ПараметрыВыполнения,
		"ИнтеграцияСПлатежнымиСистемамиРМКСлужебный.ИдентификаторОплатыВПлатежнойСистеме",
		ЗаявкаНаОплату);
		
	Возврат РезультатВыполнения;
	
КонецФункции

Функция ПолучитьИдентификаторОплатыДокументаОперации(Интеграция, ДокументОперации) Экспорт
	
	ИдентификаторОплаты = "";
	
	ИнтеграцияСПлатежнымиСистемамиРМКПереопределяемый.ПолучитьИдентификаторОплатыДокументаОперации(
		ИдентификаторОплаты,
		Интеграция,
		ДокументОперации);
	
	Возврат ИдентификаторОплаты;
	
КонецФункции

Функция ОпределитьСтатусОплатыОплаты(ДокументОплаты, Интеграция, УникальныйИдентификатор) Экспорт
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("ДокументОплаты", ДокументОплаты);
	ПараметрыПроцедуры.Вставить("Интеграция",     Интеграция);
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Проверка статуса оплаты.'");
	
	РезультатВыполнения = ДлительныеОперации.ВыполнитьФункцию(
		ПараметрыВыполнения,
		"ИнтеграцияСПлатежнымиСистемамиРМКСлужебный.СтатусОплатыВПлатежнойСистеме",
		ПараметрыПроцедуры);
	
	Возврат РезультатВыполнения;
	
КонецФункции

Функция ВозвратОплаты(ЗаявкаНаВозврат, УникальныйИдентификатор) Экспорт
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Возврат оплаты в платежной системе.'");
	
	Если Не ЗначениеЗаполнено(ЗаявкаНаВозврат.ДокументВозврата) Тогда
		
		СтруктураНовойСсылки			 = Новый Структура("ЧекККМВОбработке");
		ИнтеграцияСПлатежнымиСистемамиРМКПереопределяемый.ЗаполнитьСсылкуНовогоЧекаККМ(СтруктураНовойСсылки, Истина);
		
		ЗаявкаНаВозврат.ДокументВозврата = СтруктураНовойСсылки.ЧекККМВОбработке;
		
	КонецЕсли;
	
	РезультатВыполнения = ДлительныеОперации.ВыполнитьФункцию(
		ПараметрыВыполнения,
		"ИнтеграцияСПлатежнымиСистемамиРМКСлужебный.ВозвратОплаты",
		ЗаявкаНаВозврат);
	
	Возврат РезультатВыполнения;
	
КонецФункции

Функция ПодтвердитьВозврат(ДокументВозврата, Интеграция) Экспорт
	
	РезультатОперации = Новый Структура;
	РезультатОперации.Вставить("СтатусОперации");
	РезультатОперации.Вставить("КодОшибки", "МетодНеОпределен");
	РезультатОперации.Вставить("СообщениеОбОшибке", НСтр("ru = 'Метод не определен'"));
	
	ИнтеграцияСПлатежнымиСистемамиРМКПереопределяемый.ПодтвердитьВозврат(РезультатОперации, ДокументВозврата, Интеграция);
	
	Возврат РезультатОперации;
	
КонецФункции

Функция ОпределитьСтатусВозврата(ДокументВозврата, Интеграция, УникальныйИдентификатор) Экспорт
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("ДокументВозврата", ДокументВозврата);
	ПараметрыПроцедуры.Вставить("Интеграция",  		Интеграция);
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Проверка статуса возврата.'");
	
	РезультатВыполнения = ДлительныеОперации.ВыполнитьФункцию(
		ПараметрыВыполнения,
		"ИнтеграцияСПлатежнымиСистемамиРМКСлужебный.СтатусВозвратОплаты",
		ПараметрыПроцедуры);
	
	Возврат РезультатВыполнения;
	
КонецФункции

Функция ОтменитьОперацию(ДокументОплаты,
	ДанныеКассовойСсылки,
	Интеграция,
	ИдентификаторЗаданияФормированияQRКода,
	ИдентификаторЗаданияПроверкиСтатуса,
	ИдентификаторЗаданияВозврата,
	УникальныйИдентификатор) Экспорт
	
	ОтменитьФоновыеЗадания(
		ИдентификаторЗаданияФормированияQRКода,
		ИдентификаторЗаданияПроверкиСтатуса,
		ИдентификаторЗаданияВозврата);
	
	РезультатОперации = Новый Структура;
	РезультатОперации.Вставить("СтатусОперации");
	РезультатОперации.Вставить("КодОшибки", "МетодНеОпределен");
	РезультатОперации.Вставить("СообщениеОбОшибке", НСтр("ru = 'Метод не определен'"));
	
	НастройкиИнтеграции = Новый Структура;
	НастройкиИнтеграции.Вставить("ДеактивацияКассовойСсылки", ДанныеКассовойСсылки <> Неопределено);
	НастройкиИнтеграции.Вставить("ДанныеКассовойСсылки",      ДанныеКассовойСсылки);
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Отмена заказа.'");
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("ДокументОплаты",      ДокументОплаты);
	ПараметрыПроцедуры.Вставить("Интеграция",          Интеграция);
	ПараметрыПроцедуры.Вставить("НастройкиИнтеграции", НастройкиИнтеграции);
	
	РезультатВыполнения = ДлительныеОперации.ВыполнитьФункцию(
		ПараметрыВыполнения,
		"ИнтеграцияСПлатежнымиСистемамиРМКСлужебный.ОтменитьОперациюВФоне",
		ПараметрыПроцедуры);
		
	Возврат РезультатВыполнения;
	
КонецФункции

Процедура ОтменитьФоновыеЗадания(
	ИдентификаторЗаданияФормированияQRКода,
	ИдентификаторЗаданияПроверкиСтатуса,
	ИдентификаторЗаданияВозврата) Экспорт
	
	Если ЗначениеЗаполнено(ИдентификаторЗаданияФормированияQRКода) Тогда
		ДлительныеОперации.ОтменитьВыполнениеЗадания(
			ИдентификаторЗаданияФормированияQRКода);
		ИдентификаторЗаданияФормированияQRКода = Неопределено;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИдентификаторЗаданияПроверкиСтатуса) Тогда
		ДлительныеОперации.ОтменитьВыполнениеЗадания(
			ИдентификаторЗаданияПроверкиСтатуса);
		ИдентификаторЗаданияПроверкиСтатуса = Неопределено;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИдентификаторЗаданияВозврата) Тогда
		ДлительныеОперации.ОтменитьВыполнениеЗадания(
			ИдентификаторЗаданияВозврата);
		ИдентификаторЗаданияВозврата = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПодобратьПлатежнуюСистему(ДанныеПоиска, Наименование) Экспорт
	
	ИнтеграцияСПлатежнымиСистемамиРМКПереопределяемый.ПодобратьПлатежнуюСистему(ДанныеПоиска, Наименование);
	
КонецПроцедуры

#КонецОбласти
