#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// Возвращает реквизиты справочника, которые образуют естественный ключ
//  для элементов справочника.
//
// Возвращаемое значение:
//  Массив из Строка - массив имен реквизитов, образующих естественный ключ.
//
Функция ПоляЕстественногоКлюча() Экспорт
	
	Результат = Новый Массив();
	
	Результат.Добавить("ИмяПредопределенныхДанных");
	Результат.Добавить("Код");
	Результат.Добавить("ПометкаУдаления");
	
	Возврат Результат;
	
КонецФункции

Процедура НачальноеЗаполнение() Экспорт
	
	ЗаполнитьКодыВычетовНДФЛ();
	
КонецПроцедуры

Процедура ЗаполнитьКодыВычетовНДФЛ() Экспорт
	
	Если ОбщегоНазначения.ЭтоПодчиненныйУзелРИБ() Тогда
		Возврат;
	КонецЕсли;
	
	ГруппыВычетов = Перечисления.ГруппыВычетовПоНДФЛ;
	
	ПараметрыГруппыСтандартные = ПараметрыГруппыВычетов(Ложь, ГруппыВычетов.Стандартные);
	ОписатьКодВычетаНДФЛ("Код103", "103",
		"400 руб. на налогоплательщика, не относящегося к категориям, перечисленным в пп. 1-2 п. 1 ст. 218 Налогового кодекса Российской Федерации",
		ПараметрыГруппыСтандартные, "103", "-", "-");
	ОписатьКодВычетаНДФЛ("Код104", "104",
		"500 рублей на налогоплательщика, относящегося к категориям, перечисленным в пп. 2 п. 1 ст. 218 Налогового кодекса Российской Федерации",
		ПараметрыГруппыСтандартные, "104", "104", "104");
	ОписатьКодВычетаНДФЛ("Код105", "105",
		"3000 рублей на налогоплательщика, относящегося к категориям, перечисленным в пп. 1 п. 1 ст. 218 Налогового кодекса Российской Федерации",
		ПараметрыГруппыСтандартные, "105", "105", "105");
		
	ПараметрыГруппыНаДетей = ПараметрыГруппыВычетов(Ложь, ГруппыВычетов.СтандартныеНаДетей);
	ОписатьКодВычетаНДФЛ("Код108", "126/114",
		"На первого ребенка в возрасте до 18 лет, на учащегося очной формы обучения, аспиранта, ординатора, студента, курсанта в возрасте до 24 лет",
		ПараметрыГруппыНаДетей, "114", "114", "126");
	ОписатьКодВычетаНДФЛ("Код109", "129/117",
		"На ребенка-инвалида до 18 лет, на учащегося очной формы обучения, аспиранта, ординатора, студента до 24 лет, явл. инвалидом I или II группы",
		ПараметрыГруппыНаДетей, "117", "117", "129");
	ОписатьКодВычетаНДФЛ("Код110", "134/118",
		"В двойном размере на первого ребенка до 18 лет, на учащегося очной формы обучения до 24 лет единственному родителю, опекуну, попечителю",
		ПараметрыГруппыНаДетей, "118", "118", "134");
	ОписатьКодВычетаНДФЛ("Код111", "142/122",
		"В двойном размере на первого ребенка до 18 лет, на учащегося очной формы обучения до 24 лет при отказе второго родителя от вычета",
		ПараметрыГруппыНаДетей, "122", "122", "142");
	ОписатьКодВычетаНДФЛ("Код112", "140/121",
		"В двойном размере на ребенка-инвалида до 18 лет, на учащегося очной формы обучения до 24 лет, явл. инвалидом, единственному родителю, опекуну и др.",
		ПараметрыГруппыНаДетей, "121", "121", "140");
	ОписатьКодВычетаНДФЛ("Код113", "148/125",
		"В двойном размере на ребенка-инвалида до 18 лет, на учащегося очной формы обучения до 24 лет, явл. инвалидом, при отказе второго родителя от вычета",
		ПараметрыГруппыНаДетей, "125", "125", "148");
	ОписатьКодВычетаНДФЛ("Код115", "127/115",
		"На второго ребенка в возрасте до 18 лет, а также на каждого учащегося очной формы обучения, аспиранта, ординатора, студента, курсанта в возрасте до 24",
		ПараметрыГруппыНаДетей, "115", "115", "127");
	ОписатьКодВычетаНДФЛ("Код116", "128/116",
		"На третьего и каждого последующего ребенка в возрасте до 18 лет, а также на каждого учащегося очной формы обучения, аспиранта, ординатора, студента, к",
		ПараметрыГруппыНаДетей, "116", "116", "128");
	ОписатьКодВычетаНДФЛ("Код119", "136/119",
		"В двойном размере на второго ребенка в возрасте до 18 лет, а также на каждого учащегося очной формы обучения, аспиранта, ординатора, студента, курсант",
		ПараметрыГруппыНаДетей, "119", "119", "136");
	ОписатьКодВычетаНДФЛ("Код120", "138/120",
		"В двойном размере на третьего и каждого последующего ребенка в возрасте до 18 лет, а также на каждого учащегося очной формы обучения, аспиранта, ордин",
		ПараметрыГруппыНаДетей, "120", "120", "138");
	ОписатьКодВычетаНДФЛ("Код123", "144/123",
		"В двойном размере на второго ребенка в возрасте до 18 лет, а также на каждого учащегося очной формы обучения, аспиранта, ординатора, студента, курсант",
		ПараметрыГруппыНаДетей, "123", "123", "144");
	ОписатьКодВычетаНДФЛ("Код124", "146/124",
		"В двойном размере на третьего и каждого последующего ребенка в возрасте до 18 лет, а также на каждого учащегося очной формы обучения, аспиранта, ордин",
		ПараметрыГруппыНаДетей, "124", "124", "146");
	ОписатьКодВычетаНДФЛ("Код130", "130",
		"На первого ребенка в возрасте до 18 лет, а также на каждого учащегося очной формы обучения, аспиранта, ординатора, интерна, студента, курсанта в возрасте до 24 лет опекуну, попечителю, приемному родителю, супруге (супругу) приемного родителя, на обеспечении которых находится ребенок",
		ПараметрыГруппыНаДетей, "114", "114", "130");
	ОписатьКодВычетаНДФЛ("Код131", "131",
		"На второго ребенка в возрасте до 18 лет, а также на каждого учащегося очной формы обучения, аспиранта, ординатора, интерна, студента, курсанта в возрасте до 24 лет опекуну, попечителю, приемному родителю, супруге (супругу) приемного родителя, на обеспечении которых находится ребенок",
		ПараметрыГруппыНаДетей, "115", "115", "131");
	ОписатьКодВычетаНДФЛ("Код132", "132",
		"На третьего и каждого последующего ребенка в возрасте до 18 лет, а также на каждого учащегося очной формы обучения, аспиранта, ординатора, интерна, студента, курсанта в возрасте до 24 лет опекуну, попечителю, приемному родителю, супруге (супругу) приемного родителя, на обеспечении которых находится ребенок", 
		ПараметрыГруппыНаДетей, "116", "116", "132");
	ОписатьКодВычетаНДФЛ("Код135", "135",
		"В двойном размере на первого ребенка в возрасте до 18 лет, а также на каждого учащегося очной формы обучения, аспиранта, ординатора, интерна, студента, курсанта в возрасте до 24 лет единственному опекуну, попечителю, приемному родителю",
		ПараметрыГруппыНаДетей, "118", "118", "135");
	ОписатьКодВычетаНДФЛ("Код137", "137",
		"В двойном размере на второго ребенка в возрасте до 18 лет, а также на каждого учащегося очной формы обучения, аспиранта, ординатора, интерна, студента, курсанта в возрасте до 24 лет единственному опекуну, попечителю, приемному родителю",
		ПараметрыГруппыНаДетей, "119", "119", "137");
	ОписатьКодВычетаНДФЛ("Код139", "139",
		"В двойном размере на третьего ребенка в возрасте до 18 лет, а также на каждого учащегося очной формы обучения, аспиранта, ординатора, интерна, студента, курсанта в возрасте до 24 лет единственному опекуну, попечителю, приемному родителю",
		ПараметрыГруппыНаДетей, "120", "120", "139");
	ОписатьКодВычетаНДФЛ("Код143", "143",
		"В двойном размере на первого ребенка в возрасте до 18 лет, а также на каждого учащегося очной формы обучения, аспиранта, ординатора, интерна, студента, курсанта в возрасте до 24 лет одному из приемных родителей по их выбору на основании заявления об отказе одного из приемных родителей от получения налогового вычета",
		ПараметрыГруппыНаДетей, "122", "122", "143");
	ОписатьКодВычетаНДФЛ("Код145", "145",
		"В двойном размере на второго ребенка в возрасте до 18 лет, а также на каждого учащегося очной формы обучения, аспиранта, ординатора, интерна, студента, курсанта в возрасте до 24 лет одному из приемных родителей по их выбору на основании заявления об отказе одного из приемных родителей от получения налогового вычета",
		ПараметрыГруппыНаДетей, "123", "123", "145");
	ОписатьКодВычетаНДФЛ("Код147", "147",
		"В двойном размере на третьего ребенка в возрасте до 18 лет, а также на каждого учащегося очной формы обучения, аспиранта, ординатора, интерна, студента, курсанта в возрасте до 24 лет одному из приемных родителей по их выбору на основании заявления об отказе одного из приемных родителей от получения налогового вычета",
		ПараметрыГруппыНаДетей, "124", "124", "147");

	ПараметрыВычетовКДоходу = ПараметрыГруппыВычетов(Истина, , );
	ОписатьКодВычетаНДФЛ("Код204", "204",
		"Убыток по опер-ям с цен.бумагами, не обр-ся на орг. рынке, которые на момент приобретения обр-сь на орг. рынке, уменьш. нал. базу доходов с кодом 1530",
		ПараметрыВычетовКДоходу, "-", "-", "-");
	ОписатьКодВычетаНДФЛ("Код206", "206", "Расходы по доходам с кодом 1532", ПараметрыВычетовКДоходу, "206", "206", "206");
	ОписатьКодВычетаНДФЛ("Код207", "207", "Расходы по доходам с кодом 1535", ПараметрыВычетовКДоходу, "207", "207", "207");
	ОписатьКодВычетаНДФЛ("Код208", "208",
		"Убыток по опер. с фин.инстр. срочных сделок, обр-ся на орг. рынке, базисным активом которых явл. цен.бумаги, уменьш. нал. базу доходов с кодом 1530",
		ПараметрыВычетовКДоходу, "-", "-", "208");
	ОписатьКодВычетаНДФЛ("Код226", "226",
		"Расходы по операциям с ценными бумагами, не обращающимися на организованном рынке ценных бумаг, учитываемым на индивидуальном инвестиционном счете",
		ПараметрыВычетовКДоходу, "-", "-", "226"); 
	ОписатьКодВычетаНДФЛ("Код227", "227",
		"Расходы по операциям с ценными бумагами, не обращающимися на организованном рынке ценных бумаг, которые на момент их приобретения относились к ценным бумагам, обращающимся на организованном рынке ценных бумаг, учитываемым на индивидуальном инвестиционном счете",
		ПараметрыВычетовКДоходу, "-", "-", "227"); 
	ОписатьКодВычетаНДФЛ("Код228", "228",
		"Расходы по операциям с производными финансовыми инструментами, которые обращаются на организованном рынке и базисным активом которых являются ценные бумаги, фондовые индексы или иные производные финансовые инструменты, базисным активом которых являются ценные бумаги или фондовые индексы, учитываемым на индивидуальном инвестиционном счете",
		ПараметрыВычетовКДоходу, "-", "-", "228"); 
	ОписатьКодВычетаНДФЛ("Код229", "229",
		"Расходы по операциям с производными финансовыми инструментами, которые обращаются на организованном рынке и базисным активом которых не являются ценные бумаги, фондовые индексы или иные производные финансовые инструменты, базисным активом которых являются ценные бумаги или фондовые индексы, учитываемым на индивидуальном инвестиционном счете",
		ПараметрыВычетовКДоходу, "-", "-", "229"); 
	ОписатьКодВычетаНДФЛ("Код230", "230",
		"Расходы в виде процентов по займу, произведенные по совокупности операций РЕПО, учитываемых на индивидуальном инвестиционном счете",
		ПараметрыВычетовКДоходу, "-", "-", "230"); 
	ОписатьКодВычетаНДФЛ("Код231", "231",
		"Расходы по операциям, связанным с закрытием короткой позиции, и затраты, связанные с приобретением и реализацией ценных бумаг, являющимся объектом операций РЕПО, учитываемых на индивидуальном инвестиционном счете",
		ПараметрыВычетовКДоходу, "-", "-", "231"); 
	ОписатьКодВычетаНДФЛ("Код232", "232",
		"Расходы в виде процентов, уплаченных в налоговом периоде по совокупности договоров займа, учитываемых на индивидуальном инвестиционном счете",
		ПараметрыВычетовКДоходу, "-", "-", "232"); 
	ОписатьКодВычетаНДФЛ("Код233", "233",
		"Процентный (купонный) расход, признаваемый налогоплательщиком в случае открытия короткой позиции по ценным бумагам, обращающимся на организованном рынке ценных бумаг, по которым предусмотрено начисление процентного (купонного) дохода, учитываемый на индивидуальном инвестиционном счете",
		ПараметрыВычетовКДоходу, "-", "-", "233"); 
	ОписатьКодВычетаНДФЛ("Код234", "234", "Процентный (купонный) расход, признаваемый налогоплательщиком в случае открытия короткой позиции по ценным бумагам, не обращающимся на организованном рынке ценных бумаг, по которым предусмотрено начисление процентного (купонного) дохода, учитываемый на индивидуальном инвестиционном счете",
		ПараметрыВычетовКДоходу, "-", "-", "234"); 
	ОписатьКодВычетаНДФЛ("Код235", "235",
		"Суммы расходов по операциям с производными финансовыми инструментами, не обращающимися на организованном рынке, учитываемым на индивидуальном инвестиционном счете",
		ПараметрыВычетовКДоходу, "-", "-", "235"); 
	ОписатьКодВычетаНДФЛ("Код236", "236",
		"Сумма отрицательного финансового результата, полученного в налоговом периоде по операциям с ценными бумагами, обращающимися на организованном рынке ценных бумаг, уменьшающая финансовый результат, полученный в налоговом периоде по отдельным операциям с ценными бумагами, не обращающимися на организованном рынке ценных бумаг, которые на момент их приобретения относились к ценным бумагам, обращающимся на организованном рынке ценных бумаг, учитываемая на индивидуальном инвестиционном счете",
		ПараметрыВычетовКДоходу, "-", "-", "236"); 
	ОписатьКодВычетаНДФЛ("Код237", "237",
		"Сумма превышения расходов в виде процентов, уплаченных по совокупности договоров займа над доходами, полученными по совокупности договоров займа, уменьшающая налоговую базу по операциям с ценными бумагами, учитываемым на индивидуальном инвестиционном счете, обращающимися на организованном рынке ценных бумаг, рассчитанная в соответствии с пропорцией, с учетом положений абзаца шестого пункта 5 статьи 214.4 Налогового кодекса Российской Федерации",
		ПараметрыВычетовКДоходу, "-", "-", "237"); 
	ОписатьКодВычетаНДФЛ("Код238", "238",
		"Сумма превышения расходов в виде процентов, уплаченных по совокупности договоров займа над доходами, полученными по совокупности договоров займа, уменьшающая налоговую базу по операциям с ценными бумагами, учитываемым на индивидуальном инвестиционном счете, не обращающимися на организованном рынке ценных бумаг, рассчитанная в соответствии с пропорцией, с учетом положений абзаца шестого пункта 5 статьи 214.4 Налогового кодекса Российской Федерации",
		ПараметрыВычетовКДоходу, "-", "-", "238"); 
	ОписатьКодВычетаНДФЛ("Код239", "239",
		"Сумма убытка по операциям РЕПО, учитываемым на индивидуальном инвестиционном счете, принимаемого в уменьшение доходов по операциям с ценными бумагами, учитываемым на индивидуальном инвестиционном счете, обращающимися на организованном рынке ценных бумаг, в пропорции, рассчитанной как отношение стоимости ценных бумаг, являющихся объектом операций РЕПО, обращающихся на организованном рынке ценных бумаг, к общей стоимости ценных бумаг, являющихся объектом операций РЕПО",
		ПараметрыВычетовКДоходу, "-", "-", "239"); 
	ОписатьКодВычетаНДФЛ("Код240", "240",
		"Сумма убытка по операциям РЕПО, учитываемым на индивидуальном инвестиционном счете, принимаемого в уменьшение доходов по операциям с ценными бумагами, учитываемым на индивидуальном инвестиционном счете, не обращающимися на организованном рынке ценных бумаг, в пропорции, рассчитанной как отношение стоимости ценных бумаг, являющихся объектом операций РЕПО, не обращающихся на организованном рынке ценных бумаг, к общей стоимости ценных бумаг, являющихся объектом операций РЕПО",
		ПараметрыВычетовКДоходу, "-", "-", "240"); 
	ОписатьКодВычетаНДФЛ("Код241", "241",
		"Сумма убытка по операциям с производными финансовыми инструментами, обращающимися на организованном рынке, базисным активом которых являются ценные бумаги, фондовые индексы или иные производные финансовые инструменты, базисным активом которых являются ценные бумаги или фондовые индексы, полученного по результатам указанных операций, совершенных в налоговом периоде и учитываемых на индивидуальном инвестиционном счете, уменьшающего налоговую базу по операциям с производными финансовыми инструментами, которые обращаются на организованном рынке ценных бумаг, учитываемые на индивидуальном инвестиционном счете",
		ПараметрыВычетовКДоходу, "-", "-", "241"); 
	ОписатьКодВычетаНДФЛ("Код250", "250",
		"Сумма убытка по операциям с ценными бумагами, обращающимися на организованном рынке ценных бумаг, полученного по результатам указанных операций, совершенных в налоговом периоде и учитываемых на индивидуальном инвестиционном счете, уменьшающая финансовый результат по операциям с производными финансовыми инструментами, обращающимися на организованном рынке, базисным активом которых являются ценные бумаги, фондовые индексы или иные производные финансовые инструменты, базисным активом которых являются ценные бумаги или фондовые индексы, учитываемым на индивидуальном инвестиционном счете",
		ПараметрыВычетовКДоходу, "-", "-", "250"); 
	ОписатьКодВычетаНДФЛ("Код251", "251",
		"Сумма убытка по операциям с производными финансовыми инструментами, обращающимися на организованном рынке, базисным активом которых являются ценные бумаги, фондовые индексы или иные производные финансовые инструменты, базисным активом которых являются ценные бумаги или фондовые индексы, полученного по результатам указанных операций, совершенных в налоговом периоде и учитываемых на индивидуальном инвестиционном счете, после уменьшения финансового результата по операциям с производными финансовыми инструментами, обращающимися на организованном рынке, уменьшающая финансовый результат по операциям с ценными бумагами, обращающимися на организованном рынке ценных бумаг, учитываемым на индивидуальном инвестиционном счете",
		ПараметрыВычетовКДоходу, "-", "-", "251"); 
	ОписатьКодВычетаНДФЛ("Код252", "252",
		"Сумма убытка по операциям с производными финансовыми инструментами, обращающимися на организованном рынке, базисным активом которых не являются ценные бумаги, фондовые индексы или иные производные финансовые инструменты, базисным активом которых являются ценные бумаги или фондовые индексы, полученного по результатам указанных операций, совершенных в налоговом периоде и учитываемых на индивидуальном инвестиционном счете, уменьшающая финансовый результат по операциям с производными финансовыми инструментами, обращающимися на организованном рынке, учитываемым на индивидуальном инвестиционном счете",
		ПараметрыВычетовКДоходу, "-", "-", "252"); 
	
	ПараметрыВычетовИмущественные = ПараметрыГруппыВычетов(Ложь, ГруппыВычетов.Имущественные);
	ОписатьКодВычетаНДФЛ("Код311", "311",
		"Сумма, израсходованная налогоплательщиком на новое строительство либо приобретение на территории РФ жилого дома, квартиры или доли (долей) в них", 
		ПараметрыВычетовИмущественные, "311", "311", "311");
	ОписатьКодВычетаНДФЛ("Код312", "312",
		"Сумма, направленная на погашение процентов по целевым займам (кредитам) на новое строительство или приобретение на территории РФ жилого дома, квартиры",
		ПараметрыВычетовИмущественные, "312", "312", "312");
	ОписатьКодВычетаНДФЛ("Код318", "318",
		"Сумма процентов по кредитам в целях перекредитования кредитов на новое строительство или приобретение на территории РФ жилого дома, квартиры",
		ПараметрыВычетовИмущественные, "318", "312", "312");
		
	ПараметрыВычетовСоциальные = ПараметрыГруппыВычетов(Ложь, ГруппыВычетов.Социальные);
	ОписатьКодВычетаНДФЛ("Код319", "327",
		"Сумма упл-х пенс-х взносов по договору негосударственного пенсионного обеспечения и/или страх-х взносов по договору добровольного пенсионного страх-ия",
		ПараметрыВычетовСоциальные, "319", "327", "327");
	ОписатьКодВычетаНДФЛ("Код320", "328",
		"Сумма уплаченных дополнительных страховых взносов на накопительную часть трудовой пенсии в соответствии с Федеральным законом от 30.04.2008 № 56-ФЗ", 
		ПараметрыВычетовСоциальные, "620", "328", "328");
	
	ПараметрыВычетовСоциальныеПоУведомлениюНО = ПараметрыГруппыВычетов(Ложь, ГруппыВычетов.СоциальныеПоУведомлениюНО);
	ОписатьКодВычетаНДФЛ("Код329", "Стр.жизни",
		"Сумма страховых взносов по договору (договорам) добровольного страхования жизни, если такие договоры заключаются на срок не менее пяти лет, заключенному (заключенным) со страховой организацией в свою пользу и (или) в пользу супруга (в том числе вдовы, вдовца), родителей (в том числе усыновителей), детей (в том числе усыновленных, находящихся под опекой (попечительством))", 
		ПараметрыВычетовСоциальныеПоУведомлениюНО, "-", "-", "620");
	
	ОписатьКодВычетаНДФЛ("Код403", "403",
		"Сумма фактически произведенных и документально подтвержденных расходов, связанных с выполнением работ (оказанием услуг) по договорам ГПХ",
		ПараметрыВычетовКДоходу, "403", "403", "403");
	ОписатьКодВычетаНДФЛ("Код404", "404",
		"Сумма фактически произведенных и документально подтвержденных расходов, связанных с получением авторских вознаграждений",
		ПараметрыВычетовКДоходу, "404", "404", "404");
	ОписатьКодВычетаНДФЛ("Код405", "405", "Сумма в пределах нормативов затрат, связанных с получением авторских вознаграждений",
		ПараметрыВычетовКДоходу, "405", "405", "405");
	ОписатьКодВычетаНДФЛ("Код501", "501",
		"Вычет из стоимости подарков, полученных от организаций и индивидуальных предпринимателей",
		ПараметрыВычетовКДоходу, "501", "501", "501");
	ОписатьКодВычетаНДФЛ("Код502", "502",
		"Вычет из стоимости призов в денежной и натуральной форме на конкурсах и соревнованиях, проводимых в соотв. с решениями Прав-ва РФ и др. органов власти",
		ПараметрыВычетовКДоходу, "502", "502", "502");
	ОписатьКодВычетаНДФЛ("Код503", "503",
		"Вычет из суммы материальной помощи, оказываемой работодателями своим работникам, а также бывшим своим работникам-пенсионерам",
		ПараметрыВычетовКДоходу, "503", "503", "503");
	ОписатьКодВычетаНДФЛ("Код504", "504",
		"Вычет из суммы возмещения (оплаты) работодателями своим работникам, бывшим своим работникам (пенсионерам), а также инвалидам стоимости медикаментов",
		ПараметрыВычетовКДоходу, "504", "504", "504");
	ОписатьКодВычетаНДФЛ("Код505", "505",
		"Вычет из стоимости выигрышей и призов, полученных на конкурсах, играх и других мероприятиях в целях рекламы товаров (работ, услуг)",
		ПараметрыВычетовКДоходу, "505", "505", "505");
	ОписатьКодВычетаНДФЛ("Код506", "506",
		"Вычет из суммы материальной помощи, оказываемой инвалидам общественными организациями инвалидов",
		ПараметрыВычетовКДоходу, "506", "506", "506");
	ОписатьКодВычетаНДФЛ("Код507", "507",
		"Вычет из суммы помощи (в денежной и натуральной формах), а также стоимости подарков, полученных ветеранами, инвалидами ВОВ и приравненных к ним",
		ПараметрыВычетовКДоходу, "507", "507", "507");
	ОписатьКодВычетаНДФЛ("МатпомощьПриРожденииРебенка", "508",
		"Вычет из суммы материальной помощи, оказываемой работодателями своим работникам при рождении (усыновлении) ребенка",
		ПараметрыВычетовКДоходу, "508", "508", "508");
	ОписатьКодВычетаНДФЛ("Код509", "509",
		"Вычет из доходов, полученных работниками в натуральной форме в качестве оплаты труда от организаций - с/х товаропроизводителей и крестьянских х-в",
		ПараметрыВычетовКДоходу, "509", "509", "509");
	ОписатьКодВычетаНДФЛ("Код601", "601",
		"Сумма, уменьшающая налоговую базу по доходам, полученным в виде дивидендов",
		ПараметрыВычетовКДоходу, "601", "601", "601");
	ОписатьКодВычетаНДФЛ("Код607", "510",
		"Вычет в сумме уплаченных работодателем страховых взносов за работника на накопительную часть трудовой пенсии, но не более 12000 рублей в год",
		ПараметрыВычетовКДоходу, "607", "510", "510");
	ОписатьКодВычетаНДФЛ("Код619", "619",
		"Сумма положительного финансового результата, полученного по операциям, учитываемым на индивидуальном инвестиционном счете",
		ПараметрыВычетовКДоходу, "619", "619", "619");
	ОписатьКодВычетаНДФЛ("Код620", "620",
		"Иные суммы, уменьшающие налоговую базу в соответствии с положениями главы 23 Налогового кодекса Российской Федерации",
		ПараметрыВычетовКДоходу, "620", "620", "620");
	
	ОписатьВычеты2026();
	ДополнитьКодыВычетовНДФЛ();
	
КонецПроцедуры

Функция ПараметрыГруппыВычетов(ВычетКДоходу = Истина, ГруппаВычета = Неопределено, НеПредоставляетсяНерезидентам = Ложь)
	
	Результат = Новый Структура;
	Результат.Вставить("ВычетКДоходу", ВычетКДоходу);
	Результат.Вставить("ГруппаВычета", ГруппаВычета);
	Результат.Вставить("НеПредоставляетсяНерезидентам", НеПредоставляетсяНерезидентам);
	
	Возврат Результат;
	
КонецФункции

Процедура ОписатьКодВычетаНДФЛ(ИмяПредопределенныхДанных, Код, Наименование, ПараметрыГруппыВычетов,
	Код2011 = "", Код2015 = "", Код2016 = "")

	СсылкаПредопределенного = ОбщегоНазначения.ПредопределенныйЭлемент(
		"Справочник.ВычетыНДФЛ." + ИмяПредопределенныхДанных);
	Если ЗначениеЗаполнено(СсылкаПредопределенного) Тогда
		Элемент = СсылкаПредопределенного.ПолучитьОбъект();
	Иначе
		Элемент = СоздатьЭлемент();
		Элемент.ИмяПредопределенныхДанных = ИмяПредопределенныхДанных;
	КонецЕсли;
	
	Если Элемент.Код <> Код Тогда
		Элемент.Код = Код;
	КонецЕсли;
	Если Элемент.Наименование <> Наименование Тогда
		Элемент.Наименование = Наименование;
	КонецЕсли;
	Если Элемент.ПолноеНаименование <> Наименование Тогда
		Элемент.ПолноеНаименование = Наименование;
	КонецЕсли;
	
	Если Элемент.ВычетКДоходу <> ПараметрыГруппыВычетов.ВычетКДоходу Тогда
		Элемент.ВычетКДоходу = ПараметрыГруппыВычетов.ВычетКДоходу;
	КонецЕсли;
	Если Элемент.ГруппаВычета <> ПараметрыГруппыВычетов.ГруппаВычета Тогда
		Элемент.ГруппаВычета = ПараметрыГруппыВычетов.ГруппаВычета;
	КонецЕсли;
	Если Элемент.НеПредоставляетсяНерезидентам <> ПараметрыГруппыВычетов.НеПредоставляетсяНерезидентам Тогда
		Элемент.НеПредоставляетсяНерезидентам = ПараметрыГруппыВычетов.НеПредоставляетсяНерезидентам;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Код2011) Тогда
		Элемент.КодПрименяемыйВНалоговойОтчетностиС2011Года = Код2011;
	Иначе  	
		Элемент.КодПрименяемыйВНалоговойОтчетностиС2011Года = Элемент.Код;
	КонецЕсли;

	Если ЗначениеЗаполнено(Код2015) Тогда
		Элемент.КодПрименяемыйВНалоговойОтчетностиС2015Года = Код2015;
	Иначе  	
		Элемент.КодПрименяемыйВНалоговойОтчетностиС2015Года = Элемент.Код;
	КонецЕсли;
	
	Если Элемент.КодПрименяемыйВНалоговойОтчетностиС2016Года <> Код2016 Тогда
		Элемент.КодПрименяемыйВНалоговойОтчетностиС2016Года = Код2016;
	КонецЕсли;
	
	Если Элемент.Модифицированность() Тогда
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Элемент, Истина);
	КонецЕсли;
	
КонецПроцедуры

// Описывает налоговые вычеты по НДФЛ, применяемые с 2026 года
//
Процедура ОписатьВычеты2026() Экспорт

	ПараметрыВычетовСоциальныеПоУведомлениюНО = ПараметрыГруппыВычетов(Ложь,
		Перечисления.ГруппыВычетовПоНДФЛ.СоциальныеПоУведомлениюНО);

	// АПК:1297-выкл Не локализуется, т.к. является частью регламентированной формы, применяемой в РФ.

	ОписатьКодВычетаНДФЛ("Код320о", "320",
		"Сумма, уплаченная налогоплательщиком в налоговом периоде за свое обучение в образовательных учреждениях РФ, за обучение брата (сестры) в возрасте до 24 лет, супруга (супруги) по очной форме обучения в образовательных учреждениях РФ - в размере фактически произведенных расходов на обучение с учетом ограничения, установленного пунктом 2 статьи 219 НК РФ", 
		ПараметрыВычетовСоциальныеПоУведомлениюНО, "-", "-", "320");
	
	ОписатьКодВычетаНДФЛ("Код321", "321",
		"Сумма, уплаченная налогоплательщиком-родителем за обучение своих детей в возрасте до 24 лет, налогоплательщиком-опекуном (налогоплательщиком-попечителем) за обучение своих подопечных в возрасте до 18 лет по очной форме обучения в образовательных учреждениях РФ, налогоплательщиком, осуществляющим обязанности опекуна или попечителя над гражданами, бывшими их подопечными, после прекращения опеки или попечительства в случаях оплаты налогоплательщиком обучения граждан в возрасте до 24 лет по очной форме обучения в образовательных учреждениях РФ - в размере фактически произведенных расходов на обучение, но с учетом ограничения, установленного подпунктом 2 пункта 1 статьи 219 НК РФ", 
		ПараметрыВычетовСоциальныеПоУведомлениюНО, "-", "-", "321");
	
	ОписатьКодВычетаНДФЛ("Код333", "333",
		"Сумма, уплаченная налогоплательщиком в налоговом периоде за свое обучение в образовательных учреждениях иностранного государства, за обучение брата (сестры) в возрасте до 24 лет, супруга (супруги) по очной форме обучения в образовательных учреждениях иностранного государства - в размере фактически произведенных расходов на обучение с учетом ограничения, установленного пунктом 2 статьи 219 НК РФ", 
		ПараметрыВычетовСоциальныеПоУведомлениюНО, "-", "-", "333");
	
	ОписатьКодВычетаНДФЛ("Код334", "334",
		"Сумма, уплаченная налогоплательщиком-родителем за обучение своих детей в возрасте до 24 лет, налогоплательщиком-опекуном (налогоплательщиком-попечителем) за обучение своих подопечных в возрасте до 18 лет по очной форме обучения в образовательных учреждениях иностранного государства, налогоплательщиком, осуществляющим обязанности опекуна или попечителя над гражданами, бывшими их подопечными, после прекращения опеки или попечительства в случаях оплаты налогоплательщиком обучения граждан в возрасте до 24 лет по очной форме обучения в образовательных учреждениях иностранного государства - в размере фактически произведенных расходов на обучение, но с учетом ограничения, установленного подпунктом 2 пункта 1 статьи 219 НК РФ", 
		ПараметрыВычетовСоциальныеПоУведомлениюНО, "-", "-", "334");
	
	// АПК:1297-вкл
	
КонецПроцедуры

// Дополняет коды вычетов НДФЛ, которые не были заполнены ранее
//
Процедура ДополнитьКодыВычетовНДФЛ() Экспорт

	ПараметрыВычетовКДоходу = ПараметрыГруппыВычетов(Истина, , );
	ПараметрыВычетовСоциальныеПоУведомлениюНО = ПараметрыГруппыВычетов(Ложь,
		Перечисления.ГруппыВычетовПоНДФЛ.СоциальныеПоУведомлениюНО);
		
	// АПК:1297-выкл Не локализуется, т.к. является частью регламентированной формы, применяемой в РФ.
	
	ОписатьКодВычетаНДФЛ("Код201", "201",
		"Расходы по операциям с ценными бумагами, обращающимися на организованном рынке ценных бумаг",
		ПараметрыВычетовКДоходу, "201", "201", "201");
	ОписатьКодВычетаНДФЛ("Код202", "202",
		"Расходы по операциям с ценными бумагами, не обращающимися на организованном рынке ценных бумаг",
		ПараметрыВычетовКДоходу, "202", "202", "202");
	ОписатьКодВычетаНДФЛ("Код203", "203",
		"Расходы по операциям с ценными бумагами, не обр-мися на орг.рынке ценных бумаг, которые на момент их приобретения обр-лись на орг.рынке ценных бумаг",
		ПараметрыВычетовКДоходу, "203", "203", "203");
	ОписатьКодВычетаНДФЛ("Код205", "205",
		"Убыток по операциям с ценными бумагами, обращающимися на организованном рынке ценных бумаг, уменьшающий налоговую базу доходов с кодом 1532",
		ПараметрыВычетовКДоходу, "205", "205", "205");
	ОписатьКодВычетаНДФЛ("Код209", "209",
		"Убыток по опер. с фин.инстр. ср.сделок, обр-ся на орг.рынке, базисным активом кот. не явл. цен.бумаги,  уменьш. нал. базу по опер. с фин.инстр. ср.сд.",
		ПараметрыВычетовКДоходу, "209", "209", "209");

	ОписатьКодВычетаНДФЛ("Код324", "324",
		"Сумма, уплаченная налогоплательщиком в налоговом периоде за медицинские услуги, оказанные медицинскими организациями, индивидуальными предпринимателями, осуществляющими медицинскую деятельность, ему, его супругу (супруге), родителям, детям (в том числе усыновленным) в возрасте до 18 лет, подопечным в возрасте до 18 лет (в соответствии с перечнем медицинских услуг, утвержденным Правительством Российской Федерации) с учетом ограничения, установленного пунктом 2 статьи 219 Налогового кодекса Российской Федерации",
		ПараметрыВычетовСоциальныеПоУведомлениюНО, "-", "324", "324");	
	ОписатьКодВычетаНДФЛ("Код325", "325",
		"Суммы страховых взносов, уплаченные налогоплательщиком в налоговом периоде по договорам добровольного личного страхования, а также по договорам добровольного страхования своих супруга (супруги), родителей, детей (в том числе усыновленных) в возрасте до 18 лет, подопечных в возрасте до 18 лет, заключенным им со страховыми организациями, имеющими лицензии на ведение соответствующего вида деятельности, предусматривающим оплату такими страховыми организациями исключительно медицинских услуг в размере фактически произведенных расходов, но с учетом ограничения, установленного пунктом 2 статьи 219 Налогового кодекса Российской Федерации", 
		ПараметрыВычетовСоциальныеПоУведомлениюНО, "-", "325", "325");	
	ОписатьКодВычетаНДФЛ("Код326", "326",
		"Сумма расходов по дорогостоящему лечению в медицинских организациях, у индивидуальных предпринимателей, осуществляющих медицинскую деятельность, - в размере фактически произведенных расходов", 
		ПараметрыВычетовСоциальныеПоУведомлениюНО, "-", "326", "326");	
	
	// АПК:1297-вкл
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли