#Область СлужебныйПрограммныйИнтерфейс

// см. ШаблоныПечатиОфисныхДокументовКлиент.СохранитьШаблонКакПоследнийВыбранный
Процедура СохранитьШаблонКакПоследнийВыбранный(ИмяФормы, ШаблонПечати) Экспорт

	ШаблоныПечатиОфисныхДокументов.СохранитьШаблонКакПоследнийВыбранный(ИмяФормы, ШаблонПечати);
	
КонецПроцедуры

// см. ШаблоныПечатиОфисныхДокументовКлиент.ПоследнийВыбранныйШаблон
Функция ПоследнийВыбранныйШаблон(ИмяФормы) Экспорт

	Возврат ШаблоныПечатиОфисныхДокументов.ПоследнийВыбранныйШаблон(ИмяФормы);
	
КонецФункции

// см. ШаблоныПечатиОфисныхДокументов.ИдентификаторКомандыПечатиШаблона
Функция ИдентификаторКомандыПечатиШаблона(ИмяФормы, Предмет, ШаблонПечати) Экспорт
	
	Возврат ШаблоныПечатиОфисныхДокументов.ИдентификаторКомандыПечатиШаблона(ИмяФормы, Предмет, ШаблонПечати);
		
КонецФункции

// см. ШаблоныПечатиОфисныхДокументов.КоличествоСтандартныхШаблонов
Функция КоличествоСтандартныхШаблонов(Назначение = Неопределено) Экспорт
	
	Возврат ШаблоныПечатиОфисныхДокументов.КоличествоСтандартныхШаблонов(Назначение);
	
КонецФункции

#КонецОбласти

