////////////////////////////////////////////////////////////////////////////////
// ЕдиныйНалоговыйСчетИнтеграцияФормыКлиентПереопределяемый:
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

Процедура СоздатьПлатежныйДокумент(Форма) Экспорт
	ЕдиныйНалоговыйСчетИнтеграцияКлиентУНФ.СоздатьПлатежныйДокумент(Форма);	
КонецПроцедуры

Процедура ОтразитьВУчетеНачисления(Данные, Результат) Экспорт
	
КонецПроцедуры

Процедура ОтразитьВУчетеУплаты(Данные, Результат) Экспорт
	
КонецПроцедуры

Процедура ОтразитьВУчетеПениШтрафы(Данные, Результат) Экспорт
	
КонецПроцедуры

#КонецОбласти
