
#Область ПрограммныйИнтерфейс

// АПК: 142-выкл обратная совместимость

// Выполнить операции на эквайринговом терминале.
// Если эквайринговый терминал не поддерживает печать квитанций на терминале, для печати подключается печатающее устройство.
// 
// Параметры:
//  ОповещениеПриЗавершении - ОписаниеОповещения - оповещение при завершении.
//  ИдентификаторКлиента - ФормаКлиентскогоПриложения -идентификатор формы.
//  ИдентификаторУстройства - СправочникСсылка.ПодключаемоеОборудование - идентификатор устройства, если неопределенно - будет предложен выбор.
//  ПараметрыОперации - Структура - параметры выполнения операции.
//  ДополнительныеПараметры - Структура - дополнительные команды.
//  ПечатающееУстройство - Неопределено - Печатающее устройство.    
//
Асинх Процедура НачатьВыполнениеОперацииНаЭквайринговомТерминале(ОповещениеПриЗавершении, ИдентификаторКлиента, ИдентификаторУстройства = Неопределено, ПараметрыОперации = Неопределено, ДополнительныеПараметры = Неопределено, ПечатающееУстройство = Неопределено) Экспорт
	
	Результат = Ждать ВыполнитьОперациюНаЭквайринговомТерминалеАсинх(
		ИдентификаторКлиента,
		ИдентификаторУстройства,
		ПараметрыОперации,
		ДополнительныеПараметры,
		ПечатающееУстройство);
	
	Если ОповещениеПриЗавершении <> Неопределено Тогда
		ВыполнитьОбработкуОповещения(ОповещениеПриЗавершении, Результат);
	КонецЕсли;
		
КонецПроцедуры

// Выполнить сверку итогов на эквайринговом терминале.
// Если эквайринговый терминал не поддерживает печать квитанций на терминале, для печати подключается печатающее устройство.
// 
// Параметры:
//  ОповещениеПриЗавершении - ОписаниеОповещения - оповещение при завершении.
//  ИдентификаторКлиента - ФормаКлиентскогоПриложения -идентификатор формы.
//  ИдентификаторУстройства - СправочникСсылка.ПодключаемоеОборудование - идентификатор устройства, если неопределенно - будет предложен выбор.
//  ПараметрыОперации - Структура - параметры выполнения операции.
//  ДополнительныеПараметры - Структура - дополнительные команды.
//  ПечатающееУстройство - Неопределено - Печатающее устройство.      
//
Асинх Процедура НачатьВыполнениеСверкиИтоговНаЭквайринговомТерминале(ОповещениеПриЗавершении, ИдентификаторКлиента, ИдентификаторУстройства = Неопределено, ПараметрыОперации = Неопределено, ДополнительныеПараметры = Неопределено, ПечатающееУстройство = Неопределено) Экспорт
	
	Результат = Ждать ВыполнитьСверкуИтоговНаЭквайринговомТерминалеАсинх(
		ИдентификаторКлиента,
		ИдентификаторУстройства,
		ПараметрыОперации,
		ДополнительныеПараметры,
		ПечатающееУстройство);
	
	Если ОповещениеПриЗавершении <> Неопределено Тогда
		ВыполнитьОбработкуОповещения(ОповещениеПриЗавершении, Результат);
	КонецЕсли;
		
КонецПроцедуры

// Начать получение операции по картам.
// 
// Параметры:
//  ОповещениеПриЗавершении - ОписаниеОповещения - оповещение при завершении.
//  ИдентификаторКлиента - ФормаКлиентскогоПриложения -идентификатор формы.
//  ИдентификаторУстройства - СправочникСсылка.ПодключаемоеОборудование - идентификатор устройства, если неопределенно - будет предложен выбор.
//  ПараметрыОперации - Структура - параметры выполнения операции.
//  ДополнительныеПараметры - Структура - дополнительные команды.
//
Асинх Процедура НачатьПолучениеОперацииПоКартам(ОповещениеПриЗавершении, ИдентификаторКлиента, ИдентификаторУстройства = Неопределено, ПараметрыОперации = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт
	
	Результат = Ждать ПолучитьОперацииПоКартамАсинх(
		ИдентификаторКлиента,
		ИдентификаторУстройства,
		ПараметрыОперации,
		ДополнительныеПараметры);
	
	Если ОповещениеПриЗавершении <> Неопределено Тогда
		ВыполнитьОбработкуОповещения(ОповещениеПриЗавершении, Результат);
	КонецЕсли;
		
КонецПроцедуры

// АПК: 142-вкл

// Начать получение параметров карты.
//
// Параметры:
//   ОповещениеПриЗавершении - ОписаниеОповещения - оповещение при завершении.
//   ИдентификаторКлиента    - ФормаКлиентскогоПриложения -идентификатор формы.
//   ИдентификаторУстройства - СправочникСсылка.ПодключаемоеОборудование - идентификатор устройства, если неопределенно - будет предложен выбор.
//   ПараметрыОперации       - Структура - параметры выполнения операции.
//   ДополнительныеПараметры - Структура - дополнительные команды.
//
Асинх Процедура НачатьПолучениеПараметровКарты(ОповещениеПриЗавершении, ИдентификаторКлиента, ИдентификаторУстройства = Неопределено, ПараметрыОперации = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт
	
	Результат = Ждать ПолучитьПараметрыКартыАсинх(
		ИдентификаторКлиента,
		ИдентификаторУстройства,
		ПараметрыОперации,
		ДополнительныеПараметры);
	
	Если ОповещениеПриЗавершении <> Неопределено Тогда
		ВыполнитьОбработкуОповещения(ОповещениеПриЗавершении, Результат);
	КонецЕсли;
		
КонецПроцедуры

// Начать выполнение аварийной отмена операции.
//
// Параметры:
//   ОповещениеПриЗавершении - ОписаниеОповещения - оповещение при завершении.
//   ИдентификаторКлиента    - ФормаКлиентскогоПриложения -идентификатор формы.
//   ИдентификаторУстройства - СправочникСсылка.ПодключаемоеОборудование - идентификатор устройства, если неопределенно - будет предложен выбор.
//   ПараметрыОперации       - Структура - параметры выполнения операции.
//   ДополнительныеПараметры - Структура - дополнительные команды.
//
Асинх Процедура НачатьВыполнениеАварийнойОтменыОперации(ОповещениеПриЗавершении, ИдентификаторКлиента, ИдентификаторУстройства = Неопределено, ПараметрыОперации = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт
	
	Результат = Ждать ВыполнитьАварийнуюОтменуОперацииАсинх(
		ИдентификаторКлиента,
		ИдентификаторУстройства,
		ПараметрыОперации,
		ДополнительныеПараметры);
	
	Если ОповещениеПриЗавершении <> Неопределено Тогда
		ВыполнитьОбработкуОповещения(ОповещениеПриЗавершении, Результат);
	КонецЕсли;
		
КонецПроцедуры

// Начать получение статус операции.
//
// Параметры:
//   ОповещениеПриЗавершении - ОписаниеОповещения - оповещение при завершении.
//   ИдентификаторКлиента    - ФормаКлиентскогоПриложения -идентификатор формы.
//   ИдентификаторУстройства - СправочникСсылка.ПодключаемоеОборудование - идентификатор устройства, если неопределенно - будет предложен выбор.
//   ПараметрыОперации       - Структура - параметры выполнения операции.
//   ДополнительныеПараметры - Структура - дополнительные команды.
//
Асинх Процедура НачатьПолучитьСтатусОперации(ОповещениеПриЗавершении, ИдентификаторКлиента, ИдентификаторУстройства = Неопределено, ПараметрыОперации = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт
	
	Результат = Ждать ПолучитьСтатусОперацииАсинх(
		ИдентификаторКлиента,
		ИдентификаторУстройства,
		ПараметрыОперации,
		ДополнительныеПараметры);
	
	Если ОповещениеПриЗавершении <> Неопределено Тогда
		ВыполнитьОбработкуОповещения(ОповещениеПриЗавершении, Результат);
	КонецЕсли;
		
КонецПроцедуры

// Выполнить операции на эквайринговом терминале.
// Если эквайринговый терминал не поддерживает печать квитанций на терминале, для печати подключается печатающее устройство.
// 
// Параметры:
//  Клиент - ФормаКлиентскогоПриложения - идентификатор формы.
//  Устройство - СправочникСсылка.ПодключаемоеОборудование - идентификатор устройства, если неопределенно - будет предложен выбор.
//  ПараметрыОперации - Структура - параметры выполнения операции.
//  ДополнительныеПараметры - Структура - дополнительные команды.
//
//  ПечатающееУстройство - Неопределено - Печатающее устройство.    
//
// Возвращаемое значение:
//  Структура
//
Асинх Функция ВыполнитьОперациюНаЭквайринговомТерминалеАсинх(Знач Клиент, Знач Устройство = Неопределено, Знач ПараметрыОперации = Неопределено, Знач ДополнительныеПараметры = Неопределено, Знач ПечатающееУстройство = Неопределено) Экспорт
	
	Контекст = ОборудованиеПлатежныеСистемыКлиентСервер.НовыйКонтекстОперацииСОборудованием();
	Контекст.Клиент = Клиент;
	Контекст.ПодготовитьДанныеКлиент = Истина;
	Контекст.ОбработатьДанныеСервер = Истина;
	Контекст.ОбработатьДанныеКлиент = Истина;
	Контекст.ОбработатьДанныеПриОшибкеСервер = Истина;
	Контекст.ДополнительныеПараметры = ДополнительныеПараметры;
	
	Если Устройство = Неопределено Тогда
		Устройство = Ждать ВыбратьУстройствоАсинх();
	КонецЕсли;
	Контекст.ОсновноеУстройство = Устройство;

	ДанныеДляДополнения = МенеджерОборудованияКлиент.ПечатьСлипЧекаЭквайринговойОперации();
	ОбщегоНазначенияБПОКлиентСервер.ДополнитьСтруктуру(Контекст.ДанныеОперации, ДанныеДляДополнения);
	
	Если ТребуетсяПодключитьПечатающееУстройство(Контекст, ПараметрыОперации) Тогда
		ПечатающееУстройство = Ждать ВыбратьПечатающееУстройствоАсинх(ПечатающееУстройство);
		Контекст.ДополнительныеУстройства.Вставить("ПечатающееУстройство", ПечатающееУстройство);
	КонецЕсли;
	
	Результат = Ждать МенеджерОборудованияСлужебныйКлиент.ВыполнитьОперациюАсинх(Контекст, ПараметрыОперации.ТипТранзакции, ПараметрыОперации);
	Возврат Результат;
	
КонецФункции

// Выполнить операции на эквайринговом терминале.
// Если эквайринговый терминал не поддерживает печать квитанций на терминале, для печати подключается печатающее устройство.
// 
// Параметры:
//  Клиент - ФормаКлиентскогоПриложения - идентификатор формы.
//  Устройство - СправочникСсылка.ПодключаемоеОборудование - идентификатор устройства, если неопределенно - будет предложен выбор.
//  ПараметрыОперации - Структура - параметры выполнения операции.
//  ДополнительныеПараметры - Структура - дополнительные команды.
//
//  ПечатающееУстройство - Неопределено - Печатающее устройство.    
//
// Возвращаемое значение:
//  Структура
//
Асинх Функция ВыполнитьСверкуИтоговНаЭквайринговомТерминалеАсинх(Знач Клиент, Знач Устройство = Неопределено, Знач ПараметрыОперации = Неопределено, Знач ДополнительныеПараметры = Неопределено, Знач ПечатающееУстройство = Неопределено) Экспорт
	
	Команда = "Settlement";
	Контекст = ОборудованиеПлатежныеСистемыКлиентСервер.НовыйКонтекстОперацииСОборудованием();
	Контекст.Клиент = Клиент;
	Контекст.ОбработатьДанныеСервер = Истина;
	Контекст.ОбработатьДанныеПриОшибкеСервер = Истина;
	Контекст.ОбработатьДанныеКлиент = Истина;
	Контекст.ДополнительныеПараметры = ДополнительныеПараметры;
	
	Если Устройство = Неопределено Тогда
		Устройство = Ждать ВыбратьУстройствоАсинх();
	КонецЕсли;
	Контекст.ОсновноеУстройство = Устройство;
	
	ПечатающееУстройство = Ждать ВыбратьПечатающееУстройствоАсинх(ПечатающееУстройство);
	Контекст.ДополнительныеУстройства.Вставить("ПечатающееУстройство", ПечатающееУстройство);
	
	Результат = Ждать МенеджерОборудованияСлужебныйКлиент.ВыполнитьОперациюАсинх(Контекст, Команда, ПараметрыОперации);
	Возврат Результат;
	
КонецФункции

// Выполнить операции на эквайринговом терминале.
// Если эквайринговый терминал не поддерживает печать квитанций на терминале, для печати подключается печатающее устройство.
// 
// Параметры:
//  Клиент - ФормаКлиентскогоПриложения - идентификатор формы.
//  Устройство - СправочникСсылка.ПодключаемоеОборудование - идентификатор устройства, если неопределенно - будет предложен выбор.
//  ПараметрыОперации - Структура - параметры выполнения операции.
//  ДополнительныеПараметры - Структура - дополнительные команды.
//
// Возвращаемое значение:
//  Структура
//
Асинх Функция ПолучитьОперацииПоКартамАсинх(Знач Клиент, Знач Устройство = Неопределено, Знач ПараметрыОперации = Неопределено, Знач ДополнительныеПараметры = Неопределено) Экспорт
	
	Команда = "GetOperationByCards";
	Контекст = ОборудованиеПлатежныеСистемыКлиентСервер.НовыйКонтекстОперацииСОборудованием();
	Контекст.Клиент = Клиент;
	Контекст.ОбработатьДанныеСервер = Истина;
	Контекст.ДополнительныеПараметры = ДополнительныеПараметры;
	
	Если Устройство = Неопределено Тогда
		Устройство = Ждать ВыбратьУстройствоАсинх();
	КонецЕсли;
	Контекст.ОсновноеУстройство = Устройство;
	
	Результат = Ждать МенеджерОборудованияСлужебныйКлиент.ВыполнитьОперациюАсинх(Контекст, Команда, ПараметрыОперации);
	Возврат Результат;
	
КонецФункции

// Выполнить операции на эквайринговом терминале.
// Если эквайринговый терминал не поддерживает печать квитанций на терминале, для печати подключается печатающее устройство.
// 
// Параметры:
//  Клиент - ФормаКлиентскогоПриложения - идентификатор формы.
//  Устройство - СправочникСсылка.ПодключаемоеОборудование - идентификатор устройства, если неопределенно - будет предложен выбор.
//  ПараметрыОперации - Структура - параметры выполнения операции.
//  ДополнительныеПараметры - Структура - дополнительные команды.
//
// Возвращаемое значение:
//  Структура
//
Асинх Функция ПолучитьПараметрыКартыАсинх(Знач Клиент, Знач Устройство = Неопределено, Знач ПараметрыОперации = Неопределено, Знач ДополнительныеПараметры = Неопределено) Экспорт
	
	Команда = "GetCardParametrs";
	Контекст = ОборудованиеПлатежныеСистемыКлиентСервер.НовыйКонтекстОперацииСОборудованием();
	Контекст.Клиент = Клиент;
	Контекст.ДополнительныеПараметры = ДополнительныеПараметры;
	
	Если Устройство = Неопределено Тогда
		Устройство = Ждать ВыбратьУстройствоАсинх();
	КонецЕсли;
	Контекст.ОсновноеУстройство = Устройство;
	
	Результат = Ждать МенеджерОборудованияСлужебныйКлиент.ВыполнитьОперациюАсинх(Контекст, Команда, ПараметрыОперации);
	Возврат Результат;
	
КонецФункции

// Получить статус операции на эквайринговом терминале.
// 
// Параметры:
//  Клиент - ФормаКлиентскогоПриложения - идентификатор формы.
//  Устройство - СправочникСсылка.ПодключаемоеОборудование - идентификатор устройства, если неопределенно - будет предложен выбор.
//  ПараметрыОперации - Структура - параметры выполнения операции.
//  ДополнительныеПараметры - Структура - дополнительные команды.
//
// Возвращаемое значение:
//  Структура
//
Асинх Функция ПолучитьСтатусОперацииАсинх(Знач Клиент, Знач Устройство = Неопределено, Знач ПараметрыОперации = Неопределено, Знач ДополнительныеПараметры = Неопределено) Экспорт
	
	Команда = "OperationStatus";
	Контекст = ОборудованиеПлатежныеСистемыКлиентСервер.НовыйКонтекстОперацииСОборудованием();
	Контекст.Клиент = Клиент;       
	Контекст.ПодготовитьДанныеКлиент = Истина;      
	Контекст.ОбработатьДанныеСервер = Истина;
	Контекст.ДополнительныеПараметры = ДополнительныеПараметры;
	
	Если Устройство = Неопределено Тогда
		Устройство = Ждать ВыбратьУстройствоАсинх();
	КонецЕсли;
	Контекст.ОсновноеУстройство = Устройство;
	
	Результат = Ждать МенеджерОборудованияСлужебныйКлиент.ВыполнитьОперациюАсинх(Контекст, Команда, ПараметрыОперации);
	Возврат Результат;
	
КонецФункции

// Выполнить операции на эквайринговом терминале.
// Если эквайринговый терминал не поддерживает печать квитанций на терминале, для печати подключается печатающее устройство.
// 
// Параметры:
//  Клиент - ФормаКлиентскогоПриложения - идентификатор формы.
//  Устройство - СправочникСсылка.ПодключаемоеОборудование - идентификатор устройства, если неопределенно - будет предложен выбор.
//  ПараметрыОперации - Структура - параметры выполнения операции.
//  ДополнительныеПараметры - Структура - дополнительные команды.
//
// Возвращаемое значение:
//  Структура
//
Асинх Функция ВыполнитьАварийнуюОтменуОперацииАсинх(Знач Клиент, Знач Устройство = Неопределено, Знач ПараметрыОперации = Неопределено, Знач ДополнительныеПараметры = Неопределено) Экспорт
	
	Команда = "EmergencyVoid";
	Контекст = ОборудованиеПлатежныеСистемыКлиентСервер.НовыйКонтекстОперацииСОборудованием();
	Контекст.Клиент = Клиент;
	Контекст.ДополнительныеПараметры = ДополнительныеПараметры;
	
	Если Устройство = Неопределено Тогда
		Устройство = Ждать ВыбратьУстройствоАсинх();
	КонецЕсли;
	Контекст.ОсновноеУстройство = Устройство;
	
	Результат = Ждать МенеджерОборудованияСлужебныйКлиент.ВыполнитьОперациюАсинх(Контекст, Команда, ПараметрыОперации);
	Возврат Результат;
	
КонецФункции

// Возвращает строку последнего слип-чека
//
// Возвращаемое значение:
//  Строка
Функция ПоследнийСлипЧек() Экспорт
	
	ПодключаемоеОборудование = МенеджерОборудованияКлиент.ПодключаемоеОборудование();
	Возврат ПодключаемоеОборудование.ПоследнийСлипЧек;    
	
КонецФункции

// Возвращает возможные типы пакетной операции
// 
// Возвращаемое значение:
//  Соответствие
Функция ТипыПакетнойОперацииВОчередиЧеков() Экспорт
	
	Результат = Новый Соответствие();
	Результат.Вставить("НеПакетнаяОперация", ПредопределенноеЗначение("Перечисление.ТипыПакетнойОперацииВОчередиЧеков.НеПакетнаяОперация"));
	Результат.Вставить("ФискализацияЧекаСОплатойКартой", ПредопределенноеЗначение("Перечисление.ТипыПакетнойОперацииВОчередиЧеков.ФискализацияЧекаСОплатойКартой"));
	Результат.Вставить("ПродажаСВыдачейНаличных", ПредопределенноеЗначение("Перечисление.ТипыПакетнойОперацииВОчередиЧеков.ПродажаСВыдачейНаличных"));
	Результат.Вставить("ПокупкаСЗачислением", ПредопределенноеЗначение("Перечисление.ТипыПакетнойОперацииВОчередиЧеков.ПокупкаСЗачислением"));
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Асинх Функция ВыбратьУстройствоАсинх() Экспорт
	
	ПоддерживаемыеТипы = МенеджерОборудованияКлиент.ПараметрыТипыОборудования();
	ПоддерживаемыеТипы.ЭквайринговыйТерминал = Истина;
	РезультатВыбора = Ждать МенеджерОборудованияКлиент.ВыбратьУстройствоАсинх(
		ПоддерживаемыеТипы,
		НСтр("ru='Выберите эквайринговый терминал'"), 
		НСтр("ru='Эквайринговый терминал не подключен.'"),
		НСтр("ru='Эквайринговый терминал не выбран.'"));
		
	Если Не РезультатВыбора.Результат Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат РезультатВыбора.ИдентификаторУстройства;
	
КонецФункции

#Область ПодготовкаИОбработкаДанныхОперации

Асинх Функция ПриПодготовкеДанныхОперацииАсинх(ДанныеОперации, ПараметрыПодключения, Команда, ПараметрыОперации) Экспорт
	
	ДанныеОперации.Вставить("Результат", Истина);
	ДанныеОперации.Вставить("ТекстОшибки", "");
	ОбщегоНазначенияБПОКлиентСервер.ДополнитьСтруктуру(ДанныеОперации, ПараметрыОперации);
	
	Если ПараметрыОперации <> Неопределено И ПараметрыОперации.Свойство("РеквизитыКартыQR") Тогда
		РеквизитыКартыQR = ПараметрыОперации.РеквизитыКартыQR;
		Если ЗначениеЗаполнено(РеквизитыКартыQR) И Не ОборудованиеПлатежныеСистемыКлиентСервер.ЭтоРеквизитыКартыQR(РеквизитыКартыQR) Тогда
			ДанныеОперации.ТекстОшибки = НСтр("ru='Операция по указанному QR-коду невозможна.'");
			ДанныеОперации.Результат = Ложь;
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Если Команда = "ReturnElectronicCertificate" И ПустаяСтрока(ПараметрыОперации.СсылочныйНомер) Тогда
		Подсказка = НСтр("ru='Введите RRN операции cо слип-чека покупки ЭС'"); 
		СтрокаRRN = Ждать ВвестиСтрокуАсинх("", Подсказка, 12);
		Если СтрокаRRN <> Неопределено Тогда
			ПараметрыОперации.СсылочныйНомер = СтрокаRRN;
		КонецЕсли;
	КонецЕсли;            
	
	Если Команда <> "OperationStatus" Тогда
		Если Команда = "PayElectronicCertificate" Или Команда = "ReturnElectronicCertificate" Тогда
			Если ПустаяСтрока(ПараметрыОперации.ИдентификаторКорзины) 
				Или (ПараметрыОперации.СуммаЭлектронногоСертификата = 0 И ПараметрыОперации.СкидкаЭлектроннымиСертификатами = 0)  Тогда
				ДанныеОперации.ТекстОшибки = НСтр("ru='Неверные параметры в операции.'");
				ДанныеОперации.Результат = Ложь; 
				Возврат ДанныеОперации;
			КонецЕсли;
		Иначе
			Если НЕ (ПараметрыОперации.СуммаОперации > 0) Тогда   
				ДанныеОперации.ТекстОшибки =  НСтр("ru='Некорректная сумма операции.'");
				ДанныеОперации.Результат = Ложь; 
				Возврат ДанныеОперации;
			КонецЕсли;
		КонецЕсли;                                                                                               
	КонецЕсли;
	
	Если Команда <> "OperationStatus" Тогда  
		ПараметрыОперации.ИдентификаторОперацииНаОборудовании = ИдентификаторОперацииНаОборудовании();    
		ДанныеОперации.Вставить("ИдентификаторОперацииНаОборудовании", ПараметрыОперации.ИдентификаторОперацииНаОборудовании);
	КонецЕсли;
	
	Если Команда = "AuthorizeSales" Или Команда = "AuthorizeRefund" Или Команда = "AuthorizeVoid" 
		Или Команда = "PayByPaymentCardWithCashWithdrawal" Или Команда = "PurchaseWithEnrollment"       
		Или Команда = "PayElectronicCertificate" Или Команда = "ReturnElectronicCertificate"
		Или Команда = "AuthorizePreSales" Или Команда = "AuthorizeCompletion" Или Команда = "AuthorizeVoidPreSales" Тогда      
		ДанныеОперации.Вставить("ВходящиеПараметрыXML", ПолучитьXMLПакетДляОперации(ПараметрыОперации)); 
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Асинх Функция ПриОбработкеРезультатовОперацииАсинх(ДанныеОперации, ПараметрыПодключения, Команда, РезультатОперации) Экспорт
	
	ДополнительныеУстройства = ПараметрыПодключения.ДополнительныеУстройства;
	Если ДополнительныеУстройства.Свойство("ПечатающееУстройство") Тогда
		
		Ждать ВывестиСлипЧекАсинх(ПараметрыПодключения, ДанныеОперации);
		
	КонецЕсли;
	
КонецФункции

#КонецОбласти

// Устанавливает строку последнего слип-чека
//
// Параметры:
//  ТекстСлипЧека - Строка
Процедура УстановитьПоследнийСлипЧек(ТекстСлипЧека) Экспорт
	ПодключаемоеОборудование = МенеджерОборудованияКлиент.ПодключаемоеОборудование();
	ПодключаемоеОборудование.ПоследнийСлипЧек = ТекстСлипЧека;
КонецПроцедуры

#Область Классификаторы

// Код вида оплаты на терминале.
// 
// Параметры:    
//   ВидОплаты -  ПеречислениеСсылка.ВидОплатыНаТерминале - Вид оплаты на терминале
// Возвращаемое значение:
//   Число - Код вида оплаты   
//                                
Функция КодВидаОплатыНаТерминале(ВидОплаты) Экспорт
	
	КлассификаторыБиблиотеки = МенеджерОборудованияКлиент.КлассификаторыБиблиотеки();
	Результат = КлассификаторыБиблиотеки.КодВидаОплатыНаТерминале;
	Возврат Результат.Получить(ВидОплаты);
	
КонецФункции

// Вид оплаты на терминале по коду.
// 
// Параметры:    
//   ВидОплатыКод - Число - Код вида оплаты.
// Возвращаемое значение:
//   ПеречислениеСсылка.ВидОплатыНаТерминале - Вид оплаты на терминале
//
Функция ВидОплатыНаТерминалеПоКоду(ВидОплатыКод) Экспорт
	
	КлассификаторыБиблиотеки = МенеджерОборудованияКлиент.КлассификаторыБиблиотеки();
	Результат = КлассификаторыБиблиотеки.ВидОплатыНаТерминалеПоКоду;
	Возврат Результат.Получить(ВидОплатыКод);
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Генеририровать идентификатор операции на Оборудовании
// Целое число размерностью 4 байта, представлено как HEX-строка длинной 8 символом ASCII без «0x»
//          
// Возвращаемое значение:
//   Строка - 
//
Функция ИдентификаторОперацииНаОборудовании() 
	Генератор = Новый ГенераторСлучайныхЧисел();   
	ЗначенияЧисла = Генератор.СлучайноеЧисло(100);
	Возврат МенеджерОборудованияКлиентСервер.ЧислоВСтрокуHEX(ЗначенияЧисла);
	
КонецФункции

// Получить XMLПакет для операции.
// 
// Параметры:
//  ПараметрыОперации - Структура - Параметры
// 
// Возвращаемое значение:
//  Строка - Получить XMLПакет для операции
//
Функция ПолучитьXMLПакетДляОперации(ПараметрыОперации) Экспорт
	
#Если ВебКлиент Тогда
	Возврат ОборудованиеПлатежныеСистемыВызовСервера.ПолучитьXMLПакетДляОперации(ПараметрыОперации);
#Иначе
	Возврат ОборудованиеПлатежныеСистемыКлиентСервер.ПолучитьXMLПакетДляОперации(ПараметрыОперации);
#КонецЕсли

КонецФункции

Процедура ВыполнениеОперацииНаЭквайринговомТерминалеКоманда(КонтекстОперации) Экспорт
	
	Если КонтекстОперации.ПараметрыОперации <> Неопределено Тогда
		Если КонтекстОперации.ПараметрыОперации.Свойство("РеквизитыКартыQR") Тогда
			РеквизитыКартыQR = КонтекстОперации.ПараметрыОперации.РеквизитыКартыQR;
			Если Не ПустаяСтрока(РеквизитыКартыQR) Тогда
				Если Не ОборудованиеПлатежныеСистемыКлиентСервер.ЭтоРеквизитыКартыQR(РеквизитыКартыQR) Тогда     
					ТекстСообщения = НСтр("ru='Операция по указанному QR-коду невозможна.'");
					РезультатВыполнения = МенеджерОборудованияКлиентСервер.ПараметрыВыполненияОперацииНаОборудовании(Ложь, ТекстСообщения);
					ВыполнитьОбработкуОповещения(КонтекстОперации.ОповещениеПриЗавершении, РезультатВыполнения);
					Возврат;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
		
	ПараметрыВыполнениеКоманды = МенеджерОборудованияКлиентСервер.ПараметрыВыполнениеКоманды(КонтекстОперации.ТипТранзакции,
		"ОборудованиеПлатежныеСистемы", КонтекстОперации.ДополнительныеПараметры, КонтекстОперации.ПодготовитьДанные, КонтекстОперации.ОбработатьДанные, 
		КонтекстОперации.ИспользоватьПечатающееУстройство, КонтекстОперации.ОбработатьДанныеПриОшибке);   
	ПараметрыВыполнениеКоманды.ПодготовитьДанныеКлиент = КонтекстОперации.ПодготовитьДанныеКлиент;
		
	МенеджерОборудованияКлиент.НачатьВыполнениеКоманды(КонтекстОперации.ОповещениеПриЗавершении, КонтекстОперации.ИдентификаторКлиента, 
		КонтекстОперации.ИдентификаторУстройства, КонтекстОперации.ПараметрыОперации, ПараметрыВыполнениеКоманды, КонтекстОперации.ПечатающееУстройство);
	
КонецПроцедуры

Асинх Функция ВывестиСлипЧекАсинх(ПараметрыПодключения, ДанныеОперации)
	
	ПечатающееУстройство = ПараметрыПодключения.ДополнительныеУстройства.ПечатающееУстройство;
	ПодключениеПечатающегоУстройства = ПараметрыПодключения.ПодключенияУстройств.Получить(ПечатающееУстройство);
	
	Если ЗначениеЗаполнено(ПодключениеПечатающегоУстройства) 
		И ДанныеОперации.Свойство("ТекстСлипЧека") И Не ПустаяСтрока(ДанныеОперации.ТекстСлипЧека) Тогда
		
		ТекстСлипЧека = ДанныеОперации.ТекстСлипЧека;
		УстановитьПоследнийСлипЧек(ТекстСлипЧека);
		ОбработчикДрайвера = МенеджерОборудованияСлужебныйКлиент.ОбработчикКомандОборудования();
		
		КомандаПечати = "PrintText";
		ДанныеОперации.Вставить("ТестовыеЧеки", ДанныеОперации.ТекстСлипЧекаXML);
		РезультатВыполнения = Ждать ОбработчикДрайвера.ВыполнениеКоманды(
			ПодключениеПечатающегоУстройства, КомандаПечати, ДанныеОперации);
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ТребуетсяПодключитьПечатающееУстройство(Контекст, ПараметрыОперации)
	
	ПодключитьПечатающееУстройство = 
		ПараметрыОперации.ИспользоватьПечатающееУстройство 
		И Контекст.ДанныеОперации.ПечатьСлипЧека;
		
	Если ПодключитьПечатающееУстройство Тогда
		ПодключенныйТерминал = МенеджерОборудованияКлиент.ПолучитьПодключенноеУстройство(Контекст.ОсновноеУстройство);
		Если ЗначениеЗаполнено(ПодключенныйТерминал) Тогда
			ПодключитьПечатающееУстройство = Не ПодключенныйТерминал.ПечатьКвитанцийНаТерминале;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ПодключитьПечатающееУстройство;
	
КонецФункции

Асинх Функция ВыбратьПечатающееУстройствоАсинх(ПечатающееУстройство)
	
	Если ПечатающееУстройство = Неопределено И ОбщегоНазначенияБПОКлиент.ИспользуетсяЧекопечатающиеУстройства() Тогда
		МодульОборудованиеЧекопечатающиеУстройстваКлиент = ОбщегоНазначенияБПОКлиент.ОбщийМодуль("ОборудованиеЧекопечатающиеУстройстваКлиент");
		Возврат Ждать МодульОборудованиеЧекопечатающиеУстройстваКлиент.ВыбратьУстройствоАсинх();
	КонецЕсли;
	
	Возврат ПечатающееУстройство;
	
КонецФункции

#КонецОбласти  