#Область ПрограммныйИнтерфейс

// Процедура добавляет в структуру параметры формулы.
//
// Параметры:
//  СтрокаФормулы - Строка - строковое представление формулы
//  СтруктураПараметров - Структура - в которую будут добавлены идентификаторы из формулы
//  Отказ - Булево - признак отказа операции
//
Процедура ДобавитьПараметрыВСтруктуру(СтрокаФормулы, СтруктураПараметров, Отказ = Ложь) Экспорт

	Формула = СтрокаФормулы;
	
	НачОперанда = СтрНайти(Формула, "[");
	КонОперанда = СтрНайти(Формула, "]");
     
	ЕстьОперанд = Истина;
	Пока ЕстьОперанд Цикл
     
		Если НачОперанда <> 0 И КонОперанда <> 0 Тогда
			
            Идентификатор = СокрЛП(Сред(Формула, НачОперанда + 1, КонОперанда - НачОперанда - 1));
            Формула = Прав(Формула, СтрДлина(Формула) - КонОперанда);   
			
			Попытка
				Если НЕ СтруктураПараметров.Свойство(Идентификатор) Тогда
					СтруктураПараметров.Вставить(Идентификатор);
				КонецЕсли;
			Исключение
				Отказ = Истина;
			    Прервать;
			КонецПопытки;
			 
		КонецЕсли;

		НачОперанда = СтрНайти(Формула, "[");
		КонОперанда = СтрНайти(Формула, "]");

		Если НЕ (НачОперанда <> 0 И КонОперанда <> 0) Тогда
			ЕстьОперанд = Ложь;
		КонецЕсли;

	КонецЦикла;	

КонецПроцедуры

// Процедура выполняет вставку в параметр СтруктураДанных
// ключа "ДоступныеТипыСчетовУчета" со значением массив типов счетов
// 
// Параметры:
//  СтруктураДанных - Структура - в которую будет вставлен параметры "ДоступныеТипыСчетовУчета"
//
Процедура ПолучитьДанныеДляВыбораСчетаРасчетов(СтруктураДанных) Экспорт
	
	ДоступныеТипыСчетовУчета = Новый Массив;
	ВидНачисленияУдержания = СтруктураДанных.ВидНачисленияУдержания;
	Если НЕ ЗначениеЗаполнено(ВидНачисленияУдержания) Тогда
		
		ДоступныеТипыСчетовУчета.Добавить(Перечисления.ТипыСчетов.НезавершенноеПроизводство);
		ДоступныеТипыСчетовУчета.Добавить(Перечисления.ТипыСчетов.КосвенныеЗатраты);
		ДоступныеТипыСчетовУчета.Добавить(Перечисления.ТипыСчетов.Расходы);
		ДоступныеТипыСчетовУчета.Добавить(Перечисления.ТипыСчетов.ПрочиеРасходы);
		ДоступныеТипыСчетовУчета.Добавить(Перечисления.ТипыСчетов.ПрочиеВнеоборотныеАктивы);
		ДоступныеТипыСчетовУчета.Добавить(Перечисления.ТипыСчетов.ПрочиеДоходы);
		
	ИначеЕсли ВидНачисленияУдержания.Тип = Перечисления.ТипыНачисленийИУдержаний.Начисление Тогда
		
		ДоступныеТипыСчетовУчета.Добавить(Перечисления.ТипыСчетов.НезавершенноеПроизводство);
		ДоступныеТипыСчетовУчета.Добавить(Перечисления.ТипыСчетов.КосвенныеЗатраты);
		ДоступныеТипыСчетовУчета.Добавить(Перечисления.ТипыСчетов.Расходы);
		ДоступныеТипыСчетовУчета.Добавить(Перечисления.ТипыСчетов.ПрочиеРасходы);
		ДоступныеТипыСчетовУчета.Добавить(Перечисления.ТипыСчетов.ПрочиеВнеоборотныеАктивы);
		
	ИначеЕсли ВидНачисленияУдержания.Тип = Перечисления.ТипыНачисленийИУдержаний.Удержание Тогда
		
		ДоступныеТипыСчетовУчета.Добавить(Перечисления.ТипыСчетов.ПрочиеДоходы);
		
	КонецЕсли;
	
	СтруктураДанных.Вставить("ДоступныеТипыСчетовУчета", ДоступныеТипыСчетовУчета);
	
КонецПроцедуры

// Функция выделяет первое слово в предложении до пробела и возвращает его
//
// Параметры:
//  ИсходнаяСтрока - Строка - строка в которой необходимо выделить первое слово. Например, "Иванов И. И."
// 
// Возвращаемое значение:
//  Строка - выделенное слово
//
Функция ВыделитьСлово(ИсходнаяСтрока) Экспорт
	
	Буфер = СокрЛ(ИсходнаяСтрока);
	ПозицияПослПробела = СтрНайти(Буфер, " ");

	Если ПозицияПослПробела = 0 Тогда
		ИсходнаяСтрока = "";
		Возврат Буфер;
	КонецЕсли;
	
	ВыделенноеСлово = СокрЛП(Лев(Буфер, ПозицияПослПробела));
	ИсходнаяСтрока = Сред(ИсходнаяСтрока, ПозицияПослПробела + 1);
	
	Возврат ВыделенноеСлово;
	
КонецФункции

// Функция определяет вводился ли раннее элемент расчета или вид начисления
//
// Параметры:
//  ЗначениеИдентификатора - Строка - значение реквизита Идентификатор элемента справочника ПоказателиРасчетов
//
// Возвращаемое значение:
//  Булево - Истина, если вид начисления вводился ранее. Ложь, если вид начисления не вводился ранее.
//
Функция ПараметрРасчетаСуществует(ЗначениеИдентификатора) Экспорт
	
	Если ПустаяСтрока(ЗначениеИдентификатора) Тогда
		
		Возврат Ложь;
		
	КонецЕсли;
	
	НайденныйПараметрРасчета = Справочники.ПоказателиРасчетов.НайтиПоРеквизиту("Идентификатор", ЗначениеИдентификатора);
	Возврат НЕ НайденныйПараметрРасчета = Справочники.ПоказателиРасчетов.ПустаяСсылка();
	
КонецФункции 

// см. ЗарплатаИПерсоналСервер.ДанныеВедомостиНаВыплатуЗарплаты
Функция ДанныеВедомостиНаВыплатуЗарплаты(Ведомость, Сотрудник = Неопределено) Экспорт
	
	Возврат ЗарплатаИПерсоналСервер.ДанныеВедомостиНаВыплатуЗарплаты(Ведомость, Сотрудник);
	
КонецФункции

// Возвращает структуру с данными ведомости на выплату зарплаты в банк / кассу.
//
// Параметры:
//  ДокументОплаты - ДокументСсылка - денежный документ
//  Ведомость - ОпределяемыйТип.ВедомостьЗарплатаКадры - Ведомость на выплату зарплаты.
//  Сотрудник - Неопределено, СправочникСсылка.Сотрудники - Сотрудник, данные которого необходимо получить.
//
// Возвращаемое значение:
//  Структура:
//  * СуммаПлатежа - Число - сумма выплаты
//
Функция ДанныеВедомостиНаВыплатуРегламентированнойЗарплаты(ДокументОплаты, Ведомость, Сотрудник) Экспорт
	
	ФизЛицо = Неопределено;
	Если ЗначениеЗаполнено(Сотрудник) Тогда
		ФизЛицо = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Сотрудник, "ФизическоеЛицо");
	КонецЕсли;
	
	СписокВедомостей = Новый Массив;
	СписокВедомостей.Добавить(Ведомость);
	ТаблицаВедомостей = ВзаиморасчетыССотрудниками.ДанныеВедомостейДляОплатыДокументом(ДокументОплаты, СписокВедомостей,
		ФизЛицо, Ложь);

	ПараметрыВедомости = Новый Структура;
	ПараметрыВедомости.Вставить("СуммаПлатежа", 0);
	
	Если ТаблицаВедомостей.Количество() > 0 Тогда
		ПараметрыВедомости.СуммаПлатежа = ТаблицаВедомостей.Итог("СуммаКВыплате");
	КонецЕсли;
	
	Возврат ПараметрыВедомости;
	
КонецФункции

#КонецОбласти