
#Область ПрограммныйИнтерфейс

// Функция - Проверяет является ли переданная форма документом Расход со счета
//
// Параметры:
//  Форма - Форма - Форма денежного документа
// 
// Возвращаемое значение:
//  Булево - Результат проверки
//
Функция ЭтоРасходСоСчета(Форма) Экспорт

	Возврат ТипДокументаСтрокой(Форма) = "РасходСоСчета";

КонецФункции

// Функция - Проверяет является ли переданная форма документом Расход из кассы
//
// Параметры:
//  Форма - Форма - Форма денежного документа
// 
// Возвращаемое значение:
//  Булево - Результат проверки
//
Функция ЭтоРасходИзКассы(Форма) Экспорт

	Возврат ТипДокументаСтрокой(Форма) = "РасходИзКассы";

КонецФункции

// Функция - Проверяет является ли переданная форма документом Поступление на счет
//
// Параметры:
//  Форма - Форма - Форма денежного документа
// 
// Возвращаемое значение:
//  Булево - Результат проверки
//
Функция ЭтоПоступлениеНаСчет(Форма) Экспорт

	Возврат ТипДокументаСтрокой(Форма) = "ПоступлениеНаСчет";

КонецФункции

// Функция - Проверяет является ли переданная форма документом Поступление в кассу
//
// Параметры:
//  Форма - Форма - Форма денежного документа
// 
// Возвращаемое значение:
//  Булево - Результат проверки
//
Функция ЭтоПоступлениеВКассу(Форма) Экспорт

	Возврат ТипДокументаСтрокой(Форма) = "ПоступлениеВКассу";

КонецФункции

// Функция - Проверяет является ли переданная форма документом Платежное поручение
//
// Параметры:
//  Форма - Форма - Форма денежного документа
// 
// Возвращаемое значение:
//  Булево - Результат проверки
//
Функция ЭтоПлатежноеПоручение(Форма) Экспорт

	Возврат ТипДокументаСтрокой(Форма) = "ПлатежноеПоручение";

КонецФункции

// Функция - Проверяет является ли переданная форма документом Операция по платежным картам
//
// Параметры:
//  Форма - Форма - Форма денежного документа
// 
// Возвращаемое значение:
//  Булево - Результат проверки
//
Функция ЭтоОперацияПоПлатежнымКартам(Форма) Экспорт

	Возврат ТипДокументаСтрокой(Форма) = "ОперацияПоПлатежнымКартам";

КонецФункции

// Функция - Проверяет является ли переданная форма банковским документом
//
// Параметры:
//  Форма - Форма - Форма денежного документа
// 
// Возвращаемое значение:
//  Булево - Результат проверки
//
Функция ЭтоДокументПоБанку(Форма) Экспорт

	Возврат ЭтоРасходСоСчета(Форма) ИЛИ ЭтоПоступлениеНаСчет(Форма);

КонецФункции

// Функция - Проверяет является ли переданная форма кассовым документом
//
// Параметры:
//  Форма - Форма - Форма денежного документа
// 
// Возвращаемое значение:
//  Булево - Результат проверки
//
Функция ЭтоДокументПоКассе(Форма) Экспорт

	Возврат ЭтоРасходИзКассы(Форма) ИЛИ ЭтоПоступлениеВКассу(Форма);

КонецФункции

// Функция - Возвращает строковое представление типа документа
//
// Параметры:
//  Форма - Форма - Форма денежного документа
// 
// Возвращаемое значение:
//  Строка - Строковое представление типа документа
//
Функция ТипДокументаСтрокой(Форма) Экспорт
	
	Если ТипЗнч(Форма) = Тип("Строка") Тогда
		ИмяФормыМассив = СтрРазделить(Форма, ".", Ложь);
	Иначе
		ИмяФормыМассив = СтрРазделить(Форма.ИмяФормы, ".", Ложь);
	КонецЕсли;
	
	Если ИмяФормыМассив.Количество() >=2 Тогда
		Возврат ИмяФормыМассив[1];
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции

// Функция - Проверяет используется ли договор в переданном виде операции
//
// Параметры:
//  ВидОперации       - Перечисления.ВидыОперацийПлатежноеПоручение
//                    - Перечисления.ВидыОперацийПоступлениеВКассу
//                    - Перечисления.ВидыОперацийПоступлениеНаСчет
//                    - Перечисления.ВидыОперацийРасходИзКассы
//                    - Перечисления.ВидыОперацийРасходСоСчета
//                    - Перечисления.ВидыОперацийЭквайринга
// 
// Возвращаемое значение:
//  Булево - Результат проверки
//
Функция ВидОперацииБезДоговора(ВидОперации) Экспорт
	
	Возврат ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходСоСчета.ВыдачаЗаймаСотруднику")
		ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходСоСчета.РасчетыПоКредитам")
		ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходИзКассы.РасчетыПоКредитам")
		ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеВКассу.ВозвратЗаймаСотрудником")
		ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеВКассу.РасчетыПоКредитам")
		ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеНаСчет.ВозвратЗаймаСотрудником")
		ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеНаСчет.РасчетыПоКредитам")
		ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПлатежноеПоручение.ПеречислениеНалога")
		ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПлатежноеПоручение.Зарплата")
		ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПлатежноеПоручение.РасчетыПоКредитам");
	
КонецФункции

// Функция - Проверяет используется расшифровка платежа в переданном виде операции
//
// Параметры:
//  ВидОперации       - Перечисления.ВидыОперацийПлатежноеПоручение
//                    - Перечисления.ВидыОперацийПоступлениеВКассу
//                    - Перечисления.ВидыОперацийПоступлениеНаСчет
//                    - Перечисления.ВидыОперацийРасходИзКассы
//                    - Перечисления.ВидыОперацийРасходСоСчета
//                    - Перечисления.ВидыОперацийЭквайринга
// 
// Возвращаемое значение:
//  Булево - Результат проверки
//
Функция ВидОперацииБезРасшифровки(ВидОперации) Экспорт
	
	Возврат ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходСоСчета.Зарплата")
		ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходИзКассы.Зарплата")
		ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПлатежноеПоручение.Зарплата")
		ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПлатежноеПоручение.ПеречислениеНалога");
	
КонецФункции

// Функция - Проверяет относится ли переданный вид операции к личным средствам предпринимателя
//
// Параметры:
//  ВидОперации       - Перечисления.ВидыОперацийПлатежноеПоручение
//                    - Перечисления.ВидыОперацийПоступлениеВКассу
//                    - Перечисления.ВидыОперацийПоступлениеНаСчет
//                    - Перечисления.ВидыОперацийРасходИзКассы
//                    - Перечисления.ВидыОперацийРасходСоСчета
//                    - Перечисления.ВидыОперацийЭквайринга
// 
// Возвращаемое значение:
//  Булево - Результат проверки
//
Функция ВидОперацииЛичныеСредстваПредпринимателя(ВидОперации) Экспорт
	
	Возврат ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходСоСчета.ЛичныеСредстваПредпринимателя")
		ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходИзКассы.ЛичныеСредстваПредпринимателя")
		ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеВКассу.ЛичныеСредстваПредпринимателя")
		ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеНаСчет.ЛичныеСредстваПредпринимателя")
		ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПлатежноеПоручение.ЛичныеСредстваПредпринимателя");
	
КонецФункции

// Функция - Проверяет относится ли переданный вид операции к прочим расчетам
//
// Параметры:
//  ВидОперации       - Перечисления.ВидыОперацийПлатежноеПоручение
//                    - Перечисления.ВидыОперацийПоступлениеВКассу
//                    - Перечисления.ВидыОперацийПоступлениеНаСчет
//                    - Перечисления.ВидыОперацийРасходИзКассы
//                    - Перечисления.ВидыОперацийРасходСоСчета
//                    - Перечисления.ВидыОперацийЭквайринга
// 
// Возвращаемое значение:
//  Булево - Результат проверки
//
Функция ВидОперацииПрочиеРасчеты(ВидОперации) Экспорт
	
	Возврат ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходСоСчета.ПрочиеРасчеты")
		ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходИзКассы.ПрочиеРасчеты")
		ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеВКассу.ПрочиеРасчеты")
		ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеНаСчет.ПрочиеРасчеты")
		ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПлатежноеПоручение.ПрочиеРасчеты");
	
КонецФункции

// Функция - Проверяет учитывается ли в налоговом учете переданный вид операции
//
// Параметры:
//  ВидОперации       - Перечисления.ВидыОперацийПлатежноеПоручение
//                    - Перечисления.ВидыОперацийПоступлениеВКассу
//                    - Перечисления.ВидыОперацийПоступлениеНаСчет
//                    - Перечисления.ВидыОперацийРасходИзКассы
//                    - Перечисления.ВидыОперацийРасходСоСчета
//                    - Перечисления.ВидыОперацийЭквайринга
// 
// Возвращаемое значение:
//  Булево - Результат проверки
//
Функция ВидОперацииУчитываетсяВНУ(ВидОперации) Экспорт
	
	Возврат 	ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходСоСчета.Поставщику")
			ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходСоСчета.НашейОрганизации")
			ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходСоСчета.Покупателю")
			ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходСоСчета.Налоги")
			ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходСоСчета.ВозвратОплатыНаПлатежныеКарты")
			ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходСоСчета.ВозвратПродажиВКредит")
			ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходСоСчета.Прочее")
			ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходСоСчета.НаРасходы")
			ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходСоСчета.ПрочиеРасчеты")
			ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходСоСчета.ЗарплатаСотруднику")
			ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходСоСчета.Зарплата")
			ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходСоСчета.КомиссияБанка")
			ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходСоСчета.ВыплатаСамозанятому")
			ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходСоСчета.ВыплатыСамозанятым")
			ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходИзКассы.Поставщику")
			ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходИзКассы.НашейОрганизации")
			ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходИзКассы.Покупателю")
			ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходИзКассы.Налоги")
			ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходИзКассы.Прочее")
			ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходИзКассы.НаРасходы")
			ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходИзКассы.ПрочиеРасчеты")
			ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходИзКассы.Зарплата")
			ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходИзКассы.ЗарплатаСотруднику")
			ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеНаСчет.ОтПокупателя")
			ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеНаСчет.ОтПоставщика")
			ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеНаСчет.Налоги")
			ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеНаСчет.ПоступлениеОплатыПоКартам")
			ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеНаСчет.ПоступлениеОплатыПоКредитам")
			ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеНаСчет.Прочее")
			ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеНаСчет.ОтКурьерскойКомпанииПочты")
			ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеНаСчет.ПрочиеРасчеты")
			ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеНаСчет.ОтНашейОрганизации")
			ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеВКассу.ОтПокупателя")
			ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеВКассу.ОтНашейОрганизации")
			ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеВКассу.ОтПоставщика")
			ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеВКассу.Прочее")
			ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеВКассу.ПрочиеРасчеты");
	
КонецФункции

// Функция - Проверяет может ли использоваться патент в переданном виде операции
//
// Параметры:
//  ВидОперации       - Перечисления.ВидыОперацийПлатежноеПоручение
//                    - Перечисления.ВидыОперацийПоступлениеВКассу
//                    - Перечисления.ВидыОперацийПоступлениеНаСчет
//                    - Перечисления.ВидыОперацийРасходИзКассы
//                    - Перечисления.ВидыОперацийРасходСоСчета
//                    - Перечисления.ВидыОперацийЭквайринга
// 
// Возвращаемое значение:
//  Булево - Результат проверки
//
Функция ВидОперацииПатент(ВидОперации) Экспорт
	
	Возврат 	ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеНаСчет.ОтПокупателя")
			ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеНаСчет.ПоступлениеОплатыПоКартам")
			ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеНаСчет.ПоступлениеОплатыПоКредитам")
			ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеНаСчет.Прочее")
			ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеНаСчет.ОтКурьерскойКомпанииПочты")
			ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеНаСчет.ПрочиеРасчеты")
			ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеНаСчет.ОтНашейОрганизации")
			ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеВКассу.ОтПокупателя")
			ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеВКассу.ОтНашейОрганизации")
			ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеВКассу.Прочее")
			ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеВКассу.ПрочиеРасчеты")
			ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходСоСчета.Покупателю")
			ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходИзКассы.Покупателю");
	
КонецФункции

// Функция - Проверяет может ли использоваться НДС в переданном виде операции
//
// Параметры:
//  ВидОперации       - Перечисления.ВидыОперацийПлатежноеПоручение
//                    - Перечисления.ВидыОперацийПоступлениеВКассу
//                    - Перечисления.ВидыОперацийПоступлениеНаСчет
//                    - Перечисления.ВидыОперацийРасходИзКассы
//                    - Перечисления.ВидыОперацийРасходСоСчета
//                    - Перечисления.ВидыОперацийЭквайринга
// 
// Возвращаемое значение:
//  Булево - Результат проверки
//
Функция ВидОперацииНДС(ВидОперации) Экспорт
	
	Возврат 	ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходИзКассы.Покупателю")
			ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходИзКассы.Поставщику")
			ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходИзКассы.НашейОрганизации")
			ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеНаСчет.ОтПокупателя")
			ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеНаСчет.ОтПоставщика")
			ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеНаСчет.ОтНашейОрганизации")
			ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеВКассу.ОтПокупателя")
			ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеВКассу.ОтПоставщика")
			ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеВКассу.ОтНашейОрганизации")
			ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеВКассу.РозничнаяВыручка")
			ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеВКассу.РозничнаяВыручкаСуммовойУчет")
			ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходСоСчета.Покупателю")
			ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПлатежноеПоручение.Оплата")
			ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПлатежноеПоручение.Покупателю");
	
КонецФункции

// Функция - Проверяет, относится ли переданный вид операции к эквайринговому
//
// Параметры:
//  ВидОперации       - Перечисления.ВидыОперацийПлатежноеПоручение
//                    - Перечисления.ВидыОперацийПоступлениеВКассу
//                    - Перечисления.ВидыОперацийПоступлениеНаСчет
//                    - Перечисления.ВидыОперацийРасходИзКассы
//                    - Перечисления.ВидыОперацийРасходСоСчета
//                    - Перечисления.ВидыОперацийЭквайринга
// 
// Возвращаемое значение:
//  Булево - Результат проверки
//
Функция ВидОперацииЭквайринг(ВидОперации) Экспорт
	
	Возврат ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходСоСчета.ВозвратОплатыНаПлатежныеКарты")
		ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходСоСчета.ВозвратПродажиВКредит")
		ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеНаСчет.ПоступлениеОплатыПоКартам")
		ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеНаСчет.ПоступлениеОплатыПоКредитам");
	
КонецФункции

// Функция - Проверяет, относится ли переданный вид операции к эквайринговому
//
// Параметры:
//  ВидОперации       - ПеречислениеСсылка.ВидыОперацийПлатежноеПоручение
//                    - ПеречислениеСсылка.ВидыОперацийРасходИзКассы
//                    - ПеречислениеСсылка.ВидыОперацийРасходСоСчета
// 
// Возвращаемое значение:
//  Булево - Результат проверки
//
Функция ВидОперацииЗарплата(ВидОперации) Экспорт

	Возврат ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходИзКассы.Зарплата")
		ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходСоСчета.Зарплата")
		ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПлатежноеПоручение.Зарплата")
		ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходИзКассы.ЗарплатаСотруднику")
		ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходСоСчета.ЗарплатаСотруднику")
		ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПлатежноеПоручение.ЗарплатаСотруднику");
	
КонецФункции

// Функция - Проверяет, доступно ли указание настроек налогового учета в табличной части РасшифровкаПлатежа
//
// Параметры:
//  ВидОперации       - Перечисления.ВидыОперацийПлатежноеПоручение
//                    - Перечисления.ВидыОперацийПоступлениеВКассу
//                    - Перечисления.ВидыОперацийПоступлениеНаСчет
//                    - Перечисления.ВидыОперацийРасходИзКассы
//                    - Перечисления.ВидыОперацийРасходСоСчета
// 
// Возвращаемое значение:
//  Булево - Результат проверки
//
Функция ВидОперацииРасшифровкаСНалоговымУчетом(ВидОперации) Экспорт
	
	ДоступныеОперации = РегламентированнаяОтчетностьУСНКлиентСервер.ВидыОперацийНалоговыйУчетВРасшифровкеПлатежа();
	
	Возврат ДоступныеОперации.Найти(ВидОперации) <> Неопределено;
	
КонецФункции

// Формирует текст сообщения для поля подсказки номера счета.
//
// Параметры:
//  НомерСчета          - Строка - номер проверяемого счета.
//  БИК                 - Строка - БИК проверяемого банка.
//  ЯвляетсяБанкомРФ    - Булево - признак российского банка.
//  Цвет                - Цвет   - цвет подсказки.
//  НомерСчетаКорректен - Строка - исходящий, признак корректности проверяемого номера счета.
//
// Возвращаемое значение:
//  ФорматированнаяСтрока - форматированный текст подсказки.
//
Функция ПодсказкаПоляНомерСчета(НомерСчета, БИК, ЯвляетсяБанкомРФ, Цвет, НомерСчетаКорректен = Ложь) Экспорт
	
	ПодсказкаПоля = Новый ФорматированнаяСтрока("");
	
	Если ПропуститьПроверкуРеквизитовСчета(НомерСчета, БИК, ЯвляетсяБанкомРФ) Тогда
		Возврат ПодсказкаПоля;
	КонецЕсли;
	
	ТекущийНомерСчета = СтрЗаменить(НомерСчета," ","");
	ТекстСообщения = "";
	
	НомерСчетаКорректен = НомерСчетаКорректен(ТекущийНомерСчета, БИК, ЯвляетсяБанкомРФ, ТекстСообщения);
	Если Не НомерСчетаКорректен Тогда
		ПодсказкаПоля = Новый ФорматированнаяСтрока(ТекстСообщения,, Цвет);
	КонецЕсли;
		
	Возврат ПодсказкаПоля;
	
КонецФункции

// Формирует текст сообщения во время интерактивного ввода для поля подсказки номера счета.
//
// Параметры:
//  НомерСчета - Строка - номер проверяемого счета.
//  БИК        - Строка - БИК проверяемого банка.
//
// Возвращаемое значение:
//  ФорматированнаяСтрока - форматированный текст подсказки.
//
Функция ПодсказкаВводаПоляНомерСчета(НомерСчета, БИК) Экспорт
	
	ТекстСообщения = Новый ФорматированнаяСтрока("");
	
	КоличествоЦифрВСчете = КоличествоЦифрВСтроке(НомерСчета);

	ДлинаСчетаПоЗакону = БанковскиеПравила.ДлинаНомераСчета();
	
	ТекстСообщения = Нстр("ru = 'Осталось ввести %1'"); 
	
	СклоняемыйТекст = СтроковыеФункцииКлиентСервер.СтрокаСЧисломДляЛюбогоЯзыка(
		Нстр("ru = ';%1 цифру;;%1 цифры;%1 цифр;%1 цифры'"), ДлинаСчетаПоЗакону - КоличествоЦифрВСчете);
	
	ТекстСообщения = Новый ФорматированнаяСтрока(СтрШаблон(ТекстСообщения,СклоняемыйТекст));
		
	Возврат ТекстСообщения;
	
КонецФункции

// Формирует текст сообщения для поля подсказки банка.
//
// Параметры:
//  ДеятельностьБанкаПрекращена - Булево - признак того, что банк недействующий.
// 
// Возвращаемое значение:
//  Строка - текст подсказки.
//
Функция ПодсказкаПоляБанка(ДеятельностьБанкаПрекращена) Экспорт 
	
	ТекстСообщения = "";
	
	Если ДеятельностьБанкаПрекращена Тогда
		ТекстСообщения = Новый ФорматированнаяСтрока(НСтр("ru = 'БИК банка не найден в классификаторе банков ЦБ РФ'"));
	КонецЕсли;
	
	Возврат ТекстСообщения;
	
КонецФункции

// Проверяет правильность заполнения номера счета и возвращает в параметре текст сообщения.
//
// Параметры:
//  НомерСчета     - Строка - номер проверяемого счета.
//  КодБанка       - Строка - клиринговый код банка для проверяемого счета.
//  ЯвляетсяБанкомРФ      - Булево - признак российского банка.
//  ТекстСообщения - Строка - в параметр передается текст сообщения об ошибке, если проверка не пройдена.
// 
// Возвращаемое значение:
//  Булево - Результат проверки номера счета, если Ложь тогда счет некорректный.
//
Функция НомерСчетаКорректен(НомерСчета, КодБанка, ЯвляетсяБанкомРФ, ТекстСообщения = "") Экспорт
	
	Если ПропуститьПроверкуРеквизитовСчета(НомерСчета, КодБанка, ЯвляетсяБанкомРФ) Тогда
		Возврат Истина;
	КонецЕсли;
	
	ТекстСообщения = "";
	
	НомерСчетаКорректен = Ложь;
	
	Если ЯвляетсяБанкомРФ Тогда
		
		Если Не БанковскиеПравила.ПроверитьДлинуНомераСчета(НомерСчета) Тогда
			ТекстСообщения = НСтр("ru = 'Номер счета должен состоять из 20 знаков'");
		ИначеЕсли Не БанковскиеПравила.СтрокаСоответствуетФорматуБанковскогоСчета(НомерСчета) Тогда
			ТекстСообщения = НСтр("ru = 'Номер счета не соответствует формату ЦБ РФ'");
		ИначеЕсли Не ПустаяСтрока(КодБанка) И Не ПроверитьКонтрольныйКлючВНомереБанковскогоСчета(НомерСчета, КодБанка) Тогда
			ТекстСообщения = НСтр("ru = 'Номер счета или банк введен некорректно'");
		Иначе
			НомерСчетаКорректен = Истина;
		КонецЕсли;
		
	Иначе
		
		Если Не БанковскиеПравила.ПроверитьРазрешенныеСимволыСчета(НомерСчета) Тогда
			ТекстСообщения = НСтр("ru = 'Разрешены только буквы от A до Z и цифры'");
		Иначе
			
			КодСтраныВСчете = БанковскиеПравила.КодСтраныIBAN(НомерСчета);
			КодСтраныВБанке = БанковскиеПравила.КодСтраныSWIFT(КодБанка);
			
			Если БанковскиеПравила.СтранаПрименяетФорматIBAN(КодСтраныВСчете) Тогда
				Если Не БанковскиеПравила.ПроверитьКонтрольныйКлючIBAN(НомерСчета) Тогда
					ТекстСообщения = НСтр("ru = 'Номер счета введен некорректно'");
				ИначеЕсли ЗначениеЗаполнено(КодСтраныВБанке) И КодСтраныВСчете <> КодСтраныВБанке Тогда
					ТекстСообщения = НСтр("ru = 'IBAN должен соответствовать банку'");
				Иначе
					НомерСчетаКорректен = Истина;
				КонецЕсли;
			Иначе
				НомерСчетаКорректен = Истина;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат НомерСчетаКорректен;
	
КонецФункции

// Проверяет допустимо ли производить проверки банковского счета по переданным параметрам.
// Для иностранных банков наличие кода банка необязательно.
//
// Параметры:
//  НомерСчета       - Строка - номер проверяемого счета.
//  КодБанка         - Строка - код банка проверяемого счета.
//  ЯвляетсяБанкомРФ - Булево - признак российского банка.
// 
// Возвращаемое значение:
//  Булево - признак того, что проверки счета допустимы.
//
Функция ПропуститьПроверкуРеквизитовСчета(НомерСчета, КодБанка, ЯвляетсяБанкомРФ) Экспорт
	
	Если ЯвляетсяБанкомРФ Тогда
		ПропуститьПроверку = ПустаяСтрока(НомерСчета) Или ПустаяСтрока(КодБанка);
	Иначе
		ПропуститьПроверку = ПустаяСтрока(НомерСчета);
	КонецЕсли;
	
	Возврат ПропуститьПроверку;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция КоличествоЦифрВСтроке(ИсходнаяСтрока)
	
	Результат = 0;
	
	Длина = СтрДлина(ИсходнаяСтрока);
	Для НомерСимвола = 1 По Длина Цикл
		
		КодСимвола = КодСимвола(ИсходнаяСтрока, НомерСимвола);
		
		Если КодСимвола > 47 И КодСимвола < 58 Тогда // Число.
			Результат = Результат + 1;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ПроверитьКонтрольныйКлючВНомереБанковскогоСчета(НомерСчета, БИК)
	
	// На веб-клиенте для повышения скорости выполнения процедуры передаем исполнение кода на сервер.
	Если ОбщегоНазначенияКлиентСервер.ЭтоВебКлиент() Тогда
		Возврат БанковскиеСчетаВызовСервера.ПроверитьКонтрольныйКлючВНомереБанковскогоСчета(НомерСчета, БИК);
	Иначе
		Возврат БанковскиеПравила.ПроверитьКонтрольныйКлючВНомереБанковскогоСчета(НомерСчета, БИК);
	КонецЕсли;
	
КонецФункции

#КонецОбласти
