#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	УчетПоКомпании = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("УчетПоКомпании");
	
	Если УчетПоКомпании И Организация <> УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("Компания") Тогда
		ТекстСообщения = НСтр("ru = 'При использовании учета по компании закрытие месяца по прочим организациям не выполняется.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , , , Отказ);
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("НачалоМесяца", НачалоМесяца(Дата));
	Запрос.УстановитьПараметр("КонецМесяца", КонецМесяца(Дата));
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("РасчетПрямыхЗатрат", РасчетПрямыхЗатрат);
	Запрос.УстановитьПараметр("РаспределениеЗатрат", РаспределениеЗатрат);
	Запрос.УстановитьПараметр("РасчетФактическойСебестоимости", РасчетФактическойСебестоимости);
	Запрос.УстановитьПараметр("РасчетФинансовогоРезультата", РасчетФинансовогоРезультата);
	Запрос.УстановитьПараметр("РасчетКурсовыхРазниц", РасчетКурсовыхРазниц);
	Запрос.УстановитьПараметр("РасчетСебестоимостиВРозницеСуммовойУчет", РасчетСебестоимостиВРозницеСуммовойУчет);
	Запрос.УстановитьПараметр("ЗачетАвансаПоЕдиномуНалоговомуСчету", ЗачетАвансаПоЕдиномуНалоговомуСчету); 
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗакрытиеМесяца.Ссылка КАК Ссылка,
	|	ЗакрытиеМесяца.РасчетПрямыхЗатрат КАК РасчетПрямыхЗатрат,
	|	ЗакрытиеМесяца.РаспределениеЗатрат КАК РаспределениеЗатрат,
	|	ЗакрытиеМесяца.РасчетФактическойСебестоимости КАК РасчетФактическойСебестоимости,
	|	ЗакрытиеМесяца.РасчетФинансовогоРезультата КАК РасчетФинансовогоРезультата,
	|	ЗакрытиеМесяца.РасчетКурсовыхРазниц КАК РасчетКурсовыхРазниц,
	|	ЗакрытиеМесяца.РасчетСебестоимостиВРозницеСуммовойУчет КАК РасчетСебестоимостиВРозницеСуммовойУчет,
	|	ЗакрытиеМесяца.ЗачетАвансаПоЕдиномуНалоговомуСчету КАК ЗачетАвансаПоЕдиномуНалоговомуСчету
	|ИЗ
	|	Документ.ЗакрытиеМесяца КАК ЗакрытиеМесяца,
	|	Константа.УчетПоКомпании КАК УчетПоКомпании
	|ГДЕ
	|	ЗакрытиеМесяца.Проведен
	|	И ЗакрытиеМесяца.Ссылка <> &Ссылка
	|	И ЗакрытиеМесяца.Дата МЕЖДУ &НачалоМесяца И &КонецМесяца
	|	И (ЗакрытиеМесяца.Организация = &Организация
	|			ИЛИ УчетПоКомпании.Значение)
	|	И (ЗакрытиеМесяца.РасчетПрямыхЗатрат = &РасчетПрямыхЗатрат
	|				И ЗакрытиеМесяца.РасчетПрямыхЗатрат
	|			ИЛИ ЗакрытиеМесяца.РаспределениеЗатрат = &РаспределениеЗатрат
	|				И ЗакрытиеМесяца.РаспределениеЗатрат
	|			ИЛИ ЗакрытиеМесяца.РасчетФактическойСебестоимости = &РасчетФактическойСебестоимости
	|				И ЗакрытиеМесяца.РасчетФактическойСебестоимости
	|			ИЛИ ЗакрытиеМесяца.РасчетФинансовогоРезультата = &РасчетФинансовогоРезультата
	|				И ЗакрытиеМесяца.РасчетФинансовогоРезультата
	|			ИЛИ ЗакрытиеМесяца.РасчетКурсовыхРазниц = &РасчетКурсовыхРазниц
	|				И ЗакрытиеМесяца.РасчетКурсовыхРазниц
	|			ИЛИ ЗакрытиеМесяца.РасчетСебестоимостиВРозницеСуммовойУчет = &РасчетСебестоимостиВРозницеСуммовойУчет
	|				И ЗакрытиеМесяца.РасчетСебестоимостиВРозницеСуммовойУчет
	|			ИЛИ ЗакрытиеМесяца.ЗачетАвансаПоЕдиномуНалоговомуСчету = &ЗачетАвансаПоЕдиномуНалоговомуСчету
	|				И ЗакрытиеМесяца.ЗачетАвансаПоЕдиномуНалоговомуСчету)";
	Выборка = Запрос.Выполнить().Выбрать();
	МассивНастроек = Новый Массив;
	
	ПоляНастроек = Новый Структура;
	ПоляНастроек.Вставить("РасчетПрямыхЗатрат");
	ПоляНастроек.Вставить("РаспределениеЗатрат");
	ПоляНастроек.Вставить("РасчетФактическойСебестоимости");
	ПоляНастроек.Вставить("РасчетФинансовогоРезультата");
	ПоляНастроек.Вставить("РасчетКурсовыхРазниц");
	ПоляНастроек.Вставить("РасчетСебестоимостиВРозницеСуммовойУчет");  
	ПоляНастроек.Вставить("ЗачетАвансаПоЕдиномуНалоговомуСчету");  
	
	Пока Выборка.Следующий() Цикл
		Для каждого КлючИЗначение Из ПоляНастроек Цикл
			Если ЭтотОбъект[КлючИЗначение.Ключ] И Выборка[КлючИЗначение.Ключ] Тогда
				ЗаголовокНастройки = НРег(Метаданные().Реквизиты.Найти(КлючИЗначение.Ключ).Представление());
				Если МассивНастроек.Найти(ЗаголовокНастройки) = Неопределено Тогда
					МассивНастроек.Добавить(ЗаголовокНастройки);
				КонецЕсли; 
			КонецЕсли; 
		КонецЦикла;  
	КонецЦикла;
	Если МассивНастроек.Количество() > 0 Тогда
		МесяцСтрокой = НРег(Формат(Дата, НСтр("ru = 'ДФ=''ММММ гггг'''")));
		Если УчетПоКомпании Тогда
			ТекстСообщения = НСтр("ru = 'За %1 уже есть другие закрытия месяца (%2).'");
			ТекстСообщения = СтрШаблон(
			ТекстСообщения,
			МесяцСтрокой,
			СтрСоединить(МассивНастроек, ", "));
		Иначе
			ТекстСообщения = НСтр("ru = 'За %1 уже есть другие закрытия месяца (%2) по организации %3.'");
			ТекстСообщения = СтрШаблон(
			ТекстСообщения,
			МесяцСтрокой,
			СтрСоединить(МассивНастроек, ", "),
			Организация);
		КонецЕсли;
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , , , Отказ);
	КонецЕсли; 
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ОбменДаннымиСобытияУНФ.ПропуститьДозаполнениеДокумента(ЭтотОбъект, РежимЗаписи) Тогда
		Возврат;
	КонецЕсли;
	
	ХозяйственнаяОперация = ХозяйственныеОперацииСервер.ХозяйственнаяОперацияПоВидуОперацииДокумента(Неопределено,
		Ссылка);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли; 
	
	Если НЕ Отказ И Проведен И РасчетФактическойСебестоимости Тогда
		НаборЗаписей = РегистрыСведений.ИзмененияЗакрытогоМесяца.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Месяц.Установить(НачалоМесяца(Дата));
		НаборЗаписей.Отбор.Организация.Установить(Организация);
		НаборЗаписей.Записать(Истина);
	КонецЕсли; 	
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Инициализация дополнительных свойств для проведения документа.
	ПроведениеДокументовУНФ.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	ДобавитьРеквизитыВДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);
	
	// Разрешение записи наборов записей.
	УстановитьСвойстваНаборовЗаписейДокумента(Истина);
	
	// Установка блокировок
	УстановитьБлокировкуРегистров();
		
	// Расчет прямых затрат
	Если РасчетПрямыхЗатрат Тогда
		РассчитатьСтоимостьВозвратов(); // предварительный расчет стоимости возвратов.
		РассчитатьФактическуюСебестоимостьВыпуска("РасчетПрямыхЗатрат");
		РассчитатьСтоимостьВозвратов(); // окончательный расчет стоимости возвратов.
	КонецЕсли;
	
	// Распределение затрат
	Если РаспределениеЗатрат Тогда
		РаспределитьЗатраты();
	КонецЕсли;
	
	// Расчет фактической себестоимости
	Если РасчетФактическойСебестоимости Тогда
		РассчитатьСтоимостьВозвратов(); // предварительный расчет стоимости возвратов.
		РассчитатьФактическуюСебестоимостьВыпуска("РасчетФактическойСебестоимости");
		РассчитатьСтоимостьВозвратов(Истина); // окончательный расчет стоимости возвратов.
		ЗакрытьОстаткиБезКоличества();
	КонецЕсли;
	
	// Расчет себестоимости в рознице суммовой учет
	Если РасчетСебестоимостиВРозницеСуммовойУчет Тогда
		РассчитатьСебестоимостьВРозницеСуммовойУчет();
	КонецЕсли;
	
	// Расчет курсовых разниц
	Если РасчетКурсовыхРазниц Тогда
		РассчитатьКурсовыеРазницы();
	КонецЕсли;
	
	// Расчет финансового результата
	Если РасчетФинансовогоРезультата Тогда
		РассчитатьФинансовыйРезультат();
	КонецЕсли;
	
	// Зачет аванса по единому налоговому счету
	Если ЗачетАвансаПоЕдиномуНалоговомуСчету Тогда
		ЗачетАвансаПоЕдиномуНалоговомуСчету(ЗаполнитьСтруктуруШапкиДокумента(Отказ), Отказ);
	КонецЕсли;
	
	// Сворачивание наборов записей регистров
	СвернутьЗаписиРегистров();
	
	Если ДополнительныеСвойства.ДляПроведения.ТаблицаОшибок.Количество() > 0 Тогда
		ЗафиксироватьОшибкиЗакрытияМесяца();
	КонецЕсли;
	
	// Запрет записи наборов записей
	УстановитьСвойстваНаборовЗаписейДокумента(Ложь);
	
	ПроведениеДокументовУНФ.ЗакрытьМенеджерВременныхТаблиц(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	Если ЗачетАвансаПоЕдиномуНалоговомуСчету Тогда
		ОтменитьФормированиеЗаписейУСНВПериодеПоВиду(Организация,
													Дата,
													Перечисления.ВидыЗаписейФормированийКУДиР.РасходыЕНП,
													Ссылка);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область РасчетПрямыхЗатрат_РасчетФактическойСебестоимости

Функция СформироватьДвиженияПоРегиструУзлыКорректировкиСтоимостиСписания()
	
	Запрос = Новый Запрос();
	
	Запрос.МенеджерВременныхТаблиц = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ДатаНач", ДополнительныеСвойства.ДляПроведения.НачальнаяДатаПериода);
	Запрос.УстановитьПараметр("ДатаКон", ДополнительныеСвойства.ДляПроведения.КонечнаяДатаПериода);
	Запрос.УстановитьПараметр("КонечнаяГраницаПериода", ДополнительныеСвойства.ДляПроведения.КонечнаяГраницаПериода);
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	Запрос.УстановитьПараметр("Организация", ДополнительныеСвойства.ДляПроведения.Организация);
	
	Запрос.Текст = ТекстЗапросаУзлыКорректировкиСтоимостиСписания(Перечисления.МетодОценкиЗапасов.FIFO);
	Запрос.Выполнить();
	
	// Если в документе установлено несколько фалгов закрытия, необходимо сначала удалить временные таблицы
	Если Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("УчетЗатратСДатамиДопРасходов") <> Неопределено Тогда
		
		Запрос.Текст = "УНИЧТОЖИТЬ УчетЗатратСДатамиДопРасходов;
					|	УНИЧТОЖИТЬ НачОстаткиПартийFIFO;
					|	УНИЧТОЖИТЬ УчетЗатратПоступлениеПартий";
		Запрос.Выполнить();
		
	КонецЕсли;
	
	// Формируем остатки на конец периода, которые будем закрывать по ФИФО.
	Запрос.Текст =
	"ВЫБРАТЬ
	|	УчетЗатратОстатки.Организация КАК Организация,
	|	УчетЗатратОстатки.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	УчетЗатратОстатки.СчетУчета КАК СчетУчета,
	|	УчетЗатратОстатки.Номенклатура КАК Номенклатура,
	|	УчетЗатратОстатки.Характеристика КАК Характеристика,
	|	УчетЗатратОстатки.Партия КАК Партия,
	|	УчетЗатратОстатки.ЗаказПокупателя КАК ЗаказПокупателя,
	|	УчетЗатратОстатки.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
	|	ВЫБОР
	|		КОГДА УчетЗатратОстатки.КоличествоОстаток > 0
	|			ТОГДА УчетЗатратОстатки.КоличествоОстаток
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоличествоОстаток,
	|	ВЫБОР
	|		КОГДА УчетЗатратОстатки.КоличествоОстаток > 0
	|			ТОГДА УчетЗатратОстатки.КоличествоОстаток
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоличествоОстатокНаКонецПериода,
	|	ДОБАВИТЬКДАТЕ(&ДатаКон, СЕКУНДА, 1) КАК Период,
	|	0 КАК СуммаБезНДСОстаток,
	|	0 КАК СуммаОстаток,
	|	0 КАК СуммаИнтОстаток,
	|	0 КАК СуммаБезНДСИнтОстаток
	|ПОМЕСТИТЬ ТаблицаОстатковПартий
	|ИЗ
	|	РегистрНакопления.Запасы.Остатки(
	|			&КонечнаяГраницаПериода,
	|			Организация = &Организация
	|				И Номенклатура.МетодОценки = ЗНАЧЕНИЕ(Перечисление.МетодОценкиЗапасов.FIFO)) КАК УчетЗатратОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УчетЗатрат.ВидДвижения КАК ВидДвижения,
	|	УчетЗатрат.Организация КАК Организация,
	|	УчетЗатрат.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	УчетЗатрат.СчетУчета КАК СчетУчета,
	|	УчетЗатрат.Номенклатура КАК Номенклатура,
	|	УчетЗатрат.Характеристика КАК Характеристика,
	|	УчетЗатрат.Партия КАК Партия,
	|	УчетЗатрат.ЗаказПокупателя КАК ЗаказПокупателя,
	|	УчетЗатрат.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
	|	ВЫБОР
	|		КОГДА УчетЗатрат.Регистратор ССЫЛКА Документ.ДополнительныеРасходы
	|				И УчетЗатрат.ДокументПродажи <> НЕОПРЕДЕЛЕНО
	|				И УчетЗатрат.ДокументПродажи ССЫЛКА Документ.ПриходнаяНакладная
	|				И УчетЗатрат.ДокументПродажи <> ЗНАЧЕНИЕ(Документ.ПриходнаяНакладная.ПустаяСсылка)
	|			ТОГДА ВЫРАЗИТЬ(УчетЗатрат.ДокументПродажи КАК Документ.ПриходнаяНакладная).Дата
	|		ИНАЧЕ УчетЗатрат.Период
	|	КОНЕЦ КАК Период,
	|	УчетЗатрат.Количество КАК Количество,
	|	УчетЗатрат.СуммаБезНДС КАК СуммаБезНДС,
	|	УчетЗатрат.Сумма КАК Сумма,
	|	УчетЗатрат.СуммаИнт КАК СуммаИнт,
	|	УчетЗатрат.СуммаБезНДСИнт КАК СуммаБезНДСИнт
	|ПОМЕСТИТЬ УчетЗатратСДатамиДопРасходов
	|ИЗ
	|	РегистрНакопления.Запасы КАК УчетЗатрат
	|ГДЕ
	|	УчетЗатрат.Период МЕЖДУ &ДатаНач И &ДатаКон
	|	И (УчетЗатрат.КоррСчетУчета = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПустаяСсылка)
	|			ИЛИ УчетЗатрат.Регистратор ССЫЛКА Документ.ОтчетПереработчика)
	|	И УчетЗатрат.Организация = &Организация
	|	И (УчетЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				И НЕ УчетЗатрат.Возврат
	|			ИЛИ УчетЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				И УчетЗатрат.Возврат)
	|	И НЕ(УчетЗатрат.Регистратор ССЫЛКА Документ.СборкаЗапасов)
	|	И НЕ(УчетЗатрат.Регистратор ССЫЛКА Документ.КомплектацияЗапасов)
	|	И НЕ(УчетЗатрат.Регистратор ССЫЛКА Документ.ДополнительныеРасходы
	|				И УчетЗатрат.ДокументПродажи <> НЕОПРЕДЕЛЕНО
	|				И УчетЗатрат.ДокументПродажи ССЫЛКА Документ.ПриходнаяНакладная
	|				И УчетЗатрат.ДокументПродажи <> ЗНАЧЕНИЕ(Документ.ПриходнаяНакладная.ПустаяСсылка)
	|				И (ВЫРАЗИТЬ(УчетЗатрат.ДокументПродажи КАК Документ.ПриходнаяНакладная).Дата < &ДатаНач
	|					ИЛИ ВЫРАЗИТЬ(УчетЗатрат.ДокументПродажи КАК Документ.ПриходнаяНакладная).Дата > &ДатаКон))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УчетЗатратОстатки.Организация КАК Организация,
	|	УчетЗатратОстатки.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	УчетЗатратОстатки.СчетУчета КАК СчетУчета,
	|	УчетЗатратОстатки.Номенклатура КАК Номенклатура,
	|	УчетЗатратОстатки.Характеристика КАК Характеристика,
	|	УчетЗатратОстатки.Партия КАК Партия,
	|	УчетЗатратОстатки.ЗаказПокупателя КАК ЗаказПокупателя,
	|	УчетЗатратОстатки.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
	|	ДОБАВИТЬКДАТЕ(&ДатаНач, ДЕНЬ, -1) КАК Период,
	|	УчетЗатратОстатки.КоличествоОстаток КАК Количество,
	|	УчетЗатратОстатки.СуммаБезНДСОстаток КАК СуммаБезНДС,
	|	УчетЗатратОстатки.СуммаОстаток КАК Сумма,
	|	УчетЗатратОстатки.СуммаИнтОстаток КАК СуммаИнт,
	|	УчетЗатратОстатки.СуммаБезНДСИнтОстаток КАК СуммаБезНДСИнт
	|ПОМЕСТИТЬ НачОстаткиПартийFIFO
	|ИЗ
	|	РегистрНакопления.Запасы.Остатки(
	|			&ДатаНач,
	|			Организация = &Организация
	|				И Номенклатура.МетодОценки = ЗНАЧЕНИЕ(Перечисление.МетодОценкиЗапасов.FIFO)) КАК УчетЗатратОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УчетЗатрат.Организация КАК Организация,
	|	УчетЗатрат.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	УчетЗатрат.СчетУчета КАК СчетУчета,
	|	УчетЗатрат.Номенклатура КАК Номенклатура,
	|	УчетЗатрат.Характеристика КАК Характеристика,
	|	УчетЗатрат.Партия КАК Партия,
	|	УчетЗатрат.ЗаказПокупателя КАК ЗаказПокупателя,
	|	УчетЗатрат.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
	|	УчетЗатрат.Период КАК Период,
	|	УчетЗатрат.Количество КАК Количество,
	|	УчетЗатрат.СуммаБезНДС КАК СуммаБезНДС,
	|	УчетЗатрат.Сумма КАК Сумма,
	|	УчетЗатрат.СуммаИнт КАК СуммаИнт,
	|	УчетЗатрат.СуммаБезНДСИнт КАК СуммаБезНДСИнт,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения
	|ПОМЕСТИТЬ УчетЗатратПоступлениеПартий
	|ИЗ
	|	НачОстаткиПартийFIFO КАК УчетЗатрат
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	УчетЗатрат.Организация,
	|	УчетЗатрат.СтруктурнаяЕдиница,
	|	УчетЗатрат.СчетУчета,
	|	УчетЗатрат.Номенклатура,
	|	УчетЗатрат.Характеристика,
	|	УчетЗатрат.Партия,
	|	УчетЗатрат.ЗаказПокупателя,
	|	УчетЗатрат.ЗаказНаПроизводство,
	|	УчетЗатрат.Период,
	|	УчетЗатрат.Количество,
	|	УчетЗатрат.СуммаБезНДС,
	|	УчетЗатрат.Сумма,
	|	УчетЗатрат.СуммаИнт,
	|	УчетЗатрат.СуммаБезНДСИнт,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|ИЗ
	|	УчетЗатратСДатамиДопРасходов КАК УчетЗатрат
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	1 КАК Поле1
	|ПОМЕСТИТЬ ПериодыПартий";
	Запрос.Выполнить();
	
	Запрос.Текст =
	"УНИЧТОЖИТЬ ПериодыПартий
	|;
	|
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УчетЗатрат.Организация КАК Организация,
	|	УчетЗатрат.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	УчетЗатрат.СчетУчета КАК СчетУчета,
	|	УчетЗатрат.Номенклатура КАК Номенклатура,
	|	УчетЗатрат.Характеристика КАК Характеристика,
	|	УчетЗатрат.Партия КАК Партия,
	|	УчетЗатрат.ЗаказПокупателя КАК ЗаказПокупателя,
	|	УчетЗатрат.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
	|	МАКСИМУМ(НАЧАЛОПЕРИОДА(УчетЗатрат.Период, ДЕНЬ)) КАК Период
	|ПОМЕСТИТЬ ПериодыПартий
	|ИЗ
	|	УчетЗатратПоступлениеПартий КАК УчетЗатрат
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаОстатковПартий КАК ТаблицаОстатковПартий
	|		ПО (ТаблицаОстатковПартий.Организация = УчетЗатрат.Организация)
	|			И (ТаблицаОстатковПартий.СтруктурнаяЕдиница = УчетЗатрат.СтруктурнаяЕдиница)
	|			И (ТаблицаОстатковПартий.СчетУчета = УчетЗатрат.СчетУчета)
	|			И (ТаблицаОстатковПартий.Номенклатура = УчетЗатрат.Номенклатура)
	|			И (ТаблицаОстатковПартий.Характеристика = УчетЗатрат.Характеристика)
	|			И (ТаблицаОстатковПартий.Партия = УчетЗатрат.Партия)
	|			И (ТаблицаОстатковПартий.ЗаказПокупателя = УчетЗатрат.ЗаказПокупателя)
	|			И (ТаблицаОстатковПартий.ЗаказНаПроизводство = УчетЗатрат.ЗаказНаПроизводство)
	|			И (ТаблицаОстатковПартий.КоличествоОстаток <> 0)
	|ГДЕ
	|	УчетЗатрат.Период < ТаблицаОстатковПартий.Период
	|
	|СГРУППИРОВАТЬ ПО
	|	УчетЗатрат.Организация,
	|	УчетЗатрат.СтруктурнаяЕдиница,
	|	УчетЗатрат.СчетУчета,
	|	УчетЗатрат.Номенклатура,
	|	УчетЗатрат.Характеристика,
	|	УчетЗатрат.Партия,
	|	УчетЗатрат.ЗаказПокупателя,
	|	УчетЗатрат.ЗаказНаПроизводство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПериодыПартий.Организация КАК Организация,
	|	ПериодыПартий.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ПериодыПартий.СчетУчета КАК СчетУчета,
	|	ПериодыПартий.Номенклатура КАК Номенклатура,
	|	ПериодыПартий.Характеристика КАК Характеристика,
	|	ПериодыПартий.Партия КАК Партия,
	|	ПериодыПартий.ЗаказПокупателя КАК ЗаказПокупателя,
	|	ПериодыПартий.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
	|	СУММА(ВЫБОР
	|			КОГДА УчетЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ТОГДА УчетЗатрат.Количество
	|			ИНАЧЕ -УчетЗатрат.Количество
	|		КОНЕЦ) КАК Количество,
	|	СУММА(ВЫБОР
	|			КОГДА УчетЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ТОГДА УчетЗатрат.СуммаБезНДС
	|			ИНАЧЕ -УчетЗатрат.СуммаБезНДС
	|		КОНЕЦ) КАК СуммаБезНДС,
	|	СУММА(ВЫБОР
	|			КОГДА УчетЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ТОГДА УчетЗатрат.Сумма
	|			ИНАЧЕ -УчетЗатрат.Сумма
	|		КОНЕЦ) КАК Сумма,
	|	СУММА(ВЫБОР
	|			КОГДА УчетЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ТОГДА УчетЗатрат.СуммаИнт
	|			ИНАЧЕ -УчетЗатрат.СуммаИнт
	|		КОНЕЦ) КАК СуммаИнт,
	|	СУММА(ВЫБОР
	|			КОГДА УчетЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ТОГДА УчетЗатрат.СуммаБезНДСИнт
	|			ИНАЧЕ -УчетЗатрат.СуммаБезНДСИнт
	|		КОНЕЦ) КАК СуммаБезНДСИнт,
	|	ПериодыПартий.Период КАК Период
	|ПОМЕСТИТЬ ВнешниеПоступленияЗаПериод
	|ИЗ
	|	ПериодыПартий КАК ПериодыПартий
	|		ЛЕВОЕ СОЕДИНЕНИЕ УчетЗатратПоступлениеПартий КАК УчетЗатрат
	|		ПО ПериодыПартий.Организация = УчетЗатрат.Организация
	|			И ПериодыПартий.СтруктурнаяЕдиница = УчетЗатрат.СтруктурнаяЕдиница
	|			И ПериодыПартий.СчетУчета = УчетЗатрат.СчетУчета
	|			И ПериодыПартий.Номенклатура = УчетЗатрат.Номенклатура
	|			И ПериодыПартий.Характеристика = УчетЗатрат.Характеристика
	|			И ПериодыПартий.Партия = УчетЗатрат.Партия
	|			И ПериодыПартий.ЗаказПокупателя = УчетЗатрат.ЗаказПокупателя
	|			И ПериодыПартий.ЗаказНаПроизводство = УчетЗатрат.ЗаказНаПроизводство
	|			И (УчетЗатрат.Период МЕЖДУ ПериодыПартий.Период И КОНЕЦПЕРИОДА(ПериодыПартий.Период, ДЕНЬ))
	|
	|СГРУППИРОВАТЬ ПО
	|	ПериодыПартий.Организация,
	|	ПериодыПартий.СтруктурнаяЕдиница,
	|	ПериодыПартий.СчетУчета,
	|	ПериодыПартий.Номенклатура,
	|	ПериодыПартий.Характеристика,
	|	ПериодыПартий.Партия,
	|	ПериодыПартий.ЗаказПокупателя,
	|	ПериодыПартий.ЗаказНаПроизводство,
	|	ПериодыПартий.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаОстатковПартий.Организация КАК Организация,
	|	ТаблицаОстатковПартий.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ТаблицаОстатковПартий.СчетУчета КАК СчетУчета,
	|	ТаблицаОстатковПартий.Номенклатура КАК Номенклатура,
	|	ТаблицаОстатковПартий.Характеристика КАК Характеристика,
	|	ТаблицаОстатковПартий.Партия КАК Партия,
	|	ТаблицаОстатковПартий.ЗаказПокупателя КАК ЗаказПокупателя,
	|	ТаблицаОстатковПартий.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
	|	ВЫБОР
	|		КОГДА ТаблицаОстатковПартий.КоличествоОстаток > ЕСТЬNULL(ВнешниеПоступленияЗаПериод.Количество, 0)
	|			ТОГДА ТаблицаОстатковПартий.КоличествоОстаток - ЕСТЬNULL(ВнешниеПоступленияЗаПериод.Количество, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоличествоОстаток,
	|	ВЫБОР
	|		КОГДА ТаблицаОстатковПартий.КоличествоОстаток >= ЕСТЬNULL(ВнешниеПоступленияЗаПериод.Количество, 0)
	|			ТОГДА ТаблицаОстатковПартий.СуммаБезНДСОстаток + ЕСТЬNULL(ВнешниеПоступленияЗаПериод.СуммаБезНДС, 0)
	|		ИНАЧЕ ТаблицаОстатковПартий.СуммаБезНДСОстаток + (ВЫРАЗИТЬ(ВнешниеПоступленияЗаПериод.СуммаБезНДС * ТаблицаОстатковПартий.КоличествоОстаток / ВнешниеПоступленияЗаПериод.Количество КАК ЧИСЛО(23, 10)))
	|	КОНЕЦ КАК СуммаБезНДСОстаток,
	|	ВЫБОР
	|		КОГДА ТаблицаОстатковПартий.КоличествоОстаток >= ЕСТЬNULL(ВнешниеПоступленияЗаПериод.Количество, 0)
	|			ТОГДА ТаблицаОстатковПартий.СуммаОстаток + ЕСТЬNULL(ВнешниеПоступленияЗаПериод.Сумма, 0)
	|		ИНАЧЕ ТаблицаОстатковПартий.СуммаОстаток + (ВЫРАЗИТЬ(ВнешниеПоступленияЗаПериод.Сумма * ТаблицаОстатковПартий.КоличествоОстаток / ВнешниеПоступленияЗаПериод.Количество КАК ЧИСЛО(23, 10)))
	|	КОНЕЦ КАК СуммаОстаток,
	|	ВЫБОР
	|		КОГДА ТаблицаОстатковПартий.КоличествоОстаток >= ЕСТЬNULL(ВнешниеПоступленияЗаПериод.Количество, 0)
	|			ТОГДА ТаблицаОстатковПартий.СуммаИнтОстаток + ЕСТЬNULL(ВнешниеПоступленияЗаПериод.СуммаИнт, 0)
	|		ИНАЧЕ ТаблицаОстатковПартий.СуммаИнтОстаток + (ВЫРАЗИТЬ(ВнешниеПоступленияЗаПериод.СуммаИнт * ТаблицаОстатковПартий.КоличествоОстаток / ВнешниеПоступленияЗаПериод.Количество КАК ЧИСЛО(23, 10)))
	|	КОНЕЦ КАК СуммаИнтОстаток,
	|	ВЫБОР
	|		КОГДА ТаблицаОстатковПартий.КоличествоОстаток >= ЕСТЬNULL(ВнешниеПоступленияЗаПериод.Количество, 0)
	|			ТОГДА ТаблицаОстатковПартий.СуммаБезНДСИнтОстаток + ЕСТЬNULL(ВнешниеПоступленияЗаПериод.СуммаБезНДСИнт, 0)
	|		ИНАЧЕ ТаблицаОстатковПартий.СуммаБезНДСИнтОстаток + (ВЫРАЗИТЬ(ВнешниеПоступленияЗаПериод.СуммаБезНДСИнт * ТаблицаОстатковПартий.КоличествоОстаток / ВнешниеПоступленияЗаПериод.Количество КАК ЧИСЛО(23, 10)))
	|	КОНЕЦ КАК СуммаБезНДСИнтОстаток,
	|	ТаблицаОстатковПартий.КоличествоОстатокНаКонецПериода КАК КоличествоОстатокНаКонецПериода,
	|	ВнешниеПоступленияЗаПериод.Период КАК Период
	|ПОМЕСТИТЬ ТаблицаТекущихОстатковПартий
	|ИЗ
	|	ТаблицаОстатковПартий КАК ТаблицаОстатковПартий
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВнешниеПоступленияЗаПериод КАК ВнешниеПоступленияЗаПериод
	|		ПО ТаблицаОстатковПартий.Организация = ВнешниеПоступленияЗаПериод.Организация
	|			И ТаблицаОстатковПартий.СтруктурнаяЕдиница = ВнешниеПоступленияЗаПериод.СтруктурнаяЕдиница
	|			И ТаблицаОстатковПартий.СчетУчета = ВнешниеПоступленияЗаПериод.СчетУчета
	|			И ТаблицаОстатковПартий.Номенклатура = ВнешниеПоступленияЗаПериод.Номенклатура
	|			И ТаблицаОстатковПартий.Характеристика = ВнешниеПоступленияЗаПериод.Характеристика
	|			И ТаблицаОстатковПартий.Партия = ВнешниеПоступленияЗаПериод.Партия
	|			И ТаблицаОстатковПартий.ЗаказПокупателя = ВнешниеПоступленияЗаПериод.ЗаказПокупателя
	|			И ТаблицаОстатковПартий.ЗаказНаПроизводство = ВнешниеПоступленияЗаПериод.ЗаказНаПроизводство
	|			И (ТаблицаОстатковПартий.КоличествоОстаток <> 0)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТаблицаОстатковПартий
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВнешниеПоступленияЗаПериод
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТекущихОстатковПартий.Организация КАК Организация,
	|	ТаблицаТекущихОстатковПартий.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ТаблицаТекущихОстатковПартий.СчетУчета КАК СчетУчета,
	|	ТаблицаТекущихОстатковПартий.Номенклатура КАК Номенклатура,
	|	ТаблицаТекущихОстатковПартий.Характеристика КАК Характеристика,
	|	ТаблицаТекущихОстатковПартий.Партия КАК Партия,
	|	ТаблицаТекущихОстатковПартий.ЗаказПокупателя КАК ЗаказПокупателя,
	|	ТаблицаТекущихОстатковПартий.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
	|	ТаблицаТекущихОстатковПартий.КоличествоОстаток КАК КоличествоОстаток,
	|	ТаблицаТекущихОстатковПартий.КоличествоОстатокНаКонецПериода КАК КоличествоОстатокНаКонецПериода,
	|	ТаблицаТекущихОстатковПартий.СуммаБезНДСОстаток КАК СуммаБезНДСОстаток,
	|	ТаблицаТекущихОстатковПартий.СуммаОстаток КАК СуммаОстаток,
	|	ТаблицаТекущихОстатковПартий.СуммаИнтОстаток КАК СуммаИнтОстаток,
	|	ТаблицаТекущихОстатковПартий.СуммаБезНДСИнтОстаток КАК СуммаБезНДСИнтОстаток,
	|	ТаблицаТекущихОстатковПартий.Период КАК Период
	|ПОМЕСТИТЬ ТаблицаОстатковПартий
	|ИЗ
	|	ТаблицаТекущихОстатковПартий КАК ТаблицаТекущихОстатковПартий
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТаблицаТекущихОстатковПартий
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	1 КАК Поле1
	|ИЗ
	|	ПериодыПартий КАК ПериодыПартий";
	
	// Для определения партий по ФИФО используется итерационный алгоритм
	Результат = Запрос.Выполнить();
	Пока НЕ Результат.Пустой() Цикл
		//@skip-check query-in-loop
		Результат = Запрос.Выполнить();
	КонецЦикла;
	
	// Уменьшаем количество и сумму прихода в узлах, на количество и сумму
	// "зафиксированного" конечного остатка.
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаУзлыКорректировкиСтоимостиСписания.Организация КАК Организация,
	|	ТаблицаУзлыКорректировкиСтоимостиСписания.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ТаблицаУзлыКорректировкиСтоимостиСписания.СчетУчета КАК СчетУчета,
	|	ТаблицаУзлыКорректировкиСтоимостиСписания.Номенклатура КАК Номенклатура,
	|	ТаблицаУзлыКорректировкиСтоимостиСписания.Характеристика КАК Характеристика,
	|	ТаблицаУзлыКорректировкиСтоимостиСписания.Партия КАК Партия,
	|	ТаблицаУзлыКорректировкиСтоимостиСписания.ЗаказПокупателя КАК ЗаказПокупателя,
	|	ТаблицаУзлыКорректировкиСтоимостиСписания.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
	|	ТаблицаУзлыКорректировкиСтоимостиСписания.Количество - ЕСТЬNULL(ТаблицаОстатковПартий.КоличествоОстатокНаКонецПериода, 0) + ЕСТЬNULL(ТаблицаОстатковПартий.КоличествоОстаток, 0) КАК Количество,
	|	ВЫБОР
	|		КОГДА ТаблицаУзлыКорректировкиСтоимостиСписания.Количество - ЕСТЬNULL(ТаблицаОстатковПартий.КоличествоОстатокНаКонецПериода, 0) + ЕСТЬNULL(ТаблицаОстатковПартий.КоличествоОстаток, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ (ТаблицаУзлыКорректировкиСтоимостиСписания.СуммаБезНДС * ТаблицаУзлыКорректировкиСтоимостиСписания.Количество - ЕСТЬNULL(ТаблицаОстатковПартий.СуммаБезНДСОстаток, 0)) / (ТаблицаУзлыКорректировкиСтоимостиСписания.Количество - ЕСТЬNULL(ТаблицаОстатковПартий.КоличествоОстатокНаКонецПериода, 0) + ЕСТЬNULL(ТаблицаОстатковПартий.КоличествоОстаток, 0))
	|	КОНЕЦ КАК СуммаБезНДС,
	|	ВЫБОР
	|		КОГДА ТаблицаУзлыКорректировкиСтоимостиСписания.Количество - ЕСТЬNULL(ТаблицаОстатковПартий.КоличествоОстатокНаКонецПериода, 0) + ЕСТЬNULL(ТаблицаОстатковПартий.КоличествоОстаток, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ (ТаблицаУзлыКорректировкиСтоимостиСписания.Сумма * ТаблицаУзлыКорректировкиСтоимостиСписания.Количество - ЕСТЬNULL(ТаблицаОстатковПартий.СуммаОстаток, 0)) / (ТаблицаУзлыКорректировкиСтоимостиСписания.Количество - ЕСТЬNULL(ТаблицаОстатковПартий.КоличествоОстатокНаКонецПериода, 0) + ЕСТЬNULL(ТаблицаОстатковПартий.КоличествоОстаток, 0))
	|	КОНЕЦ КАК Сумма,
	|	ВЫБОР
	|		КОГДА ТаблицаУзлыКорректировкиСтоимостиСписания.Количество - ЕСТЬNULL(ТаблицаОстатковПартий.КоличествоОстатокНаКонецПериода, 0) + ЕСТЬNULL(ТаблицаОстатковПартий.КоличествоОстаток, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ (ТаблицаУзлыКорректировкиСтоимостиСписания.СуммаИнт * ТаблицаУзлыКорректировкиСтоимостиСписания.Количество - ЕСТЬNULL(ТаблицаОстатковПартий.СуммаИнтОстаток, 0)) / (ТаблицаУзлыКорректировкиСтоимостиСписания.Количество - ЕСТЬNULL(ТаблицаОстатковПартий.КоличествоОстатокНаКонецПериода, 0) + ЕСТЬNULL(ТаблицаОстатковПартий.КоличествоОстаток, 0))
	|	КОНЕЦ КАК СуммаИнт,
	|	ВЫБОР
	|		КОГДА ТаблицаУзлыКорректировкиСтоимостиСписания.Количество - ЕСТЬNULL(ТаблицаОстатковПартий.КоличествоОстатокНаКонецПериода, 0) + ЕСТЬNULL(ТаблицаОстатковПартий.КоличествоОстаток, 0) = 0
	|			ТОГДА 0
	|		ИНАЧЕ (ТаблицаУзлыКорректировкиСтоимостиСписания.СуммаБезНДСИнт * ТаблицаУзлыКорректировкиСтоимостиСписания.Количество - ЕСТЬNULL(ТаблицаОстатковПартий.СуммаБезНДСИнтОстаток, 0)) / (ТаблицаУзлыКорректировкиСтоимостиСписания.Количество - ЕСТЬNULL(ТаблицаОстатковПартий.КоличествоОстатокНаКонецПериода, 0) + ЕСТЬNULL(ТаблицаОстатковПартий.КоличествоОстаток, 0))
	|	КОНЕЦ КАК СуммаБезНДСИнт
	|ИЗ
	|	ТаблицаУзлыКорректировкиСтоимостиСписания КАК ТаблицаУзлыКорректировкиСтоимостиСписания
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаОстатковПартий КАК ТаблицаОстатковПартий
	|		ПО ТаблицаУзлыКорректировкиСтоимостиСписания.Организация = ТаблицаОстатковПартий.Организация
	|			И ТаблицаУзлыКорректировкиСтоимостиСписания.СтруктурнаяЕдиница = ТаблицаОстатковПартий.СтруктурнаяЕдиница
	|			И ТаблицаУзлыКорректировкиСтоимостиСписания.СчетУчета = ТаблицаОстатковПартий.СчетУчета
	|			И ТаблицаУзлыКорректировкиСтоимостиСписания.Номенклатура = ТаблицаОстатковПартий.Номенклатура
	|			И ТаблицаУзлыКорректировкиСтоимостиСписания.Характеристика = ТаблицаОстатковПартий.Характеристика
	|			И ТаблицаУзлыКорректировкиСтоимостиСписания.Партия = ТаблицаОстатковПартий.Партия
	|			И ТаблицаУзлыКорректировкиСтоимостиСписания.ЗаказПокупателя = ТаблицаОстатковПартий.ЗаказПокупателя
	|			И ТаблицаУзлыКорректировкиСтоимостиСписания.ЗаказНаПроизводство = ТаблицаОстатковПартий.ЗаказНаПроизводство";
	
	Запрос.Текст = Запрос.Текст + ТекстОбъединитьВсе();
	Запрос.Текст = Запрос.Текст + ТекстЗапросаУзлыКорректировкиСтоимостиСписания(Перечисления.МетодОценкиЗапасов.ПоСредней);
	
	НомерУзла = 0;
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		НаборЗаписей = РегистрыСведений.УзлыКорректировкиСтоимостиСписания.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(Ссылка);
		НаборЗаписей.Записать(Истина);
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			НомерУзла = НомерУзла + 1;
			НовыйУзел = НаборЗаписей.Добавить();
			НовыйУзел.НомерУзла = НомерУзла;
			НовыйУзел.Регистратор = Ссылка;
			НовыйУзел.Период = Дата;
			ЗаполнитьЗначенияСвойств(НовыйУзел, Выборка);
		КонецЦикла;
		НаборЗаписей.Записать(Ложь);
	КонецЕсли;
	
	// Первое приближение (решение на первой итерации).
	Запрос.Текст =
	"ВЫБРАТЬ
	|	УзлыКорректировкиСтоимостиСписания.НомерУзла,
	|	УзлыКорректировкиСтоимостиСписания.СуммаБезНДС КАК СуммаБезНДС,
	|	УзлыКорректировкиСтоимостиСписания.Сумма,
	|	УзлыКорректировкиСтоимостиСписания.СуммаИнт КАК СуммаИнт,
	|	УзлыКорректировкиСтоимостиСписания.СуммаБезНДСИнт КАК СуммаБезНДСИнт
	|ПОМЕСТИТЬ ТаблицаРешений
	|ИЗ
	|	РегистрСведений.УзлыКорректировкиСтоимостиСписания КАК УзлыКорректировкиСтоимостиСписания
	|ГДЕ
	|	УзлыКорректировкиСтоимостиСписания.Регистратор = &Регистратор
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НомерУзла
	|";
	Запрос.Выполнить();
	
	Возврат НомерУзла;
	
КонецФункции

Функция РешитьСЛУ()

	Запрос = Новый Запрос();
	Запрос.МенеджерВременныхТаблиц = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ДатаНач", ДополнительныеСвойства.ДляПроведения.НачальнаяДатаПериода);
	Запрос.УстановитьПараметр("ДатаКон", ДополнительныеСвойства.ДляПроведения.КонечнаяДатаПериода);
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	Запрос.УстановитьПараметр("Организация", ДополнительныеСвойства.ДляПроведения.Организация);

	Запрос.Текст = ТекстЗапросаВозвраты();
	ТаблицаВозвратов = РаспределитьВозвратыПоПродажам(Запрос);

	Запрос.УстановитьПараметр("ТаблицаВозвратов", ТаблицаВозвратов);

	Запрос.Текст = ТекстЗапросаУчетЗатрат()
					+ ОбщегоНазначения.РазделительПакетаЗапросов()
					+ ТекстЗапросаВТУзлыКорректировки();
	Запрос.Выполнить();

	ИсточникДанныхУзлов = СформироватьМатрицуУзловДляРасчетаСистемЛинейныхУравнений(Запрос);

	РешениеСумма       = РешитьСистемуЛинейныхУравнений(Запрос, ИсточникДанныхУзлов, "Сумма");
	РешениеСуммаБезНДС = РешитьСистемуЛинейныхУравнений(Запрос, ИсточникДанныхУзлов, "СуммаБезНДС");

	Если ПолучитьФункциональнуюОпцию("ПередачаТоваровМеждуОрганизациями") Тогда
		РешениеСуммаИнт       = РешитьСистемуЛинейныхУравнений(Запрос, ИсточникДанныхУзлов, "СуммаИнт");
		РешениеСуммаБезНДСИнт = РешитьСистемуЛинейныхУравнений(Запрос, ИсточникДанныхУзлов, "СуммаБезНДСИнт");
	Иначе
		РешениеСуммаИнт       = ПустоеРешениеСЛУ();
		РешениеСуммаБезНДСИнт = ПустоеРешениеСЛУ();
	КонецЕсли;

	Запрос.УстановитьПараметр("РешениеСумма",          РешениеСумма);
	Запрос.УстановитьПараметр("РешениеСуммаБезНДС",    РешениеСуммаБезНДС);
	Запрос.УстановитьПараметр("РешениеСуммаИнт",       РешениеСуммаИнт);
	Запрос.УстановитьПараметр("РешениеСуммаБезНДСИнт", РешениеСуммаБезНДСИнт);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	РешениеСумма.НомерУзла КАК НомерУзла,
	|	РешениеСумма.Решение1 КАК Решение
	|ПОМЕСТИТЬ РешениеСумма
	|ИЗ
	|	&РешениеСумма КАК РешениеСумма
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РешениеСуммаБезНДС.НомерУзла КАК НомерУзла,
	|	РешениеСуммаБезНДС.Решение1 КАК Решение
	|ПОМЕСТИТЬ РешениеСуммаБезНДС
	|ИЗ
	|	&РешениеСуммаБезНДС КАК РешениеСуммаБезНДС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РешениеСуммаИнт.НомерУзла КАК НомерУзла,
	|	РешениеСуммаИнт.Решение1 КАК Решение
	|ПОМЕСТИТЬ РешениеСуммаИнт
	|ИЗ
	|	&РешениеСуммаИнт КАК РешениеСуммаИнт
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РешениеСуммаБезНДСИнт.НомерУзла КАК НомерУзла,
	|	РешениеСуммаБезНДСИнт.Решение1 КАК Решение
	|ПОМЕСТИТЬ РешениеСуммаБезНДСИнт
	|ИЗ
	|	&РешениеСуммаБезНДСИнт КАК РешениеСуммаБезНДСИнт
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТаблицаРешений
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РешениеСумма.НомерУзла КАК НомерУзла,
	|	ЕСТЬNULL(РешениеСумма.Решение, 0) КАК Сумма,
	|	ЕСТЬNULL(РешениеСуммаБезНДС.Решение, 0) КАК СуммаБезНДС,
	|	ЕСТЬNULL(РешениеСуммаИнт.Решение, 0) КАК СуммаИнт,
	|	ЕСТЬNULL(РешениеСуммаБезНДСИнт.Решение, 0) КАК СуммаБезНДСИнт
	|ПОМЕСТИТЬ ТаблицаРешений
	|ИЗ
	|	РешениеСумма КАК РешениеСумма
	|		ЛЕВОЕ СОЕДИНЕНИЕ РешениеСуммаБезНДС КАК РешениеСуммаБезНДС
	|		ПО РешениеСумма.НомерУзла = РешениеСуммаБезНДС.НомерУзла
	|		ЛЕВОЕ СОЕДИНЕНИЕ РешениеСуммаИнт КАК РешениеСуммаИнт
	|		ПО РешениеСумма.НомерУзла = РешениеСуммаИнт.НомерУзла
	|		ЛЕВОЕ СОЕДИНЕНИЕ РешениеСуммаБезНДСИнт КАК РешениеСуммаБезНДСИнт
	|		ПО РешениеСумма.НомерУзла = РешениеСуммаБезНДСИнт.НомерУзла
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НомерУзла";

	Запрос.ВыполнитьПакет();

	Возврат Истина;

КонецФункции


Функция РешитьСистемуЛинейныхУравнений(Запрос, ИсточникУзлов, ИмяПравойЧасти)

	РасчетСистемЛинейныхУравнений = Новый РасчетСистемЛинейныхУравнений;

	РасчетСистемЛинейныхУравнений.ИсточникДанныхУзлов = ИсточникУзлов;
	РасчетСистемЛинейныхУравнений.ИсточникДанныхСвязей = СформироватьМатрицуСвязейДляРасчетаСистемЛинейныхУравнений(Запрос, ИмяПравойЧасти);

	РасчетСистемЛинейныхУравнений.КолонкаУравненияВУзлах = "НомерУравнения";
	РасчетСистемЛинейныхУравнений.КолонкаУравненияВСвязях = "НомерУравнения";
	РасчетСистемЛинейныхУравнений.КолонкаПеременныеВСвязях = "НомерПеременной";

	ОписаниеСистемы = РасчетСистемЛинейныхУравнений.ОписанияСистем.Добавить();
	ОписаниеСистемы.КолонкаКоэффициентовВУзлах = ИмяПравойЧасти;
	ОписаниеСистемы.КолонкаКоэффициентовВСвязях = "Количество";

	ТаблицаРешений = РасчетСистемЛинейныхУравнений.РассчитатьСистемыЛинейныхУравнений();

	Возврат ТаблицаРешений;

КонецФункции

Функция ПустоеРешениеСЛУ()

	ПустоеРешение = Новый ТаблицаЗначений;
	ПустоеРешение.Колонки.Добавить("НомерУзла",
		Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(10, 0)));
	ПустоеРешение.Колонки.Добавить("Решение1",
		Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(15, 2)));

	Возврат ПустоеРешение;

КонецФункции

Функция ТекстЗапросаВТУзлыКорректировки()

	Возврат
	"ВЫБРАТЬ
	|	УзлыКорректировкиСтоимостиСписания.НомерУзла КАК НомерУзла,
	|	УзлыКорректировкиСтоимостиСписания.Организация КАК Организация,
	|	УзлыКорректировкиСтоимостиСписания.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	УзлыКорректировкиСтоимостиСписания.СчетУчета КАК СчетУчета,
	|	УзлыКорректировкиСтоимостиСписания.Номенклатура КАК Номенклатура,
	|	УзлыКорректировкиСтоимостиСписания.Характеристика КАК Характеристика,
	|	УзлыКорректировкиСтоимостиСписания.Партия КАК Партия,
	|	УзлыКорректировкиСтоимостиСписания.ЗаказПокупателя КАК ЗаказПокупателя,
	|	УзлыКорректировкиСтоимостиСписания.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
	|	УзлыКорректировкиСтоимостиСписания.Количество КАК Количество
	|ПОМЕСТИТЬ ВТ_УзлыКорректировки
	|ИЗ
	|	РегистрСведений.УзлыКорректировкиСтоимостиСписания КАК УзлыКорректировкиСтоимостиСписания
	|ГДЕ
	|	УзлыКорректировкиСтоимостиСписания.Регистратор = &Регистратор
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	СтруктурнаяЕдиница,
	|	СчетУчета,
	|	Номенклатура,
	|	Характеристика,
	|	Партия,
	|	ЗаказПокупателя,
	|	ЗаказНаПроизводство";

КонецФункции

Процедура СформироватьДвиженияПоРегиструУчетаЗатрат(НаборЗаписей, НаборЗаписейУправленческий, СтрокаДвижения, СуммаИлиСтруктура, ФиксированнаяСтоимость, СодержаниеПроводки = Неопределено)

	Если СодержаниеПроводки = Неопределено Тогда
		Если СтрокаДвижения.СчетУчетаТипСчета = Перечисления.ТипыСчетов.Запасы Тогда
			СодержаниеПроводки = НСтр("ru = 'Списание запасов со склада'");
		Иначе
			Если ЗначениеЗаполнено(СтрокаДвижения.Номенклатура) Тогда
				СодержаниеПроводки = НСтр("ru = 'Списание расходов'");
			Иначе
				СодержаниеПроводки = НСтр("ru = 'Списание запасов из производства'");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Сумма = СуммаИлиСтруктура.СуммаКорректировки;
	СуммаБезНДС = СуммаИлиСтруктура.СуммаКорректировкиБезНДС;
	
	// Расход по регистру Учет запасов и затрат.
	НоваяСтрока = НаборЗаписей.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДвижения);
	НоваяСтрока.ВидДвижения = ВидДвиженияНакопления.Расход;
	НоваяСтрока.Период = ?(ЗначениеЗаполнено(НоваяСтрока.Период), НоваяСтрока.Период, Дата); // для возвратов период будет заполнен, это нужно для FIFO
	НоваяСтрока.Регистратор = Ссылка;
	НоваяСтрока.ФиксированнаяСтоимость = ФиксированнаяСтоимость;
	НоваяСтрока.Количество = 0;
	НоваяСтрока.Сумма = Сумма;
	НоваяСтрока.СуммаБезНДС = СуммаБезНДС;
	НоваяСтрока.СодержаниеПроводки = СодержаниеПроводки;
	
	Если СтрокаДвижения.КоррСчетУчета = ДополнительныеСвойства.ДляПроведения.ПустойСчет Тогда
		Возврат;
	КонецЕсли;
	
	Если СтрокаДвижения.КоррСчетУчетаТипСчета = Перечисления.ТипыСчетов.Запасы Тогда
		СодержаниеПроводки = НСтр("ru = 'Оприходование запасов на склад'");
	Иначе
		Если ЗначениеЗаполнено(СтрокаДвижения.Номенклатура) Тогда
			СодержаниеПроводки = НСтр("ru = 'Поступление расходов'");
		Иначе
			СодержаниеПроводки = НСтр("ru = 'Оприходование запасов в производство'");
		КонецЕсли;
	КонецЕсли;
		
	// Приход по регистру Учет запасов и затрат.
	НоваяСтрока = НаборЗаписей.Добавить();
	НоваяСтрока.ВидДвижения = ВидДвиженияНакопления.Приход;
	НоваяСтрока.Период = Дата;
	НоваяСтрока.Регистратор = Ссылка;
	НоваяСтрока.Организация = СтрокаДвижения.Организация;
	НоваяСтрока.СтруктурнаяЕдиница = СтрокаДвижения.КоррСтруктурнаяЕдиница;
	НоваяСтрока.СчетУчета = СтрокаДвижения.КоррСчетУчета;
	НоваяСтрока.Номенклатура = СтрокаДвижения.КоррНоменклатура;
	НоваяСтрока.Характеристика = СтрокаДвижения.КоррХарактеристика;
	НоваяСтрока.Партия = СтрокаДвижения.КоррПартия;
	НоваяСтрока.ЗаказПокупателя = СтрокаДвижения.КоррЗаказПокупателя;	
	НоваяСтрока.ЗаказНаПроизводство = СтрокаДвижения.КоррЗаказНаПроизводство;	
	НоваяСтрока.Спецификация = СтрокаДвижения.КоррСпецификация;
	НоваяСтрока.КоррСпецификация = СтрокаДвижения.Спецификация;
	НоваяСтрока.КоррСтруктурнаяЕдиница = СтрокаДвижения.СтруктурнаяЕдиница;
	НоваяСтрока.КоррСчетУчета = СтрокаДвижения.СчетУчета;
	НоваяСтрока.КоррНоменклатура = СтрокаДвижения.Номенклатура;
	НоваяСтрока.КоррХарактеристика = СтрокаДвижения.Характеристика;
	НоваяСтрока.КоррПартия = СтрокаДвижения.Партия;
	НоваяСтрока.КоррЗаказПокупателя = СтрокаДвижения.ЗаказПокупателя;
	НоваяСтрока.КоррЗаказНаПроизводство = СтрокаДвижения.ЗаказНаПроизводство;
	НоваяСтрока.ФиксированнаяСтоимость = ФиксированнаяСтоимость;
	НоваяСтрока.Сумма = Сумма;
	НоваяСтрока.СуммаБезНДС = СуммаБезНДС;
	НоваяСтрока.СодержаниеПроводки = СодержаниеПроводки;
	
	// Движения по регистру Управленческий.
	НоваяСтрока = НаборЗаписейУправленческий.Добавить();
	НоваяСтрока.Период = Дата;
	НоваяСтрока.Регистратор = Ссылка;
	НоваяСтрока.Организация = СтрокаДвижения.Организация;
	НоваяСтрока.СценарийПланирования = Справочники.СценарииПланирования.Фактический;
	НоваяСтрока.СчетДт = СтрокаДвижения.КоррСчетУчета;
	НоваяСтрока.СчетКт = СтрокаДвижения.СчетУчета;
	НоваяСтрока.Сумма = Сумма; 
	НоваяСтрока.Содержание = СодержаниеПроводки;
	
КонецПроцедуры // СформироватьДвиженияПоРегиструУчетаЗатрат()

Процедура СформироватьКорректирующиеДвиженияПоРегиструУчетаЗатрат()
	
	Запрос = Новый Запрос();
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.СписаниеЗапасов)
	|				ИЛИ ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ОтчетКомиссионераОСписании)
	|				ИЛИ ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ПересортицаЗапасов)
	|			ТОГДА УчетЗатрат.ДокументПродажи.Корреспонденция
	|		КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ПеремещениеЗапасов)
	|				И (УчетЗатрат.ДокументПродажи.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.СписаниеНаРасходы)
	|					ИЛИ УчетЗатрат.ДокументПродажи.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.ПередачаВЭксплуатацию))
	|			ТОГДА УчетЗатрат.ДокументПродажи.СчетЗатрат
	|		КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ПеремещениеЗапасов)
	|			ТОГДА УчетЗатрат.Номенклатура.СчетУчетаЗатрат
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК СчетУчетаСписания,
	|	ВЫБОР
	|		КОГДА УчетЗатрат.ПеремещениеВРозницуСуммовойУчет
	|			ТОГДА ВЫБОР
	|					КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ПриходнаяНакладная)
	|						ТОГДА УчетЗатрат.ДокументПродажи.СтруктурнаяЕдиница
	|					КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ПеремещениеЗапасов)
	|						ТОГДА УчетЗатрат.ДокументПродажи.СтруктурнаяЕдиницаПолучатель
	|					ИНАЧЕ НЕОПРЕДЕЛЕНО
	|				КОНЕЦ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК РозничнаяСтруктурнаяЕдиница,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.СписаниеЗапасов)
	|				ИЛИ ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ОтчетКомиссионераОСписании)
	|				ИЛИ ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ПересортицаЗапасов)
	|			ТОГДА УчетЗатрат.ДокументПродажи.Корреспонденция.ТипСчета
	|		КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ПеремещениеЗапасов)
	|				И (УчетЗатрат.ДокументПродажи.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.СписаниеНаРасходы)
	|					ИЛИ УчетЗатрат.ДокументПродажи.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.ПередачаВЭксплуатацию))
	|			ТОГДА УчетЗатрат.ДокументПродажи.СчетЗатрат.ТипСчета
	|		КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ПеремещениеЗапасов)
	|			ТОГДА УчетЗатрат.Номенклатура.СчетУчетаЗатрат.ТипСчета
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК СчетУчетаСписанияТипСчета,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ПеремещениеЗапасов)
	|			ТОГДА УчетЗатрат.ДокументПродажи.НаправлениеДеятельности
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК НаправлениеДеятельностиСписания,
	|	УчетЗатрат.Организация КАК Организация,
	|	УчетЗатрат.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ПеремещениеЗапасов)
	|			ТОГДА УчетЗатрат.ДокументПродажи.СтруктурнаяЕдиницаПолучатель
	|		ИНАЧЕ УчетЗатрат.ДокументПродажи.СтруктурнаяЕдиница
	|	КОНЕЦ КАК СтруктурнаяЕдиницаПолучатель,
	|	УчетЗатрат.СчетУчета КАК СчетУчета,
	|	УчетЗатрат.Номенклатура КАК Номенклатура,
	|	УчетЗатрат.Характеристика КАК Характеристика,
	|	УчетЗатрат.Партия КАК Партия,
	|	УчетЗатрат.ЗаказПокупателя КАК ЗаказПокупателя,
	|	УчетЗатрат.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
	|	УчетЗатрат.Спецификация КАК Спецификация,
	|	УчетЗатрат.КоррСпецификация КАК КоррСпецификация,
	|	УчетЗатрат.КоррСтруктурнаяЕдиница КАК КоррСтруктурнаяЕдиница,
	|	УчетЗатрат.КоррСчетУчета КАК КоррСчетУчета,
	|	УчетЗатрат.КоррНоменклатура КАК КоррНоменклатура,
	|	УчетЗатрат.КоррХарактеристика КАК КоррХарактеристика,
	|	УчетЗатрат.КоррПартия КАК КоррПартия,
	|	УчетЗатрат.КоррЗаказПокупателя КАК КоррЗаказПокупателя,
	|	УчетЗатрат.КоррЗаказНаПроизводство КАК КоррЗаказНаПроизводство,
	|	СУММА(ВЫБОР
	|			КОГДА УчетЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				ТОГДА УчетЗатрат.Количество
	|			ИНАЧЕ -УчетЗатрат.Количество
	|		КОНЕЦ) КАК Количество,
	|	СУММА(ВЫБОР
	|			КОГДА УчетЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				ТОГДА УчетЗатрат.СуммаБезНДС
	|			ИНАЧЕ -УчетЗатрат.СуммаБезНДС
	|		КОНЕЦ) КАК СуммаБезНДС,
	|	СУММА(ВЫБОР
	|			КОГДА УчетЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				ТОГДА УчетЗатрат.Сумма
	|			ИНАЧЕ -УчетЗатрат.Сумма
	|		КОНЕЦ) КАК Сумма,
	|	СУММА(ВЫБОР
	|			КОГДА УчетЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				ТОГДА УчетЗатрат.СуммаИнт
	|			ИНАЧЕ -УчетЗатрат.СуммаИнт
	|		КОНЕЦ) КАК СуммаИнт,
	|	СУММА(ВЫБОР
	|			КОГДА УчетЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				ТОГДА УчетЗатрат.СуммаБезНДСИнт
	|			ИНАЧЕ -УчетЗатрат.СуммаБезНДСИнт
	|		КОНЕЦ) КАК СуммаБезНДСИнт,
	|	УчетЗатрат.Номенклатура.КатегорияНоменклатуры КАК НоменклатураКатегорияНоменклатуры,
	|	УчетЗатрат.Номенклатура.НаправлениеДеятельности КАК НаправлениеДеятельностиПродажи,
	|	УчетЗатрат.Номенклатура.НаправлениеДеятельности.СчетУчетаСебестоимостиПродаж КАК НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродаж,
	|	УчетЗатрат.Номенклатура.НаправлениеДеятельности.СчетУчетаСебестоимостиПродаж.ТипСчета КАК НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродажТипСчета,
	|	УчетЗатрат.ДокументПродажи КАК ДокументПродажи,
	|	УчетЗатрат.ЗаказПродажи КАК ЗаказПродажи,
	|	УчетЗатрат.ЗаказПродажи.УчетПотребностиПоСкладам КАК УчетПотребностиПоСкладам,
	|	УчетЗатрат.Подразделение КАК Подразделение,
	|	УчетЗатрат.Ответственный КАК Ответственный,
	|	УчетЗатрат.СтавкаНДС КАК СтавкаНДС,
	|	УчетЗатрат.ЗатратыНаВыпуск КАК ЗатратыНаВыпуск,
	|	УчетЗатрат.ПеремещениеВРозницуСуммовойУчет КАК ПеремещениеВРозницуСуммовойУчет
	|ПОМЕСТИТЬ УчетЗатратСписания
	|ИЗ
	|	РегистрНакопления.Запасы КАК УчетЗатрат
	|ГДЕ
	|	УчетЗатрат.Период МЕЖДУ &ДатаНач И &ДатаКон
	|	И (УчетЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				И НЕ УчетЗатрат.Возврат
	|			ИЛИ УчетЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				И УчетЗатрат.Возврат
	|ИЛИ (УчетЗатрат.Возврат И УчетЗатрат.ДокументПродажи = УчетЗатрат.Регистратор))
	|	И УчетЗатрат.Организация = &Организация
	|	И НЕ УчетЗатрат.ФиксированнаяСтоимость
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА УчетЗатрат.ПеремещениеВРозницуСуммовойУчет
	|			ТОГДА ВЫБОР
	|					КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ПриходнаяНакладная)
	|						ТОГДА УчетЗатрат.ДокументПродажи.СтруктурнаяЕдиница
	|					КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ПеремещениеЗапасов)
	|						ТОГДА УчетЗатрат.ДокументПродажи.СтруктурнаяЕдиницаПолучатель
	|					ИНАЧЕ НЕОПРЕДЕЛЕНО
	|				КОНЕЦ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ПеремещениеЗапасов)
	|			ТОГДА УчетЗатрат.ДокументПродажи.НаправлениеДеятельности
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	УчетЗатрат.Организация,
	|	УчетЗатрат.СтруктурнаяЕдиница,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ПеремещениеЗапасов)
	|			ТОГДА УчетЗатрат.ДокументПродажи.СтруктурнаяЕдиницаПолучатель
	|		ИНАЧЕ УчетЗатрат.ДокументПродажи.СтруктурнаяЕдиница
	|	КОНЕЦ,
	|	УчетЗатрат.СчетУчета,
	|	УчетЗатрат.Номенклатура,
	|	УчетЗатрат.Характеристика,
	|	УчетЗатрат.Партия,
	|	УчетЗатрат.ЗаказПокупателя,
	|	УчетЗатрат.ЗаказНаПроизводство,
	|	УчетЗатрат.Спецификация,
	|	УчетЗатрат.КоррСпецификация,
	|	УчетЗатрат.КоррСтруктурнаяЕдиница,
	|	УчетЗатрат.КоррСчетУчета,
	|	УчетЗатрат.КоррНоменклатура,
	|	УчетЗатрат.КоррХарактеристика,
	|	УчетЗатрат.КоррПартия,
	|	УчетЗатрат.КоррЗаказПокупателя,
	|	УчетЗатрат.КоррЗаказНаПроизводство,
	|	УчетЗатрат.Номенклатура.КатегорияНоменклатуры,
	|	УчетЗатрат.Номенклатура.НаправлениеДеятельности,
	|	УчетЗатрат.Номенклатура.НаправлениеДеятельности.СчетУчетаСебестоимостиПродаж,
	|	УчетЗатрат.Номенклатура.НаправлениеДеятельности.СчетУчетаСебестоимостиПродаж.ТипСчета,
	|	УчетЗатрат.ДокументПродажи,
	|	УчетЗатрат.ЗаказПродажи,
	|	УчетЗатрат.Подразделение,
	|	УчетЗатрат.Ответственный,
	|	УчетЗатрат.СтавкаНДС,
	|	УчетЗатрат.ЗатратыНаВыпуск,
	|	УчетЗатрат.ПеремещениеВРозницуСуммовойУчет,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.СписаниеЗапасов)
	|				ИЛИ ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ОтчетКомиссионераОСписании)
	|				ИЛИ ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ПересортицаЗапасов)
	|			ТОГДА УчетЗатрат.ДокументПродажи.Корреспонденция
	|		КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ПеремещениеЗапасов)
	|				И (УчетЗатрат.ДокументПродажи.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.СписаниеНаРасходы)
	|					ИЛИ УчетЗатрат.ДокументПродажи.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.ПередачаВЭксплуатацию))
	|			ТОГДА УчетЗатрат.ДокументПродажи.СчетЗатрат
	|		КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ПеремещениеЗапасов)
	|			ТОГДА УчетЗатрат.Номенклатура.СчетУчетаЗатрат
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.СписаниеЗапасов)
	|				ИЛИ ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ОтчетКомиссионераОСписании)
	|				ИЛИ ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ПересортицаЗапасов)
	|			ТОГДА УчетЗатрат.ДокументПродажи.Корреспонденция.ТипСчета
	|		КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ПеремещениеЗапасов)
	|				И (УчетЗатрат.ДокументПродажи.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.СписаниеНаРасходы)
	|					ИЛИ УчетЗатрат.ДокументПродажи.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.ПередачаВЭксплуатацию))
	|			ТОГДА УчетЗатрат.ДокументПродажи.СчетЗатрат.ТипСчета
	|		КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ПеремещениеЗапасов)
	|			ТОГДА УчетЗатрат.Номенклатура.СчетУчетаЗатрат.ТипСчета
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	СтруктурнаяЕдиница,
	|	СчетУчета,
	|	Номенклатура,
	|	Характеристика,
	|	Партия,
	|	ЗаказПокупателя,
	|	ЗаказНаПроизводство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УзлыКорректировкиСтоимостиСписания.Организация КАК Организация,
	|	УзлыКорректировкиСтоимостиСписания.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	УчетЗатрат.СтруктурнаяЕдиницаПолучатель КАК СтруктурнаяЕдиницаПолучатель,
	|	УзлыКорректировкиСтоимостиСписания.СчетУчета КАК СчетУчета,
	|	УзлыКорректировкиСтоимостиСписания.СчетУчета.ТипСчета КАК СчетУчетаТипСчета,
	|	УзлыКорректировкиСтоимостиСписания.Номенклатура КАК Номенклатура,
	|	УзлыКорректировкиСтоимостиСписания.Характеристика КАК Характеристика,
	|	УзлыКорректировкиСтоимостиСписания.Партия КАК Партия,
	|	УзлыКорректировкиСтоимостиСписания.ЗаказПокупателя КАК ЗаказПокупателя,
	|	УзлыКорректировкиСтоимостиСписания.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
	|	УзлыКорректировкиСтоимостиСписания.НомерУзла КАК НомерУзла,
	|	УчетЗатрат.Спецификация КАК Спецификация,
	|	УчетЗатрат.КоррСпецификация КАК КоррСпецификация,
	|	УчетЗатрат.СчетУчетаСписания КАК СчетУчетаСписания,
	|	УчетЗатрат.СчетУчетаСписанияТипСчета КАК СчетУчетаСписанияТипСчета,
	|	УчетЗатрат.КоррСтруктурнаяЕдиница КАК КоррСтруктурнаяЕдиница,
	|	УчетЗатрат.КоррСчетУчета КАК КоррСчетУчета,
	|	УчетЗатрат.КоррСчетУчета.ТипСчета КАК КоррСчетУчетаТипСчета,
	|	УчетЗатрат.КоррНоменклатура КАК КоррНоменклатура,
	|	УчетЗатрат.КоррХарактеристика КАК КоррХарактеристика,
	|	УчетЗатрат.КоррПартия КАК КоррПартия,
	|	УчетЗатрат.КоррЗаказПокупателя КАК КоррЗаказПокупателя,
	|	УчетЗатрат.КоррЗаказНаПроизводство КАК КоррЗаказНаПроизводство,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(УчетЗатрат.Количество, 0) = 0
	|			ТОГДА ЕСТЬNULL(УчетЗатрат.Сумма, 0)
	|		ИНАЧЕ ЕСТЬNULL(УчетЗатрат.Количество, 0)
	|	КОНЕЦ КАК Количество,
	|	ЕСТЬNULL(УчетЗатрат.СуммаБезНДС, 0) КАК СуммаБезНДС,
	|	ЕСТЬNULL(УчетЗатрат.Сумма, 0) КАК Сумма,
	|	ЕСТЬNULL(УчетЗатрат.СуммаИнт, 0) КАК СуммаИнт,
	|	ЕСТЬNULL(УчетЗатрат.СуммаБезНДСИнт, 0) КАК СуммаБезНДСИнт,
	|	ЕСТЬNULL(ТаблицаРешений.СуммаБезНДС, 0) КАК ЦенаБезНДС,
	|	ЕСТЬNULL(ТаблицаРешений.Сумма, 0) КАК Цена,
	|	ЕСТЬNULL(ТаблицаРешений.СуммаИнт, 0) КАК ЦенаИнт,
	|	ЕСТЬNULL(ТаблицаРешений.СуммаБезНДСИнт, 0) КАК ЦенаИнтБезНДС,
	|	УчетЗатрат.НоменклатураКатегорияНоменклатуры КАК НоменклатураКатегорияНоменклатуры,
	|	УчетЗатрат.НаправлениеДеятельностиПродажи КАК НаправлениеДеятельностиПродажи,
	|	УчетЗатрат.НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродаж КАК НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродаж,
	|	УчетЗатрат.НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродажТипСчета КАК НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродажТипСчета,
	|	УчетЗатрат.ДокументПродажи КАК ДокументПродажи,
	|	ВЫБОР
	|		КОГДА УчетЗатрат.ДокументПродажи ССЫЛКА Документ.РасходнаяНакладная
	|			ТОГДА УчетЗатрат.ДокументПродажи.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратПоставщику)
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоВозвратПоставщику,
	|	УчетЗатрат.ЗаказПродажи КАК ЗаказПродажи,
	|	УчетЗатрат.УчетПотребностиПоСкладам КАК УчетПотребностиПоСкладам,
	|	УчетЗатрат.Подразделение КАК Подразделение,
	|	УчетЗатрат.Ответственный КАК Ответственный,
	|	УчетЗатрат.СтавкаНДС КАК СтавкаНДС,
	|	УчетЗатрат.ЗатратыНаВыпуск КАК ЗатратыНаВыпуск,
	|	УчетЗатрат.НаправлениеДеятельностиСписания КАК НаправлениеДеятельностиСписания,
	|	УчетЗатрат.ПеремещениеВРозницуСуммовойУчет КАК ПеремещениеВРозницуСуммовойУчет,
	|	УчетЗатрат.РозничнаяСтруктурнаяЕдиница КАК РозничнаяСтруктурнаяЕдиница
	|ИЗ
	|	РегистрСведений.УзлыКорректировкиСтоимостиСписания КАК УзлыКорректировкиСтоимостиСписания
	|		ЛЕВОЕ СОЕДИНЕНИЕ УчетЗатратСписания КАК УчетЗатрат
	|		ПО УзлыКорректировкиСтоимостиСписания.Организация = УчетЗатрат.Организация
	|			И УзлыКорректировкиСтоимостиСписания.СтруктурнаяЕдиница = УчетЗатрат.СтруктурнаяЕдиница
	|			И УзлыКорректировкиСтоимостиСписания.СчетУчета = УчетЗатрат.СчетУчета
	|			И УзлыКорректировкиСтоимостиСписания.Номенклатура = УчетЗатрат.Номенклатура
	|			И УзлыКорректировкиСтоимостиСписания.Характеристика = УчетЗатрат.Характеристика
	|			И УзлыКорректировкиСтоимостиСписания.Партия = УчетЗатрат.Партия
	|			И УзлыКорректировкиСтоимостиСписания.ЗаказПокупателя = УчетЗатрат.ЗаказПокупателя
	|			И УзлыКорректировкиСтоимостиСписания.ЗаказНаПроизводство = УчетЗатрат.ЗаказНаПроизводство
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаРешений КАК ТаблицаРешений
	|		ПО (ТаблицаРешений.НомерУзла = УзлыКорректировкиСтоимостиСписания.НомерУзла)
	|ГДЕ
	|	УзлыКорректировкиСтоимостиСписания.Регистратор = &Регистратор
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерУзла УБЫВ";
	
	Запрос.МенеджерВременныхТаблиц = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	Запрос.УстановитьПараметр("ДатаНач", ДополнительныеСвойства.ДляПроведения.НачальнаяДатаПериода);
	Запрос.УстановитьПараметр("ДатаКон", ДополнительныеСвойства.ДляПроведения.КонечнаяДатаПериода);
	Запрос.УстановитьПараметр("Организация", ДополнительныеСвойства.ДляПроведения.Организация);
	
	Результат = Запрос.ВыполнитьПакет();
	
	Если Результат[1].Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	// Создадим набор записей регистра накопления Учет запасов и затрат.
	НаборЗаписейЗапасы = РегистрыНакопления.Запасы.СоздатьНаборЗаписей();
	НаборЗаписейЗапасы.Отбор.Регистратор.Установить(Ссылка);
	
	// Создадим набор записей регистра накопления Продажи.
	НаборЗаписейПродажи = РегистрыНакопления.Продажи.СоздатьНаборЗаписей();
	НаборЗаписейПродажи.Отбор.Регистратор.Установить(Ссылка);
	
	// Создадим набор записей регистра накопления УчетДоходовИРасходов.
	НаборЗаписейДоходыИРасходы = РегистрыНакопления.ДоходыИРасходы.СоздатьНаборЗаписей();
	НаборЗаписейДоходыИРасходы.Отбор.Регистратор.Установить(Ссылка);
	
	// Создадим набор записей регистра накопления СуммовойУчетВРознице.
	НаборЗаписейСуммовойУчетВРознице = РегистрыНакопления.СуммовойУчетВРознице.СоздатьНаборЗаписей();
	НаборЗаписейСуммовойУчетВРознице.Отбор.Регистратор.Установить(Ссылка);
	
	// Создадим набор записей регистра накопления Управленческий.
	НаборЗаписейУправленческий = РегистрыБухгалтерии.Управленческий.СоздатьНаборЗаписей();
	НаборЗаписейУправленческий.Отбор.Регистратор.Установить(Ссылка);
	
	ВыборкаДетальныеЗаписи = Результат[1].Выбрать();
	
	УчетПоПроектам = ПолучитьФункциональнуюОпцию("УчетПоПроектам");
	
	ПорогКорректировки = 0.005;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		// Сделаем проверку, на случай, если есть не закрытые кассовые смены.
		Если ТипЗнч(ВыборкаДетальныеЗаписи.ДокументПродажи) = Тип("ДокументСсылка.ЧекККМ")
			ИЛИ ТипЗнч(ВыборкаДетальныеЗаписи.ДокументПродажи) = Тип("ДокументСсылка.ЧекККМВозврат") Тогда
			Продолжить;
		КонецЕсли;
		
		// Посчитаем суммы перемещения и корректировки.
		СуммаПеремещения = ВыборкаДетальныеЗаписи.Цена * ВыборкаДетальныеЗаписи.Количество;
		СуммаКорректировки = СуммаПеремещения - ВыборкаДетальныеЗаписи.Сумма;
		
		СуммаПеремещенияБезНДС = ВыборкаДетальныеЗаписи.ЦенаБезНДС * ВыборкаДетальныеЗаписи.Количество;
		СуммаКорректировкиБезНДС = СуммаПеремещенияБезНДС - ВыборкаДетальныеЗаписи.СуммаБезНДС;
		
		СуммаПеремещенияИнт = ВыборкаДетальныеЗаписи.ЦенаИнт * ВыборкаДетальныеЗаписи.Количество;
		СуммаКорректировкиИнт = СуммаПеремещенияИнт - ВыборкаДетальныеЗаписи.СуммаИнт;
		
		СуммаПеремещенияИнтБезНДС = ВыборкаДетальныеЗаписи.ЦенаИнтБезНДС * ВыборкаДетальныеЗаписи.Количество;
		СуммаКорректировкиИнтБезНДС = СуммаПеремещенияИнтБезНДС - ВыборкаДетальныеЗаписи.СуммаБезНДСИнт;
		
		СуммыКорректировкиСтруктура = Новый Структура;
		СуммыКорректировкиСтруктура.Вставить("СуммаКорректировки", СуммаКорректировки);
		СуммыКорректировкиСтруктура.Вставить("СуммаКорректировкиБезНДС", СуммаКорректировкиБезНДС);
		СуммыКорректировкиСтруктура.Вставить("СуммаКорректировкиИнт", СуммаКорректировкиИнт);
		СуммыКорректировкиСтруктура.Вставить("СуммаКорректировкиИнтБезНДС", СуммаКорректировкиИнтБезНДС);
		
		КорректировкаТребуется = Макс(СуммаКорректировки, -СуммаКорректировки) > ПорогКорректировки
							 ИЛИ Макс(СуммаКорректировкиБезНДС, -СуммаКорректировкиБезНДС) > ПорогКорректировки;
		
		Если КорректировкаТребуется Тогда
			
			// Движения по регистру Учет запасов и затрат.
			СформироватьДвиженияПоРегиструУчетаЗатрат(
				НаборЗаписейЗапасы,
				НаборЗаписейУправленческий,
				ВыборкаДетальныеЗаписи,
				СуммыКорректировкиСтруктура,
				Ложь);
			
			Если ВыборкаДетальныеЗаписи.КоррСчетУчета = ДополнительныеСвойства.ДляПроведения.ПустойСчет Тогда
				
				Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ДокументПродажи)
				   И ((ТипЗнч(ВыборкаДетальныеЗаписи.ДокументПродажи) = Тип("ДокументСсылка.РасходнаяНакладная")
					 И НЕ ВыборкаДетальныеЗаписи.ЭтоВозвратПоставщику)
				  ИЛИ ТипЗнч(ВыборкаДетальныеЗаписи.ДокументПродажи) = Тип("ДокументСсылка.ОтчетОРозничныхПродажах")
				  ИЛИ ТипЗнч(ВыборкаДетальныеЗаписи.ДокументПродажи) = Тип("ДокументСсылка.АктВыполненныхРабот")
				  ИЛИ ТипЗнч(ВыборкаДетальныеЗаписи.ДокументПродажи) = Тип("ДокументСсылка.ОтчетКомиссионера")
				  ИЛИ ТипЗнч(ВыборкаДетальныеЗаписи.ДокументПродажи) = Тип("ДокументСсылка.ЗаказПокупателя")
				  ИЛИ ТипЗнч(ВыборкаДетальныеЗаписи.ДокументПродажи) = Тип("ДокументСсылка.ОтчетОПереработке")
				  ИЛИ ТипЗнч(ВыборкаДетальныеЗаписи.ДокументПродажи) = Тип("ДокументСсылка.ПередачаТоваровМеждуОрганизациями")) Тогда
					
					// Движения по регистру Продажи.
					НоваяСтрока = НаборЗаписейПродажи.Добавить();
					НоваяСтрока.Период = Дата;
					НоваяСтрока.Регистратор = Ссылка;
					НоваяСтрока.Организация = ВыборкаДетальныеЗаписи.Организация;
					НоваяСтрока.ЗаказПокупателя = ВыборкаДетальныеЗаписи.ЗаказПродажи;
					НоваяСтрока.Подразделение = ВыборкаДетальныеЗаписи.Подразделение;
					НоваяСтрока.Ответственный = ВыборкаДетальныеЗаписи.Ответственный;
					НоваяСтрока.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
					НоваяСтрока.Характеристика = ВыборкаДетальныеЗаписи.Характеристика;
					НоваяСтрока.Партия = ВыборкаДетальныеЗаписи.Партия;
					НоваяСтрока.Документ = ВыборкаДетальныеЗаписи.ДокументПродажи;
					НоваяСтрока.СтавкаНДС = ВыборкаДетальныеЗаписи.СтавкаНДС;
					НоваяСтрока.Себестоимость = СуммаКорректировки;
					НоваяСтрока.СебестоимостьБезНДС = СуммаКорректировкиБезНДС;
					НоваяСтрока.СебестоимостьИнт = СуммаКорректировкиИнт;
					НоваяСтрока.СебестоимостьБезНДСИнт = СуммаКорректировкиИнтБезНДС;
					
					Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ЗаказПродажи)
						И ВыборкаДетальныеЗаписи.УчетПотребностиПоСкладам = Истина Тогда
						НоваяСтрока.Склад = ВыборкаДетальныеЗаписи.СтруктурнаяЕдиница;
					КонецЕсли;
					
					// Движения по регистру ДоходыИРасходы.
					НоваяСтрока = НаборЗаписейДоходыИРасходы.Добавить();
					НоваяСтрока.Период = Дата;
					НоваяСтрока.Регистратор = Ссылка;
					НоваяСтрока.Организация = ВыборкаДетальныеЗаписи.Организация;
					НоваяСтрока.СтруктурнаяЕдиница = ВыборкаДетальныеЗаписи.Подразделение;
					НоваяСтрока.ЗаказПокупателя = ВыборкаДетальныеЗаписи.ЗаказПродажи;
					НоваяСтрока.НаправлениеДеятельности = ВыборкаДетальныеЗаписи.НаправлениеДеятельностиПродажи;
					НоваяСтрока.СчетУчета = ВыборкаДетальныеЗаписи.НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродаж;
					НоваяСтрока.СуммаРасходов = СуммаКорректировки;
					НоваяСтрока.СодержаниеПроводки = СодержанияПроводок.ОтражениеРасходов();
					
					Если УчетПоПроектам Тогда
						Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ВыборкаДетальныеЗаписи.ДокументПродажи, "Проект") Тогда
							НоваяСтрока.Проект = ВыборкаДетальныеЗаписи.ДокументПродажи.Проект;
						КонецЕсли;
					КонецЕсли;
					
					// Движения по регистру Управленческий.
					НоваяСтрока = НаборЗаписейУправленческий.Добавить();
					НоваяСтрока.Период = Дата;
					НоваяСтрока.Регистратор = Ссылка;
					НоваяСтрока.Организация = ВыборкаДетальныеЗаписи.Организация;
					НоваяСтрока.СценарийПланирования = Справочники.СценарииПланирования.Фактический;
					НоваяСтрока.СчетДт = ВыборкаДетальныеЗаписи.НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродаж;
					НоваяСтрока.СчетКт = ВыборкаДетальныеЗаписи.СчетУчета;
					НоваяСтрока.Содержание = СодержанияПроводок.ОтражениеРасходов();
					НоваяСтрока.Сумма = СуммаКорректировки;
					
				ИначеЕсли ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ДокументПродажи)
						И ТипЗнч(ВыборкаДетальныеЗаписи.ДокументПродажи) = Тип("ДокументСсылка.РасходнаяНакладная")
						И ВыборкаДетальныеЗаписи.ЭтоВозвратПоставщику Тогда
						
					// Движения по регистру Доходы и расходы.
					НоваяСтрока = НаборЗаписейДоходыИРасходы.Добавить();
					НоваяСтрока.Период = ДополнительныеСвойства.ДляПроведения.Дата;
					НоваяСтрока.Регистратор = Ссылка;
					НоваяСтрока.Организация = ВыборкаДетальныеЗаписи.Организация;
					НоваяСтрока.СтруктурнаяЕдиница = Неопределено;
					НоваяСтрока.ЗаказПокупателя = Неопределено;
					НоваяСтрока.НаправлениеДеятельности = Справочники.НаправленияДеятельности.Прочее;
					
					Если СуммаКорректировки < 0 Тогда
						НоваяСтрока.СчетУчета = ПланыСчетов.Управленческий.ПрочиеРасходы;
						НоваяСтрока.СуммаРасходов = СуммаКорректировки;
						НоваяСтрока.СодержаниеПроводки = СодержанияПроводок.ПрочиеРасходы();
					Иначе
						НоваяСтрока.СчетУчета = ПланыСчетов.Управленческий.ПрочиеДоходы;
						НоваяСтрока.СуммаДоходов = СуммаКорректировки;
						НоваяСтрока.СодержаниеПроводки = СодержанияПроводок.ПрочиеРасходы();
					КонецЕсли;
					НоваяСтрока.Аналитика = ВыборкаДетальныеЗаписи.Номенклатура;
					
					Если УчетПоПроектам Тогда
						Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ВыборкаДетальныеЗаписи.ДокументПродажи, "Проект") Тогда
							НоваяСтрока.Проект = ВыборкаДетальныеЗаписи.ДокументПродажи.Проект;
						КонецЕсли;
					КонецЕсли;
					
					// Движения по регистру Управленческий.
					НоваяСтрока = НаборЗаписейУправленческий.Добавить();
					НоваяСтрока.Период = Дата;
					НоваяСтрока.Регистратор = Ссылка;
					НоваяСтрока.Организация = ВыборкаДетальныеЗаписи.Организация;
					НоваяСтрока.СценарийПланирования = Справочники.СценарииПланирования.Фактический;
					
					Если СуммаКорректировки < 0 Тогда
						НоваяСтрока.СчетДт = ПланыСчетов.Управленческий.ПрочиеРасходы;
						НоваяСтрока.СчетКт = ВыборкаДетальныеЗаписи.СчетУчета;
						НоваяСтрока.Сумма = - СуммаКорректировки;
						НоваяСтрока.Содержание = СодержанияПроводок.ПрочиеРасходы();
					Иначе
						НоваяСтрока.СчетДт = ВыборкаДетальныеЗаписи.СчетУчета;
						НоваяСтрока.СчетКт = ПланыСчетов.Управленческий.ПрочиеДоходы;
						НоваяСтрока.Сумма = СуммаКорректировки;
						НоваяСтрока.Содержание = СодержанияПроводок.ПрочиеРасходы();
					КонецЕсли;
					
				ИначеЕсли ВыборкаДетальныеЗаписи.ПеремещениеВРозницуСуммовойУчет Тогда
					
					// Движения по регистру СуммовойУчетВРознице.
					НоваяСтрока = НаборЗаписейСуммовойУчетВРознице.Добавить();
					НоваяСтрока.Период = Дата;
					НоваяСтрока.ВидДвижения = ВидДвиженияНакопления.Приход;
					НоваяСтрока.Регистратор = Ссылка;
					НоваяСтрока.Организация = ВыборкаДетальныеЗаписи.Организация;
					НоваяСтрока.СтруктурнаяЕдиница = ВыборкаДетальныеЗаписи.РозничнаяСтруктурнаяЕдиница;
					НоваяСтрока.Валюта = ВыборкаДетальныеЗаписи.РозничнаяСтруктурнаяЕдиница.РозничныйВидЦен.ВалютаЦены;
					НоваяСтрока.СодержаниеПроводки = СодержанияПроводок.ПеремещениеВРозницу();
					НоваяСтрока.Себестоимость = СуммаКорректировки;
					
					// Движения по регистру Управленческий.
					ЗначенияРеквизитовТочка = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
						ВыборкаДетальныеЗаписи.РозничнаяСтруктурнаяЕдиница, "СчетУчетаВРознице, СчетУчетаНаценки", Истина);
					
					НоваяСтрока = НаборЗаписейУправленческий.Добавить();
					НоваяСтрока.Период = Дата;
					НоваяСтрока.Регистратор = Ссылка;
					НоваяСтрока.Организация = ВыборкаДетальныеЗаписи.Организация;
					НоваяСтрока.СценарийПланирования = Справочники.СценарииПланирования.Фактический;
					НоваяСтрока.СчетДт = ЗначенияРеквизитовТочка.СчетУчетаВРознице;
					НоваяСтрока.СчетКт = ВыборкаДетальныеЗаписи.СчетУчета;
					НоваяСтрока.Содержание = СодержанияПроводок.ПеремещениеВРозницу();
					НоваяСтрока.Сумма = СуммаКорректировки; 
					
					НоваяСтрока = НаборЗаписейУправленческий.Добавить();
					НоваяСтрока.Период = Дата;
					НоваяСтрока.Регистратор = Ссылка;
					НоваяСтрока.Организация = ВыборкаДетальныеЗаписи.Организация;
					НоваяСтрока.СценарийПланирования = Справочники.СценарииПланирования.Фактический;
					НоваяСтрока.СчетДт = ЗначенияРеквизитовТочка.СчетУчетаВРознице;
					НоваяСтрока.СчетКт = ЗначенияРеквизитовТочка.СчетУчетаНаценки;
					НоваяСтрока.Содержание = СодержанияПроводок.ТорговаяНаценка();
					НоваяСтрока.Сумма = - СуммаКорректировки; 
					
				ИначеЕсли ВыборкаДетальныеЗаписи.СчетУчетаСписанияТипСчета = Перечисления.ТипыСчетов.ПрочиеРасходы
					  ИЛИ ВыборкаДетальныеЗаписи.СчетУчетаСписанияТипСчета = Перечисления.ТипыСчетов.Расходы Тогда
					
					// Движения по регистру Доходы и расходы.
					НоваяСтрока = НаборЗаписейДоходыИРасходы.Добавить();
					НоваяСтрока.Период = ДополнительныеСвойства.ДляПроведения.Дата;
					НоваяСтрока.Регистратор = Ссылка;
					НоваяСтрока.Организация = ВыборкаДетальныеЗаписи.Организация;
					НоваяСтрока.СтруктурнаяЕдиница = ВыборкаДетальныеЗаписи.СтруктурнаяЕдиницаПолучатель;
					
					Если ТипЗнч(ВыборкаДетальныеЗаписи.ДокументПродажи) = Тип("ДокументСсылка.ПеремещениеЗапасов")
					   И ВыборкаДетальныеЗаписи.СчетУчетаСписанияТипСчета = Перечисления.ТипыСчетов.Расходы Тогда
						НоваяСтрока.НаправлениеДеятельности = ВыборкаДетальныеЗаписи.НаправлениеДеятельностиСписания;
						НоваяСтрока.ЗаказПокупателя = ВыборкаДетальныеЗаписи.ЗаказПокупателя;
					Иначе
						НоваяСтрока.НаправлениеДеятельности = Справочники.НаправленияДеятельности.Прочее;
					КонецЕсли;
					
					НоваяСтрока.СчетУчета = ВыборкаДетальныеЗаписи.СчетУчетаСписания;
					НоваяСтрока.Аналитика = ВыборкаДетальныеЗаписи.Номенклатура;
					НоваяСтрока.СуммаРасходов = СуммаКорректировки;
					НоваяСтрока.СодержаниеПроводки = СодержанияПроводок.ПрочиеРасходы();
					
					Если УчетПоПроектам Тогда
						Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ВыборкаДетальныеЗаписи.ДокументПродажи, "Проект") Тогда
							НоваяСтрока.Проект = ВыборкаДетальныеЗаписи.ДокументПродажи.Проект;
						КонецЕсли;
					КонецЕсли;
					
					// Движения по регистру Управленческий.
					НоваяСтрока = НаборЗаписейУправленческий.Добавить();
					НоваяСтрока.Период = Дата;
					НоваяСтрока.Регистратор = Ссылка;
					НоваяСтрока.Организация = ВыборкаДетальныеЗаписи.Организация;
					НоваяСтрока.СценарийПланирования = Справочники.СценарииПланирования.Фактический;
					НоваяСтрока.СчетДт = ВыборкаДетальныеЗаписи.СчетУчетаСписания;
					НоваяСтрока.СчетКт = ВыборкаДетальныеЗаписи.СчетУчета;
					НоваяСтрока.Содержание = СодержанияПроводок.ПрочиеРасходы();
					НоваяСтрока.Сумма = СуммаКорректировки;
					
				Иначе
					
					Если НЕ ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.СчетУчетаСписания) 
						ИЛИ НЕ ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.СчетУчета) Тогда
						
						// Некорректная проводка
						ПараметрыНоменклатуры = Новый Структура;
						ПараметрыНоменклатуры.Вставить("ПредставлениеНоменклатуры", ВыборкаДетальныеЗаписи.Номенклатура);
						ПараметрыНоменклатуры.Вставить("ПредставлениеХарактеристики", ВыборкаДетальныеЗаписи.Характеристика);
						ПараметрыНоменклатуры.Вставить("ПредставлениеПартии", ВыборкаДетальныеЗаписи.Партия);
						ПредставлениеНоменклатуры = ПечатьДокументовУНФ.ПредставлениеНоменклатуры(ПараметрыНоменклатуры);
						Если НЕ ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.СчетУчетаСписания) Тогда
							ПредставлениеСчета = НСтр("ru = 'счет затрат (списания)'");
						Иначе
							ПредставлениеСчета = НСтр("ru = 'счет учета запасов'");
						КонецЕсли; 
						ШаблонОшибки = НСтр("ru = 'В движениях номенклатуры %1 не заполнен %2, движение не выполнено. Требуется проверка корректности заполнения счетов в карточке номенклатуры и корреспондирующих счетов при непосредственном списании и/или оприходовании запаса'");
						ОписаниеОшибки = СтрШаблон(ШаблонОшибки, ПредставлениеНоменклатуры, ПредставлениеСчета);
						Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ДокументПродажи) Тогда
							ШаблонОшибки = НСтр("ru = '%1. Документ: %2'");
							ОписаниеОшибки = СтрШаблон(ШаблонОшибки, ОписаниеОшибки, ВыборкаДетальныеЗаписи.ДокументПродажи);
						КонецЕсли; 
						ДобавитьОшибкуВТаблицу(ОписаниеОшибки, "РаспределениеЗатрат");
						
					Иначе
						
						// Движения по регистру Управленческий.
						НоваяСтрока = НаборЗаписейУправленческий.Добавить();
						НоваяСтрока.Период = Дата;
						НоваяСтрока.Регистратор = Ссылка;
						НоваяСтрока.Организация = ВыборкаДетальныеЗаписи.Организация;
						НоваяСтрока.СценарийПланирования = Справочники.СценарииПланирования.Фактический;
						НоваяСтрока.СчетДт = ВыборкаДетальныеЗаписи.СчетУчетаСписания;
						НоваяСтрока.СчетКт = ВыборкаДетальныеЗаписи.СчетУчета;
						НоваяСтрока.Содержание = СодержанияПроводок.СписаниеЗапасовНаПроизвольныйСчет();
						НоваяСтрока.Сумма = СуммаКорректировки;
						
					КонецЕсли; 
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	// Пишем оставшиеся записи Учет запасов и затрат.
	НаборЗаписейЗапасы.Записать(Ложь);
	
	// Пишем оставшиеся записи Продажи.
	НаборЗаписейПродажи.Записать(Ложь);
	
	// Пишем оставшиеся записи Учет доходов и расходов.
	НаборЗаписейДоходыИРасходы.Записать(Ложь);
	
	// Пишем оставшиеся записи Суммовой учет в рознице.
	НаборЗаписейСуммовойУчетВРознице.Записать(Ложь);
	
	// Пишем оставшиеся записи Управленческий.
	НаборЗаписейУправленческий.Записать(Ложь);
	
КонецПроцедуры // СформироватьКорректирующиеДвиженияПоРегиструУчетаЗатрат()

Процедура РаспределитьСуммыБезКоличества(ВидОперации)
	
	СписокОбработанныхУзлов = Новый Массив();
	СписокОбработанныхУзлов.Добавить("");
	
	ДатаНач = ДополнительныеСвойства.ДляПроведения.НачальнаяДатаПериода;
	ДатаКон = ДополнительныеСвойства.ДляПроведения.КонечнаяДатаПериода;
	
	Запрос = Новый Запрос();
	Запрос.МенеджерВременныхТаблиц = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Организация", ДополнительныеСвойства.ДляПроведения.Организация);
	
	// Готовится таблица перемещений.
	Запрос.Текст =
	"ВЫБРАТЬ
	|	УчетЗатрат.Организация КАК Организация,
	|	УчетЗатрат.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	УчетЗатрат.СчетУчета КАК СчетУчета,
	|	УчетЗатрат.СчетУчета.ТипСчета КАК СчетУчетаТипСчета,
	|	УчетЗатрат.Номенклатура КАК Номенклатура,
	|	УчетЗатрат.Характеристика КАК Характеристика,
	|	УчетЗатрат.Партия КАК Партия,
	|	УчетЗатрат.ЗаказПокупателя КАК ЗаказПокупателя,
	|	УчетЗатрат.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
	|	УчетЗатрат.Спецификация КАК Спецификация,
	|	УчетЗатрат.КоррСтруктурнаяЕдиница КАК КоррСтруктурнаяЕдиница,
	|	УчетЗатрат.КоррСчетУчета КАК КоррСчетУчета,
	|	УчетЗатрат.КоррСчетУчета.ТипСчета КАК КоррСчетУчетаТипСчета,
	|	УчетЗатрат.КоррНоменклатура КАК КоррНоменклатура,
	|	УчетЗатрат.КоррХарактеристика КАК КоррХарактеристика,
	|	УчетЗатрат.КоррПартия КАК КоррПартия,
	|	УчетЗатрат.КоррЗаказПокупателя КАК КоррЗаказПокупателя,
	|	УчетЗатрат.КоррЗаказНаПроизводство КАК КоррЗаказНаПроизводство,
	|	УчетЗатрат.КоррСпецификация КАК КоррСпецификация,
	|	УчетЗатрат.ДокументПродажи КАК ДокументПродажи,
	|	УчетЗатрат.ЗаказПродажи КАК ЗаказПродажи,
	|	УчетЗатрат.ЗаказПродажи.УчетПотребностиПоСкладам КАК УчетПотребностиПоСкладам,
	|	УчетЗатрат.Подразделение КАК Подразделение,
	|	УчетЗатрат.Ответственный КАК Ответственный,
	|	УчетЗатрат.СтавкаНДС КАК СтавкаНДС,
	|	УчетЗатрат.ЗатратыНаВыпуск КАК ЗатратыНаВыпуск,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.СписаниеЗапасов)
	|				ИЛИ ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ОтчетКомиссионераОСписании)
	|				ИЛИ ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ПересортицаЗапасов)
	|			ТОГДА УчетЗатрат.ДокументПродажи.Корреспонденция
	|		КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ПеремещениеЗапасов)
	|				И УчетЗатрат.ДокументПродажи.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.СписаниеНаРасходы)
	|			ТОГДА УчетЗатрат.ДокументПродажи.СчетЗатрат
	|		КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ПеремещениеЗапасов)
	|			ТОГДА УчетЗатрат.Номенклатура.СчетУчетаЗатрат
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК СчетУчетаСписания,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.СписаниеЗапасов)
	|				ИЛИ ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ОтчетКомиссионераОСписании)
	|				ИЛИ ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ПересортицаЗапасов)
	|			ТОГДА УчетЗатрат.ДокументПродажи.Корреспонденция.ТипСчета
	|		КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ПеремещениеЗапасов)
	|				И УчетЗатрат.ДокументПродажи.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.СписаниеНаРасходы)
	|			ТОГДА УчетЗатрат.ДокументПродажи.СчетЗатрат.ТипСчета
	|		КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ПеремещениеЗапасов)
	|			ТОГДА УчетЗатрат.Номенклатура.СчетУчетаЗатрат.ТипСчета
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК СчетУчетаСписанияТипСчета,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ПеремещениеЗапасов)
	|			ТОГДА УчетЗатрат.ДокументПродажи.НаправлениеДеятельности
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК НаправлениеДеятельностиСписания,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ПеремещениеЗапасов)
	|			ТОГДА УчетЗатрат.ДокументПродажи.СтруктурнаяЕдиницаПолучатель
	|		ИНАЧЕ УчетЗатрат.ДокументПродажи.СтруктурнаяЕдиница
	|	КОНЕЦ КАК СтруктурнаяЕдиницаПолучатель,
	|	ВЫБОР
	|		КОГДА УчетЗатрат.ПеремещениеВРозницуСуммовойУчет
	|			ТОГДА ВЫБОР
	|					КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ПриходнаяНакладная)
	|						ТОГДА УчетЗатрат.ДокументПродажи.СтруктурнаяЕдиница
	|					КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ПеремещениеЗапасов)
	|						ТОГДА УчетЗатрат.ДокументПродажи.СтруктурнаяЕдиницаПолучатель
	|					ИНАЧЕ НЕОПРЕДЕЛЕНО
	|				КОНЕЦ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК РозничнаяСтруктурнаяЕдиница,
	|	УчетЗатрат.ПеремещениеВРозницуСуммовойУчет КАК ПеремещениеВРозницуСуммовойУчет,
	|	УчетЗатрат.Номенклатура.КатегорияНоменклатуры КАК НоменклатураКатегорияНоменклатуры,
	|	УчетЗатрат.Номенклатура.НаправлениеДеятельности КАК НаправлениеДеятельностиПродажи,
	|	УчетЗатрат.Номенклатура.НаправлениеДеятельности.СчетУчетаСебестоимостиПродаж КАК НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродаж,
	|	УчетЗатрат.Номенклатура.НаправлениеДеятельности.СчетУчетаСебестоимостиПродаж.ТипСчета КАК НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродажТипСчета,
	|	СУММА(ВЫБОР
	|			КОГДА УчетЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|						И НЕ УчетЗатрат.Возврат
	|					ИЛИ УчетЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|						И УчетЗатрат.Возврат
	|				ТОГДА УчетЗатрат.СуммаБезНДС
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаБезНДС,
	|	СУММА(ВЫБОР
	|			КОГДА УчетЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|						И НЕ УчетЗатрат.Возврат
	|					ИЛИ УчетЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|						И УчетЗатрат.Возврат
	|				ТОГДА УчетЗатрат.Сумма
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Сумма
	|ПОМЕСТИТЬ УчетЗатратДвиженияРасход
	|ИЗ
	|	РегистрНакопления.Запасы КАК УчетЗатрат
	|ГДЕ
	|	УчетЗатрат.Период МЕЖДУ &ДатаНач И &ДатаКон
	|	И УчетЗатрат.Организация = &Организация
	|	И НЕ УчетЗатрат.ФиксированнаяСтоимость
	|
	|СГРУППИРОВАТЬ ПО
	|	УчетЗатрат.Организация,
	|	УчетЗатрат.СтруктурнаяЕдиница,
	|	УчетЗатрат.СчетУчета,
	|	УчетЗатрат.Номенклатура,
	|	УчетЗатрат.Характеристика,
	|	УчетЗатрат.Партия,
	|	УчетЗатрат.ЗаказПокупателя,
	|	УчетЗатрат.ЗаказНаПроизводство,
	|	УчетЗатрат.Спецификация,
	|	УчетЗатрат.КоррСтруктурнаяЕдиница,
	|	УчетЗатрат.КоррСчетУчета,
	|	УчетЗатрат.КоррНоменклатура,
	|	УчетЗатрат.КоррХарактеристика,
	|	УчетЗатрат.КоррПартия,
	|	УчетЗатрат.КоррЗаказПокупателя,
	|	УчетЗатрат.КоррЗаказНаПроизводство,
	|	УчетЗатрат.КоррСпецификация,
	|	УчетЗатрат.ДокументПродажи,
	|	УчетЗатрат.ЗаказПродажи,
	|	УчетЗатрат.Подразделение,
	|	УчетЗатрат.Ответственный,
	|	УчетЗатрат.СтавкаНДС,
	|	УчетЗатрат.ЗатратыНаВыпуск,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ПеремещениеЗапасов)
	|			ТОГДА УчетЗатрат.ДокументПродажи.НаправлениеДеятельности
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ПеремещениеЗапасов)
	|			ТОГДА УчетЗатрат.ДокументПродажи.СтруктурнаяЕдиницаПолучатель
	|		ИНАЧЕ УчетЗатрат.ДокументПродажи.СтруктурнаяЕдиница
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА УчетЗатрат.ПеремещениеВРозницуСуммовойУчет
	|			ТОГДА ВЫБОР
	|					КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ПриходнаяНакладная)
	|						ТОГДА УчетЗатрат.ДокументПродажи.СтруктурнаяЕдиница
	|					КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ПеремещениеЗапасов)
	|						ТОГДА УчетЗатрат.ДокументПродажи.СтруктурнаяЕдиницаПолучатель
	|					ИНАЧЕ НЕОПРЕДЕЛЕНО
	|				КОНЕЦ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	УчетЗатрат.ПеремещениеВРозницуСуммовойУчет,
	|	УчетЗатрат.Номенклатура.КатегорияНоменклатуры,
	|	УчетЗатрат.Номенклатура.НаправлениеДеятельности,
	|	УчетЗатрат.Номенклатура.НаправлениеДеятельности.СчетУчетаСебестоимостиПродаж,
	|	УчетЗатрат.Номенклатура.НаправлениеДеятельности.СчетУчетаСебестоимостиПродаж.ТипСчета,
	|	УчетЗатрат.СчетУчета.ТипСчета,
	|	УчетЗатрат.КоррСчетУчета.ТипСчета,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.СписаниеЗапасов)
	|				ИЛИ ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ОтчетКомиссионераОСписании)
	|				ИЛИ ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ПересортицаЗапасов)
	|			ТОГДА УчетЗатрат.ДокументПродажи.Корреспонденция
	|		КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ПеремещениеЗапасов)
	|				И УчетЗатрат.ДокументПродажи.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.СписаниеНаРасходы)
	|			ТОГДА УчетЗатрат.ДокументПродажи.СчетЗатрат
	|		КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ПеремещениеЗапасов)
	|			ТОГДА УчетЗатрат.Номенклатура.СчетУчетаЗатрат
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.СписаниеЗапасов)
	|				ИЛИ ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ОтчетКомиссионераОСписании)
	|				ИЛИ ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ПересортицаЗапасов)
	|			ТОГДА УчетЗатрат.ДокументПродажи.Корреспонденция.ТипСчета
	|		КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ПеремещениеЗапасов)
	|				И УчетЗатрат.ДокументПродажи.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещениеЗапасов.СписаниеНаРасходы)
	|			ТОГДА УчетЗатрат.ДокументПродажи.СчетЗатрат.ТипСчета
	|		КОГДА ТИПЗНАЧЕНИЯ(УчетЗатрат.ДокументПродажи) = ТИП(Документ.ПеремещениеЗапасов)
	|			ТОГДА УчетЗатрат.Номенклатура.СчетУчетаЗатрат.ТипСчета
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СтруктурнаяЕдиница,
	|	СчетУчета,
	|	Номенклатура,
	|	Характеристика,
	|	Партия,
	|	ЗаказПокупателя,
	|	ЗаказНаПроизводство,
	|	КоррСтруктурнаяЕдиница,
	|	КоррСчетУчета,
	|	КоррНоменклатура,
	|	КоррХарактеристика,
	|	КоррПартия,
	|	КоррЗаказПокупателя,
	|	КоррЗаказНаПроизводство";
	
	Запрос.УстановитьПараметр("ДатаНач", ДатаНач);
	Запрос.УстановитьПараметр("ДатаКон", ДатаКон);
	
	Запрос.Выполнить();
	
	// Определяются направления списания всех сумм меньше рубля, для узлов по которым
	// есть остатки по суммам и без количества.
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	""РаспределитьСуммыБезКоличества"" КАК Поле1,
	|	УчетЗатратОстатки.Организация КАК Организация,
	|	УчетЗатратОстатки.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	УчетЗатратОстатки.СчетУчета КАК СчетУчета,
	|	УчетЗатратОстатки.СчетУчета.ТипСчета КАК СчетУчетаТипСчета,
	|	УчетЗатратОстатки.Номенклатура КАК Номенклатура,
	|	УчетЗатратОстатки.Характеристика КАК Характеристика,
	|	УчетЗатратОстатки.Партия КАК Партия,
	|	УчетЗатратОстатки.ЗаказПокупателя КАК ЗаказПокупателя,
	|	УчетЗатратОстатки.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
	|	ВЫБОР
	|		КОГДА УчетЗатратОстатки.КоличествоОстаток = 0
	|				И ВложенныйЗапрос.СуммаБезНДС <> 0
	|				И (УчетЗатратОстатки.СуммаБезНДСОстаток МЕЖДУ -1 И 1
	|					ИЛИ УчетЗатратОстатки.Номенклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка))
	|			ТОГДА УчетЗатратОстатки.СуммаБезНДСОстаток
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаБезНДС,
	|	ВЫБОР
	|		КОГДА УчетЗатратОстатки.КоличествоОстаток = 0
	|				И ВложенныйЗапрос.Сумма <> 0
	|				И (УчетЗатратОстатки.СуммаОстаток МЕЖДУ -1 И 1
	|					ИЛИ УчетЗатратОстатки.Номенклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка))
	|			ТОГДА УчетЗатратОстатки.СуммаОстаток
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Сумма,
	|	ВложенныйЗапрос.КоррСтруктурнаяЕдиница КАК КоррСтруктурнаяЕдиница,
	|	ВложенныйЗапрос.Спецификация КАК Спецификация,
	|	ВложенныйЗапрос.КоррСпецификация КАК КоррСпецификация,
	|	ВложенныйЗапрос.КоррСчетУчета КАК КоррСчетУчета,
	|	ВложенныйЗапрос.КоррСчетУчетаТипСчета КАК КоррСчетУчетаТипСчета,
	|	ВложенныйЗапрос.КоррНоменклатура КАК КоррНоменклатура,
	|	ВложенныйЗапрос.КоррХарактеристика КАК КоррХарактеристика,
	|	ВложенныйЗапрос.КоррПартия КАК КоррПартия,
	|	ВложенныйЗапрос.КоррЗаказПокупателя КАК КоррЗаказПокупателя,
	|	ВложенныйЗапрос.КоррЗаказНаПроизводство КАК КоррЗаказНаПроизводство,
	|	ВложенныйЗапрос.ДокументПродажи КАК ДокументПродажи,
	|	ВложенныйЗапрос.ЗаказПродажи КАК ЗаказПродажи,
	|	ВложенныйЗапрос.УчетПотребностиПоСкладам КАК УчетПотребностиПоСкладам,
	|	ВложенныйЗапрос.Подразделение КАК Подразделение,
	|	ВложенныйЗапрос.Ответственный КАК Ответственный,
	|	ВложенныйЗапрос.СтавкаНДС КАК СтавкаНДС,
	|	ВложенныйЗапрос.ЗатратыНаВыпуск КАК ЗатратыНаВыпуск,
	|	ВложенныйЗапрос.НоменклатураКатегорияНоменклатуры КАК НоменклатураКатегорияНоменклатуры,
	|	ВложенныйЗапрос.НаправлениеДеятельностиПродажи КАК НаправлениеДеятельностиПродажи,
	|	ВложенныйЗапрос.НаправлениеДеятельностиСписания КАК НаправлениеДеятельностиСписания,
	|	ВложенныйЗапрос.НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродаж КАК НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродаж,
	|	ВложенныйЗапрос.НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродажТипСчета КАК НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродажТипСчета,
	|	УзлыКорректировкиСтоимостиСписания.НомерУзла КАК НомерУзла,
	|	УзлыКорректировкиСтоимостиСписанияИсточник.НомерУзла КАК НомерУзлаИсточник,
	|	ВложенныйЗапрос.СчетУчетаСписания КАК СчетУчетаСписания,
	|	ВложенныйЗапрос.СчетУчетаСписанияТипСчета КАК СчетУчетаСписанияТипСчета,
	|	ВложенныйЗапрос.СтруктурнаяЕдиницаПолучатель КАК СтруктурнаяЕдиницаПолучатель,
	|	ВложенныйЗапрос.ПеремещениеВРозницуСуммовойУчет КАК ПеремещениеВРозницуСуммовойУчет,
	|	ВложенныйЗапрос.РозничнаяСтруктурнаяЕдиница КАК РозничнаяСтруктурнаяЕдиница,
	|	ЕСТЬNULL(УчетЗатратОстаткиКор.КоличествоОстаток, 0) КАК КоличествоОстаток
	|ИЗ
	|	РегистрНакопления.Запасы.Остатки(&ГраницаДатаКон, Организация = &Организация) КАК УчетЗатратОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ УчетЗатратДвиженияРасход КАК ВложенныйЗапрос
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Запасы.Остатки(&ГраницаДатаКон, ) КАК УчетЗатратОстаткиКор
	|			ПО ВложенныйЗапрос.Организация = УчетЗатратОстаткиКор.Организация
	|				И ВложенныйЗапрос.КоррСтруктурнаяЕдиница = УчетЗатратОстаткиКор.СтруктурнаяЕдиница
	|				И ВложенныйЗапрос.КоррСчетУчета = УчетЗатратОстаткиКор.СчетУчета
	|				И ВложенныйЗапрос.КоррНоменклатура = УчетЗатратОстаткиКор.Номенклатура
	|				И ВложенныйЗапрос.КоррХарактеристика = УчетЗатратОстаткиКор.Характеристика
	|				И ВложенныйЗапрос.КоррПартия = УчетЗатратОстаткиКор.Партия
	|				И ВложенныйЗапрос.КоррЗаказПокупателя = УчетЗатратОстаткиКор.ЗаказПокупателя
	|				И ВложенныйЗапрос.КоррЗаказНаПроизводство = УчетЗатратОстаткиКор.ЗаказНаПроизводство
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УзлыКорректировкиСтоимостиСписания КАК УзлыКорректировкиСтоимостиСписания
	|			ПО ВложенныйЗапрос.Организация = УзлыКорректировкиСтоимостиСписания.Организация
	|				И ВложенныйЗапрос.КоррСтруктурнаяЕдиница = УзлыКорректировкиСтоимостиСписания.СтруктурнаяЕдиница
	|				И ВложенныйЗапрос.КоррСчетУчета = УзлыКорректировкиСтоимостиСписания.СчетУчета
	|				И ВложенныйЗапрос.КоррНоменклатура = УзлыКорректировкиСтоимостиСписания.Номенклатура
	|				И ВложенныйЗапрос.КоррХарактеристика = УзлыКорректировкиСтоимостиСписания.Характеристика
	|				И ВложенныйЗапрос.КоррПартия = УзлыКорректировкиСтоимостиСписания.Партия
	|				И ВложенныйЗапрос.КоррЗаказПокупателя = УзлыКорректировкиСтоимостиСписания.ЗаказПокупателя
	|				И ВложенныйЗапрос.КоррЗаказНаПроизводство = УзлыКорректировкиСтоимостиСписания.ЗаказНаПроизводство
	|				И (УзлыКорректировкиСтоимостиСписания.Регистратор = &Регистратор)
	|		ПО УчетЗатратОстатки.Организация = ВложенныйЗапрос.Организация
	|			И УчетЗатратОстатки.СтруктурнаяЕдиница = ВложенныйЗапрос.СтруктурнаяЕдиница
	|			И УчетЗатратОстатки.СчетУчета = ВложенныйЗапрос.СчетУчета
	|			И УчетЗатратОстатки.Номенклатура = ВложенныйЗапрос.Номенклатура
	|			И УчетЗатратОстатки.Характеристика = ВложенныйЗапрос.Характеристика
	|			И УчетЗатратОстатки.Партия = ВложенныйЗапрос.Партия
	|			И УчетЗатратОстатки.ЗаказПокупателя = ВложенныйЗапрос.ЗаказПокупателя
	|			И УчетЗатратОстатки.ЗаказНаПроизводство = ВложенныйЗапрос.ЗаказНаПроизводство
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УзлыКорректировкиСтоимостиСписания КАК УзлыКорректировкиСтоимостиСписанияИсточник
	|		ПО (УзлыКорректировкиСтоимостиСписанияИсточник.Регистратор = &Регистратор)
	|			И УчетЗатратОстатки.Организация = УзлыКорректировкиСтоимостиСписанияИсточник.Организация
	|			И УчетЗатратОстатки.СтруктурнаяЕдиница = УзлыКорректировкиСтоимостиСписанияИсточник.СтруктурнаяЕдиница
	|			И УчетЗатратОстатки.СчетУчета = УзлыКорректировкиСтоимостиСписанияИсточник.СчетУчета
	|			И УчетЗатратОстатки.Номенклатура = УзлыКорректировкиСтоимостиСписанияИсточник.Номенклатура
	|			И УчетЗатратОстатки.Характеристика = УзлыКорректировкиСтоимостиСписанияИсточник.Характеристика
	|			И УчетЗатратОстатки.Партия = УзлыКорректировкиСтоимостиСписанияИсточник.Партия
	|			И УчетЗатратОстатки.ЗаказПокупателя = УзлыКорректировкиСтоимостиСписанияИсточник.ЗаказПокупателя
	|			И УчетЗатратОстатки.ЗаказНаПроизводство = УзлыКорректировкиСтоимостиСписанияИсточник.ЗаказНаПроизводство
	|ГДЕ
	|	УчетЗатратОстатки.СуммаОстаток <> 0
	|	И УчетЗатратОстатки.КоличествоОстаток = 0
	|	И ВложенныйЗапрос.Сумма <> 0
	|	И (УчетЗатратОстатки.СуммаОстаток МЕЖДУ -1 И 1
	|			ИЛИ УчетЗатратОстатки.Номенклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка))
	|	И УчетЗатратОстатки.СуммаОстаток <> 0
	|	И НЕ ВложенныйЗапрос.СчетУчета ЕСТЬ NULL
	|	И НЕ ЕСТЬNULL(УзлыКорректировкиСтоимостиСписанияИсточник.НомерУзла, 0) = ЕСТЬNULL(УзлыКорректировкиСтоимостиСписания.НомерУзла, 0)
	|
	|УПОРЯДОЧИТЬ ПО
	|	КоличествоОстаток УБЫВ,
	|	ВЫБОР
	|		КОГДА УзлыКорректировкиСтоимостиСписания.НомерУзла В (&СписокОбработанныхУзлов)
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ УБЫВ";
	
	Запрос.УстановитьПараметр("ГраницаДатаКон", Новый Граница(ДатаКон, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	Запрос.УстановитьПараметр("СписокОбработанныхУзлов", СписокОбработанныхУзлов);
	
	// Создадим набор записей регистра накопления Учет запасов и затрат.
	НаборЗаписейЗапасы = РегистрыНакопления.Запасы.СоздатьНаборЗаписей();
	НаборЗаписейЗапасы.Отбор.Регистратор.Установить(Ссылка);
	
	// Создадим набор записей регистра накопления Продажи.
	НаборЗаписейПродажи = РегистрыНакопления.Продажи.СоздатьНаборЗаписей();
	НаборЗаписейПродажи.Отбор.Регистратор.Установить(Ссылка);
	
	// Создадим набор записей регистра накопления УчетДоходовИРасходов.
	НаборЗаписейДоходыИРасходы = РегистрыНакопления.ДоходыИРасходы.СоздатьНаборЗаписей();
	НаборЗаписейДоходыИРасходы.Отбор.Регистратор.Установить(Ссылка);
	
	// Создадим набор записей регистра накопления СуммовойУчетВРознице.
	НаборЗаписейСуммовойУчетВРознице = РегистрыНакопления.СуммовойУчетВРознице.СоздатьНаборЗаписей();
	НаборЗаписейСуммовойУчетВРознице.Отбор.Регистратор.Установить(Ссылка);
	
	// Создадим набор записей регистра бухгалтерии НаборЗаписейУправленческий.
	НаборЗаписейУправленческий = РегистрыБухгалтерии.Управленческий.СоздатьНаборЗаписей();
	НаборЗаписейУправленческий.Отбор.Регистратор.Установить(Ссылка);
	
	КоличествоИтераций = 0;
	
	Результат = Запрос.Выполнить();
	
	Пока НЕ Результат.Пустой() Цикл
		
		КоличествоИтераций = КоличествоИтераций + 1;
		Если КоличествоИтераций > 60 Тогда
			ТаблицаНоменклатуры = Результат.Выгрузить();
			ТаблицаНоменклатуры.Свернуть("Номенклатура, Характеристика, Партия");
			Подробности = "";
			ДлинаСтроки = 0;
			ДополнительноеКоличество = 0;
			ПараметрыНоменклатуры = Новый Структура;
			ЭлементыПредставления = Новый Массив;
			Для каждого СтрокаНоменклатура Из ТаблицаНоменклатуры Цикл
				ПараметрыНоменклатуры.Очистить();
				ПараметрыНоменклатуры.Вставить("ПредставлениеНоменклатуры", СтрокаНоменклатура.Номенклатура);
				ПараметрыНоменклатуры.Вставить("ПредставлениеХарактеристики", СтрокаНоменклатура.Характеристика);
				ПараметрыНоменклатуры.Вставить("ПредставлениеПартии", СтрокаНоменклатура.Партия);
				ПредставлениеНоменклатуры = ПечатьДокументовУНФ.ПредставлениеНоменклатуры(ПараметрыНоменклатуры);
				Если НЕ ПустаяСтрока(Подробности) Тогда
					ЭлементыПредставления.Добавить(Подробности);
				КонецЕсли;
				Если ДлинаСтроки > 0 И ДлинаСтроки + СтрДлина(ПредставлениеНоменклатуры) + 2 > 250 Тогда
					// Ограничение слишком большого перечня номенклатуры
					ДополнительноеКоличество = ДополнительноеКоличество + 1;
					Продолжить;	
				КонецЕсли;
				ДлинаСтроки = ДлинаСтроки + СтрДлина(ПредставлениеНоменклатуры) + ?(ДлинаСтроки = 0, 0, 2);
				ЭлементыПредставления.Добавить(ПредставлениеНоменклатуры);
			КонецЦикла; 
			Подробности = СтрСоединить(ЭлементыПредставления, "; ");        
			Если ДополнительноеКоличество > 0 Тогда
				Подробности = СтрШаблон(НСтр("ru = '%1 и еще %2'"), Подробности, ДополнительноеКоличество);
			КонецЕсли;
			ОписаниеОшибки = СтрШаблон(
				НСтр("ru = 'Не удалось скорректировать суммовые остатки по затрат по позициям номенклатуры: %1.'"),
				Подробности);
			ДобавитьОшибкуВТаблицу(ОписаниеОшибки, ВидОперации);
			Прервать;
		КонецЕсли;
		
		НаборЗаписейЗапасы.Очистить();
		НаборЗаписейПродажи.Очистить();
		НаборЗаписейДоходыИРасходы.Очистить();
		НаборЗаписейСуммовойУчетВРознице.Очистить();
		НаборЗаписейУправленческий.Очистить();
		
		ВыборкаДетальныеЗаписи = Результат.Выбрать();
		СписокОбработанныхУзловИсточников = Новый Массив();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			// Сделаем проверку, на случай, если есть не закрытые кассовые смены.
			Если ТипЗнч(ВыборкаДетальныеЗаписи.ДокументПродажи) = Тип("ДокументСсылка.ЧекККМ")
				ИЛИ ТипЗнч(ВыборкаДетальныеЗаписи.ДокументПродажи) = Тип("ДокументСсылка.ЧекККМВозврат") Тогда
				Продолжить;
			КонецЕсли;
			
			Если СписокОбработанныхУзловИсточников.Найти(ВыборкаДетальныеЗаписи.НомерУзлаИсточник) = Неопределено Тогда
				СписокОбработанныхУзловИсточников.Добавить(ВыборкаДетальныеЗаписи.НомерУзлаИсточник);
			Иначе
				Продолжить; // Этот источник уже скорректировали.
			КонецЕсли;
			
			Если СписокОбработанныхУзлов.Найти(ВыборкаДетальныеЗаписи.НомерУзла) = Неопределено Тогда
				СписокОбработанныхУзлов.Добавить(ВыборкаДетальныеЗаписи.НомерУзла);
			КонецЕсли;
			
			СуммаКорректировки = ВыборкаДетальныеЗаписи.Сумма;
			СуммаКорректировкиБезНДС = ВыборкаДетальныеЗаписи.СуммаБезНДС;
			
			СуммыКорректировкиСтруктура = Новый Структура();
			СуммыКорректировкиСтруктура.Вставить("СуммаКорректировки", СуммаКорректировки);
			СуммыКорректировкиСтруктура.Вставить("СуммаКорректировкиБезНДС", СуммаКорректировкиБезНДС);
			
			СформироватьДвиженияПоРегиструУчетаЗатрат(
				НаборЗаписейЗапасы,
				НаборЗаписейУправленческий,
				ВыборкаДетальныеЗаписи,
				СуммыКорректировкиСтруктура,
				Ложь,);
			
			Если ВыборкаДетальныеЗаписи.КоррСчетУчета = ДополнительныеСвойства.ДляПроведения.ПустойСчет Тогда
				
				Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ДокументПродажи)
				   И ((ТипЗнч(ВыборкаДетальныеЗаписи.ДокументПродажи) = Тип("ДокументСсылка.РасходнаяНакладная")
					 И ВыборкаДетальныеЗаписи.ДокументПродажи.ВидОперации <> Перечисления.ВидыОперацийРасходнаяНакладная.ВозвратПоставщику)
				  ИЛИ ТипЗнч(ВыборкаДетальныеЗаписи.ДокументПродажи) = Тип("ДокументСсылка.ОтчетОРозничныхПродажах")
				  ИЛИ ТипЗнч(ВыборкаДетальныеЗаписи.ДокументПродажи) = Тип("ДокументСсылка.АктВыполненныхРабот")
				  ИЛИ ТипЗнч(ВыборкаДетальныеЗаписи.ДокументПродажи) = Тип("ДокументСсылка.ОтчетКомиссионера")
				  ИЛИ ТипЗнч(ВыборкаДетальныеЗаписи.ДокументПродажи) = Тип("ДокументСсылка.ЗаказПокупателя")
				  ИЛИ ТипЗнч(ВыборкаДетальныеЗаписи.ДокументПродажи) = Тип("ДокументСсылка.ОтчетОПереработке")
				  ИЛИ ТипЗнч(ВыборкаДетальныеЗаписи.ДокументПродажи) = Тип("ДокументСсылка.ПередачаТоваровМеждуОрганизациями")) Тогда
					
					// Движения по регистру Продажи.
					НоваяСтрока = НаборЗаписейПродажи.Добавить();
					НоваяСтрока.Период = Дата;
					НоваяСтрока.Регистратор = Ссылка;
					НоваяСтрока.Организация = ВыборкаДетальныеЗаписи.Организация;
					НоваяСтрока.ЗаказПокупателя = ВыборкаДетальныеЗаписи.ЗаказПродажи;
					НоваяСтрока.Подразделение = ВыборкаДетальныеЗаписи.Подразделение;
					НоваяСтрока.Ответственный = ВыборкаДетальныеЗаписи.Ответственный;
					НоваяСтрока.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
					НоваяСтрока.Характеристика = ВыборкаДетальныеЗаписи.Характеристика;
					НоваяСтрока.Партия = ВыборкаДетальныеЗаписи.Партия;
					НоваяСтрока.Документ = ВыборкаДетальныеЗаписи.ДокументПродажи;
					НоваяСтрока.СтавкаНДС = ВыборкаДетальныеЗаписи.СтавкаНДС;
					НоваяСтрока.Себестоимость = СуммаКорректировки;
					НоваяСтрока.СебестоимостьБезНДС = СуммаКорректировкиБезНДС;
					Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ЗаказПродажи) 
						И ВыборкаДетальныеЗаписи.УчетПотребностиПоСкладам = Истина Тогда
						НоваяСтрока.Склад = ВыборкаДетальныеЗаписи.СтруктурнаяЕдиница;
					КонецЕсли;
					
					// Движения по регистру ДоходыИРасходы.
					НоваяСтрока = НаборЗаписейДоходыИРасходы.Добавить();
					НоваяСтрока.Период = Дата;
					НоваяСтрока.Регистратор = Ссылка;
					НоваяСтрока.Организация = ВыборкаДетальныеЗаписи.Организация;
					НоваяСтрока.СтруктурнаяЕдиница = ВыборкаДетальныеЗаписи.Подразделение;
					НоваяСтрока.ЗаказПокупателя = ВыборкаДетальныеЗаписи.ЗаказПродажи;
					НоваяСтрока.НаправлениеДеятельности = ВыборкаДетальныеЗаписи.НаправлениеДеятельностиПродажи;
					НоваяСтрока.СчетУчета = ВыборкаДетальныеЗаписи.НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродаж;
					НоваяСтрока.СуммаРасходов = СуммаКорректировки;
					НоваяСтрока.СодержаниеПроводки = НСтр("ru = 'Отражение расходов по продаже'");
					
					// Движения по регистру Управленческий.
					НоваяСтрока = НаборЗаписейУправленческий.Добавить();
					НоваяСтрока.Период = Дата;
					НоваяСтрока.Регистратор = Ссылка;
					НоваяСтрока.Организация = ВыборкаДетальныеЗаписи.Организация;
					НоваяСтрока.СценарийПланирования = Справочники.СценарииПланирования.Фактический;
					НоваяСтрока.СчетДт = ВыборкаДетальныеЗаписи.НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродаж;
					НоваяСтрока.СчетКт = ВыборкаДетальныеЗаписи.СчетУчета;
					НоваяСтрока.Содержание = НСтр("ru = 'Отражение расходов по продаже'");
					НоваяСтрока.Сумма = СуммаКорректировки;
					
				ИначеЕсли ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ДокументПродажи)
						И ТипЗнч(ВыборкаДетальныеЗаписи.ДокументПродажи) = Тип("ДокументСсылка.РасходнаяНакладная")
						И ВыборкаДетальныеЗаписи.ДокументПродажи.ВидОперации = Перечисления.ВидыОперацийРасходнаяНакладная.ВозвратПоставщику Тогда
						
					// Движения по регистру Доходы и расходы.
					НоваяСтрока = НаборЗаписейДоходыИРасходы.Добавить();
					НоваяСтрока.Период = ДополнительныеСвойства.ДляПроведения.Дата;
					НоваяСтрока.Регистратор = Ссылка;
					НоваяСтрока.Организация = ВыборкаДетальныеЗаписи.Организация;
					НоваяСтрока.СтруктурнаяЕдиница = Неопределено;
					НоваяСтрока.ЗаказПокупателя = Неопределено;
					НоваяСтрока.НаправлениеДеятельности = Справочники.НаправленияДеятельности.Прочее;
					
					Если СуммаКорректировки < 0 Тогда
						НоваяСтрока.СчетУчета = ПланыСчетов.Управленческий.ПрочиеРасходы;
						НоваяСтрока.СуммаРасходов = СуммаКорректировки;
						НоваяСтрока.СодержаниеПроводки = НСтр("ru = 'Прочие расходы по возврату поставщику'");
					Иначе
						НоваяСтрока.СчетУчета = ПланыСчетов.Управленческий.ПрочиеДоходы;
						НоваяСтрока.СуммаДоходов = СуммаКорректировки;
						НоваяСтрока.СодержаниеПроводки = НСтр("ru = 'Прочие доходы по возврату поставщику'");
					КонецЕсли;
					НоваяСтрока.Аналитика = ВыборкаДетальныеЗаписи.Номенклатура;
					
					// Движения по регистру Управленческий.
					НоваяСтрока = НаборЗаписейУправленческий.Добавить();
					НоваяСтрока.Период = Дата;
					НоваяСтрока.Регистратор = Ссылка;
					НоваяСтрока.Организация = ВыборкаДетальныеЗаписи.Организация;
					НоваяСтрока.СценарийПланирования = Справочники.СценарииПланирования.Фактический;
					
					Если СуммаКорректировки < 0 Тогда
						НоваяСтрока.СчетДт = ПланыСчетов.Управленческий.ПрочиеРасходы;
						НоваяСтрока.СчетКт = ВыборкаДетальныеЗаписи.СчетУчета;
						НоваяСтрока.Сумма = - СуммаКорректировки;
						НоваяСтрока.Содержание = НСтр("ru = 'Прочие расходы по возврату поставщику'");
					Иначе
						НоваяСтрока.СчетДт = ВыборкаДетальныеЗаписи.СчетУчета;
						НоваяСтрока.СчетКт = ПланыСчетов.Управленческий.ПрочиеДоходы;
						НоваяСтрока.Сумма = СуммаКорректировки;
						НоваяСтрока.Содержание = НСтр("ru = 'Прочие доходы по возврату поставщику'");
					КонецЕсли;
					
				ИначеЕсли ВыборкаДетальныеЗаписи.ПеремещениеВРозницуСуммовойУчет Тогда
					
					// Движения по регистру СуммовойУчетВРознице.
					НоваяСтрока = НаборЗаписейСуммовойУчетВРознице.Добавить();
					НоваяСтрока.Период = Дата;
					НоваяСтрока.ВидДвижения = ВидДвиженияНакопления.Приход;
					НоваяСтрока.Регистратор = Ссылка;
					НоваяСтрока.Организация = ВыборкаДетальныеЗаписи.Организация;
					НоваяСтрока.СтруктурнаяЕдиница = ВыборкаДетальныеЗаписи.РозничнаяСтруктурнаяЕдиница;
					НоваяСтрока.Валюта = ВыборкаДетальныеЗаписи.РозничнаяСтруктурнаяЕдиница.РозничныйВидЦен.ВалютаЦены;
					НоваяСтрока.СодержаниеПроводки = НСтр("ru = 'Перемещение в розницу'");
					НоваяСтрока.Себестоимость = СуммаКорректировки;
					
					// Движения по регистру Управленческий.
					ЗначенияРеквизитовТочка = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
						ВыборкаДетальныеЗаписи.РозничнаяСтруктурнаяЕдиница, "СчетУчетаВРознице, СчетУчетаНаценки", Истина);
					
					НоваяСтрока = НаборЗаписейУправленческий.Добавить();
					НоваяСтрока.Период = Дата;
					НоваяСтрока.Регистратор = Ссылка;
					НоваяСтрока.Организация = ВыборкаДетальныеЗаписи.Организация;
					НоваяСтрока.СценарийПланирования = Справочники.СценарииПланирования.Фактический;
					НоваяСтрока.СчетДт = ЗначенияРеквизитовТочка.СчетУчетаВРознице;
					НоваяСтрока.СчетКт = ВыборкаДетальныеЗаписи.СчетУчета;
					НоваяСтрока.Содержание = НСтр("ru = 'Перемещение в розницу'");
					НоваяСтрока.Сумма = СуммаКорректировки; 
					
					НоваяСтрока = НаборЗаписейУправленческий.Добавить();
					НоваяСтрока.Период = Дата;
					НоваяСтрока.Регистратор = Ссылка;
					НоваяСтрока.Организация = ВыборкаДетальныеЗаписи.Организация;
					НоваяСтрока.СценарийПланирования = Справочники.СценарииПланирования.Фактический;
					НоваяСтрока.СчетДт = ЗначенияРеквизитовТочка.СчетУчетаВРознице;
					НоваяСтрока.СчетКт = ЗначенияРеквизитовТочка.СчетУчетаНаценки;
					НоваяСтрока.Содержание = НСтр("ru = 'Торговая наценка'");
					НоваяСтрока.Сумма = - СуммаКорректировки; 

				ИначеЕсли ВыборкаДетальныеЗаписи.СчетУчетаСписанияТипСчета = Перечисления.ТипыСчетов.ПрочиеРасходы
					  ИЛИ ВыборкаДетальныеЗаписи.СчетУчетаСписанияТипСчета = Перечисления.ТипыСчетов.Расходы Тогда
					
					// Движения по регистру Доходы и расходы.
					НоваяСтрока = НаборЗаписейДоходыИРасходы.Добавить();
					НоваяСтрока.Период = ДополнительныеСвойства.ДляПроведения.Дата;
					НоваяСтрока.Регистратор = Ссылка;
					НоваяСтрока.Организация = ВыборкаДетальныеЗаписи.Организация;
					НоваяСтрока.СтруктурнаяЕдиница = ВыборкаДетальныеЗаписи.СтруктурнаяЕдиницаПолучатель;
					
					Если ТипЗнч(ВыборкаДетальныеЗаписи.ДокументПродажи) = Тип("ДокументСсылка.ПеремещениеЗапасов")
					   И ВыборкаДетальныеЗаписи.СчетУчетаСписанияТипСчета = Перечисления.ТипыСчетов.Расходы Тогда
						НоваяСтрока.НаправлениеДеятельности = ВыборкаДетальныеЗаписи.НаправлениеДеятельностиСписания;
						НоваяСтрока.ЗаказПокупателя = ВыборкаДетальныеЗаписи.ЗаказПокупателя;
					Иначе
						НоваяСтрока.НаправлениеДеятельности = Справочники.НаправленияДеятельности.Прочее;
					КонецЕсли;
					
					НоваяСтрока.СчетУчета = ВыборкаДетальныеЗаписи.СчетУчетаСписания;
					НоваяСтрока.Аналитика = ВыборкаДетальныеЗаписи.Номенклатура;
					НоваяСтрока.СуммаРасходов = СуммаКорректировки;
					НоваяСтрока.СодержаниеПроводки = НСтр("ru = 'Прочие расходы'");
					
					// Движения по регистру Управленческий.
					НоваяСтрока = НаборЗаписейУправленческий.Добавить();
					НоваяСтрока.Период = Дата;
					НоваяСтрока.Регистратор = Ссылка;
					НоваяСтрока.Организация = ВыборкаДетальныеЗаписи.Организация;
					НоваяСтрока.СценарийПланирования = Справочники.СценарииПланирования.Фактический;
					НоваяСтрока.СчетДт = ВыборкаДетальныеЗаписи.СчетУчетаСписания;
					НоваяСтрока.СчетКт = ВыборкаДетальныеЗаписи.СчетУчета;
					НоваяСтрока.Содержание = НСтр("ru = 'Прочие расходы'");
					НоваяСтрока.Сумма = СуммаКорректировки;
					
				Иначе
					
					Если НЕ ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.СчетУчетаСписания) 
						ИЛИ НЕ ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.СчетУчета) Тогда
						
						// Некорректная проводка
						ПараметрыНоменклатуры = Новый Структура;
						ПараметрыНоменклатуры.Вставить("ПредставлениеНоменклатуры", ВыборкаДетальныеЗаписи.Номенклатура);
						ПараметрыНоменклатуры.Вставить("ПредставлениеХарактеристики", ВыборкаДетальныеЗаписи.Характеристика);
						ПараметрыНоменклатуры.Вставить("ПредставлениеПартии", ВыборкаДетальныеЗаписи.Партия);
						ПредставлениеНоменклатуры = ПечатьДокументовУНФ.ПредставлениеНоменклатуры(ПараметрыНоменклатуры);
						Если НЕ ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.СчетУчетаСписания) Тогда
							ПредставлениеСчета = НСтр("ru = 'счет затрат (списания)'");
						Иначе
							ПредставлениеСчета = НСтр("ru = 'счет учета запасов'");
						КонецЕсли; 
						ШаблонОшибки = НСтр("ru = 'В движениях номенклатуры %1 не заполнен %2, движение не выполнено. Требуется проверка корректности заполнения счетов в карточке номенклатуры и корреспондирующих счетов при непосредственном списании и/или оприходовании запаса'");
						ОписаниеОшибки = СтрШаблон(ШаблонОшибки, ПредставлениеНоменклатуры, ПредставлениеСчета);
						Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ДокументПродажи) Тогда
							ШаблонОшибки = НСтр("ru = '%1. Документ: %2'");
							ОписаниеОшибки = СтрШаблон(ШаблонОшибки, ОписаниеОшибки, ВыборкаДетальныеЗаписи.ДокументПродажи);
						КонецЕсли; 
						ДобавитьОшибкуВТаблицу(ОписаниеОшибки, "РаспределениеЗатрат");
						
					Иначе
						
						// Движения по регистру Управленческий.
						НоваяСтрока = НаборЗаписейУправленческий.Добавить();
						НоваяСтрока.Период = Дата;
						НоваяСтрока.Регистратор = Ссылка;
						НоваяСтрока.Организация = ВыборкаДетальныеЗаписи.Организация;
						НоваяСтрока.СценарийПланирования = Справочники.СценарииПланирования.Фактический;
						НоваяСтрока.СчетДт = ВыборкаДетальныеЗаписи.СчетУчетаСписания;
						НоваяСтрока.СчетКт = ВыборкаДетальныеЗаписи.СчетУчета;
						НоваяСтрока.Содержание = НСтр("ru = 'Списание запасов на произвольный счет'");
						НоваяСтрока.Сумма = СуммаКорректировки;
					
					КонецЕсли;
				
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
		НаборЗаписейЗапасы.Записать(Ложь);
		НаборЗаписейПродажи.Записать(Ложь);
		НаборЗаписейДоходыИРасходы.Записать(Ложь);
		НаборЗаписейСуммовойУчетВРознице.Записать(Ложь);
		НаборЗаписейУправленческий.Записать(Ложь);
		
		Если КоличествоИтераций = 15 ИЛИ КоличествоИтераций = 30 ИЛИ КоличествоИтераций = 45 Тогда
			// Сброс списка отработанных узлов.
			СписокОбработанныхУзлов.Очистить();
			СписокОбработанныхУзлов.Добавить("");
		КонецЕсли;
		
		Запрос.УстановитьПараметр("СписокОбработанныхУзлов", СписокОбработанныхУзлов);
		Результат = Запрос.Выполнить();
		
	КонецЦикла;
	
	Запрос.Текст = "УНИЧТОЖИТЬ УчетЗатратДвиженияРасход";
	Запрос.Выполнить();
	
КонецПроцедуры // РаспределитьСуммыБезКоличества()

Процедура КорректировкаСписанияУчетЗатрат(ВидОперации)
	
	// Сформируем список состояний.
	КоличествоУравненийСЛУ = СформироватьДвиженияПоРегиструУзлыКорректировкиСтоимостиСписания();
	
	Если КоличествоУравненийСЛУ > 0 Тогда
		
		// Решим СЛУ и определим среднюю цену в каждом состоянии.
		РешениеНайдено = РешитьСЛУ();
		
		Если НЕ РешениеНайдено Тогда
			Возврат;
		КонецЕсли;
		
		// Скорректируем движения по состояниям.
		СформироватьКорректирующиеДвиженияПоРегиструУчетаЗатрат();
		
		// Распределим оставшиеся в состояниях копейки (результаты ошибок округления).
		РаспределитьСуммыБезКоличества(ВидОперации);
		
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	""Уравнений нет"" КАК Поле1
		|ПОМЕСТИТЬ УчетЗатрат
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	""Уравнений нет"" КАК Поле1
		|ПОМЕСТИТЬ УчетЗатратВозвратыТекПериода
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	""Уравнений нет"" КАК Поле1
		|ПОМЕСТИТЬ УчетЗатратСписания
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	""Уравнений нет"" КАК Поле1
		|ПОМЕСТИТЬ УчетЗатратВозвратыПоРезервам
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	""Уравнений нет"" КАК Поле1
		|ПОМЕСТИТЬ УчетЗатратВозвратыСвободные
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	""Уравнений нет"" КАК Поле1
		|ПОМЕСТИТЬ УчетЗатратВозвраты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	""Уравнений нет"" КАК Поле1
		|ПОМЕСТИТЬ УчетЗатратБезУчетаВозвратов";
		
		Запрос.МенеджерВременныхТаблиц = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		
		Запрос.Выполнить();
		
	КонецЕсли;
	
КонецПроцедуры // КорректировкаСписанияУчетЗатрат()

Процедура РассчитатьСтоимостьВозвратов(ОкончательныйРасчет = Ложь)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Если Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("ВтВозвраты") <> Неопределено Тогда
		Запрос.Текст = "УНИЧТОЖИТЬ ВтВозвраты;
						|УНИЧТОЖИТЬ Продажи";
		Запрос.Выполнить();
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапросаСтоимостьВозвратов(ОкончательныйРасчет);
	
	Запрос.УстановитьПараметр("Организация", ДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("НачалоПериода", ДополнительныеСвойства.ДляПроведения.НачальнаяДатаПериода);
	Запрос.УстановитьПараметр("КонецПериода", ДополнительныеСвойства.ДляПроведения.КонечнаяДатаПериода);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;

	ТаблицаОстатков = Неопределено;
	
	Если ОкончательныйРасчет Тогда
		
		Запрос = Новый Запрос;
		ТаблицаНоменклатуры = Результат.Выгрузить();
		Запрос.УстановитьПараметр("ТаблицаНоменклатуры", ТаблицаНоменклатуры);
		Запрос.УстановитьПараметр("Организация", ДополнительныеСвойства.ДляПроведения.Организация);
		
		ГраницаДатаКон = ДополнительныеСвойства.ДляПроведения.КонечнаяДатаПериода;
		ГраницаДатаКон = Новый Граница(ГраницаДатаКон, ВидГраницы.Включая);
		Запрос.УстановитьПараметр("ГраницаДатаКон", ГраницаДатаКон);
		
		Запрос.МенеджерВременныхТаблиц = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		Запрос.Текст = ТекстЗапросаСтоимостьВозвратовОкончательныйРасчет();
		
		ТаблицаОстатков = Запрос.Выполнить().Выгрузить();
		ТаблицаОстатков.Индексы.Добавить("Организация, СтруктурнаяЕдиница, СчетУчета, Номенклатура, Характеристика, Партия, ЗаказПокупателя, ЗаказНаПроизводство");
		
	КонецЕсли;

	НаборЗаписейЗапасы = РегистрыНакопления.Запасы.СоздатьНаборЗаписей();
	НаборЗаписейЗапасы.Отбор.Регистратор.Установить(Ссылка);

	НаборЗаписейПродажи = РегистрыНакопления.Продажи.СоздатьНаборЗаписей();
	НаборЗаписейПродажи.Отбор.Регистратор.Установить(Ссылка);

	НаборЗаписейДоходыИРасходы = РегистрыНакопления.ДоходыИРасходы.СоздатьНаборЗаписей();
	НаборЗаписейДоходыИРасходы.Отбор.Регистратор.Установить(Ссылка);

	НаборЗаписейУправленческий = РегистрыБухгалтерии.Управленческий.СоздатьНаборЗаписей();
	НаборЗаписейУправленческий.Отбор.Регистратор.Установить(Ссылка);

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если ВыборкаДетальныеЗаписи.КоличествоПродаж <> 0 Тогда
			
			ЦенаПродажи = ВыборкаДетальныеЗаписи.СуммаПродаж / ВыборкаДетальныеЗаписи.КоличествоПродаж;
			СуммаКорректировки = ВыборкаДетальныеЗаписи.СуммаВозвратов - ЦенаПродажи * ВыборкаДетальныеЗаписи.КоличествоВозвратов;
			
			ЦенаПродажиБезНДС = ВыборкаДетальныеЗаписи.СуммаБезНДСПродаж / ВыборкаДетальныеЗаписи.КоличествоПродаж;
			СуммаКорректировкиБезНДС = ВыборкаДетальныеЗаписи.СуммаБезНДСВозвратов - ЦенаПродажиБезНДС * ВыборкаДетальныеЗаписи.КоличествоВозвратов;
		Иначе
			СуммаКорректировки = 0;
			СуммаКорректировкиБезНДС = 0;
		КонецЕсли;
		
		Если ОкончательныйРасчет И ТаблицаОстатков <> Неопределено И Окр(СуммаКорректировки, 2) <> 0 Тогда
			
			СтруктураПоиска = Новый Структура;
			СтруктураПоиска.Вставить("Организация", ВыборкаДетальныеЗаписи.Организация);
			СтруктураПоиска.Вставить("СтруктурнаяЕдиница", ВыборкаДетальныеЗаписи.СтруктурнаяЕдиница);
			СтруктураПоиска.Вставить("СчетУчета", ВыборкаДетальныеЗаписи.СчетУчета);
			СтруктураПоиска.Вставить("Номенклатура", ВыборкаДетальныеЗаписи.Номенклатура);
			СтруктураПоиска.Вставить("Характеристика", ВыборкаДетальныеЗаписи.Характеристика);
			СтруктураПоиска.Вставить("Партия", ВыборкаДетальныеЗаписи.Партия);
			СтруктураПоиска.Вставить("ЗаказПокупателя", ВыборкаДетальныеЗаписи.ЗаказПокупателя);
			СтруктураПоиска.Вставить("ЗаказНаПроизводство", ВыборкаДетальныеЗаписи.ЗаказНаПроизводство);
			
			СтрокиОстатков = ТаблицаОстатков.НайтиСтроки(СтруктураПоиска);
			Если СтрокиОстатков.Количество() = 0 ИЛИ СтрокиОстатков[0].Остаток = 0 Тогда
				Продолжить;
			КонецЕсли; 
		КонецЕсли; 
		
		Если Окр(СуммаКорректировки, 2) <> 0 ИЛИ Окр(СуммаКорректировкиБезНДС, 2) <> 0 Тогда
			
			СуммыКорректировкиСтруктура = Новый Структура("СуммаКорректировки, СуммаКорректировкиБезНДС", СуммаКорректировки, СуммаКорректировкиБезНДС);
			
			СформироватьДвиженияПоРегиструУчетаЗатрат(
				НаборЗаписейЗапасы,
				НаборЗаписейУправленческий,
				ВыборкаДетальныеЗаписи,
				СуммыКорректировкиСтруктура,
				ВыборкаДетальныеЗаписи.ЭтоВозвратПрошлогоПериода,
				НСтр("ru = 'Себестоимость возврата от покупателя'"));
			
			НоваяСтрока = НаборЗаписейПродажи.Добавить();
			НоваяСтрока.Период = Дата;
			НоваяСтрока.Регистратор = Ссылка;
			НоваяСтрока.Организация = ВыборкаДетальныеЗаписи.Организация;
			НоваяСтрока.ЗаказПокупателя = ВыборкаДетальныеЗаписи.ЗаказПродажи;
			НоваяСтрока.Подразделение = ВыборкаДетальныеЗаписи.Подразделение;
			НоваяСтрока.Ответственный = ВыборкаДетальныеЗаписи.Ответственный;
			НоваяСтрока.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
			НоваяСтрока.Характеристика = ВыборкаДетальныеЗаписи.Характеристика;
			НоваяСтрока.Партия = ВыборкаДетальныеЗаписи.Партия;
			НоваяСтрока.Документ = ВыборкаДетальныеЗаписи.ДокументПродажи;
			НоваяСтрока.СтавкаНДС = ВыборкаДетальныеЗаписи.СтавкаНДС;
			НоваяСтрока.Себестоимость = СуммаКорректировки;
			НоваяСтрока.СебестоимостьБезНДС = СуммаКорректировкиБезНДС;
			Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ЗаказПродажи) 
				И ВыборкаДетальныеЗаписи.УчетПотребностиПоСкладам = Истина Тогда
				НоваяСтрока.Склад = ВыборкаДетальныеЗаписи.СтруктурнаяЕдиница;
			КонецЕсли;
			
			НоваяСтрока = НаборЗаписейДоходыИРасходы.Добавить();
			НоваяСтрока.Период = Дата;
			НоваяСтрока.Регистратор = Ссылка;
			НоваяСтрока.Организация = ВыборкаДетальныеЗаписи.Организация;
			НоваяСтрока.СтруктурнаяЕдиница = ВыборкаДетальныеЗаписи.Подразделение;
			НоваяСтрока.ЗаказПокупателя = ВыборкаДетальныеЗаписи.ЗаказПродажи;
			НоваяСтрока.НаправлениеДеятельности = ВыборкаДетальныеЗаписи.НаправлениеДеятельностиПродажи;
			НоваяСтрока.СчетУчета = ВыборкаДетальныеЗаписи.НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродаж;
			НоваяСтрока.СуммаРасходов = СуммаКорректировки;
			НоваяСтрока.СодержаниеПроводки = СодержанияПроводок.ОтражениеРасходов();
			
			НоваяСтрока = НаборЗаписейУправленческий.Добавить();
			НоваяСтрока.Период = Дата;
			НоваяСтрока.Регистратор = Ссылка;
			НоваяСтрока.Организация = ВыборкаДетальныеЗаписи.Организация;
			НоваяСтрока.СценарийПланирования = Справочники.СценарииПланирования.Фактический;
			НоваяСтрока.СчетДт = ВыборкаДетальныеЗаписи.НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродаж;
			НоваяСтрока.СчетКт = ВыборкаДетальныеЗаписи.СчетУчета;
			НоваяСтрока.Содержание = СодержанияПроводок.ОтражениеРасходов();
			НоваяСтрока.Сумма = СуммаКорректировки;
			
		КонецЕсли;
		
	КонецЦикла;

	НаборЗаписейЗапасы.Записать(Ложь);
	НаборЗаписейПродажи.Записать(Ложь);
	НаборЗаписейДоходыИРасходы.Записать(Ложь);
	НаборЗаписейУправленческий.Записать(Ложь);

КонецПроцедуры

Процедура РассчитатьФактическуюСебестоимостьВыпуска(ВидОперации)
	
	КорректировкаСписанияУчетЗатрат(ВидОперации);
	
	// Уничтожим временные таблицы.
	МенеджерВременныхТаблиц = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Если МенеджерВременныхТаблиц.Таблицы.Количество() > 0 Тогда
		
		ЧастиЗапроса = Новый Массив;
		
		Для Каждого ВременнаяТаблица Из МенеджерВременныхТаблиц.Таблицы Цикл
			ЧастиЗапроса.Добавить(СтрШаблон("УНИЧТОЖИТЬ %1", ВременнаяТаблица.ПолноеИмя));
		КонецЦикла;
		
		Запрос = Новый Запрос;
		Запрос.Текст = СтрСоединить(ЧастиЗапроса, "; ");
		Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
		Запрос.ВыполнитьПакет();
		
	КонецЕсли;
	
	// Очистим набор записей УзлыКорректировкиСтоимостиСписания.
	НаборЗаписей = РегистрыСведений.УзлыКорректировкиСтоимостиСписания.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(Ссылка);
	НаборЗаписей.Записать(Истина);

КонецПроцедуры

Процедура ЗакрытьОстаткиБезКоличества()
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьЭтапыПроизводства") 
		ИЛИ НЕ ПолучитьФункциональнуюОпцию("ИспользоватьЗакрытиеСуммБезКоличества") Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", ДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("ДатаНач", ДополнительныеСвойства.ДляПроведения.НачальнаяДатаПериода);
	Запрос.УстановитьПараметр("ДатаКон", ДополнительныеСвойства.ДляПроведения.КонечнаяДатаПериода);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗапасыОстаткиИОбороты.Организация КАК Организация,
	|	ЗапасыОстаткиИОбороты.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ВЫБОР
	|		КОГДА ЗапасыОстаткиИОбороты.СтруктурнаяЕдиница ССЫЛКА Справочник.СтруктурныеЕдиницы
	|			ТОГДА ВЫРАЗИТЬ(ЗапасыОстаткиИОбороты.СтруктурнаяЕдиница КАК Справочник.СтруктурныеЕдиницы).ТипСтруктурнойЕдиницы
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.ПустаяСсылка)
	|	КОНЕЦ КАК ТипСтруктурнойЕдиницы,
	|	ЗапасыОстаткиИОбороты.СчетУчета КАК СчетУчета,
	|	ЗапасыОстаткиИОбороты.Номенклатура КАК Номенклатура,
	|	ЗапасыОстаткиИОбороты.Характеристика КАК Характеристика,
	|	ЗапасыОстаткиИОбороты.Партия КАК Партия,
	|	ЗапасыОстаткиИОбороты.ЗаказПокупателя КАК ЗаказПокупателя,
	|	ЗапасыОстаткиИОбороты.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
	|	ЗапасыОстаткиИОбороты.СуммаБезНДСКонечныйОстаток КАК СуммаБезНДС,
	|	ЗапасыОстаткиИОбороты.СуммаКонечныйОстаток КАК Сумма,
	|	ЗапасыОстаткиИОбороты.Номенклатура.СчетУчетаЗатрат КАК СчетУчетаЗатрат,
	|	ЗапасыОстаткиИОбороты.Номенклатура.СчетУчетаЗатрат.ТипСчета КАК СчетУчетаЗатратТипСчета,
	|	ЗапасыОстаткиИОбороты.Номенклатура.НаправлениеДеятельности КАК НаправлениеДеятельности
	|ИЗ
	|	РегистрНакопления.Запасы.ОстаткиИОбороты(
	|			&ДатаНач,
	|			&ДатаКон,
	|			Период,
	|			,
	|			Организация = &Организация
	|				И Номенклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|				И СчетУчета.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Запасы)
	|				И СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Склад)) КАК ЗапасыОстаткиИОбороты
	|ГДЕ
	|	ЗапасыОстаткиИОбороты.КоличествоКонечныйОстаток = 0
	|	И (ЗапасыОстаткиИОбороты.СуммаКонечныйОстаток <> 0 ИЛИ ЗапасыОстаткиИОбороты.СуммаБезНДСКонечныйОстаток <> 0)";
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат;	
	КонецЕсли;
	
	НаборЗаписейЗапасы = РегистрыНакопления.Запасы.СоздатьНаборЗаписей();
	НаборЗаписейЗапасы.Отбор.Регистратор.Установить(ДополнительныеСвойства.ДляПроведения.Ссылка);
	
	НаборЗаписейДоходыИРасходы = РегистрыНакопления.ДоходыИРасходы.СоздатьНаборЗаписей();
	НаборЗаписейДоходыИРасходы.Отбор.Регистратор.Установить(ДополнительныеСвойства.ДляПроведения.Ссылка);
	
	НаборЗаписейУправленческий = РегистрыБухгалтерии.Управленческий.СоздатьНаборЗаписей();
	НаборЗаписейУправленческий.Отбор.Регистратор.Установить(ДополнительныеСвойства.ДляПроведения.Ссылка);
	
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		  
		// Движения по регистру Запасы.
		НоваяСтрока = НаборЗаписейЗапасы.Добавить();
		НоваяСтрока.ВидДвижения = ВидДвиженияНакопления.Расход;
		НоваяСтрока.Период = Дата;
		НоваяСтрока.Регистратор = Ссылка;
		НоваяСтрока.Организация = Выборка.Организация;
		НоваяСтрока.СтруктурнаяЕдиница = Выборка.СтруктурнаяЕдиница;
		НоваяСтрока.СчетУчета = Выборка.СчетУчета;
		НоваяСтрока.Номенклатура = Выборка.Номенклатура;
		НоваяСтрока.Характеристика = Выборка.Характеристика;
		НоваяСтрока.Партия = Выборка.Партия;
		НоваяСтрока.ЗаказПокупателя = Выборка.ЗаказПокупателя;	
		НоваяСтрока.ЗаказНаПроизводство = Выборка.ЗаказНаПроизводство;	
		НоваяСтрока.ФиксированнаяСтоимость = Истина;
		НоваяСтрока.Сумма = Выборка.Сумма;
		НоваяСтрока.СуммаБезНДС = Выборка.СуммаБезНДС;
		НоваяСтрока.СодержаниеПроводки = СодержанияПроводок.ЗакрытиеОстаткаСуммБезКоличества();

		// Движения по регистру ДоходыИРасходы.
		НоваяСтрока = НаборЗаписейДоходыИРасходы.Добавить();
		НоваяСтрока.Период = Дата;
		НоваяСтрока.Регистратор = Ссылка;
		НоваяСтрока.Организация = Выборка.Организация;
		Если Выборка.ТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.Подразделение Тогда
			НоваяСтрока.СтруктурнаяЕдиница = Выборка.СтруктурнаяЕдиница;
		Иначе
			НоваяСтрока.СтруктурнаяЕдиница = Справочники.СтруктурныеЕдиницы.ПустаяСсылка();
		КонецЕсли;
		НоваяСтрока.ЗаказПокупателя = Выборка.ЗаказПокупателя;
		НоваяСтрока.НаправлениеДеятельности = Выборка.НаправлениеДеятельности;
		Если Выборка.СчетУчетаЗатратТипСчета = Перечисления.ТипыСчетов.Расходы
			ИЛИ Выборка.СчетУчетаЗатратТипСчета = Перечисления.ТипыСчетов.ПрочиеРасходы Тогда
			НоваяСтрока.СчетУчета = Выборка.СчетУчетаЗатрат;
			НоваяСтрока.СуммаРасходов = Выборка.Сумма;
		ИначеЕсли Выборка.Сумма > 0 Тогда
			НоваяСтрока.СчетУчета = ПланыСчетов.Управленческий.ПрочиеРасходы;
			НоваяСтрока.СуммаРасходов = Выборка.Сумма;
		Иначе
			НоваяСтрока.СчетУчета = ПланыСчетов.Управленческий.ПрочиеДоходы;
			НоваяСтрока.СуммаРасходов = - Выборка.Сумма;
		КонецЕсли;
		НоваяСтрока.СодержаниеПроводки = СодержанияПроводок.ЗакрытиеОстаткаСуммБезКоличества();
		
		// Движения по регистру Управленческий.
		НоваяСтрока = НаборЗаписейУправленческий.Добавить();
		НоваяСтрока.Период = Дата;
		НоваяСтрока.Регистратор = Ссылка;
		НоваяСтрока.Организация = Выборка.Организация;
		НоваяСтрока.СценарийПланирования = Справочники.СценарииПланирования.Фактический;
		Если Выборка.СчетУчетаЗатратТипСчета = Перечисления.ТипыСчетов.Расходы
			ИЛИ Выборка.СчетУчетаЗатратТипСчета = Перечисления.ТипыСчетов.ПрочиеРасходы Тогда
			НоваяСтрока.СчетДт = Выборка.СчетУчетаЗатрат;
			НоваяСтрока.СчетКт = Выборка.СчетУчета;
			НоваяСтрока.Сумма = Выборка.Сумма;
		ИначеЕсли Выборка.Сумма > 0 Тогда
			НоваяСтрока.СчетДт = ПланыСчетов.Управленческий.ПрочиеРасходы;
			НоваяСтрока.СчетКт = Выборка.СчетУчета;
			НоваяСтрока.Сумма = Выборка.Сумма;
		Иначе
			НоваяСтрока.СчетДт = Выборка.СчетУчета;
			НоваяСтрока.СчетКт = ПланыСчетов.Управленческий.ПрочиеДоходы;
			НоваяСтрока.Сумма = - Выборка.Сумма;
		КонецЕсли;
		НоваяСтрока.Содержание = СодержанияПроводок.ЗакрытиеОстаткаСуммБезКоличества();
					
	КонецЦикла;
	
	НаборЗаписейЗапасы.Записать(Ложь);
	НаборЗаписейДоходыИРасходы.Записать(Ложь);
	НаборЗаписейУправленческий.Записать(Ложь);
	
КонецПроцедуры

Функция РаспределитьВозвратыПоПродажам(Запрос)
	
	ТаблицаВозвратов = СоздатьТаблицуВозвратов();
	РезультатЗапроса = Запрос.Выполнить();
	
	ОбходОрганизация = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ОбходОрганизация.Следующий() Цикл
		ОбходСтруктурнаяЕдиница = ОбходОрганизация.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ОбходСтруктурнаяЕдиница.Следующий() Цикл
			ОбходСчетУчета = ОбходСтруктурнаяЕдиница.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ОбходСчетУчета.Следующий() Цикл
				ОбходНоменклатура = ОбходСчетУчета.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ОбходНоменклатура.Следующий() Цикл
					ОбходХарактеристика = ОбходНоменклатура.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					Пока ОбходХарактеристика.Следующий() Цикл
						ОбходПартия = ОбходХарактеристика.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
						Пока ОбходПартия.Следующий() Цикл
							ОбходДокПродажи = ОбходПартия.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
							Пока ОбходДокПродажи.Следующий() Цикл
								ОбходСуммаБезНДС = ОбходДокПродажи.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
								Пока ОбходСуммаБезНДС.Следующий() Цикл
									ОбходСуммаВозврат = ОбходСуммаБезНДС.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
									Пока ОбходСуммаВозврат.Следующий() Цикл
										ОбходКолВозврат = ОбходСуммаВозврат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
										Пока ОбходКолВозврат.Следующий() Цикл
											
											КоличествоОсталось = ОбходКолВозврат.КоличествоВозврат;
											СуммаОсталось = ОбходКолВозврат.СуммаВозврат;
											СуммаБезНДСОсталось = ОбходКолВозврат.СуммаБезНДСВозврат;
											
											Если КоличествоОсталось > 0 Тогда
												ВыборкаДетали = ОбходКолВозврат.Выбрать();
												Пока ВыборкаДетали.Следующий() Цикл
													РаспределитьПоЗаписи(
														ВыборкаДетали,
														ТаблицаВозвратов,
														КоличествоОсталось,
														СуммаОсталось,
														СуммаБезНДСОсталось);
													
													Если КоличествоОсталось = 0 Тогда
														Прервать;
													КонецЕсли;
												КонецЦикла;
											КонецЕсли;
											
										КонецЦикла;
									КонецЦикла;
								КонецЦикла;
							КонецЦикла;
						КонецЦикла;
					КонецЦикла;
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	Возврат ТаблицаВозвратов;
	
КонецФункции

Процедура РаспределитьПоЗаписи(Запись, Таблица, КоличествоОсталось, СуммаОсталось, СуммаБезНДСОсталось)
	
	Если КоличествоОсталось <= 0 Тогда
		Возврат;
	КонецЕсли;
	
	НоваяСтрока = Таблица.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Запись);
	
	Если КоличествоОсталось <= Запись.КоличествоПродано Тогда
		
		НоваяСтрока.КоличествоРаспределено = КоличествоОсталось;
		НоваяСтрока.СуммаРаспределено = СуммаОсталось;
		НоваяСтрока.СуммаБезНДСРаспределено = СуммаБезНДСОсталось;
		
		КоличествоОсталось = 0;
		СуммаОсталось = 0;
		СуммаБезНДСОсталось = 0;
		
	Иначе
		
		НоваяСтрока.КоличествоРаспределено = Запись.КоличествоПродано;
		НоваяСтрока.СуммаРаспределено = Запись.СуммаПродано;
		НоваяСтрока.СуммаБезНДСРаспределено = Запись.СуммаБезНДСПродано;
		
		КоличествоОсталось = КоличествоОсталось - Запись.КоличествоПродано;
		СуммаОсталось = СуммаОсталось - Запись.СуммаПродано;
		СуммаБезНДСОсталось = СуммаБезНДСОсталось - Запись.СуммаБезНДСПродано;
		
	КонецЕсли;
	
КонецПроцедуры

Функция СоздатьТаблицуВозвратов()
	
	ТипКоличество = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 3));
	ТипСумма = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2));
	ТипУзел = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 0));
	ТипСправочникОрганизации = Новый ОписаниеТипов("СправочникСсылка.Организации");
	ТипСправочникСтруктурныеЕдиницы = Новый ОписаниеТипов("СправочникСсылка.СтруктурныеЕдиницы");
	ТипПланСчетов = Новый ОписаниеТипов("ПланСчетовСсылка.Управленческий");
	ТипНоменклатура = Новый ОписаниеТипов("СправочникСсылка.Номенклатура");
	ТипХарактеристики = Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры");
	ТипПартии = Новый ОписаниеТипов("СправочникСсылка.ПартииНоменклатуры");
	ТипЗаказПокупателя = Новый ОписаниеТипов("ДокументСсылка.ЗаказПокупателя");
	ТипЗаказНаПроизводство = Новый ОписаниеТипов("ДокументСсылка.ЗаказНаПроизводство");
	
	МассивТиповДокументПродажи = Новый Массив;
	МассивТиповДокументПродажи.Добавить(Тип("ДокументСсылка.СписаниеЗапасов"));
	МассивТиповДокументПродажи.Добавить(Тип("ДокументСсылка.РасходнаяНакладная"));
	МассивТиповДокументПродажи.Добавить(Тип("ДокументСсылка.ОтчетКомиссионера"));
	МассивТиповДокументПродажи.Добавить(Тип("ДокументСсылка.ПеремещениеЗапасов"));
	МассивТиповДокументПродажи.Добавить(Тип("ДокументСсылка.ПриходнаяНакладная"));
	МассивТиповДокументПродажи.Добавить(Тип("ДокументСсылка.ЧекККМВозврат"));
	МассивТиповДокументПродажи.Добавить(Тип("ДокументСсылка.АктВыполненныхРабот"));
	МассивТиповДокументПродажи.Добавить(Тип("ДокументСсылка.ЧекККМ"));
	МассивТиповДокументПродажи.Добавить(Тип("ДокументСсылка.ОтчетОПереработке"));
	МассивТиповДокументПродажи.Добавить(Тип("ДокументСсылка.АвансовыйОтчет"));
	МассивТиповДокументПродажи.Добавить(Тип("ДокументСсылка.ЗаказПокупателя"));
	МассивТиповДокументПродажи.Добавить(Тип("ДокументСсылка.ОтчетОРозничныхПродажах"));
	МассивТиповДокументПродажи.Добавить(Тип("ДокументСсылка.ПересортицаЗапасов"));
	МассивТиповДокументПродажи.Добавить(Тип("ДокументСсылка.ОтчетКомиссионераОСписании"));
	МассивТиповДокументПродажи.Добавить(Тип("ДокументСсылка.ПередачаТоваровМеждуОрганизациями"));
	ТипДокументПродажи = Новый ОписаниеТипов(МассивТиповДокументПродажи);
		
	ТаблицаВозвратов = Новый ТаблицаЗначений;
	ТаблицаВозвратов.Колонки.Добавить("Организация", ТипСправочникОрганизации);
	ТаблицаВозвратов.Колонки.Добавить("СтруктурнаяЕдиница", ТипСправочникСтруктурныеЕдиницы);
	ТаблицаВозвратов.Колонки.Добавить("СчетУчета", ТипПланСчетов);
	ТаблицаВозвратов.Колонки.Добавить("Номенклатура", ТипНоменклатура);
	ТаблицаВозвратов.Колонки.Добавить("Характеристика", ТипХарактеристики);
	ТаблицаВозвратов.Колонки.Добавить("Партия", ТипПартии);
	ТаблицаВозвратов.Колонки.Добавить("ЗаказПокупателя", ТипЗаказПокупателя);
	ТаблицаВозвратов.Колонки.Добавить("ЗаказНаПроизводство", ТипЗаказНаПроизводство);
	ТаблицаВозвратов.Колонки.Добавить("НомерУзла", ТипУзел);
	ТаблицаВозвратов.Колонки.Добавить("КоличествоПродано", ТипКоличество);
	ТаблицаВозвратов.Колонки.Добавить("СуммаБезНДСПродано", ТипСумма);
	ТаблицаВозвратов.Колонки.Добавить("СуммаПродано", ТипСумма);
	ТаблицаВозвратов.Колонки.Добавить("КоличествоВозврат", ТипКоличество);
	ТаблицаВозвратов.Колонки.Добавить("СуммаБезНДСВозврат", ТипСумма);
	ТаблицаВозвратов.Колонки.Добавить("СуммаВозврат", ТипСумма);
	ТаблицаВозвратов.Колонки.Добавить("СуммаБезНДСРаспределено", ТипСумма);
	ТаблицаВозвратов.Колонки.Добавить("КоличествоРаспределено", ТипКоличество);
	ТаблицаВозвратов.Колонки.Добавить("СуммаРаспределено", ТипСумма);
	ТаблицаВозвратов.Колонки.Добавить("ДокументПродажи", ТипДокументПродажи);
	
	Возврат ТаблицаВозвратов;
	
КонецФункции

Функция СформироватьМатрицуУзловДляРасчетаСистемЛинейныхУравнений(ЗапросОбщий)

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	УзлыКорректировкиСтоимостиСписания.НомерУзла КАК НомерУравнения,
		|	УзлыКорректировкиСтоимостиСписания.Количество КАК Количество,
		|	УзлыКорректировкиСтоимостиСписания.Сумма КАК Сумма,
		|	УзлыКорректировкиСтоимостиСписания.СуммаБезНДС КАК СуммаБезНДС,
		|	УзлыКорректировкиСтоимостиСписания.СуммаИнт КАК СуммаИнт,
		|	УзлыКорректировкиСтоимостиСписания.СуммаБезНДСИнт КАК СуммаБезНДСИнт
		|ИЗ
		|	РегистрСведений.УзлыКорректировкиСтоимостиСписания КАК УзлыКорректировкиСтоимостиСписания
		|ГДЕ
		|	УзлыКорректировкиСтоимостиСписания.Регистратор = &Регистратор";

	Запрос.Параметры.Вставить("Регистратор", ЗапросОбщий.Параметры.Регистратор);

	Возврат Запрос.Выполнить();

КонецФункции

Функция СформироватьМатрицуСвязейДляРасчетаСистемЛинейныхУравнений(ЗапросОбщий, ИмяПоляСуммы = "Сумма")

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = ЗапросОбщий.МенеджерВременныхТаблиц;

	Если Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("ВТ_СвязиСырые") <> Неопределено Тогда
		Запрос.Текст = "УНИЧТОЖИТЬ ВТ_СвязиСырые;
					|	УНИЧТОЖИТЬ МатрицаСвернуто";
		Запрос.Выполнить();
	КонецЕсли;

	Запрос.Текст =
		"ВЫБРАТЬ
		|	УзелПриемник.НомерУзла КАК НомерУравнения,
		|	УчетЗатрат.НомерУзла КАК НомерПеременной,
		|	СУММА((&ВесСвязи) * -1.0) КАК ВесСвязиСумма
		|ПОМЕСТИТЬ ВТ_СвязиСырые
		|ИЗ
		|	УчетЗатрат КАК УчетЗатрат
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_УзлыКорректировки КАК УзелПриемник
		|		ПО УчетЗатрат.Организация = УзелПриемник.Организация
		|			И УчетЗатрат.СтруктурнаяЕдиница = УзелПриемник.СтруктурнаяЕдиница
		|			И УчетЗатрат.СчетУчета = УзелПриемник.СчетУчета
		|			И УчетЗатрат.Номенклатура = УзелПриемник.Номенклатура
		|			И УчетЗатрат.Характеристика = УзелПриемник.Характеристика
		|			И УчетЗатрат.Партия = УзелПриемник.Партия
		|			И УчетЗатрат.ЗаказПокупателя = УзелПриемник.ЗаказПокупателя
		|			И УчетЗатрат.ЗаказНаПроизводство = УзелПриемник.ЗаказНаПроизводство
		|ГДЕ
		|	УзелПриемник.НомерУзла <> УчетЗатрат.НомерУзла
		|
		|СГРУППИРОВАТЬ ПО
		|	УзелПриемник.НомерУзла,
		|	УчетЗатрат.НомерУзла
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_СвязиСырые.НомерУравнения КАК НомерУравнения,
		|	ВТ_СвязиСырые.НомерПеременной КАК НомерПеременной,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(Узел.Количество, 0) = 0
		|			ТОГДА 0
		|		ИНАЧЕ ВЫРАЗИТЬ(ВТ_СвязиСырые.ВесСвязиСумма
		|				/ Узел.Количество КАК ЧИСЛО(23, 10))
		|	КОНЕЦ КАК Количество
		|ПОМЕСТИТЬ МатрицаСвернуто
		|ИЗ
		|	ВТ_СвязиСырые КАК ВТ_СвязиСырые
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_УзлыКорректировки КАК Узел
		|		ПО ВТ_СвязиСырые.НомерУравнения = Узел.НомерУзла
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МатрицаСвернуто.НомерУравнения КАК НомерУравнения,
		|	МатрицаСвернуто.НомерПеременной КАК НомерПеременной,
		|	МатрицаСвернуто.Количество КАК Количество
		|ИЗ
		|	МатрицаСвернуто КАК МатрицаСвернуто
		|ГДЕ
		|	МатрицаСвернуто.Количество <> 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_УзлыКорректировки.НомерУзла,
		|	ВТ_УзлыКорректировки.НомерУзла,
		|	1
		|ИЗ
		|	ВТ_УзлыКорректировки КАК ВТ_УзлыКорректировки
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерУравнения,
		|	НомерПеременной";

	ВесСвязи = "ВЫБОР КОГДА УчетЗатрат.Количество <> 0
				|		ТОГДА УчетЗатрат.Количество
				|		ИНАЧЕ УчетЗатрат." + ИмяПоляСуммы + "
				|	КОНЕЦ";
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ВесСвязи", ВесСвязи);

	Запрос.УстановитьПараметр("Регистратор", ЗапросОбщий.Параметры.Регистратор);
	Возврат Запрос.Выполнить();

КонецФункции

Функция ТекстЗапросаВозвраты()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ЗапасыПредварительно.Организация КАК Организация,
	|	ЗапасыПредварительно.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ЗапасыПредварительно.СчетУчета КАК СчетУчета,
	|	ЗапасыПредварительно.Номенклатура КАК Номенклатура,
	|	ЗапасыПредварительно.Характеристика КАК Характеристика,
	|	ЗапасыПредварительно.Партия КАК Партия,
	|	ЗапасыПредварительно.ЗаказПокупателя КАК ЗаказПокупателя,
	|	ЗапасыПредварительно.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
	|	ЗапасыПредварительно.ЗаказПродажи КАК ЗаказПродажи,
	|	ЗапасыПредварительно.ДокументПродажи КАК ДокументПродажи,
	|	ЗапасыПредварительно.ВидДвижения КАК ВидДвижения,
	|	ЗапасыПредварительно.Возврат КАК Возврат,
	|	ЗапасыПредварительно.ФиксированнаяСтоимость КАК ФиксированнаяСтоимость,
	|	ЗапасыПредварительно.Количество КАК Количество,
	|	ЗапасыПредварительно.СуммаБезНДС КАК СуммаБезНДС,
	|	ЗапасыПредварительно.Сумма КАК Сумма
	|ПОМЕСТИТЬ ЗапасыПредварительно
	|ИЗ
	|	РегистрНакопления.Запасы КАК ЗапасыПредварительно
	|ГДЕ
	|	ЗапасыПредварительно.Организация = &Организация
	|	И ЗапасыПредварительно.Период МЕЖДУ &ДатаНач И &ДатаКон
	|	И ЗапасыПредварительно.ДокументПродажи <> НЕОПРЕДЕЛЕНО
	|	И МЕСЯЦ(ЗапасыПредварительно.ДокументПродажи.Дата) = МЕСЯЦ(ЗапасыПредварительно.Период)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументПродажи,
	|	Организация,
	|	СтруктурнаяЕдиница,
	|	СчетУчета,
	|	Номенклатура,
	|	Характеристика,
	|	Партия,
	|	ЗаказПокупателя,
	|	ЗаказНаПроизводство,
	|	ЗаказПродажи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УчетЗапасовИЗатрат.Организация КАК Организация,
	|	УчетЗапасовИЗатрат.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	УчетЗапасовИЗатрат.СчетУчета КАК СчетУчета,
	|	УчетЗапасовИЗатрат.Номенклатура КАК Номенклатура,
	|	УчетЗапасовИЗатрат.Характеристика КАК Характеристика,
	|	УчетЗапасовИЗатрат.Партия КАК Партия,
	|	УчетЗапасовИЗатрат.ЗаказПокупателя КАК ЗаказПокупателя,
	|	УчетЗапасовИЗатрат.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
	|	УчетЗапасовИЗатрат.ЗаказПродажи КАК ЗаказПродажи,
	|	УчетЗапасовИЗатрат.ДокументПродажи КАК ДокументПродажи,
	|	-СУММА(УчетЗапасовИЗатрат.Количество) КАК Количество,
	|	-СУММА(УчетЗапасовИЗатрат.СуммаБезНДС) КАК СуммаБезНДС,
	|	-СУММА(УчетЗапасовИЗатрат.Сумма) КАК Сумма
	|ПОМЕСТИТЬ УчетЗатратВозвратыТекПериода
	|ИЗ
	|	ЗапасыПредварительно КАК УчетЗапасовИЗатрат
	|ГДЕ
	|	УчетЗапасовИЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И УчетЗапасовИЗатрат.Возврат
	|	И НЕ УчетЗапасовИЗатрат.ФиксированнаяСтоимость
	|
	|СГРУППИРОВАТЬ ПО
	|	УчетЗапасовИЗатрат.Организация,
	|	УчетЗапасовИЗатрат.СтруктурнаяЕдиница,
	|	УчетЗапасовИЗатрат.СчетУчета,
	|	УчетЗапасовИЗатрат.Номенклатура,
	|	УчетЗапасовИЗатрат.Характеристика,
	|	УчетЗапасовИЗатрат.Партия,
	|	УчетЗапасовИЗатрат.ЗаказПокупателя,
	|	УчетЗапасовИЗатрат.ЗаказНаПроизводство,
	|	УчетЗапасовИЗатрат.ЗаказПродажи,
	|	УчетЗапасовИЗатрат.ДокументПродажи
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументПродажи,
	|	Организация,
	|	СтруктурнаяЕдиница,
	|	СчетУчета,
	|	Номенклатура,
	|	Характеристика,
	|	Партия,
	|	ЗаказПокупателя,
	|	ЗаказНаПроизводство,
	|	ЗаказПродажи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УчетЗатратВозвратыТекПериода.Организация КАК Организация,
	|	УчетЗатратВозвратыТекПериода.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	УчетЗатратВозвратыТекПериода.СчетУчета КАК СчетУчета,
	|	УчетЗатратВозвратыТекПериода.Номенклатура КАК Номенклатура,
	|	УчетЗатратВозвратыТекПериода.Характеристика КАК Характеристика,
	|	УчетЗатратВозвратыТекПериода.Партия КАК Партия,
	|	УчетЗатратВозвратыТекПериода.ЗаказПокупателя КАК ЗаказПокупателя,
	|	УчетЗатратВозвратыТекПериода.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
	|	СУММА(ЕСТЬNULL(УчетЗапасовИЗатрат.Количество, 0)) КАК КоличествоПродано,
	|	СУММА(ЕСТЬNULL(УчетЗапасовИЗатрат.СуммаБезНДС, 0)) КАК СуммаБезНДСПродано,
	|	СУММА(ЕСТЬNULL(УчетЗапасовИЗатрат.Сумма, 0)) КАК СуммаПродано,
	|	УчетЗатратВозвратыТекПериода.Количество КАК КоличествоВозврат,
	|	УчетЗатратВозвратыТекПериода.СуммаБезНДС КАК СуммаБезНДСВозврат,
	|	УчетЗатратВозвратыТекПериода.Сумма КАК СуммаВозврат,
	|	УчетЗатратВозвратыТекПериода.ДокументПродажи КАК ДокументПродажи
	|ПОМЕСТИТЬ УчетЗатратВозвратыОбъединенные
	|ИЗ
	|	УчетЗатратВозвратыТекПериода КАК УчетЗатратВозвратыТекПериода
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЗапасыПредварительно КАК УчетЗапасовИЗатрат
	|		ПО УчетЗатратВозвратыТекПериода.ДокументПродажи = УчетЗапасовИЗатрат.ДокументПродажи
	|			И УчетЗатратВозвратыТекПериода.Организация = УчетЗапасовИЗатрат.Организация
	|			И УчетЗатратВозвратыТекПериода.Номенклатура = УчетЗапасовИЗатрат.Номенклатура
	|			И УчетЗатратВозвратыТекПериода.Характеристика = УчетЗапасовИЗатрат.Характеристика
	|			И УчетЗатратВозвратыТекПериода.Партия = УчетЗапасовИЗатрат.Партия
	|			И УчетЗатратВозвратыТекПериода.ЗаказПродажи = УчетЗапасовИЗатрат.ЗаказПродажи
	|			И УчетЗатратВозвратыТекПериода.ЗаказПродажи = УчетЗапасовИЗатрат.ЗаказПокупателя
	|			И (НЕ УчетЗапасовИЗатрат.Возврат)
	|ГДЕ
	|	(УчетЗапасовИЗатрат.ЗаказПокупателя <> ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|		И УчетЗапасовИЗатрат.ЗаказНаПроизводство = ЗНАЧЕНИЕ(Документ.ЗаказНаПроизводство.ПустаяСсылка))
	|	ИЛИ (УчетЗапасовИЗатрат.ЗаказПокупателя = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|		И УчетЗапасовИЗатрат.ЗаказНаПроизводство = ЗНАЧЕНИЕ(Документ.ЗаказНаПроизводство.ПустаяСсылка))
	|
	|СГРУППИРОВАТЬ ПО
	|	УчетЗатратВозвратыТекПериода.Организация,
	|	УчетЗатратВозвратыТекПериода.СтруктурнаяЕдиница,
	|	УчетЗатратВозвратыТекПериода.СчетУчета,
	|	УчетЗатратВозвратыТекПериода.Номенклатура,
	|	УчетЗатратВозвратыТекПериода.Характеристика,
	|	УчетЗатратВозвратыТекПериода.Партия,
	|	УчетЗатратВозвратыТекПериода.ЗаказПокупателя,
	|	УчетЗатратВозвратыТекПериода.ЗаказНаПроизводство,
	|	УчетЗатратВозвратыТекПериода.Количество,
	|	УчетЗатратВозвратыТекПериода.СуммаБезНДС,
	|	УчетЗатратВозвратыТекПериода.Сумма,
	|	УчетЗатратВозвратыТекПериода.ДокументПродажи
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументПродажи,
	|	Организация,
	|	СтруктурнаяЕдиница,
	|	СчетУчета,
	|	Номенклатура,
	|	Характеристика,
	|	Партия,
	|	ЗаказПокупателя,
	|	ЗаказНаПроизводство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УчетЗатратВозвраты.Организация КАК Организация,
	|	УчетЗатратВозвраты.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	УчетЗатратВозвраты.СчетУчета КАК СчетУчета,
	|	УчетЗатратВозвраты.Номенклатура КАК Номенклатура,
	|	УчетЗатратВозвраты.Характеристика КАК Характеристика,
	|	УчетЗатратВозвраты.Партия КАК Партия,
	|	УчетЗатратВозвраты.ЗаказПокупателя КАК ЗаказПокупателя,
	|	УчетЗатратВозвраты.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
	|	УзлыКорректировкиСтоимостиСписания.НомерУзла КАК НомерУзла,
	|	УчетЗатратВозвраты.КоличествоПродано КАК КоличествоПродано,
	|	УчетЗатратВозвраты.СуммаБезНДСПродано КАК СуммаБезНДСПродано,
	|	УчетЗатратВозвраты.СуммаПродано КАК СуммаПродано,
	|	УчетЗатратВозвраты.КоличествоВозврат КАК КоличествоВозврат,
	|	УчетЗатратВозвраты.СуммаБезНДСВозврат КАК СуммаБезНДСВозврат,
	|	УчетЗатратВозвраты.СуммаВозврат КАК СуммаВозврат,
	|	0 КАК СуммаБезНДСРаспределено,
	|	0 КАК КоличествоРаспределено,
	|	0 КАК СуммаРаспределено,
	|	УчетЗатратВозвраты.ДокументПродажи КАК ДокументПродажи
	|
	|ИЗ
	|	УчетЗатратВозвратыОбъединенные КАК УчетЗатратВозвраты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УзлыКорректировкиСтоимостиСписания КАК УзлыКорректировкиСтоимостиСписания
	|		ПО (УзлыКорректировкиСтоимостиСписания.Регистратор = &Регистратор)
	|			И УчетЗатратВозвраты.Организация = УзлыКорректировкиСтоимостиСписания.Организация
	|			И УчетЗатратВозвраты.СтруктурнаяЕдиница = УзлыКорректировкиСтоимостиСписания.СтруктурнаяЕдиница
	|			И УчетЗатратВозвраты.СчетУчета = УзлыКорректировкиСтоимостиСписания.СчетУчета
	|			И УчетЗатратВозвраты.Номенклатура = УзлыКорректировкиСтоимостиСписания.Номенклатура
	|			И УчетЗатратВозвраты.Характеристика = УзлыКорректировкиСтоимостиСписания.Характеристика
	|			И УчетЗатратВозвраты.Партия = УзлыКорректировкиСтоимостиСписания.Партия
	|			И УчетЗатратВозвраты.ЗаказПокупателя = УзлыКорректировкиСтоимостиСписания.ЗаказПокупателя
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерУзла
	|ИТОГИ ПО
	|	Организация,
	|	СтруктурнаяЕдиница,
	|	СчетУчета,
	|	Номенклатура,
	|	Характеристика,
	|	Партия,
	|	ДокументПродажи,
	|	СуммаБезНДСВозврат,
	|	СуммаВозврат,
	|	КоличествоВозврат";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаУчетЗатрат()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ТаблицаВозвратов.Организация КАК Организация,
	|	ТаблицаВозвратов.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ТаблицаВозвратов.СчетУчета КАК СчетУчета,
	|	ТаблицаВозвратов.Номенклатура КАК Номенклатура,
	|	ТаблицаВозвратов.Характеристика КАК Характеристика,
	|	ТаблицаВозвратов.Партия КАК Партия,
	|	ТаблицаВозвратов.ЗаказПокупателя КАК ЗаказПокупателя,
	|	ТаблицаВозвратов.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
	|	ТаблицаВозвратов.НомерУзла КАК НомерУзла,
	|	ТаблицаВозвратов.КоличествоРаспределено КАК Количество,
	|	ТаблицаВозвратов.СуммаБезНДСРаспределено КАК СуммаБезНДС,
	|	ТаблицаВозвратов.СуммаРаспределено КАК Сумма,
	|	ТаблицаВозвратов.ДокументПродажи КАК ДокументПродажи
	|ПОМЕСТИТЬ УчетЗатратВозвраты
	|ИЗ
	|	&ТаблицаВозвратов КАК ТаблицаВозвратов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УчетЗапасовИЗатрат.Организация КАК Организация,
	|	УчетЗапасовИЗатрат.КоррСтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	УчетЗапасовИЗатрат.КоррСчетУчета КАК СчетУчета,
	|	УчетЗапасовИЗатрат.КоррНоменклатура КАК Номенклатура,
	|	УчетЗапасовИЗатрат.КоррХарактеристика КАК Характеристика,
	|	УчетЗапасовИЗатрат.КоррПартия КАК Партия,
	|	УчетЗапасовИЗатрат.КоррЗаказПокупателя КАК ЗаказПокупателя,
	|	УчетЗапасовИЗатрат.КоррЗаказНаПроизводство КАК ЗаказНаПроизводство,
	|	УзлыКорректировкиСтоимостиСписания.НомерУзла КАК НомерУзла,
	|	СУММА(ВЫБОР
	|		КОГДА УчетЗапасовИЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			И НЕ УчетЗапасовИЗатрат.Возврат
	|			ТОГДА 1
	|		КОГДА УчетЗапасовИЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			И УчетЗапасовИЗатрат.Возврат
	|			ТОГДА -1
	|		ИНАЧЕ 0
	|	КОНЕЦ * УчетЗапасовИЗатрат.Количество) КАК Количество,
	|	СУММА(ВЫБОР
	|		КОГДА УчетЗапасовИЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			И НЕ УчетЗапасовИЗатрат.Возврат
	|			ТОГДА 1
	|		КОГДА УчетЗапасовИЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			И УчетЗапасовИЗатрат.Возврат
	|			ТОГДА -1
	|		ИНАЧЕ 0
	|	КОНЕЦ * УчетЗапасовИЗатрат.СуммаБезНДС) КАК СуммаБезНДС,
	|	СУММА(ВЫБОР
	|		КОГДА УчетЗапасовИЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			И НЕ УчетЗапасовИЗатрат.Возврат
	|			ТОГДА 1
	|		КОГДА УчетЗапасовИЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			И УчетЗапасовИЗатрат.Возврат
	|			ТОГДА -1
	|		ИНАЧЕ 0
	|	КОНЕЦ * УчетЗапасовИЗатрат.Сумма) КАК Сумма,
	|	СУММА(ВЫБОР
	|		КОГДА УчетЗапасовИЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			И НЕ УчетЗапасовИЗатрат.Возврат
	|			ТОГДА 1
	|		КОГДА УчетЗапасовИЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			И УчетЗапасовИЗатрат.Возврат
	|			ТОГДА -1
	|		ИНАЧЕ 0
	|	КОНЕЦ * УчетЗапасовИЗатрат.СуммаИнт) КАК СуммаИнт,
	|	СУММА(ВЫБОР
	|		КОГДА УчетЗапасовИЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			И НЕ УчетЗапасовИЗатрат.Возврат
	|			ТОГДА 1
	|		КОГДА УчетЗапасовИЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			И УчетЗапасовИЗатрат.Возврат
	|			ТОГДА -1
	|		ИНАЧЕ 0
	|	КОНЕЦ * УчетЗапасовИЗатрат.СуммаБезНДСИнт) КАК СуммаБезНДСИнт
	|ПОМЕСТИТЬ УчетЗатратБезУчетаВозвратов
	|ИЗ
	|	РегистрНакопления.Запасы КАК УчетЗапасовИЗатрат
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УзлыКорректировкиСтоимостиСписания КАК УзлыКорректировкиСтоимостиСписания
	|		ПО (УзлыКорректировкиСтоимостиСписания.Регистратор = &Регистратор)
	|			И УчетЗапасовИЗатрат.Организация = УзлыКорректировкиСтоимостиСписания.Организация
	|			И УчетЗапасовИЗатрат.СтруктурнаяЕдиница = УзлыКорректировкиСтоимостиСписания.СтруктурнаяЕдиница
	|			И УчетЗапасовИЗатрат.СчетУчета = УзлыКорректировкиСтоимостиСписания.СчетУчета
	|			И УчетЗапасовИЗатрат.Номенклатура = УзлыКорректировкиСтоимостиСписания.Номенклатура
	|			И УчетЗапасовИЗатрат.Характеристика = УзлыКорректировкиСтоимостиСписания.Характеристика
	|			И УчетЗапасовИЗатрат.Партия = УзлыКорректировкиСтоимостиСписания.Партия
	|			И УчетЗапасовИЗатрат.ЗаказПокупателя = УзлыКорректировкиСтоимостиСписания.ЗаказПокупателя
	|			И УчетЗапасовИЗатрат.ЗаказНаПроизводство = УзлыКорректировкиСтоимостиСписания.ЗаказНаПроизводство
	|ГДЕ
	|	УчетЗапасовИЗатрат.Период МЕЖДУ &ДатаНач И &ДатаКон
	|	И УчетЗапасовИЗатрат.Организация = &Организация
	|	И НЕ УчетЗапасовИЗатрат.ФиксированнаяСтоимость
	|
	|СГРУППИРОВАТЬ ПО
	|	УчетЗапасовИЗатрат.Организация,
	|	УчетЗапасовИЗатрат.КоррСтруктурнаяЕдиница,
	|	УчетЗапасовИЗатрат.КоррСчетУчета,
	|	УчетЗапасовИЗатрат.КоррНоменклатура,
	|	УчетЗапасовИЗатрат.КоррХарактеристика,
	|	УчетЗапасовИЗатрат.КоррПартия,
	|	УчетЗапасовИЗатрат.КоррЗаказПокупателя,
	|	УчетЗапасовИЗатрат.КоррЗаказНаПроизводство,
	|	УзлыКорректировкиСтоимостиСписания.НомерУзла
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	СтруктурнаяЕдиница,
	|	СчетУчета,
	|	Номенклатура,
	|	Характеристика,
	|	Партия,
	|	ЗаказПокупателя,
	|	ЗаказНаПроизводство,
	|	НомерУзла
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УчетЗатрат.Организация КАК Организация,
	|	УчетЗатрат.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	УчетЗатрат.СчетУчета КАК СчетУчета,
	|	УчетЗатрат.Номенклатура КАК Номенклатура,
	|	УчетЗатрат.Характеристика КАК Характеристика,
	|	УчетЗатрат.Партия КАК Партия,
	|	УчетЗатрат.ЗаказПокупателя КАК ЗаказПокупателя,
	|	УчетЗатрат.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
	|	УчетЗатрат.НомерУзла КАК НомерУзла,
	|	СУММА(УчетЗатрат.Количество) КАК Количество,
	|	СУММА(УчетЗатрат.СуммаБезНДС) КАК СуммаБезНДС,
	|	СУММА(УчетЗатрат.Сумма) КАК Сумма,
	|	СУММА(УчетЗатрат.СуммаИнт) КАК СуммаИнт,
	|	СУММА(УчетЗатрат.СуммаБезНДСИнт) КАК СуммаБезНДСИнт
	|ПОМЕСТИТЬ УчетЗатрат
	|ИЗ
	|	(ВЫБРАТЬ
	|		УчетЗатратЗаВычетомВозвратов.Организация КАК Организация,
	|		УчетЗатратЗаВычетомВозвратов.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|		УчетЗатратЗаВычетомВозвратов.СчетУчета КАК СчетУчета,
	|		УчетЗатратЗаВычетомВозвратов.Номенклатура КАК Номенклатура,
	|		УчетЗатратЗаВычетомВозвратов.Характеристика КАК Характеристика,
	|		УчетЗатратЗаВычетомВозвратов.Партия КАК Партия,
	|		УчетЗатратЗаВычетомВозвратов.ЗаказПокупателя КАК ЗаказПокупателя,
	|		УчетЗатратЗаВычетомВозвратов.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
	|		УчетЗатратЗаВычетомВозвратов.НомерУзла КАК НомерУзла,
	|		УчетЗатратЗаВычетомВозвратов.Количество КАК Количество,
	|		УчетЗатратЗаВычетомВозвратов.СуммаБезНДС КАК СуммаБезНДС,
	|		УчетЗатратЗаВычетомВозвратов.Сумма КАК Сумма,
	|		УчетЗатратЗаВычетомВозвратов.СуммаИнт КАК СуммаИнт,
	|		УчетЗатратЗаВычетомВозвратов.СуммаБезНДСИнт КАК СуммаБезНДСИнт
	|	ИЗ
	|		УчетЗатратБезУчетаВозвратов КАК УчетЗатратЗаВычетомВозвратов
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		УчетЗатратВозвраты.Организация КАК Организация,
	|		УчетЗатратВозвраты.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|		УчетЗатратВозвраты.СчетУчета КАК СчетУчета,
	|		УчетЗатратВозвраты.Номенклатура КАК Номенклатура,
	|		УчетЗатратВозвраты.Характеристика КАК Характеристика,
	|		УчетЗатратВозвраты.Партия КАК Партия,
	|		УчетЗатратВозвраты.ЗаказПокупателя КАК ЗаказПокупателя,
	|		УчетЗатратВозвраты.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
	|		УчетЗатратВозвраты.НомерУзла КАК НомерУзла,
	|		ВЫБОР
	|			КОГДА УчетЗатратВозвраты.ДокументПродажи <> ЗНАЧЕНИЕ(Документ.РасходнаяНакладная.ПустаяСсылка)
	|				ТОГДА УчетЗатратВозвраты.Количество
	|			ИНАЧЕ -УчетЗатратВозвраты.Количество
	|		КОНЕЦ КАК Количество,
	|		ВЫБОР
	|			КОГДА УчетЗатратВозвраты.ДокументПродажи <> ЗНАЧЕНИЕ(Документ.РасходнаяНакладная.ПустаяСсылка)
	|				ТОГДА УчетЗатратВозвраты.СуммаБезНДС
	|			ИНАЧЕ -УчетЗатратВозвраты.СуммаБезНДС
	|		КОНЕЦ КАК СуммаБезНДС,
	|		ВЫБОР
	|			КОГДА УчетЗатратВозвраты.ДокументПродажи <> ЗНАЧЕНИЕ(Документ.РасходнаяНакладная.ПустаяСсылка)
	|				ТОГДА УчетЗатратВозвраты.Сумма
	|			ИНАЧЕ -УчетЗатратВозвраты.Сумма
	|		КОНЕЦ КАК Сумма,
	|		0 КАК СуммаИнт,
	|		0 КАК СуммаБезНДСИнт
	|	ИЗ
	|		УчетЗатратВозвраты КАК УчетЗатратВозвраты) КАК УчетЗатрат
	|
	|СГРУППИРОВАТЬ ПО
	|	УчетЗатрат.Организация,
	|	УчетЗатрат.СтруктурнаяЕдиница,
	|	УчетЗатрат.СчетУчета,
	|	УчетЗатрат.Номенклатура,
	|	УчетЗатрат.Характеристика,
	|	УчетЗатрат.Партия,
	|	УчетЗатрат.ЗаказПокупателя,
	|	УчетЗатрат.ЗаказНаПроизводство,
	|	УчетЗатрат.НомерУзла
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	СтруктурнаяЕдиница,
	|	СчетУчета,
	|	Номенклатура,
	|	Характеристика,
	|	Партия,
	|	ЗаказПокупателя,
	|	ЗаказНаПроизводство,
	|	НомерУзла
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаСтоимостьВозвратов(ОкончательныйРасчет)
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Запасы.Период КАК Период,
	|	Запасы.Организация КАК Организация,
	|	Запасы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	Запасы.СчетУчета КАК СчетУчета,
	|	Запасы.Номенклатура КАК Номенклатура,
	|	Запасы.Характеристика КАК Характеристика,
	|	Запасы.Партия КАК Партия,
	|	Запасы.ЗаказПокупателя КАК ЗаказПокупателя,
	|	Запасы.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
	|	Запасы.ЗаказПродажи КАК ЗаказПродажи,
	|	Запасы.ЗаказПродажи.УчетПотребностиПоСкладам КАК УчетПотребностиПоСкладам,
	|	Запасы.СтавкаНДС КАК СтавкаНДС,
	|	Запасы.ДокументПродажи КАК ДокументПродажи,
	|	Запасы.Подразделение КАК Подразделение,
	|	Запасы.КоррСчетУчета КАК КоррСчетУчета,
	|	Запасы.Ответственный КАК Ответственный,
	|	ВЫБОР
	|		КОГДА КОНЕЦПЕРИОДА(Запасы.ДокументПродажи.Дата, МЕСЯЦ) < КОНЕЦПЕРИОДА(Запасы.Период, МЕСЯЦ)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоВозвратПрошлогоПериода,
	|	-СУММА(Запасы.Количество) КАК Количество,
	|	-СУММА(Запасы.СуммаБезНДС) КАК СуммаБезНДС,
	|	-СУММА(Запасы.Сумма) КАК Сумма
	|ПОМЕСТИТЬ ВтВозвраты
	|ИЗ
	|	РегистрНакопления.Запасы КАК Запасы
	|ГДЕ
	|	Запасы.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Запасы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И Запасы.Возврат
	|	И Запасы.Организация = &Организация
	|	И Запасы.КоррСчетУчета = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПустаяСсылка)
	|	И Запасы.ДокументПродажи <> НЕОПРЕДЕЛЕНО
	|СГРУППИРОВАТЬ ПО
	|	Запасы.Период,
	|	ВЫБОР
	|		КОГДА КОНЕЦПЕРИОДА(Запасы.ДокументПродажи.Дата, МЕСЯЦ) < КОНЕЦПЕРИОДА(Запасы.Период, МЕСЯЦ)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	Запасы.Организация,
	|	Запасы.СтруктурнаяЕдиница,
	|	Запасы.СчетУчета,
	|	Запасы.Номенклатура,
	|	Запасы.Характеристика,
	|	Запасы.Партия,
	|	Запасы.ЗаказПокупателя,
	|	Запасы.ЗаказНаПроизводство,
	|	Запасы.ЗаказПродажи,
	|	Запасы.СтавкаНДС,
	|	Запасы.ДокументПродажи,
	|	Запасы.Подразделение,
	|	Запасы.КоррСчетУчета,
	|	Запасы.Ответственный,
	|	Запасы.ЗаказПродажи.УчетПотребностиПоСкладам
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументПродажи,
	|	Номенклатура,
	|	Характеристика,
	|	Партия,
	|	ЗаказПродажи,
	|	СчетУчета,
	|	СтавкаНДС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Запасы.Номенклатура КАК Номенклатура,
	|	Запасы.Характеристика КАК Характеристика,
	|	Запасы.Партия КАК Партия,
	|	Запасы.ЗаказПродажи КАК ЗаказПродажи,
	|	Запасы.ДокументПродажи КАК ДокументПродажи,
	|	Запасы.СчетУчета КАК СчетУчета,
	|	Запасы.СтавкаНДС КАК СтавкаНДС,
	|	Запасы.Количество КАК Количество,
	|	Запасы.СуммаБезНДС КАК СуммаБезНДС,
	|	Запасы.Сумма КАК Сумма
	|ПОМЕСТИТЬ Продажи
	|ИЗ
	|	РегистрНакопления.Запасы КАК Запасы
	|ГДЕ
	|	Запасы.Организация = &Организация
	|	И Запасы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И НЕ Запасы.Возврат
	|	И Запасы.КоррСчетУчета = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПустаяСсылка)
	|	И Запасы.ДокументПродажи В
	|		(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|			ВтВозвраты.ДокументПродажи КАК ДокументПродажи
	|		ИЗ
	|			ВтВозвраты)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументПродажи,
	|	Номенклатура,
	|	Характеристика,
	|	Партия,
	|	ЗаказПродажи,
	|	СчетУчета,
	|	СтавкаНДС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаВозвратов.Период КАК Период,
	|	ИСТИНА КАК Возврат,
	|	&Организация КАК Организация,
	|	ТаблицаВозвратов.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ТаблицаВозвратов.СчетУчета КАК СчетУчета,
	|	ТаблицаВозвратов.Номенклатура КАК Номенклатура,
	|	ТаблицаВозвратов.Номенклатура.НаправлениеДеятельности КАК НаправлениеДеятельностиПродажи,
	|	ТаблицаВозвратов.Номенклатура.НаправлениеДеятельности.СчетУчетаСебестоимостиПродаж КАК
	|		НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродаж,
	|	ТаблицаВозвратов.Характеристика КАК Характеристика,
	|	ТаблицаВозвратов.Партия КАК Партия,
	|	ТаблицаВозвратов.ЗаказПокупателя КАК ЗаказПокупателя,
	|	ТаблицаВозвратов.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
	|	ТаблицаВозвратов.ЗаказПродажи КАК ЗаказПродажи,
	|	ТаблицаВозвратов.УчетПотребностиПоСкладам КАК УчетПотребностиПоСкладам,
	|	ТаблицаВозвратов.Количество КАК КоличествоВозвратов,
	|	ТаблицаВозвратов.СуммаБезНДС КАК СуммаБезНДСВозвратов,
	|	ТаблицаВозвратов.Сумма КАК СуммаВозвратов,
	|	ТаблицаВозвратов.ДокументПродажи КАК ДокументПродажи,
	|	ТаблицаВозвратов.Подразделение КАК Подразделение,
	|	ТаблицаВозвратов.СтавкаНДС КАК СтавкаНДС,
	|	ТаблицаВозвратов.Ответственный КАК Ответственный,
	|	ТаблицаВозвратов.ЭтоВозвратПрошлогоПериода КАК ЭтоВозвратПрошлогоПериода,
	|	ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПустаяСсылка) КАК КоррСчетУчета,
	|	СУММА(ТаблицаПродажи.Количество) КАК КоличествоПродаж,
	|	СУММА(ТаблицаПродажи.СуммаБезНДС) КАК СуммаБезНДСПродаж,
	|	СУММА(ТаблицаПродажи.Сумма) КАК СуммаПродаж
	|ПОМЕСТИТЬ ВозвратыПоПродажам
	|ИЗ
	|	ВтВозвраты КАК ТаблицаВозвратов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Продажи КАК ТаблицаПродажи
	|		ПО ТаблицаВозвратов.Номенклатура = ТаблицаПродажи.Номенклатура
	|		И ТаблицаВозвратов.Характеристика = ТаблицаПродажи.Характеристика
	|		И ТаблицаВозвратов.Партия = ТаблицаПродажи.Партия
	|		И ТаблицаВозвратов.ЗаказПродажи = ТаблицаПродажи.ЗаказПродажи
	|		И ТаблицаВозвратов.ДокументПродажи = ТаблицаПродажи.ДокументПродажи
	|		И ТаблицаВозвратов.СчетУчета = ТаблицаПродажи.СчетУчета
	|		И ТаблицаВозвратов.СтавкаНДС = ТаблицаПродажи.СтавкаНДС
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаВозвратов.Период,
	|	ТаблицаВозвратов.СтруктурнаяЕдиница,
	|	ТаблицаВозвратов.СчетУчета,
	|	ТаблицаВозвратов.Номенклатура,
	|	ТаблицаВозвратов.Характеристика,
	|	ТаблицаВозвратов.Партия,
	|	ТаблицаВозвратов.ЗаказПокупателя,
	|	ТаблицаВозвратов.ЗаказНаПроизводство,
	|	ТаблицаВозвратов.ЗаказПродажи,
	|	ТаблицаВозвратов.УчетПотребностиПоСкладам,
	|	ТаблицаВозвратов.Количество,
	|	ТаблицаВозвратов.СуммаБезНДС,
	|	ТаблицаВозвратов.Сумма,
	|	ТаблицаВозвратов.ДокументПродажи,
	|	ТаблицаВозвратов.Подразделение,
	|	ТаблицаВозвратов.СтавкаНДС,
	|	ТаблицаВозвратов.Ответственный,
	|	ТаблицаВозвратов.ЭтоВозвратПрошлогоПериода,
	|	ТаблицаВозвратов.Номенклатура.НаправлениеДеятельности,
	|	ТаблицаВозвратов.Номенклатура.НаправлениеДеятельности.СчетУчетаСебестоимостиПродаж,
	|	ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПустаяСсылка)
	|ИМЕЮЩИЕ
	|	ВЫРАЗИТЬ(СУММА(ТаблицаПродажи.Сумма) - ТаблицаВозвратов.Сумма КАК ЧИСЛО(15, 2)) <> 0";
	
	Если ОкончательныйРасчет Тогда
		ТекстЗапроса = ТекстЗапроса + ОбщегоНазначения.РазделительПакетаЗапросов();
		ТекстЗапроса = ТекстЗапроса +
		"ВЫБРАТЬ
		|	ТаблицаВозвратов.Период КАК Период,
		|	ТаблицаВозвратов.Возврат КАК Возврат,
		|	ТаблицаВозвратов.Организация КАК Организация,
		|	ТаблицаВозвратов.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	ТаблицаВозвратов.СчетУчета КАК СчетУчета,
		|	ТаблицаВозвратов.Номенклатура КАК Номенклатура,
		|	ТаблицаВозвратов.НаправлениеДеятельностиПродажи КАК НаправлениеДеятельностиПродажи,
		|	ТаблицаВозвратов.НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродаж КАК
		|		НаправлениеДеятельностиПродажиСчетУчетаСебестоимостиПродаж,
		|	ТаблицаВозвратов.Характеристика КАК Характеристика,
		|	ТаблицаВозвратов.Партия КАК Партия,
		|	ТаблицаВозвратов.ЗаказПокупателя КАК ЗаказПокупателя,
		|	ТаблицаВозвратов.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
		|	ТаблицаВозвратов.ЗаказПродажи КАК ЗаказПродажи,
		|	ТаблицаВозвратов.УчетПотребностиПоСкладам КАК УчетПотребностиПоСкладам,
		|	ТаблицаВозвратов.КоличествоВозвратов КАК КоличествоВозвратов,
		|	ТаблицаВозвратов.СуммаБезНДСВозвратов КАК СуммаБезНДСВозвратов,
		|	ТаблицаВозвратов.СуммаВозвратов КАК СуммаВозвратов,
		|	ТаблицаВозвратов.ДокументПродажи КАК ДокументПродажи,
		|	ТаблицаВозвратов.Подразделение КАК Подразделение,
		|	ТаблицаВозвратов.СтавкаНДС КАК СтавкаНДС,
		|	ТаблицаВозвратов.Ответственный КАК Ответственный,
		|	ТаблицаВозвратов.ЭтоВозвратПрошлогоПериода КАК ЭтоВозвратПрошлогоПериода,
		|	ТаблицаВозвратов.КоррСчетУчета КАК КоррСчетУчета,
		|	ТаблицаВозвратов.КоличествоПродаж КАК КоличествоПродаж,
		|	ТаблицаВозвратов.СуммаБезНДСПродаж КАК СуммаБезНДСПродаж,
		|	ТаблицаВозвратов.СуммаПродаж КАК СуммаПродаж
		|ИЗ
		|	ВозвратыПоПродажам КАК ТаблицаВозвратов";
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ПОМЕСТИТЬ ВозвратыПоПродажам", ""); // Сохранять во временную таблицу не требуется
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаСтоимостьВозвратовОкончательныйРасчет()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	&Организация КАК Организация,
	|	ТаблицаНоменклатуры.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ТаблицаНоменклатуры.СчетУчета КАК СчетУчета,
	|	ТаблицаНоменклатуры.Номенклатура КАК Номенклатура,
	|	ТаблицаНоменклатуры.Характеристика КАК Характеристика,
	|	ТаблицаНоменклатуры.Партия КАК Партия,
	|	ТаблицаНоменклатуры.ЗаказПокупателя КАК ЗаказПокупателя,
	|	ТаблицаНоменклатуры.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
	|	ТаблицаНоменклатуры.СуммаПродаж КАК СуммаПродаж,
	|	ТаблицаНоменклатуры.КоличествоПродаж КАК КоличествоПродаж,
	|	ТаблицаНоменклатуры.КоличествоВозвратов КАК КоличествоВозвратов,
	|	ТаблицаНоменклатуры.СуммаБезНДСВозвратов КАК СуммаБезНДСВозвратов,
	|	ТаблицаНоменклатуры.СуммаВозвратов КАК СуммаВозвратов
	|ПОМЕСТИТЬ ТаблицаНоменклатуры
	|ИЗ
	|	ВозвратыПоПродажам КАК ТаблицаНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаНоменклатуры.Организация КАК Организация,
	|	ТаблицаНоменклатуры.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ТаблицаНоменклатуры.СчетУчета КАК СчетУчета,
	|	ТаблицаНоменклатуры.Номенклатура КАК Номенклатура,
	|	ТаблицаНоменклатуры.Характеристика КАК Характеристика,
	|	ТаблицаНоменклатуры.Партия КАК Партия,
	|	ТаблицаНоменклатуры.ЗаказПокупателя КАК ЗаказПокупателя,
	|	ТаблицаНоменклатуры.ЗаказНаПроизводство КАК ЗаказНаПроизводство
	|ПОМЕСТИТЬ ТаблицаНоменклатурыСвернуто
	|ИЗ
	|	ТаблицаНоменклатуры КАК ТаблицаНоменклатуры
	|ГДЕ
	|	ТаблицаНоменклатуры.КоличествоПродаж <> 0
	|	И (ВЫРАЗИТЬ(ТаблицаНоменклатуры.СуммаВозвратов - ТаблицаНоменклатуры.СуммаПродаж * ТаблицаНоменклатуры.КоличествоВозвратов / ТаблицаНоменклатуры.КоличествоПродаж КАК ЧИСЛО(15, 2))) <> 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаНоменклатуры.ЗаказНаПроизводство,
	|	ТаблицаНоменклатуры.Партия,
	|	ТаблицаНоменклатуры.ЗаказПокупателя,
	|	ТаблицаНоменклатуры.Организация,
	|	ТаблицаНоменклатуры.СчетУчета,
	|	ТаблицаНоменклатуры.Номенклатура,
	|	ТаблицаНоменклатуры.Характеристика,
	|	ТаблицаНоменклатуры.СтруктурнаяЕдиница
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗапасыОстатки.Организация КАК Организация,
	|	ЗапасыОстатки.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ЗапасыОстатки.СчетУчета КАК СчетУчета,
	|	ЗапасыОстатки.Номенклатура КАК Номенклатура,
	|	ЗапасыОстатки.Характеристика КАК Характеристика,
	|	ЗапасыОстатки.Партия КАК Партия,
	|	ЗапасыОстатки.ЗаказПокупателя КАК ЗаказПокупателя,
	|	ЗапасыОстатки.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
	|	ЗапасыОстатки.КоличествоОстаток КАК Остаток
	|ИЗ
	|	РегистрНакопления.Запасы.Остатки(
	|			&ГраницаДатаКон,
	|			(Организация, СтруктурнаяЕдиница, СчетУчета, Номенклатура, Характеристика, Партия, ЗаказПокупателя, ЗаказНаПроизводство) В
	|				(ВЫБРАТЬ
	|					ТаблицаНоменклатурыСвернуто.Организация КАК Организация,
	|					ТаблицаНоменклатурыСвернуто.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|					ТаблицаНоменклатурыСвернуто.СчетУчета КАК СчетУчета,
	|					ТаблицаНоменклатурыСвернуто.Номенклатура КАК Номенклатура,
	|					ТаблицаНоменклатурыСвернуто.Характеристика КАК Характеристика,
	|					ТаблицаНоменклатурыСвернуто.Партия КАК Партия,
	|					ТаблицаНоменклатурыСвернуто.ЗаказПокупателя КАК ЗаказПокупателя,
	|					ТаблицаНоменклатурыСвернуто.ЗаказНаПроизводство КАК ЗаказНаПроизводство
	|				ИЗ
	|					ТаблицаНоменклатурыСвернуто)) КАК ЗапасыОстатки";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаУзлыКорректировкиСтоимостиСписания(МетодОценки)
	
	// Получим таблицу новых узлов, каждый узел определяется комбинацией всех
	// измерений учета. В колонку Сумма помещается средняя цена по соответствующему
	// ресурсу регистра УчетЗапасовИЗатрат по внешнему поступлению для каждого узла.
	// Эти колонки являются правыми частями в системе линейных уравнений. В колонки
	// Количество помещается общее количество поступления в каждый узел. Если по
	// данному узлу движений по количеству не было, а были только движения по
	// стоимости, значит вместо количества используется стоимость (узел
	// соответствует не материальным расходам). Если из узла было списание по
	// фиксированной стоимости то уменьшаем количество и стоимость поступления в
	// данный узел на количество и стоимость по фиксированной операции.
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	УчетЗатратДляРасчетов.Организация КАК Организация,
	|	УчетЗатратДляРасчетов.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	УчетЗатратДляРасчетов.СчетУчета КАК СчетУчета,
	|	УчетЗатратДляРасчетов.Номенклатура КАК Номенклатура,
	|	УчетЗатратДляРасчетов.Характеристика КАК Характеристика,
	|	УчетЗатратДляРасчетов.Партия КАК Партия,
	|	УчетЗатратДляРасчетов.ЗаказПокупателя КАК ЗаказПокупателя,
	|	УчетЗатратДляРасчетов.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
	|	ВЫБОР
	|		КОГДА СУММА(ВложенныйЗапрос.Количество) = 0
	|			ТОГДА СУММА(ВложенныйЗапрос.СуммаДляКоличества)
	|		ИНАЧЕ СУММА(ВложенныйЗапрос.Количество)
	|	КОНЕЦ КАК Количество,
	|	ВЫБОР
	|		КОГДА СУММА(ВложенныйЗапрос.Количество) = 0
	|				И СУММА(ВложенныйЗапрос.СуммаБезНДСДляКоличества) = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(СУММА(ВложенныйЗапрос.СуммаБезНДС) / ВЫБОР
	|					КОГДА СУММА(ВложенныйЗапрос.Количество) = 0
	|						ТОГДА СУММА(ВложенныйЗапрос.СуммаБезНДСДляКоличества)
	|					ИНАЧЕ СУММА(ВложенныйЗапрос.Количество)
	|				КОНЕЦ КАК ЧИСЛО(23, 10))
	|	КОНЕЦ КАК СуммаБезНДС,
	|	ВЫБОР
	|		КОГДА СУММА(ВложенныйЗапрос.Количество) = 0
	|				И СУММА(ВложенныйЗапрос.СуммаДляКоличества) = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(СУММА(ВложенныйЗапрос.Сумма) / ВЫБОР
	|					КОГДА СУММА(ВложенныйЗапрос.Количество) = 0
	|						ТОГДА СУММА(ВложенныйЗапрос.СуммаДляКоличества)
	|					ИНАЧЕ СУММА(ВложенныйЗапрос.Количество)
	|				КОНЕЦ КАК ЧИСЛО(23, 10))
	|	КОНЕЦ КАК Сумма,
	|	ВЫБОР
	|		КОГДА СУММА(ВложенныйЗапрос.Количество) = 0
	|				И СУММА(ВложенныйЗапрос.СуммаИнтДляКоличества) = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(СУММА(ВложенныйЗапрос.СуммаИнт) / ВЫБОР
	|					КОГДА СУММА(ВложенныйЗапрос.Количество) = 0
	|						ТОГДА СУММА(ВложенныйЗапрос.СуммаИнтДляКоличества)
	|					ИНАЧЕ СУММА(ВложенныйЗапрос.Количество)
	|				КОНЕЦ КАК ЧИСЛО(23, 10))
	|	КОНЕЦ КАК СуммаИнт,
	|	ВЫБОР
	|		КОГДА СУММА(ВложенныйЗапрос.Количество) = 0
	|				И СУММА(ВложенныйЗапрос.СуммаБезНДСИнтДляКоличества) = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(СУММА(ВложенныйЗапрос.СуммаБезНДСИнт) / ВЫБОР
	|					КОГДА СУММА(ВложенныйЗапрос.Количество) = 0
	|						ТОГДА СУММА(ВложенныйЗапрос.СуммаБезНДСИнтДляКоличества)
	|					ИНАЧЕ СУММА(ВложенныйЗапрос.Количество)
	|				КОНЕЦ КАК ЧИСЛО(23, 10))
	|	КОНЕЦ КАК СуммаБезНДСИнт
	|ПОМЕСТИТЬ ТаблицаУзлыКорректировкиСтоимостиСписания
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		УчетЗатрат.Организация КАК Организация,
	|		УчетЗатрат.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|		УчетЗатрат.СчетУчета КАК СчетУчета,
	|		УчетЗатрат.Номенклатура КАК Номенклатура,
	|		УчетЗатрат.Характеристика КАК Характеристика,
	|		УчетЗатрат.Партия КАК Партия,
	|		УчетЗатрат.ЗаказПокупателя КАК ЗаказПокупателя,
	|		УчетЗатрат.ЗаказНаПроизводство КАК ЗаказНаПроизводство
	|	ИЗ
	|		РегистрНакопления.Запасы КАК УчетЗатрат
	|	ГДЕ
	|		УчетЗатрат.Период МЕЖДУ &ДатаНач И &ДатаКон
	|		И УчетЗатрат.Организация = &Организация
	|		И (УчетЗатрат.Количество <> 0
	|				ИЛИ УчетЗатрат.Сумма <> 0)) КАК УчетЗатратДляРасчетов
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			УчетЗатрат.Организация КАК Организация,
	|			УчетЗатрат.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|			УчетЗатрат.СчетУчета КАК СчетУчета,
	|			УчетЗатрат.Номенклатура КАК Номенклатура,
	|			УчетЗатрат.Характеристика КАК Характеристика,
	|			УчетЗатрат.Партия КАК Партия,
	|			УчетЗатрат.ЗаказПокупателя КАК ЗаказПокупателя,
	|			УчетЗатрат.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
	|			ВЫБОР
	|				КОГДА УчетЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|					ТОГДА УчетЗатрат.Количество
	|				ИНАЧЕ -УчетЗатрат.Количество
	|			КОНЕЦ КАК Количество,
	|			ВЫБОР
	|				КОГДА УчетЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|					ТОГДА УчетЗатрат.СуммаБезНДС
	|				ИНАЧЕ -УчетЗатрат.СуммаБезНДС
	|			КОНЕЦ КАК СуммаБезНДСДляКоличества,
	|			ВЫБОР
	|				КОГДА УчетЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|						И УчетЗатрат.ФиксированнаяСтоимость
	|					ТОГДА УчетЗатрат.СуммаБезНДС
	|				КОГДА УчетЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|						И УчетЗатрат.ФиксированнаяСтоимость
	|					ТОГДА -УчетЗатрат.СуммаБезНДС
	|				ИНАЧЕ 0
	|			КОНЕЦ КАК СуммаБезНДС,
	|			ВЫБОР
	|				КОГДА УчетЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|					ТОГДА УчетЗатрат.Сумма
	|				ИНАЧЕ -УчетЗатрат.Сумма
	|			КОНЕЦ КАК СуммаДляКоличества,
	|			ВЫБОР
	|				КОГДА УчетЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|						И УчетЗатрат.ФиксированнаяСтоимость
	|					ТОГДА УчетЗатрат.Сумма
	|				КОГДА УчетЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|						И УчетЗатрат.ФиксированнаяСтоимость
	|					ТОГДА -УчетЗатрат.Сумма
	|				ИНАЧЕ 0
	|			КОНЕЦ КАК Сумма,
	|			ВЫБОР
	|				КОГДА УчетЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|					ТОГДА УчетЗатрат.СуммаИнт
	|				ИНАЧЕ -УчетЗатрат.СуммаИнт
	|			КОНЕЦ КАК СуммаИнтДляКоличества,
	|			ВЫБОР
	|				КОГДА УчетЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|						И (УчетЗатрат.ФиксированнаяСтоимость)
	|					ТОГДА УчетЗатрат.СуммаИнт
	|				КОГДА УчетЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|						И (УчетЗатрат.ФиксированнаяСтоимость)
	|					ТОГДА -УчетЗатрат.СуммаИнт
	|				ИНАЧЕ 0
	|			КОНЕЦ КАК СуммаИнт,
	|			ВЫБОР
	|				КОГДА УчетЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|					ТОГДА УчетЗатрат.СуммаБезНДСИнт
	|				ИНАЧЕ -УчетЗатрат.СуммаБезНДСИнт
	|			КОНЕЦ КАК СуммаБезНДСИнтДляКоличества,
	|			ВЫБОР
	|				КОГДА УчетЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|						И (УчетЗатрат.ФиксированнаяСтоимость)
	|					ТОГДА УчетЗатрат.СуммаБезНДСИнт
	|				КОГДА УчетЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|						И (УчетЗатрат.ФиксированнаяСтоимость)
	|					ТОГДА -УчетЗатрат.СуммаБезНДСИнт
	|				ИНАЧЕ 0
	|			КОНЕЦ КАК СуммаБезНДСИнт
	|		ИЗ
	|			РегистрНакопления.Запасы КАК УчетЗатрат
	|		ГДЕ
	|			УчетЗатрат.Период МЕЖДУ &ДатаНач И &ДатаКон
	|			И (УчетЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|						И НЕ УчетЗатрат.Возврат
	|					ИЛИ УчетЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|						И УчетЗатрат.Возврат)
	|			И УчетЗатрат.Организация = &Организация
	|		
	|		ОБЪЕДИНИТЬ ВСЕ
	|		
	|		ВЫБРАТЬ
	|			УчетЗатрат.Организация,
	|			УчетЗатрат.СтруктурнаяЕдиница,
	|			УчетЗатрат.СчетУчета,
	|			УчетЗатрат.Номенклатура,
	|			УчетЗатрат.Характеристика,
	|			УчетЗатрат.Партия,
	|			УчетЗатрат.ЗаказПокупателя,
	|			УчетЗатрат.ЗаказНаПроизводство,
	|			ВЫБОР
	|				КОГДА УчетЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|					ТОГДА УчетЗатрат.Количество
	|				ИНАЧЕ 0 - УчетЗатрат.Количество
	|			КОНЕЦ,
	|			ВЫБОР
	|				КОГДА УчетЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|					ТОГДА УчетЗатрат.СуммаБезНДС
	|				ИНАЧЕ 0 - УчетЗатрат.СуммаБезНДС
	|			КОНЕЦ,
	|			ВЫБОР
	|				КОГДА УчетЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|					ТОГДА УчетЗатрат.СуммаБезНДС
	|				ИНАЧЕ 0 - УчетЗатрат.СуммаБезНДС
	|			КОНЕЦ,
	|			ВЫБОР
	|				КОГДА УчетЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|					ТОГДА УчетЗатрат.Сумма
	|				ИНАЧЕ 0 - УчетЗатрат.Сумма
	|			КОНЕЦ,
	|			ВЫБОР
	|				КОГДА УчетЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|					ТОГДА УчетЗатрат.Сумма
	|				ИНАЧЕ 0 - УчетЗатрат.Сумма
	|			КОНЕЦ,
	|			ВЫБОР
	|				КОГДА УчетЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|					ТОГДА УчетЗатрат.СуммаИнт
	|				ИНАЧЕ 0 - УчетЗатрат.СуммаИнт
	|			КОНЕЦ,
	|			ВЫБОР
	|				КОГДА УчетЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|					ТОГДА УчетЗатрат.СуммаИнт
	|				ИНАЧЕ 0 - УчетЗатрат.СуммаИнт
	|			КОНЕЦ,
	|			ВЫБОР
	|				КОГДА УчетЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|					ТОГДА УчетЗатрат.СуммаБезНДСИнт
	|				ИНАЧЕ 0 - УчетЗатрат.СуммаБезНДСИнт
	|			КОНЕЦ,
	|			ВЫБОР
	|				КОГДА УчетЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|					ТОГДА УчетЗатрат.СуммаБезНДСИнт
	|				ИНАЧЕ 0 - УчетЗатрат.СуммаБезНДСИнт
	|			КОНЕЦ
	|		ИЗ
	|			РегистрНакопления.Запасы КАК УчетЗатрат
	|		ГДЕ
	|			УчетЗатрат.Период МЕЖДУ &ДатаНач И &ДатаКон
	|			И (УчетЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|						И НЕ УчетЗатрат.Возврат
	|					ИЛИ УчетЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|						И УчетЗатрат.Возврат)
	|			И УчетЗатрат.ФиксированнаяСтоимость
	|			И УчетЗатрат.Организация = &Организация
	|		
	|		ОБЪЕДИНИТЬ ВСЕ
	|		
	|		ВЫБРАТЬ
	|			УчетЗатратОстатки.Организация,
	|			УчетЗатратОстатки.СтруктурнаяЕдиница,
	|			УчетЗатратОстатки.СчетУчета,
	|			УчетЗатратОстатки.Номенклатура,
	|			УчетЗатратОстатки.Характеристика,
	|			УчетЗатратОстатки.Партия,
	|			УчетЗатратОстатки.ЗаказПокупателя,
	|			УчетЗатратОстатки.ЗаказНаПроизводство,
	|			УчетЗатратОстатки.КоличествоОстаток,
	|			УчетЗатратОстатки.СуммаБезНДСОстаток,
	|			УчетЗатратОстатки.СуммаБезНДСОстаток,
	|			УчетЗатратОстатки.СуммаОстаток,
	|			УчетЗатратОстатки.СуммаОстаток,
	|			УчетЗатратОстатки.СуммаИнтОстаток,
	|			УчетЗатратОстатки.СуммаИнтОстаток,
	|			УчетЗатратОстатки.СуммаБезНДСИнтОстаток,
	|			УчетЗатратОстатки.СуммаБезНДСИнтОстаток
	|		ИЗ
	|			РегистрНакопления.Запасы.Остатки(&ДатаНач, Организация = &Организация) КАК УчетЗатратОстатки) КАК ВложенныйЗапрос
	|		ПО УчетЗатратДляРасчетов.Организация = ВложенныйЗапрос.Организация
	|			И УчетЗатратДляРасчетов.СтруктурнаяЕдиница = ВложенныйЗапрос.СтруктурнаяЕдиница
	|			И УчетЗатратДляРасчетов.СчетУчета = ВложенныйЗапрос.СчетУчета
	|			И УчетЗатратДляРасчетов.Номенклатура = ВложенныйЗапрос.Номенклатура
	|			И УчетЗатратДляРасчетов.Характеристика = ВложенныйЗапрос.Характеристика
	|			И УчетЗатратДляРасчетов.Партия = ВложенныйЗапрос.Партия
	|			И УчетЗатратДляРасчетов.ЗаказПокупателя = ВложенныйЗапрос.ЗаказПокупателя
	|			И УчетЗатратДляРасчетов.ЗаказНаПроизводство = ВложенныйЗапрос.ЗаказНаПроизводство
	|ГДЕ
	|	&УсловиеПоМетодуОценкки
	|
	|СГРУППИРОВАТЬ ПО
	|	УчетЗатратДляРасчетов.Организация,
	|	УчетЗатратДляРасчетов.СтруктурнаяЕдиница,
	|	УчетЗатратДляРасчетов.СчетУчета,
	|	УчетЗатратДляРасчетов.Номенклатура,
	|	УчетЗатратДляРасчетов.Характеристика,
	|	УчетЗатратДляРасчетов.Партия,
	|	УчетЗатратДляРасчетов.ЗаказПокупателя,
	|	УчетЗатратДляРасчетов.ЗаказНаПроизводство";
	
	Если МетодОценки = Перечисления.МетодОценкиЗапасов.FIFO Тогда
		УсловиеПоМетодуОценки = "УчетЗатратДляРасчетов.Номенклатура.МетодОценки = ЗНАЧЕНИЕ(Перечисление.МетодОценкиЗапасов.FIFO)";
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ПОМЕСТИТЬ ТаблицаУзлыКорректировкиСтоимостиСписания", "");
		УсловиеПоМетодуОценки = "(УчетЗатратДляРасчетов.Номенклатура.МетодОценки = ЗНАЧЕНИЕ(Перечисление.МетодОценкиЗапасов.ПоСредней)
			|			ИЛИ УчетЗатратДляРасчетов.Номенклатура.МетодОценки = ЗНАЧЕНИЕ(Перечисление.МетодОценкиЗапасов.ПустаяСсылка)
			|			ИЛИ УчетЗатратДляРасчетов.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка))";
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеПоМетодуОценкки", УсловиеПоМетодуОценки);
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстОбъединитьВсе()
	
	Возврат "
	|	ОБЪЕДИНИТЬ ВСЕ
	|";
	
КонецФункции

#КонецОбласти

#Область РаспределениеЗатрат

Процедура РаспределитьЗатраты()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	УчетЗапасовИЗатрат.Организация КАК Организация,
	|	УчетЗапасовИЗатрат.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	УчетЗапасовИЗатрат.СчетУчета КАК СчетУчета,
	|	УчетЗапасовИЗатрат.СчетУчета.ТипСчета КАК СчетУчетаТипСчета,
	|	УчетЗапасовИЗатрат.СчетУчета.СпособРаспределения КАК СчетУчетаСпособРаспределения,
	|	УчетЗапасовИЗатрат.СчетУчета.СчетЗакрытия КАК СчетУчетаСчетЗакрытия,
	|	УчетЗапасовИЗатрат.СчетУчета.СчетЗакрытия.ТипСчета КАК СчетУчетаСчетЗакрытияТипСчета,
	|	УчетЗапасовИЗатрат.Номенклатура КАК Номенклатура,
	|	УчетЗапасовИЗатрат.Характеристика КАК Характеристика,
	|	УчетЗапасовИЗатрат.Партия КАК Партия,
	|	УчетЗапасовИЗатрат.ЗаказПокупателя КАК ЗаказПокупателя,
	|	УчетЗапасовИЗатрат.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
	|	УчетЗапасовИЗатрат.СуммаБезНДСОстаток КАК СуммаБезНДС,
	|	УчетЗапасовИЗатрат.СуммаОстаток КАК Сумма
	|ИЗ
	|	РегистрНакопления.Запасы.Остатки(
	|			&ДатаОкончания,
	|			Организация = &Организация
	|				И СчетУчета.СпособРаспределения <> ЗНАЧЕНИЕ(Перечисление.БазыРаспределенияРасходов.НеРаспределять)
	|				И (СчетУчета.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.КосвенныеЗатраты)
	|					ИЛИ СчетУчета.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.НезавершенноеПроизводство)
	|						И Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка))) КАК УчетЗапасовИЗатрат
	|
	|УПОРЯДОЧИТЬ ПО
	|	СчетУчетаСпособРаспределения,
	|	СтруктурнаяЕдиница,
	|	ЗаказПокупателя,
	|	ЗаказНаПроизводство
	|ИТОГИ
	|	СУММА(Сумма),
	|	СУММА(СуммаБезНДС)
	|ПО
	|	СчетУчетаСпособРаспределения,
	|	СтруктурнаяЕдиница,
	|	ЗаказПокупателя";
	
	Запрос.УстановитьПараметр("Организация",   ДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("ДатаОкончания", ДополнительныеСвойства.ДляПроведения.КонечнаяГраницаПериода);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	// Создадим наборы записей
	НаборЗаписейЗапасы = РегистрыНакопления.Запасы.СоздатьНаборЗаписей();
	НаборЗаписейЗапасы.Отбор.Регистратор.Установить(ДополнительныеСвойства.ДляПроведения.Ссылка);
	НаборЗаписейУправленческий = РегистрыБухгалтерии.Управленческий.СоздатьНаборЗаписей();
	НаборЗаписейУправленческий.Отбор.Регистратор.Установить(Ссылка);
	
	ТаблицыБазы = СформироватьОбщиеТаблицыБазыРаспределения();
	
	ОбходПоСпособРаспределения = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ОбходПоСпособРаспределения.Следующий() Цикл
		
		ОбходПоСтруктурнаяЕдиница = ОбходПоСпособРаспределения.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		// Обход по подразделениям.
		Пока ОбходПоСтруктурнаяЕдиница.Следующий() Цикл
			
			ФильтрПоСтруктурнаяЕдиница = ОбходПоСтруктурнаяЕдиница.СтруктурнаяЕдиница;
			ОбходПоЗаказ = ОбходПоСтруктурнаяЕдиница.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			// Обход по заказам.
			Пока ОбходПоЗаказ.Следующий() Цикл
				
				ФильтрПоЗаказ = ОбходПоЗаказ.ЗаказПокупателя;
				
				Если ОбходПоЗаказ.СчетУчетаСпособРаспределения = Перечисления.БазыРаспределенияРасходов.НеРаспределять Тогда
					Продолжить;
				КонецЕсли;
				
				ОбходПоСчетамУчета = ОбходПоЗаказ.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				
				// Обход по счетам затрат.
				Пока ОбходПоСчетамУчета.Следующий() Цикл
					
					СпособРаспределения = ОбходПоСчетамУчета.СчетУчетаСпособРаспределения;
					СчетУчета = ОбходПоСчетамУчета.СчетУчета;
					
					ПараметрыПоиска = Новый Структура;
					ПараметрыПоиска.Вставить("СтруктурнаяЕдиница", ФильтрПоСтруктурнаяЕдиница);
					ПараметрыПоиска.Вставить("ЗаказПокупателяОтбор", ФильтрПоЗаказ);
					ТаблицаБазы = ВыделитьБазуРаспределенияЗатрат(ТаблицыБазы, СпособРаспределения, СчетУчета, ПараметрыПоиска);
					
					Если ТаблицаБазы.Количество() = 0 Тогда
						ПараметрыПоиска = Новый Структура;
						ПараметрыПоиска.Вставить("ЗаказПокупателяОтбор", ФильтрПоЗаказ);
						ТаблицаБазы = ВыделитьБазуРаспределенияЗатрат(ТаблицыБазы, СпособРаспределения, СчетУчета, ПараметрыПоиска);
					КонецЕсли;
				
					// Проверим таблицу базы распределения.
					Если ТаблицаБазы.Количество() = 0 Тогда
						ОписаниеОшибки = СформироватьОписаниеОшибкиРаспределенияЗатрат(
																		ОбходПоСчетамУчета.СчетУчета,
																		ОбходПоСчетамУчета.СчетУчетаСпособРаспределения,
																		ФильтрПоЗаказ,
																		ОбходПоСчетамУчета.Сумма);
						ДобавитьОшибкуВТаблицу(ОписаниеОшибки, "РаспределениеЗатрат", ФильтрПоЗаказ);
						
						Продолжить;
						
					КонецЕсли;
					
					ВсегоБазаРаспределения = ТаблицаБазы.Итог("База");
					ВсегоБазаРаспределенияБезНДС = ТаблицаБазы.Итог("БазаБезНДС");
					КоличествоНаправлений  = ТаблицаБазы.Количество() - 1;
					
					Если ВсегоБазаРаспределения = 0 Тогда
						Продолжить;
					КонецЕсли;
					
					// Распределяем сумму.
					Если ОбходПоСчетамУчета.Сумма <> 0 ИЛИ ОбходПоСчетамУчета.СуммаБезНДС <> 0 Тогда
						
						СуммаКРаспределению = ОбходПоСчетамУчета.Сумма;
						СуммаРаспределили = 0;
					
						СуммаБезНДСКРаспределению = ОбходПоСчетамУчета.СуммаБезНДС;
						СуммаБезНДСРаспределили = 0;
					
						Для каждого НаправлениеРаспределения Из ТаблицаБазы Цикл
							
							СуммаЗатрат = ?(СуммаКРаспределению = 0, 0, Окр(НаправлениеРаспределения.База / ВсегоБазаРаспределения * СуммаКРаспределению, 2, 1));
							СуммаРаспределили = СуммаРаспределили + СуммаЗатрат;
							
							СуммаБезНДСЗатрат = ?(СуммаБезНДСКРаспределению = 0 Или ВсегоБазаРаспределенияБезНДС = 0,
							0,
							Окр(НаправлениеРаспределения.База / ВсегоБазаРаспределенияБезНДС * СуммаБезНДСКРаспределению, 2, 1));
							
							СуммаБезНДСРаспределили = СуммаБезНДСРаспределили + СуммаБезНДСЗатрат;
							
							// Если это последняя строка - скорректируем сумму в ней на ошибку округления.
							Если ТаблицаБазы.Индекс(НаправлениеРаспределения) = КоличествоНаправлений Тогда
								СуммаЗатрат = СуммаЗатрат + СуммаКРаспределению - СуммаРаспределили;
								СуммаРаспределили = СуммаКРаспределению;
								
								СуммаБезНДСЗатрат = СуммаБезНДСЗатрат + СуммаБезНДСКРаспределению - СуммаБезНДСРаспределили;
								СуммаБезНДСРаспределили = СуммаБезНДСКРаспределению;
							КонецЕсли;
							
							СуммыКорректировкиСтруктура = Новый Структура();
							СуммыКорректировкиСтруктура.Вставить("СуммаКорректировки", СуммаЗатрат);
							СуммыКорректировкиСтруктура.Вставить("СуммаКорректировкиБезНДС", СуммаБезНДСЗатрат);
							
							Если СуммаЗатрат <> 0 ИЛИ СуммаБезНДСЗатрат <> 0 Тогда
								
								Если ОбходПоСчетамУчета.СчетУчетаТипСчета = Перечисления.ТипыСчетов.КосвенныеЗатраты Тогда // косвенные распределяются через счет закрытия
								
									СтрокаДвижения = Новый Структура;
									СтрокаДвижения.Вставить("Организация"             , ОбходПоСчетамУчета.Организация);
									СтрокаДвижения.Вставить("СтруктурнаяЕдиница"      , ОбходПоСчетамУчета.СтруктурнаяЕдиница);
									СтрокаДвижения.Вставить("СчетУчета"               , ОбходПоСчетамУчета.СчетУчета);
									СтрокаДвижения.Вставить("СчетУчетаТипСчета"       , ОбходПоСчетамУчета.СчетУчетаТипСчета);
									СтрокаДвижения.Вставить("Номенклатура"            , ОбходПоСчетамУчета.Номенклатура);
									СтрокаДвижения.Вставить("Характеристика"          , ОбходПоСчетамУчета.Характеристика);
									СтрокаДвижения.Вставить("Партия"                  , ОбходПоСчетамУчета.Партия);
									СтрокаДвижения.Вставить("ЗаказПокупателя"         , ОбходПоСчетамУчета.ЗаказПокупателя);
									СтрокаДвижения.Вставить("ЗаказНаПроизводство"     , ОбходПоСчетамУчета.ЗаказНаПроизводство);
									СтрокаДвижения.Вставить("КоррСтруктурнаяЕдиница"  , НаправлениеРаспределения.СтруктурнаяЕдиница);
									СтрокаДвижения.Вставить("КоррСчетУчета"           , ОбходПоСчетамУчета.СчетУчетаСчетЗакрытия);
									СтрокаДвижения.Вставить("КоррСчетУчетаТипСчета"   , ОбходПоСчетамУчета.СчетУчетаСчетЗакрытияТипСчета);
									СтрокаДвижения.Вставить("КоррНоменклатура"        , Справочники.Номенклатура.ПустаяСсылка());
									СтрокаДвижения.Вставить("КоррХарактеристика"      , Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка());
									СтрокаДвижения.Вставить("КоррПартия"              , Справочники.ПартииНоменклатуры.ПустаяСсылка());
									СтрокаДвижения.Вставить("КоррЗаказПокупателя"     , Документы.ЗаказПокупателя.ПустаяСсылка());
									СтрокаДвижения.Вставить("КоррЗаказНаПроизводство" , Документы.ЗаказНаПроизводство.ПустаяСсылка());
									СтрокаДвижения.Вставить("ДокументПродажи"         , Неопределено);
									СтрокаДвижения.Вставить("ЗатратыНаВыпуск"         , Ложь);
									СтрокаДвижения.Вставить("Спецификация"            , Справочники.Спецификации.ПустаяСсылка());
									СтрокаДвижения.Вставить("КоррСпецификация"        , Справочники.Спецификации.ПустаяСсылка());
									СтрокаДвижения.Вставить("СтавкаНДС"               , Справочники.СтавкиНДС.ПустаяСсылка());
									
									// Движения по регистру Учет запасов и затрат.
									СформироватьДвиженияПоРегиструУчетаЗатрат(
										НаборЗаписейЗапасы,
										НаборЗаписейУправленческий,
										СтрокаДвижения,
										СуммыКорректировкиСтруктура,
										Истина);
									
									Если ЗначениеЗаполнено(НаправлениеРаспределения.Номенклатура) Тогда
										
										СтрокаДвижения = Новый Структура;
										СтрокаДвижения.Вставить("Организация"             , ОбходПоСчетамУчета.Организация);
										СтрокаДвижения.Вставить("СтруктурнаяЕдиница"      , НаправлениеРаспределения.СтруктурнаяЕдиница);
										СтрокаДвижения.Вставить("СчетУчета"               , ОбходПоСчетамУчета.СчетУчетаСчетЗакрытия);
										СтрокаДвижения.Вставить("СчетУчетаТипСчета"       , ОбходПоСчетамУчета.СчетУчетаСчетЗакрытияТипСчета);
										СтрокаДвижения.Вставить("Номенклатура"            , Справочники.Номенклатура.ПустаяСсылка());
										СтрокаДвижения.Вставить("Характеристика"          , Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка());
										СтрокаДвижения.Вставить("Партия"                  , Справочники.ПартииНоменклатуры.ПустаяСсылка());
										СтрокаДвижения.Вставить("ЗаказПокупателя"         , Документы.ЗаказПокупателя.ПустаяСсылка());
										СтрокаДвижения.Вставить("ЗаказНаПроизводство"     , Документы.ЗаказНаПроизводство.ПустаяСсылка());
										СтрокаДвижения.Вставить("КоррСтруктурнаяЕдиница"  , НаправлениеРаспределения.СтруктурнаяЕдиница);
										СтрокаДвижения.Вставить("КоррСчетУчета"           , НаправлениеРаспределения.СчетУчета);
										СтрокаДвижения.Вставить("КоррСчетУчетаТипСчета"   , НаправлениеРаспределения.СчетУчетаТипСчета);
										СтрокаДвижения.Вставить("КоррНоменклатура"        , НаправлениеРаспределения.Номенклатура);
										СтрокаДвижения.Вставить("КоррХарактеристика"      , НаправлениеРаспределения.Характеристика);
										СтрокаДвижения.Вставить("КоррПартия"              , НаправлениеРаспределения.Партия);
										СтрокаДвижения.Вставить("КоррЗаказПокупателя"     , НаправлениеРаспределения.ЗаказПокупателя);
										СтрокаДвижения.Вставить("КоррЗаказНаПроизводство" , Документы.ЗаказНаПроизводство.ПустаяСсылка());
										СтрокаДвижения.Вставить("ДокументПродажи"         , Неопределено);
										СтрокаДвижения.Вставить("ЗатратыНаВыпуск"         , Истина);
										СтрокаДвижения.Вставить("Спецификация"            , Справочники.Спецификации.ПустаяСсылка());
										СтрокаДвижения.Вставить("КоррСпецификация"        , НаправлениеРаспределения.Спецификация);
										СтрокаДвижения.Вставить("СтавкаНДС"               , Справочники.СтавкиНДС.ПустаяСсылка());
									
										// Движения по регистру Учет запасов и затрат.
										СформироватьДвиженияПоРегиструУчетаЗатрат(
											НаборЗаписейЗапасы,
											НаборЗаписейУправленческий,
											СтрокаДвижения,
											СуммыКорректировкиСтруктура,
											Истина);
										
									КонецЕсли;
									
								ИначеЕсли ЗначениеЗаполнено(НаправлениеРаспределения.Номенклатура) Тогда // распределение прямых
									
									СтрокаДвижения = Новый Структура;
									СтрокаДвижения.Вставить("Организация"             , ОбходПоСчетамУчета.Организация);
									СтрокаДвижения.Вставить("СтруктурнаяЕдиница"      , ОбходПоСчетамУчета.СтруктурнаяЕдиница);
									СтрокаДвижения.Вставить("СчетУчета"               , ОбходПоСчетамУчета.СчетУчета);
									СтрокаДвижения.Вставить("СчетУчетаТипСчета"       , ОбходПоСчетамУчета.СчетУчетаТипСчета);
									СтрокаДвижения.Вставить("Номенклатура"            , ОбходПоСчетамУчета.Номенклатура);
									СтрокаДвижения.Вставить("Характеристика"          , ОбходПоСчетамУчета.Характеристика);
									СтрокаДвижения.Вставить("Партия"                  , ОбходПоСчетамУчета.Партия);
									СтрокаДвижения.Вставить("ЗаказПокупателя"         , ОбходПоСчетамУчета.ЗаказПокупателя);
									СтрокаДвижения.Вставить("ЗаказНаПроизводство"     , ОбходПоСчетамУчета.ЗаказНаПроизводство);
									СтрокаДвижения.Вставить("КоррСтруктурнаяЕдиница"  , НаправлениеРаспределения.СтруктурнаяЕдиница);
									СтрокаДвижения.Вставить("КоррСчетУчета"           , НаправлениеРаспределения.СчетУчета);
									СтрокаДвижения.Вставить("КоррСчетУчетаТипСчета"   , НаправлениеРаспределения.СчетУчетаТипСчета);
									СтрокаДвижения.Вставить("КоррНоменклатура"        , НаправлениеРаспределения.Номенклатура);
									СтрокаДвижения.Вставить("КоррХарактеристика"      , НаправлениеРаспределения.Характеристика);
									СтрокаДвижения.Вставить("КоррПартия"              , НаправлениеРаспределения.Партия);
									СтрокаДвижения.Вставить("КоррЗаказПокупателя"     , НаправлениеРаспределения.ЗаказПокупателя);
									Если ТаблицаБазы.Колонки.Найти("ЗаказНаПроизводство") <> Неопределено Тогда
										СтрокаДвижения.Вставить("КоррЗаказНаПроизводство" , НаправлениеРаспределения.ЗаказНаПроизводство);
									Иначе
										СтрокаДвижения.Вставить("КоррЗаказНаПроизводство" , Документы.ЗаказНаПроизводство.ПустаяСсылка());
									КонецЕсли; 
									СтрокаДвижения.Вставить("ДокументПродажи"         , Неопределено);
									СтрокаДвижения.Вставить("ЗатратыНаВыпуск"         , Истина);
									СтрокаДвижения.Вставить("Спецификация"            , Справочники.Спецификации.ПустаяСсылка());
									СтрокаДвижения.Вставить("КоррСпецификация"        , НаправлениеРаспределения.Спецификация);
									СтрокаДвижения.Вставить("СтавкаНДС"               , Справочники.СтавкиНДС.ПустаяСсылка());
									
									// Движения по регистру Учет запасов и затрат.
									СформироватьДвиженияПоРегиструУчетаЗатрат(
										НаборЗаписейЗапасы,
										НаборЗаписейУправленческий,
										СтрокаДвижения,
										СуммыКорректировкиСтруктура,
										Истина);
									
								КонецЕсли;
								
							КонецЕсли;
							
						КонецЦикла;
						
						Если СуммаРаспределили = 0 И СуммаБезНДСРаспределили = 0 Тогда
							ОписаниеОшибки = СформироватьОписаниеОшибкиРаспределенияЗатрат(
																		ОбходПоСчетамУчета.СчетУчета,
																		ОбходПоСчетамУчета.СчетУчетаСпособРаспределения,
																		ФильтрПоЗаказ,
																		ОбходПоСчетамУчета.Сумма);
							ДобавитьОшибкуВТаблицу(ОписаниеОшибки, "РаспределениеЗатрат", ФильтрПоЗаказ);
							
							Продолжить;
							
						КонецЕсли;
						
					КонецЕсли
					
				КонецЦикла;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
	// Пишем оставшиеся записи
	НаборЗаписейЗапасы.Записать(Ложь);
	НаборЗаписейУправленческий.Записать(Ложь);
	
КонецПроцедуры

Функция СформироватьОбщиеТаблицыБазыРаспределения()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНачала",                 ДополнительныеСвойства.ДляПроведения.НачальнаяДатаПериода);
	Запрос.УстановитьПараметр("ДатаОкончания",              ДополнительныеСвойства.ДляПроведения.КонечнаяДатаПериода);
	Запрос.УстановитьПараметр("ДатаОкончанияГраница",       ДополнительныеСвойства.ДляПроведения.КонечнаяГраницаПериода);
	Запрос.УстановитьПараметр("Организация",                ДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("ИспользуетсяРезервирование", ПолучитьФункциональнуюОпцию("РезервированиеЗапасов"));

	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВыпускПродукцииОбороты.Организация КАК Организация,
		|	ВыпускПродукцииОбороты.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	ВыпускПродукцииОбороты.Номенклатура КАК Номенклатура,
		|	ВыпускПродукцииОбороты.Характеристика КАК Характеристика,
		|	ВыпускПродукцииОбороты.Партия КАК Партия,
		|	ВЫБОР
		|		КОГДА &ИспользуетсяРезервирование
		|			ТОГДА ВыпускПродукцииОбороты.ЗаказПокупателя
		|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
		|	КОНЕЦ КАК ЗаказПокупателя,
		|	ВыпускПродукцииОбороты.ЗаказПокупателя КАК ЗаказПокупателяОтбор,
		|	ВыпускПродукцииОбороты.Спецификация КАК Спецификация,
		|	ВыпускПродукцииОбороты.Номенклатура.СчетУчетаЗатрат КАК СчетУчета,
		|	ВыпускПродукцииОбороты.Номенклатура.СчетУчетаЗатрат КАК СчетУчетаОтбор,
		|	ВыпускПродукцииОбороты.Номенклатура.СчетУчетаЗатрат.ТипСчета КАК СчетУчетаТипСчета,
		|	ВыпускПродукцииОбороты.КоличествоОборот КАК БазаБезНДС,
		|	ВыпускПродукцииОбороты.КоличествоОборот КАК База
		|ПОМЕСТИТЬ БазаПоВыпуску
		|ИЗ
		|	РегистрНакопления.ВыпускПродукции.Обороты(
		|			&ДатаНачала,
		|			&ДатаОкончанияГраница,
		|			,
		|			Организация = &Организация
		|				И СтруктурнаяЕдиница.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Подразделение)
		|				И Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)) КАК ВыпускПродукцииОбороты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	УчетЗатрат.Организация КАК Организация,
		|	УчетЗатрат.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	НЕОПРЕДЕЛЕНО КАК Номенклатура,
		|	НЕОПРЕДЕЛЕНО КАК Характеристика,
		|	НЕОПРЕДЕЛЕНО КАК Партия,
		|	НЕОПРЕДЕЛЕНО КАК ЗаказПокупателя,
		|	УчетЗатрат.ЗаказПокупателя КАК ЗаказПокупателяОтбор,
		|	НЕОПРЕДЕЛЕНО КАК ЗаказНаПроизводство,
		|	НЕОПРЕДЕЛЕНО КАК Спецификация,
		|	УчетЗатрат.СчетУчета КАК СчетУчета,
		|	УчетЗатрат.СчетУчета КАК СчетУчетаОтбор,
		|	УчетЗатрат.СчетУчета.ТипСчета КАК СчетУчетаТипСчета,
		|	УчетЗатрат.СуммаБезНДСОстаток КАК БазаБезНДС,
		|	УчетЗатрат.СуммаОстаток КАК База
		|ПОМЕСТИТЬ БазаПоПрямымЗатратам
		|ИЗ
		|	РегистрНакопления.Запасы.Остатки(
		|			&ДатаОкончанияГраница,
		|			Организация = &Организация
		|				И СчетУчета.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.НезавершенноеПроизводство)) КАК УчетЗатрат
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	УчетЗатрат.Организация,
		|	УчетЗатрат.КоррСтруктурнаяЕдиница,
		|	УчетЗатрат.КоррНоменклатура,
		|	УчетЗатрат.КоррХарактеристика,
		|	УчетЗатрат.КоррПартия,
		|	УчетЗатрат.КоррЗаказПокупателя,
		|	УчетЗатрат.КоррЗаказПокупателя,
		|	УчетЗатрат.КоррЗаказНаПроизводство,
		|	УчетЗатрат.КоррСпецификация,
		|	УчетЗатрат.КоррСчетУчета,
		|	УчетЗатрат.СчетУчета,
		|	УчетЗатрат.КоррСчетУчета.ТипСчета,
		|	СУММА(УчетЗатрат.СуммаБезНДС),
		|	СУММА(УчетЗатрат.Сумма)
		|ИЗ
		|	РегистрНакопления.Запасы КАК УчетЗатрат
		|ГДЕ
		|	УчетЗатрат.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И УчетЗатрат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|	И УчетЗатрат.Организация = &Организация
		|	И УчетЗатрат.СчетУчета.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.НезавершенноеПроизводство)
		|	И УчетЗатрат.ЗатратыНаВыпуск
		|
		|СГРУППИРОВАТЬ ПО
		|	УчетЗатрат.Организация,
		|	УчетЗатрат.КоррСтруктурнаяЕдиница,
		|	УчетЗатрат.КоррНоменклатура,
		|	УчетЗатрат.КоррХарактеристика,
		|	УчетЗатрат.КоррПартия,
		|	УчетЗатрат.КоррЗаказПокупателя,
		|	УчетЗатрат.КоррЗаказНаПроизводство,
		|	УчетЗатрат.КоррСпецификация,
		|	УчетЗатрат.СчетУчета,
		|	УчетЗатрат.КоррСчетУчета,
		|	УчетЗатрат.КоррСчетУчета.ТипСчета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	УправленческийСчетаУчета.Ссылка КАК СчетУчета,
		|	УправленческийСчетаУчета.СчетУчета КАК ДоступныйСчет
		|ПОМЕСТИТЬ ФильтрыПоПрямымЗатратам
		|ИЗ
		|	ПланСчетов.Управленческий.СчетаУчета КАК УправленческийСчетаУчета";
	
	Результат = Запрос.ВыполнитьПакетСПромежуточнымиДанными();
	
	НомерТаблицыБазыПоВыпуску = 0;
	НомерТаблицыБазыПоПрямымЗатратам = 1;
	НомерТаблицыФильтров = 2;
	
	ТаблицыБазы = Новый Структура;
	ТаблицыБазы.Вставить("БазаПоВыпуску", Результат.Получить(НомерТаблицыБазыПоВыпуску).Выгрузить());
	ТаблицыБазы.Вставить("БазаПоПрямымЗатратам", Результат.Получить(НомерТаблицыБазыПоПрямымЗатратам).Выгрузить());
	ТаблицыБазы.Вставить("ФильтрыПоПрямымЗатратам", Результат.Получить(НомерТаблицыФильтров).Выгрузить());
	
	Возврат ТаблицыБазы;
	
КонецФункции

Функция ВыделитьБазуРаспределенияЗатрат(ОбщиеТаблицыБазы, СпособРаспределения, СчетУчета, ИсходныеПараметрыПоиска)
		
	Если СпособРаспределения = Перечисления.БазыРаспределенияРасходов.ОбъемВыпуска Тогда
		ИсходнаяТаблицаБазы = ОбщиеТаблицыБазы.БазаПоВыпуску;
	ИначеЕсли СпособРаспределения = Перечисления.БазыРаспределенияРасходов.ПрямыеЗатраты Тогда
		ИсходнаяТаблицаБазы = ОбщиеТаблицыБазы.БазаПоПрямымЗатратам;
	Иначе
		Возврат Новый ТаблицаЗначений;
	КонецЕсли;
	
	// Нужно оставить только те параметры поиска, у которых заполнено значение
	ПараметрыПоиска = Новый Структура;

	Для каждого КлючИЗначение Из ИсходныеПараметрыПоиска Цикл
		Если ЗначениеЗаполнено(КлючИЗначение.Значение) Тогда
			ПараметрыПоиска.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение);
		КонецЕсли;
	КонецЦикла;
	
	// База по объему выпуска фильтруется только по параметрам поиска
	Если СпособРаспределения = Перечисления.БазыРаспределенияРасходов.ОбъемВыпуска Тогда
		Если ПараметрыПоиска.Количество() = 0 Тогда
			ТаблицаБазы = ИсходнаяТаблицаБазы.Скопировать();
		Иначе
			ТаблицаБазы = ИсходнаяТаблицаБазы.Скопировать(ПараметрыПоиска);
		КонецЕсли;
	Иначе // База по объему выпуска фильтруется также и по доступным счетам
		
		ПараметрыПоиска.Вставить("СчетУчетаОтбор", Неопределено);
		
		ТаблицаБазы = ИсходнаяТаблицаБазы.СкопироватьКолонки();
		
		ДоступныеСчета = ОбщиеТаблицыБазы.ФильтрыПоПрямымЗатратам.НайтиСтроки(Новый Структура("СчетУчета", СчетУчета));
		
		Для каждого СтрокаСчета Из ДоступныеСчета Цикл
			ПараметрыПоиска.СчетУчетаОтбор = СтрокаСчета.ДоступныйСчет;
			ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ИсходнаяТаблицаБазы.Скопировать(ПараметрыПоиска), ТаблицаБазы);
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат ТаблицаБазы;
	
КонецФункции

#КонецОбласти

#Область РасчетФинансовогоРезультата

Процедура РассчитатьФинансовыйРезультат()
	
	ОсновноеНаправление = Справочники.НаправленияДеятельности.ОсновноеНаправление;
	СчетПрибылиПоОсновномуНаправлению = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОсновноеНаправление, "СчетУчетаПрибыли");
	
	// Отражаем финансовый результат по доходам и расходам, которые не нуждаются в распределении
	ОтразитьФинансовыйРезультатБезРаспределения(ОсновноеНаправление, СчетПрибылиПоОсновномуНаправлению);
		
	// Распределение по базе распределения.
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация",    ДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("ДатаНачала",     ДополнительныеСвойства.ДляПроведения.НачальнаяДатаПериода);
	Запрос.УстановитьПараметр("ДатаОкончания",  ДополнительныеСвойства.ДляПроведения.КонечнаяГраницаПериода);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДоходыИРасходыОбороты.Организация КАК Организация,
	|	ДоходыИРасходыОбороты.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ДоходыИРасходыОбороты.Проект КАК Проект,
	|	ДоходыИРасходыОбороты.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ДоходыИРасходыОбороты.НаправлениеДеятельности.СчетУчетаПрибыли КАК СчетУчетаПрибыли,
	|	ДоходыИРасходыОбороты.ЗаказПокупателя КАК Заказ,
	|	ДоходыИРасходыОбороты.СчетУчета КАК СчетУчета,
	|	ДоходыИРасходыОбороты.Аналитика КАК Аналитика,
	|	ДоходыИРасходыОбороты.СчетУчета.СпособРаспределения КАК СчетУчетаСпособРаспределения,
	|	СУММА(ДоходыИРасходыОбороты.СуммаДоходовОборот) КАК СуммаДоходов,
	|	СУММА(ДоходыИРасходыОбороты.СуммаРасходовОборот) КАК СуммаРасходов
	|ИЗ
	|	РегистрНакопления.ДоходыИРасходы.Обороты(
	|			&ДатаНачала,
	|			&ДатаОкончания,
	|			Авто,
	|			Организация = &Организация
	|				И СчетУчета.СпособРаспределения <> ЗНАЧЕНИЕ(Перечисление.БазыРаспределенияРасходов.НеРаспределять)
	|				И (НаправлениеДеятельности.СчетУчетаСебестоимостиПродаж <> СчетУчета
	|						И НаправлениеДеятельности.СчетУчетаВыручкиОтПродаж <> СчетУчета
	|					ИЛИ НаправлениеДеятельности = ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.Прочее)
	|					ИЛИ НаправлениеДеятельности = ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка))) КАК ДоходыИРасходыОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	ДоходыИРасходыОбороты.Организация,
	|	ДоходыИРасходыОбороты.СтруктурнаяЕдиница,
	|	ДоходыИРасходыОбороты.Проект,
	|	ДоходыИРасходыОбороты.НаправлениеДеятельности,
	|	ДоходыИРасходыОбороты.НаправлениеДеятельности.СчетУчетаПрибыли,
	|	ДоходыИРасходыОбороты.ЗаказПокупателя,
	|	ДоходыИРасходыОбороты.СчетУчета,
	|	ДоходыИРасходыОбороты.Аналитика,
	|	ДоходыИРасходыОбороты.СчетУчета.СпособРаспределения
	|
	|УПОРЯДОЧИТЬ ПО
	|	СчетУчетаСпособРаспределения,
	|	Проект,
	|	СтруктурнаяЕдиница,
	|	НаправлениеДеятельности,
	|	Заказ
	|ИТОГИ
	|	СУММА(СуммаДоходов),
	|	СУММА(СуммаРасходов)
	|ПО
	|	СчетУчетаСпособРаспределения,
	|	Проект,
	|	СтруктурнаяЕдиница,
	|	НаправлениеДеятельности,
	|	Заказ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ОбщаяБазаРаспределения = СформироватьОбщуюТаблицуБазыРаспределенияФинансовогоРезультата();
	
	// Создадим набор записей регистра накопления Учет запасов и затрат.
	НаборЗаписейФинансовыйРезультат = РегистрыНакопления.ФинансовыйРезультат.СоздатьНаборЗаписей();
	НаборЗаписейФинансовыйРезультат.Отбор.Регистратор.Установить(ДополнительныеСвойства.ДляПроведения.Ссылка);
	
	// Создадим набор записей регистра накопления Учет доходов и расходов.
	НаборЗаписейУправленческий = РегистрыБухгалтерии.Управленческий.СоздатьНаборЗаписей();
	НаборЗаписейУправленческий.Отбор.Регистратор.Установить(Ссылка);
	
	МаксимальноеКоличествоЗаписей = 100000;
	
	ОбходПоСпособРаспределения = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	// Обход по способам распределения.
	Пока ОбходПоСпособРаспределения.Следующий() Цикл
		
		ОбходПоПроектам = ОбходПоСпособРаспределения.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		// Обход по проектам.
		Пока ОбходПоПроектам.Следующий() Цикл
			
			ФильтрПоПроект = ОбходПоПроектам.Проект;
			
			ОбходПоСтруктурнаяЕдиница = ОбходПоПроектам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			// Обход по подразделениям.
			Пока ОбходПоСтруктурнаяЕдиница.Следующий() Цикл
				
				ФильтрПоСтруктурнаяЕдиница = ОбходПоСтруктурнаяЕдиница.СтруктурнаяЕдиница;
				
				ОбходПоНаправлениеДеятельности = ОбходПоСтруктурнаяЕдиница.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				
				// Обход по направлениям деятельности.
				Пока ОбходПоНаправлениеДеятельности.Следующий() Цикл
					
					ФильтрПоНаправлениеДеятельности = ОбходПоНаправлениеДеятельности.НаправлениеДеятельности;
					
					ОбходПоЗаказ = ОбходПоНаправлениеДеятельности.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					
					// Обход по заказам.
					Пока ОбходПоЗаказ.Следующий() Цикл
						
						ФильтрПоЗаказ = ОбходПоЗаказ.Заказ;
						
						Если ОбходПоЗаказ.СчетУчетаСпособРаспределения = Перечисления.БазыРаспределенияРасходов.НеРаспределять Тогда
							Продолжить;
						КонецЕсли;
						
						СпособРаспределения = ОбходПоЗаказ.СчетУчетаСпособРаспределения;
						
						ПараметрыПоиска = Новый Структура;
						ПараметрыПоиска.Вставить("СтруктурнаяЕдиница", ФильтрПоСтруктурнаяЕдиница);
						ТаблицаБазыПоСтруктурнойЕдинице = ВыделитьБазуРаспределенияФинансовогоРезультата(ОбщаяБазаРаспределения, СпособРаспределения, ПараметрыПоиска);
						
						Если ТаблицаБазыПоСтруктурнойЕдинице.Количество() > 0 Тогда
							
							ПараметрыПоиска = Новый Структура;
							ПараметрыПоиска.Вставить("СтруктурнаяЕдиница", ФильтрПоСтруктурнаяЕдиница);
							ПараметрыПоиска.Вставить("НаправлениеДеятельности", ФильтрПоНаправлениеДеятельности);
							ПараметрыПоиска.Вставить("Заказ", ФильтрПоЗаказ);
							ПараметрыПоиска.Вставить("Проект", ФильтрПоПроект);
							ТаблицаБазы = ВыделитьБазуРаспределенияФинансовогоРезультата(ОбщаяБазаРаспределения, СпособРаспределения, ПараметрыПоиска);
							
							Если ТаблицаБазы.Количество() = 0 Тогда
								ПараметрыПоиска = Новый Структура;
								ПараметрыПоиска.Вставить("СтруктурнаяЕдиница", ФильтрПоСтруктурнаяЕдиница);
								ПараметрыПоиска.Вставить("НаправлениеДеятельности", ФильтрПоНаправлениеДеятельности);
								ПараметрыПоиска.Вставить("Проект", ФильтрПоПроект);
								ТаблицаБазы = ВыделитьБазуРаспределенияФинансовогоРезультата(ОбщаяБазаРаспределения, СпособРаспределения, ПараметрыПоиска);
							КонецЕсли;
							
							Если ТаблицаБазы.Количество() = 0 Тогда
								ПараметрыПоиска = Новый Структура;
								ПараметрыПоиска.Вставить("СтруктурнаяЕдиница", ФильтрПоСтруктурнаяЕдиница);
								ПараметрыПоиска.Вставить("Проект", ФильтрПоПроект);
								ТаблицаБазы = ВыделитьБазуРаспределенияФинансовогоРезультата(ОбщаяБазаРаспределения, СпособРаспределения, ПараметрыПоиска);
							КонецЕсли;
							
							Если ТаблицаБазы.Количество() = 0 Тогда
								ТаблицаБазы = ТаблицаБазыПоСтруктурнойЕдинице;
							КонецЕсли;
							
						Иначе
							
							ПараметрыПоиска = Новый Структура;
							ПараметрыПоиска.Вставить("НаправлениеДеятельности", ФильтрПоНаправлениеДеятельности);
							ПараметрыПоиска.Вставить("Заказ", ФильтрПоЗаказ);
							ПараметрыПоиска.Вставить("Проект", ФильтрПоПроект);
							ТаблицаБазы = ВыделитьБазуРаспределенияФинансовогоРезультата(ОбщаяБазаРаспределения, СпособРаспределения, ПараметрыПоиска);
							
							Если ТаблицаБазы.Количество() = 0 Тогда
								ПараметрыПоиска = Новый Структура;
								ПараметрыПоиска.Вставить("НаправлениеДеятельности", ФильтрПоНаправлениеДеятельности);
								ПараметрыПоиска.Вставить("Проект", ФильтрПоПроект);
								ТаблицаБазы = ВыделитьБазуРаспределенияФинансовогоРезультата(ОбщаяБазаРаспределения, СпособРаспределения, ПараметрыПоиска);
							КонецЕсли;
							
							Если ТаблицаБазы.Количество() = 0 Тогда
								ПараметрыПоиска = Новый Структура;
								ПараметрыПоиска.Вставить("Проект", ФильтрПоПроект);
								ТаблицаБазы = ВыделитьБазуРаспределенияФинансовогоРезультата(ОбщаяБазаРаспределения, СпособРаспределения, ПараметрыПоиска);
							КонецЕсли;
							
							Если ТаблицаБазы.Количество() = 0 Тогда
								ПараметрыПоиска = Новый Структура;
								ТаблицаБазы = ВыделитьБазуРаспределенияФинансовогоРезультата(ОбщаяБазаРаспределения, СпособРаспределения, ПараметрыПоиска);
							КонецЕсли;
						
						КонецЕсли;
					
					Если ТаблицаБазы.Количество() > 0 Тогда
						ВсегоБазаРаспределения = ТаблицаБазы.Итог("База");
						КоличествоНаправлений  = ТаблицаБазы.Количество() - 1;
					Иначе
						ВсегоБазаРаспределения = 0;
						КоличествоНаправлений  = 0;
					КонецЕсли;
					
					ОбходПоСчетамУчета = ОбходПоЗаказ.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					
					// Обход по счетам затрат.
					Пока ОбходПоСчетамУчета.Следующий() Цикл
						
						Если ТаблицаБазы.Количество() = 0 ИЛИ ВсегоБазаРаспределения = 0 Тогда
							СтрокаТаблицы = ТаблицаБазы.Добавить();
							СтрокаТаблицы.СтруктурнаяЕдиница = ОбходПоСчетамУчета.СтруктурнаяЕдиница;
							СтрокаТаблицы.Проект = ОбходПоСчетамУчета.Проект;
							СтрокаТаблицы.НаправлениеДеятельности = ОсновноеНаправление;
							СтрокаТаблицы.Заказ = ОбходПоСчетамУчета.Заказ;
							СтрокаТаблицы.СчетУчетаВыручкиОтПродаж = ОбходПоСчетамУчета.СчетУчета;
							СтрокаТаблицы.СчетУчетаСебестоимостиПродаж = ОбходПоСчетамУчета.СчетУчета;
							СтрокаТаблицы.СчетУчетаПрибыли = СчетПрибылиПоОсновномуНаправлению;
							СтрокаТаблицы.База = 1;
							ВсегоБазаРаспределения = 1;
						КонецЕсли;
						
						// Распределяем сумму.
						Если ОбходПоСчетамУчета.СуммаДоходов <> 0 
						 ИЛИ ОбходПоСчетамУчета.СуммаРасходов <> 0 Тогда
							
							Если ОбходПоСчетамУчета.СуммаДоходов <> 0 Тогда
								СуммаКРаспределению = ОбходПоСчетамУчета.СуммаДоходов;
							ИначеЕсли ОбходПоСчетамУчета.СуммаРасходов <> 0 Тогда
								СуммаКРаспределению = ОбходПоСчетамУчета.СуммаРасходов;
							КонецЕсли;
							
							СуммаРаспределили = 0;
							
							Для каждого НаправлениеРаспределения Из ТаблицаБазы Цикл
								
								СуммаЗатрат = ?(СуммаКРаспределению = 0, 0, Окр(НаправлениеРаспределения.База / ВсегоБазаРаспределения * СуммаКРаспределению, 2, 1));
								СуммаРаспределили = СуммаРаспределили + СуммаЗатрат;
								
								// Если это последняя строка - скорректируем сумму в ней на ошибку округления.
								Если ТаблицаБазы.Индекс(НаправлениеРаспределения) = КоличествоНаправлений Тогда
									СуммаЗатрат = СуммаЗатрат + СуммаКРаспределению - СуммаРаспределили;
									СуммаРаспределили = СуммаРаспределили + СуммаЗатрат;
								КонецЕсли;
								
								Если СуммаЗатрат <> 0 Тогда
									
									// Движения по регистру Финансовый результат.
									НоваяСтрока	= НаборЗаписейФинансовыйРезультат.Добавить();
									НоваяСтрока.Период = Дата;
									НоваяСтрока.Регистратор	= Ссылка;
									НоваяСтрока.Организация	= ДополнительныеСвойства.ДляПроведения.Организация;
									НоваяСтрока.СтруктурнаяЕдиница = НаправлениеРаспределения.СтруктурнаяЕдиница;
									НоваяСтрока.Проект = НаправлениеРаспределения.Проект;
									НоваяСтрока.НаправлениеДеятельности	= НаправлениеРаспределения.НаправлениеДеятельности;
									НоваяСтрока.ЗаказПокупателя	= НаправлениеРаспределения.Заказ;
									
									НоваяСтрока.СчетУчета = ОбходПоСчетамУчета.СчетУчета;
									НоваяСтрока.Аналитика = ОбходПоСчетамУчета.Аналитика;
									Если ОбходПоСчетамУчета.СуммаДоходов <> 0 Тогда
										НоваяСтрока.СуммаДоходов = СуммаЗатрат;
									ИначеЕсли ОбходПоСчетамУчета.СуммаРасходов <> 0 Тогда
										НоваяСтрока.СуммаРасходов = СуммаЗатрат;
									КонецЕсли;
									
									НоваяСтрока.СодержаниеПроводки = СодержанияПроводок.ФинансовыйРезультат();
									
									// Движения по регистру Управленческий.
									НоваяСтрока = НаборЗаписейУправленческий.Добавить();
									НоваяСтрока.Период = Дата;
									НоваяСтрока.Регистратор = Ссылка;
									НоваяСтрока.Организация = ДополнительныеСвойства.ДляПроведения.Организация;
									НоваяСтрока.СценарийПланирования = Справочники.СценарииПланирования.Фактический;
									
									Если ОбходПоСчетамУчета.СуммаДоходов <> 0 Тогда
										НоваяСтрока.СчетДт = ОбходПоСчетамУчета.СчетУчета;
										НоваяСтрока.СчетКт = НаправлениеРаспределения.СчетУчетаПрибыли;
										НоваяСтрока.Сумма = СуммаЗатрат; 
									ИначеЕсли ОбходПоСчетамУчета.СуммаРасходов <> 0 Тогда
										НоваяСтрока.СчетДт = НаправлениеРаспределения.СчетУчетаПрибыли;
										НоваяСтрока.СчетКт = ОбходПоСчетамУчета.СчетУчета;
										НоваяСтрока.Сумма = СуммаЗатрат;
									КонецЕсли;
									
									НоваяСтрока.Содержание = СодержанияПроводок.ФинансовыйРезультат();
									
								КонецЕсли;
								
								Если НаборЗаписейФинансовыйРезультат.Количество() > МаксимальноеКоличествоЗаписей Тогда
									НаборЗаписейФинансовыйРезультат.Записать(РежимЗамещения.Добавление);
								КонецЕсли;
								
							КонецЦикла;
							
							Если СуммаРаспределили = 0 Тогда
								СуммаКОшибке = ?(ОбходПоСчетамУчета.СуммаДоходов <> 0, ОбходПоСчетамУчета.СуммаДоходов, ОбходПоСчетамУчета.СуммаРасходов);
								ОписаниеОшибки = СформироватьОписаниеОшибкиРаспределенияРасходов(
																	ОбходПоСчетамУчета.СчетУчета,
																	ОбходПоЗаказ.СчетУчетаСпособРаспределения,
																	СуммаКОшибке);
								ДобавитьОшибкуВТаблицу(ОписаниеОшибки, "РасчетФинансовогоРезультата");
								
								Продолжить;
								
							КонецЕсли;
							
						КонецЕсли
						
					КонецЦикла;
					
				КонецЦикла;
				
			КонецЦикла;
			
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
	НаборЗаписейФинансовыйРезультат.Записать(Ложь);
	НаборЗаписейФинансовыйРезультат.Очистить();
	
	НаборЗаписейУправленческий.Записать(Ложь);
	НаборЗаписейУправленческий.Очистить();
	
КонецПроцедуры

Процедура ОтразитьФинансовыйРезультатБезРаспределения(ОсновноеНаправление, СчетПрибылиПоОсновномуНаправлению)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДоходыИРасходыОбороты.Организация КАК Организация,
	|	ДоходыИРасходыОбороты.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ДоходыИРасходыОбороты.Проект КАК Проект,
	|	ДоходыИРасходыОбороты.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ДоходыИРасходыОбороты.НаправлениеДеятельности.СчетУчетаПрибыли КАК СчетУчетаПрибыли,
	|	ДоходыИРасходыОбороты.ЗаказПокупателя КАК ЗаказПокупателя,
	|	ДоходыИРасходыОбороты.СчетУчета КАК СчетУчета,
	|	ДоходыИРасходыОбороты.Аналитика КАК Аналитика,
	|	СУММА(ДоходыИРасходыОбороты.СуммаДоходовОборот) КАК СуммаДоходов,
	|	СУММА(ДоходыИРасходыОбороты.СуммаРасходовОборот) КАК СуммаРасходов
	|ИЗ
	|	РегистрНакопления.ДоходыИРасходы.Обороты(
	|			&ДатаНачала,
	|			&ДатаОкончания,
	|			Авто,
	|			Организация = &Организация
	|				И (СчетУчета.СпособРаспределения = ЗНАЧЕНИЕ(Перечисление.БазыРаспределенияРасходов.НеРаспределять)
	|					ИЛИ (НаправлениеДеятельности.СчетУчетаСебестоимостиПродаж = СчетУчета
	|						ИЛИ НаправлениеДеятельности.СчетУчетаВыручкиОтПродаж = СчетУчета)
	|						И НаправлениеДеятельности <> ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.Прочее))) КАК ДоходыИРасходыОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	ДоходыИРасходыОбороты.Организация,
	|	ДоходыИРасходыОбороты.СтруктурнаяЕдиница,
	|	ДоходыИРасходыОбороты.Проект,
	|	ДоходыИРасходыОбороты.НаправлениеДеятельности,
	|	ДоходыИРасходыОбороты.НаправлениеДеятельности.СчетУчетаПрибыли,
	|	ДоходыИРасходыОбороты.ЗаказПокупателя,
	|	ДоходыИРасходыОбороты.СчетУчета,
	|	ДоходыИРасходыОбороты.Аналитика";
	
	Запрос.УстановитьПараметр("Организация",    ДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("ДатаНачала",     ДополнительныеСвойства.ДляПроведения.НачальнаяДатаПериода);
	Запрос.УстановитьПараметр("ДатаОкончания",  ДополнительныеСвойства.ДляПроведения.КонечнаяГраницаПериода);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕслИ;

	// Создадим наборы записей
	НаборЗаписейФинансовыйРезультат = РегистрыНакопления.ФинансовыйРезультат.СоздатьНаборЗаписей();
	НаборЗаписейФинансовыйРезультат.Отбор.Регистратор.Установить(ДополнительныеСвойства.ДляПроведения.Ссылка);
	НаборЗаписейУправленческий = РегистрыБухгалтерии.Управленческий.СоздатьНаборЗаписей();
	НаборЗаписейУправленческий.Отбор.Регистратор.Установить(Ссылка);
	
	ВыборкаРезультатЗапроса = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаРезультатЗапроса.Следующий() Цикл
		
		// Движения по регистру Финансовый результат.
		НоваяСтрока = НаборЗаписейФинансовыйРезультат.Добавить();
		НоваяСтрока.Период = Дата;
		НоваяСтрока.Регистратор = Ссылка;
		НоваяСтрока.СодержаниеПроводки = СодержанияПроводок.ФинансовыйРезультат();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаРезультатЗапроса);
		
		// Направление не может быть пустым
		Если НЕ ЗначениеЗаполнено(НоваяСтрока.НаправлениеДеятельности) Тогда
			НоваяСтрока.НаправлениеДеятельности = ОсновноеНаправление;
		КонецЕсли;
		
		// Для исключения рассинхронизации с Управленческий
		Если НоваяСтрока.СуммаДоходов <> 0 Тогда
			НоваяСтрока.СуммаРасходов = 0;
		КонецЕсли;
		
		// Движения по регистру Управленческий.
		НоваяСтрока = НаборЗаписейУправленческий.Добавить();
		НоваяСтрока.Период = Дата;
		НоваяСтрока.Регистратор = Ссылка;
		НоваяСтрока.Организация = ВыборкаРезультатЗапроса.Организация;
		НоваяСтрока.СценарийПланирования = Справочники.СценарииПланирования.Фактический;
		НоваяСтрока.Содержание = СодержанияПроводок.ФинансовыйРезультат();
		
		Если ВыборкаРезультатЗапроса.СуммаДоходов <> 0 Тогда
			НоваяСтрока.СчетДт = ВыборкаРезультатЗапроса.СчетУчета;
			НоваяСтрока.СчетКт = ?(
				ЗначениеЗаполнено(ВыборкаРезультатЗапроса.НаправлениеДеятельности),
				ВыборкаРезультатЗапроса.СчетУчетаПрибыли,
				СчетПрибылиПоОсновномуНаправлению);
			НоваяСтрока.Сумма = ВыборкаРезультатЗапроса.СуммаДоходов; 
		ИначеЕсли ВыборкаРезультатЗапроса.СуммаРасходов <> 0 Тогда
			НоваяСтрока.СчетДт = ?(
				ЗначениеЗаполнено(ВыборкаРезультатЗапроса.НаправлениеДеятельности),
				ВыборкаРезультатЗапроса.СчетУчетаПрибыли,
				СчетПрибылиПоОсновномуНаправлению);
			НоваяСтрока.СчетКт = ВыборкаРезультатЗапроса.СчетУчета;
			НоваяСтрока.Сумма = ВыборкаРезультатЗапроса.СуммаРасходов;
		КонецЕсли;
		
	КонецЦикла;
	
	НаборЗаписейФинансовыйРезультат.Записать(Ложь);
	НаборЗаписейУправленческий.Записать(Ложь);

КонецПроцедуры

Функция СформироватьОбщуюТаблицуБазыРаспределенияФинансовогоРезультата()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода"    , ДополнительныеСвойства.ДляПроведения.НачальнаяДатаПериода);
	Запрос.УстановитьПараметр("КонецПериода"    , ДополнительныеСвойства.ДляПроведения.КонечнаяДатаПериода);
	Запрос.УстановитьПараметр("Организация", ДополнительныеСвойства.ДляПроведения.Организация);
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПродажиОбороты.Номенклатура.НаправлениеДеятельности КАК НаправлениеДеятельности,
		|	ПродажиОбороты.ЗаказПокупателя КАК Заказ,
		|	ПродажиОбороты.Номенклатура.НаправлениеДеятельности.СчетУчетаВыручкиОтПродаж КАК СчетУчетаВыручкиОтПродаж,
		|	ПродажиОбороты.Номенклатура.НаправлениеДеятельности.СчетУчетаСебестоимостиПродаж КАК СчетУчетаСебестоимостиПродаж,
		|	ПродажиОбороты.Номенклатура.НаправлениеДеятельности.СчетУчетаПрибыли КАК СчетУчетаПрибыли,
		|	ПродажиОбороты.Подразделение КАК СтруктурнаяЕдиница,
		|	ПродажиОбороты.Проект КАК Проект,
		|	СУММА(ПродажиОбороты.КоличествоОборот) КАК ОбъемПродаж,
		|	СУММА(ПродажиОбороты.СуммаОборот) КАК ВыручкаОтПродаж,
		|	СУММА(ПродажиОбороты.СебестоимостьОборот) КАК СебестоимостьПродаж,
		|	СУММА(ПродажиОбороты.СуммаОборот - ПродажиОбороты.СебестоимостьОборот) КАК ВаловаяПрибыль
		|	
		|ИЗ
		|	РегистрНакопления.Продажи.Обороты(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			Авто,
		|			Организация = &Организация) КАК ПродажиОбороты
		|ГДЕ
		|	ПродажиОбороты.Номенклатура.НаправлениеДеятельности <> ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.Прочее)
		|СГРУППИРОВАТЬ ПО
		|	ПродажиОбороты.Организация,
		|	ПродажиОбороты.Номенклатура.НаправлениеДеятельности,
		|	ПродажиОбороты.ЗаказПокупателя,
		|	ПродажиОбороты.Номенклатура.НаправлениеДеятельности.СчетУчетаВыручкиОтПродаж,
		|	ПродажиОбороты.Номенклатура.НаправлениеДеятельности.СчетУчетаСебестоимостиПродаж,
		|	ПродажиОбороты.Номенклатура.НаправлениеДеятельности.СчетУчетаПрибыли,
		|	ПродажиОбороты.Подразделение,
		|	ПродажиОбороты.Проект";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ВыделитьБазуРаспределенияФинансовогоРезультата(ОбщаяТаблицаБазы, СпособРаспределения, ИсходныеПараметрыПоиска)
	
	ИмяКолонкиБазы = "База"; // Не локализуется
	
	// Нужно оставить только те параметры поиска, у которых заполнено значение
	ПараметрыПоиска = Новый Структура;

	Для каждого КлючИЗначение Из ИсходныеПараметрыПоиска Цикл
		Если ЗначениеЗаполнено(КлючИЗначение.Значение) Тогда
			ПараметрыПоиска.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение);
		КонецЕсли;
	КонецЦикла;
	
	Если ПараметрыПоиска.Количество() = 0 Тогда
		ТаблицаБазы = ОбщаяТаблицаБазы.Скопировать();
	Иначе
		ТаблицаБазы = ОбщаяТаблицаБазы.Скопировать(ПараметрыПоиска);
	КонецЕсли;
	
	Если СпособРаспределения = Перечисления.БазыРаспределенияРасходов.ВыручкаОтПродаж Тогда
		ТаблицаБазы.Колонки.Найти("ВыручкаОтПродаж").Имя = ИмяКолонкиБазы;
	ИначеЕсли СпособРаспределения = Перечисления.БазыРаспределенияРасходов.СебестоимостьПродаж Тогда 
		ТаблицаБазы.Колонки.Найти("СебестоимостьПродаж").Имя = ИмяКолонкиБазы;
	ИначеЕсли СпособРаспределения = Перечисления.БазыРаспределенияРасходов.ВаловаяПрибыль Тогда 
		ТаблицаБазы.Колонки.Найти("ВаловаяПрибыль").Имя = ИмяКолонкиБазы;
	Иначе
		ТаблицаБазы.Колонки.Найти("ОбъемПродаж").Имя = ИмяКолонкиБазы;
	КонецЕсли;
	
	Возврат ТаблицаБазы;
	
КонецФункции

#КонецОбласти

#Область РасчетСебестоимостиВРозницеСуммовойУчет

Процедура РассчитатьСебестоимостьВРозницеСуммовойУчет()
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ДатаНач", ДополнительныеСвойства.ДляПроведения.НачальнаяДатаПериода);
	Запрос.УстановитьПараметр("ДатаКон", ДополнительныеСвойства.ДляПроведения.КонечнаяДатаПериода);
	Запрос.УстановитьПараметр("Организация", ДополнительныеСвойства.ДляПроведения.Организация);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СуммовойУчетВРозницеОбороты.Организация КАК Организация,
	|	СуммовойУчетВРозницеОбороты.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	СуммовойУчетВРозницеОбороты.Валюта КАК Валюта,
	|	СуммовойУчетВРозницеОбороты.СуммаВалПриход КАК СуммаВалПриход,
	|	СуммовойУчетВРозницеОбороты.СуммаВалРасход КАК СуммаВалРасход,
	|	СуммовойУчетВРозницеОбороты.СебестоимостьПриход КАК СебестоимостьПриход,
	|	СуммовойУчетВРозницеОбороты.СебестоимостьРасход КАК СебестоимостьРасход,
	|	ВЫБОР
	|		КОГДА СуммовойУчетВРозницеОбороты.СуммаВалПриход <> 0
	|			ТОГДА (ВЫРАЗИТЬ(СуммовойУчетВРозницеОбороты.СуммаВалРасход * СуммовойУчетВРозницеОбороты.СебестоимостьПриход / СуммовойУчетВРозницеОбороты.СуммаВалПриход КАК ЧИСЛО(15, 2))) - СуммовойУчетВРозницеОбороты.СебестоимостьРасход
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОбщаяСуммаКорректировки
	|ПОМЕСТИТЬ ВременнаяТаблицаСуммаКорректировки
	|ИЗ
	|	РегистрНакопления.СуммовойУчетВРознице.Обороты(, &ДатаКон, , Организация = &Организация) КАК СуммовойУчетВРозницеОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СуммовойУчетВРознице.Организация КАК Организация,
	|	СуммовойУчетВРознице.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	СуммовойУчетВРознице.Валюта КАК Валюта,
	|	СУММА(СуммовойУчетВРознице.Себестоимость) КАК СебестоимостьРасход
	|ПОМЕСТИТЬ ВременнаяТаблицаОбщаяСебестоимостьРасход
	|ИЗ
	|	РегистрНакопления.СуммовойУчетВРознице КАК СуммовойУчетВРознице
	|ГДЕ
	|	СуммовойУчетВРознице.Период МЕЖДУ &ДатаНач И &ДатаКон
	|	И СуммовойУчетВРознице.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И СуммовойУчетВРознице.Себестоимость <> 0
	|	И СуммовойУчетВРознице.Организация = &Организация
	|	И СуммовойУчетВРознице.ДокументПродажи <> ЗНАЧЕНИЕ(Документ.ПоступлениеВКассу.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	СуммовойУчетВРознице.Организация,
	|	СуммовойУчетВРознице.СтруктурнаяЕдиница,
	|	СуммовойУчетВРознице.Валюта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СуммовойУчетВРознице.Организация КАК Организация,
	|	СуммовойУчетВРознице.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	СуммовойУчетВРознице.Валюта КАК Валюта,
	|	СуммовойУчетВРознице.ДокументПродажи КАК ДокументПродажи,
	|	СуммовойУчетВРознице.ДокументПродажи.Подразделение КАК ДокументПродажиПодразделение,
	|	СуммовойУчетВРознице.ДокументПродажи.СтруктурнаяЕдиница.РозничныйВидЦен.ВалютаЦены КАК ДокументПродажиСтруктурнаяЕдиницаРозничныйВидЦенВалютаЦены,
	|	СуммовойУчетВРознице.ДокументПродажи.НаправлениеДеятельности КАК ДокументПродажиНаправлениеДеятельности,
	|	СуммовойУчетВРознице.ДокументПродажи.НаправлениеДеятельности.СчетУчетаСебестоимостиПродаж КАК ДокументПродажиНаправлениеДеятельностиСчетУчетаСебестоимостиПродаж,
	|	СуммовойУчетВРознице.ДокументПродажи.СтруктурнаяЕдиница.СчетУчетаВРознице КАК ДокументПродажиСтруктурнаяЕдиницаСчетУчетаВРознице,
	|	СуммовойУчетВРознице.ДокументПродажи.СтруктурнаяЕдиница.СчетУчетаНаценки КАК ДокументПродажиСтруктурнаяЕдиницаСчетУчетаНаценки,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВременнаяТаблицаОбщаяСебестоимостьРасход.СебестоимостьРасход, 0) <> 0
	|			ТОГДА ВЫРАЗИТЬ(СуммовойУчетВРознице.Себестоимость / ВременнаяТаблицаОбщаяСебестоимостьРасход.СебестоимостьРасход * ВременнаяТаблицаСуммаКорректировки.ОбщаяСуммаКорректировки КАК ЧИСЛО(15, 2))
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаКорректировки
	|ИЗ
	|	РегистрНакопления.СуммовойУчетВРознице КАК СуммовойУчетВРознице
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаСуммаКорректировки КАК ВременнаяТаблицаСуммаКорректировки
	|		ПО СуммовойУчетВРознице.Организация = ВременнаяТаблицаСуммаКорректировки.Организация
	|			И СуммовойУчетВРознице.СтруктурнаяЕдиница = ВременнаяТаблицаСуммаКорректировки.СтруктурнаяЕдиница
	|			И СуммовойУчетВРознице.Валюта = ВременнаяТаблицаСуммаКорректировки.Валюта
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаОбщаяСебестоимостьРасход КАК ВременнаяТаблицаОбщаяСебестоимостьРасход
	|		ПО СуммовойУчетВРознице.Организация = ВременнаяТаблицаОбщаяСебестоимостьРасход.Организация
	|			И СуммовойУчетВРознице.СтруктурнаяЕдиница = ВременнаяТаблицаОбщаяСебестоимостьРасход.СтруктурнаяЕдиница
	|			И СуммовойУчетВРознице.Валюта = ВременнаяТаблицаОбщаяСебестоимостьРасход.Валюта
	|ГДЕ
	|	СуммовойУчетВРознице.Период МЕЖДУ &ДатаНач И &ДатаКон
	|	И СуммовойУчетВРознице.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И СуммовойУчетВРознице.Себестоимость <> 0
	|	И СуммовойУчетВРознице.Организация = &Организация
	|	И СуммовойУчетВРознице.ДокументПродажи <> ЗНАЧЕНИЕ(Документ.ПоступлениеВКассу.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВременнаяТаблицаСуммаКорректировки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВременнаяТаблицаОбщаяСебестоимостьРасход";
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса[2].Выбрать();
	
	// Создадим набор записей регистра накопления СуммовойУчетВРознице.
	НаборЗаписейСуммовойУчетВРознице = РегистрыНакопления.СуммовойУчетВРознице.СоздатьНаборЗаписей();
	НаборЗаписейСуммовойУчетВРознице.Отбор.Регистратор.Установить(Ссылка);
	
	// Создадим набор записей регистра накопления УчетДоходовИРасходов.
	НаборЗаписейДоходыИРасходы = РегистрыНакопления.ДоходыИРасходы.СоздатьНаборЗаписей();
	НаборЗаписейДоходыИРасходы.Отбор.Регистратор.Установить(Ссылка);
	
	// Создадим набор записей регистра накопления Управленческий.
	НаборЗаписейУправленческий = РегистрыБухгалтерии.Управленческий.СоздатьНаборЗаписей();
	НаборЗаписейУправленческий.Отбор.Регистратор.Установить(Ссылка);
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если Окр(ВыборкаДетальныеЗаписи.СуммаКорректировки, 2) = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		// Движения по регистру СуммовойУчетВРознице.
		НоваяСтрока = НаборЗаписейСуммовойУчетВРознице.Добавить();
		НоваяСтрока.Период = Дата;
		НоваяСтрока.ВидДвижения = ВидДвиженияНакопления.Расход;
		НоваяСтрока.Регистратор = Ссылка;
		НоваяСтрока.Организация = ВыборкаДетальныеЗаписи.Организация;
		НоваяСтрока.СтруктурнаяЕдиница = ВыборкаДетальныеЗаписи.СтруктурнаяЕдиница;
		НоваяСтрока.Валюта = ВыборкаДетальныеЗаписи.ДокументПродажиСтруктурнаяЕдиницаРозничныйВидЦенВалютаЦены;
		НоваяСтрока.СодержаниеПроводки = НСтр("ru = 'Себестоимость'");
		НоваяСтрока.Себестоимость = ВыборкаДетальныеЗаписи.СуммаКорректировки;
		
		// Движения по регистру ДоходыИРасходы.
		НоваяСтрока = НаборЗаписейДоходыИРасходы.Добавить();
		НоваяСтрока.Период = Дата;
		НоваяСтрока.Регистратор = Ссылка;
		НоваяСтрока.Организация = ВыборкаДетальныеЗаписи.Организация;
		НоваяСтрока.СтруктурнаяЕдиница = ВыборкаДетальныеЗаписи.ДокументПродажиПодразделение;
		НоваяСтрока.НаправлениеДеятельности = ВыборкаДетальныеЗаписи.ДокументПродажиНаправлениеДеятельности;
		НоваяСтрока.СчетУчета = ВыборкаДетальныеЗаписи.ДокументПродажиНаправлениеДеятельностиСчетУчетаСебестоимостиПродаж;
		НоваяСтрока.СуммаРасходов = ВыборкаДетальныеЗаписи.СуммаКорректировки;
		НоваяСтрока.СодержаниеПроводки = НСтр("ru = 'Отражение расходов'");
		
		// Движения по регистру Управленческий.
		НоваяСтрока = НаборЗаписейУправленческий.Добавить();
		НоваяСтрока.Период = Дата;
		НоваяСтрока.Регистратор = Ссылка;
		НоваяСтрока.Организация = ВыборкаДетальныеЗаписи.Организация;
		НоваяСтрока.СценарийПланирования = Справочники.СценарииПланирования.Фактический;
		НоваяСтрока.СчетДт = ВыборкаДетальныеЗаписи.ДокументПродажиНаправлениеДеятельностиСчетУчетаСебестоимостиПродаж;
		НоваяСтрока.СчетКт = ВыборкаДетальныеЗаписи.ДокументПродажиСтруктурнаяЕдиницаСчетУчетаВРознице;
		НоваяСтрока.Содержание = НСтр("ru = 'Себестоимость'");
		НоваяСтрока.Сумма = ВыборкаДетальныеЗаписи.СуммаКорректировки;
		
		// Движения по регистру Управленческий.
		НоваяСтрока = НаборЗаписейУправленческий.Добавить();
		НоваяСтрока.Период = Дата;
		НоваяСтрока.Регистратор = Ссылка;
		НоваяСтрока.Организация = ВыборкаДетальныеЗаписи.Организация;
		НоваяСтрока.СценарийПланирования = Справочники.СценарииПланирования.Фактический;
		НоваяСтрока.СчетДт = ВыборкаДетальныеЗаписи.ДокументПродажиСтруктурнаяЕдиницаСчетУчетаВРознице;
		НоваяСтрока.СчетКт = ВыборкаДетальныеЗаписи.ДокументПродажиСтруктурнаяЕдиницаСчетУчетаНаценки;
		НоваяСтрока.Содержание = НСтр("ru = 'Наценка'");
		НоваяСтрока.Сумма = - ВыборкаДетальныеЗаписи.СуммаКорректировки;
		
	КонецЦикла;
	
	// Пишем оставшиеся записи Учет доходов и расходов.
	НаборЗаписейДоходыИРасходы.Записать(Ложь);
	
	// Пишем оставшиеся записи Суммовой учет в рознице.
	НаборЗаписейСуммовойУчетВРознице.Записать(Ложь);
	
	// Пишем оставшиеся записи Управленческий.
	НаборЗаписейУправленческий.Записать(Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область РасчетКурсовыхРазниц

Процедура РассчитатьКурсовыеРазницы()
	
	// Создадим набор записей регистра накопления ДенежныеСредства.
	НаборЗаписейДенежныеСредства = РегистрыНакопления.ДенежныеСредства.СоздатьНаборЗаписей();
	НаборЗаписейДенежныеСредства.Отбор.Регистратор.Установить(Ссылка);
	
	// Создадим набор записей регистра накопления ДенежныеСредстваВКассахККМ.
	НаборЗаписейДенежныеСредстваВКассахККМ = РегистрыНакопления.ДенежныеСредстваВКассахККМ.СоздатьНаборЗаписей();
	НаборЗаписейДенежныеСредстваВКассахККМ.Отбор.Регистратор.Установить(Ссылка);
	
	// Создадим набор записей регистра накопления ДенежныеСредстваКПоступлению.
	НаборЗаписейДенежныеСредстваКПоступлению = РегистрыНакопления.ДенежныеСредстваКПоступлению.СоздатьНаборЗаписей();
	НаборЗаписейДенежныеСредстваКПоступлению.Отбор.Регистратор.Установить(Ссылка);
	
	// Создадим набор записей регистра накопления РасчетыСПерсоналом.
	НаборЗаписейРасчетыСПерсоналом = РегистрыНакопления.РасчетыСПерсоналом.СоздатьНаборЗаписей();
	НаборЗаписейРасчетыСПерсоналом.Отбор.Регистратор.Установить(Ссылка);
	
	// Создадим набор записей регистра накопления РасчетыСПодотчетниками.
	НаборЗаписейРасчетыСПодотчетниками = РегистрыНакопления.РасчетыСПодотчетниками.СоздатьНаборЗаписей();
	НаборЗаписейРасчетыСПодотчетниками.Отбор.Регистратор.Установить(Ссылка);
	
	// Создадим набор записей регистра накопления РасчетыСПокупателями.
	НаборЗаписейРасчетыСПокупателями = РегистрыНакопления.РасчетыСПокупателями.СоздатьНаборЗаписей();
	НаборЗаписейРасчетыСПокупателями.Отбор.Регистратор.Установить(Ссылка);
	
	// Создадим набор записей регистра накопления РасчетыСПоставщиками.
	НаборЗаписейРасчетыСПоставщиками = РегистрыНакопления.РасчетыСПоставщиками.СоздатьНаборЗаписей();
	НаборЗаписейРасчетыСПоставщиками.Отбор.Регистратор.Установить(Ссылка);
	
	// Создадим набор записей регистра накопления УчетДоходовИРасходов.
	НаборЗаписейДоходыИРасходы = РегистрыНакопления.ДоходыИРасходы.СоздатьНаборЗаписей();
	НаборЗаписейДоходыИРасходы.Отбор.Регистратор.Установить(Ссылка);
	
	// Создадим набор записей регистра сведений ОтчетПоКурсовымРазницам.
	НаборЗаписейОтчетПоКурсовымРазницам = РегистрыСведений.ОтчетПоКурсовымРазницам.СоздатьНаборЗаписей();
	НаборЗаписейОтчетПоКурсовымРазницам.Отбор.Регистратор.Установить(Ссылка);
	
	// Создадим набор записей регистра бухгалтерии Управленческий.
	НаборЗаписейУправленческий = РегистрыБухгалтерии.Управленческий.СоздатьНаборЗаписей();
	НаборЗаписейУправленческий.Отбор.Регистратор.Установить(Ссылка);
	
	// Создадим набор записей регистра накопления ДвиженияДенежныхСредств.
	НаборЗаписейДвиженияДенежныхСредств = РегистрыНакопления.ДвиженияДенежныхСредств.СоздатьНаборЗаписей();
	НаборЗаписейДвиженияДенежныхСредств.Отбор.Регистратор.Установить(Ссылка);
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ДатаКон", ДополнительныеСвойства.ДляПроведения.КонечнаяДатаПериода);
	Запрос.УстановитьПараметр("Организация", ДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("КурсоваяРазница", СодержанияПроводок.КурсоваяРазница());
	
	// Денежные средства.
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаОстатки.Организация КАК Организация,
	|	&Дата КАК Период,
	|	&Ссылка КАК Регистратор,
	|	ТаблицаОстатки.ТипДенежныхСредств КАК ТипДенежныхСредств,
	|	ТаблицаОстатки.БанковскийСчетКасса КАК БанковскийСчетКасса,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеДоходы)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеРасходы)
	|	КОНЕЦ КАК Аналитика,
	|	ТаблицаОстатки.Валюта КАК Валюта,
	|	ТаблицаОстатки.СуммаОстаток КАК СуммаОстаток,
	|	ТаблицаОстатки.СуммаВалОстаток КАК СуммаВалОстаток,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ КАК ВидДвиженияУправленческий,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0)
	|		ИНАЧЕ -(ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0))
	|	КОНЕЦ КАК Сумма,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПоложительнаяКурсоваяРазница)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ОтрицательнаяКурсоваяРазница)
	|	КОНЕЦ КАК Статья,
	|	&КурсоваяРазница КАК СодержаниеПроводки,
	|	НЕОПРЕДЕЛЕНО КАК СтруктурнаяЕдиница,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.Прочее) КАК НаправлениеДеятельности,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаДоходов,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА 0
	|		ИНАЧЕ -(ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0))
	|	КОНЕЦ КАК СуммаРасходов,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеДоходы)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеРасходы)
	|	КОНЕЦ КАК СчетУчета,
	|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический) КАК СценарийПланирования,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ТаблицаОстатки.БанковскийСчетКасса.СчетУчета
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеРасходы)
	|	КОНЕЦ КАК СчетДт,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеДоходы)
	|		ИНАЧЕ ТаблицаОстатки.БанковскийСчетКасса.СчетУчета
	|	КОНЕЦ КАК СчетКт,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|				И ТаблицаОстатки.БанковскийСчетКасса.СчетУчета.Валютный
	|			ТОГДА ТаблицаОстатки.Валюта
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ВалютаДт,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) < 0
	|				И ТаблицаОстатки.БанковскийСчетКасса.СчетУчета.Валютный
	|			ТОГДА ТаблицаОстатки.Валюта
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ВалютаКт,
	|	НЕОПРЕДЕЛЕНО КАК ДоговорКонтрагента,
	|	&КурсоваяРазница КАК Содержание
	|ИЗ
	|	РегистрНакопления.ДенежныеСредства.Остатки(&ДатаКон, Организация = &Организация) КАК ТаблицаОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
	|				&ДатаКон,
	|				Валюта В
	|					(ВЫБРАТЬ
	|						Константы.ВалютаУчета
	|					ИЗ
	|						Константы КАК Константы)) КАК КурсыВалютУчетаСрезПоследних
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&ДатаКон, ) КАК КурсыВалютБанковскийСчетКассаСрезПоследних
	|		ПО ТаблицаОстатки.Валюта = КурсыВалютБанковскийСчетКассаСрезПоследних.Валюта
	|ГДЕ
	|	ТаблицаОстатки.СуммаВалОстаток * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) <> ТаблицаОстатки.СуммаОстаток
	|	И (ТаблицаОстатки.СуммаВалОстаток * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ТаблицаОстатки.СуммаОстаток >= 0.005
	|			ИЛИ ТаблицаОстатки.СуммаВалОстаток * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ТаблицаОстатки.СуммаОстаток <= -0.005)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если Окр(ВыборкаДетальныеЗаписи.Сумма, 2) = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		// Движения по регистрам.
		НоваяСтрока = НаборЗаписейДенежныеСредства.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		НоваяСтрока.ХозяйственнаяОперация = ХозяйственнаяОперация; // Хозяйственная операция
		НоваяСтрока.ВидДвижения = ВыборкаДетальныеЗаписи.ВидДвиженияУправленческий;
		
		НоваяСтрока = НаборЗаписейДоходыИРасходы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		НоваяСтрока.Аналитика = ВыборкаДетальныеЗаписи.Валюта;
		
		НоваяСтрока = НаборЗаписейУправленческий.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		
		НоваяСтрока = НаборЗаписейОтчетПоКурсовымРазницам.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		НоваяСтрока.Сумма = ?(ВыборкаДетальныеЗаписи.ВидДвиженияУправленческий = ВидДвиженияНакопления.Приход, НоваяСтрока.Сумма, -НоваяСтрока.Сумма);
		НоваяСтрока.Аналитика = Строка(ВыборкаДетальныеЗаписи.БанковскийСчетКасса);
		НоваяСтрока.Раздел = НСтр("ru = 'Денежные средства'");
		
		НоваяСтрока = НаборЗаписейДвиженияДенежныхСредств.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		НоваяСтрока.СценарийПланирования = Справочники.СценарииПланирования.Фактический;
		НоваяСтрока.ХозяйственнаяОперация = ХозяйственнаяОперация;
		НоваяСтрока.СуммаПриход = ВыборкаДетальныеЗаписи.СуммаДоходов;
		НоваяСтрока.СуммаРасход = ВыборкаДетальныеЗаписи.СуммаРасходов;
		
	КонецЦикла;
	
	// Денежные средства в кассах ККМ.
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаОстатки.Организация КАК Организация,
	|	&Дата КАК Период,
	|	&Ссылка КАК Регистратор,
	|	ТаблицаОстатки.КассаККМ КАК КассаККМ,
	|	ТаблицаОстатки.КассаККМ.ВалютаДенежныхСредств КАК Валюта,
	|	ТаблицаОстатки.СуммаОстаток КАК СуммаОстаток,
	|	ТаблицаОстатки.СуммаВалОстаток КАК СуммаВалОстаток,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ КАК ВидДвиженияУправленческий,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0)
	|		ИНАЧЕ -(ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0))
	|	КОНЕЦ КАК Сумма,
	|	&КурсоваяРазница КАК СодержаниеПроводки,
	|	НЕОПРЕДЕЛЕНО КАК СтруктурнаяЕдиница,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.Прочее) КАК НаправлениеДеятельности,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаДоходов,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА 0
	|		ИНАЧЕ -(ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0))
	|	КОНЕЦ КАК СуммаРасходов,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеДоходы)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеРасходы)
	|	КОНЕЦ КАК СчетУчета,
	|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический) КАК СценарийПланирования,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ТаблицаОстатки.КассаККМ.СчетУчета
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеРасходы)
	|	КОНЕЦ КАК СчетДт,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеДоходы)
	|		ИНАЧЕ ТаблицаОстатки.КассаККМ.СчетУчета
	|	КОНЕЦ КАК СчетКт,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|				И ТаблицаОстатки.КассаККМ.СчетУчета.Валютный
	|			ТОГДА ТаблицаОстатки.КассаККМ.ВалютаДенежныхСредств
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ВалютаДт,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) < 0
	|				И ТаблицаОстатки.КассаККМ.СчетУчета.Валютный
	|			ТОГДА ТаблицаОстатки.КассаККМ.ВалютаДенежныхСредств
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ВалютаКт,
	|	НЕОПРЕДЕЛЕНО КАК ДоговорКонтрагента,
	|	&КурсоваяРазница КАК Содержание
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваВКассахККМ.Остатки(&ДатаКон, Организация = &Организация) КАК ТаблицаОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
	|				&ДатаКон,
	|				Валюта В
	|					(ВЫБРАТЬ
	|						Константы.ВалютаУчета
	|					ИЗ
	|						Константы КАК Константы)) КАК КурсыВалютУчетаСрезПоследних
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&ДатаКон, ) КАК КурсыВалютБанковскийСчетКассаСрезПоследних
	|		ПО ТаблицаОстатки.КассаККМ.ВалютаДенежныхСредств = КурсыВалютБанковскийСчетКассаСрезПоследних.Валюта
	|ГДЕ
	|	ТаблицаОстатки.СуммаВалОстаток * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) <> ТаблицаОстатки.СуммаОстаток
	|	И (ТаблицаОстатки.СуммаВалОстаток * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ТаблицаОстатки.СуммаОстаток >= 0.005
	|			ИЛИ ТаблицаОстатки.СуммаВалОстаток * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ТаблицаОстатки.СуммаОстаток <= -0.005)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если Окр(ВыборкаДетальныеЗаписи.Сумма, 2) = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		// Движения по регистрам.
		НоваяСтрока = НаборЗаписейДенежныеСредстваВКассахККМ.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		НоваяСтрока.ВидДвижения = ВыборкаДетальныеЗаписи.ВидДвиженияУправленческий;
		НоваяСтрока = НаборЗаписейДоходыИРасходы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		НоваяСтрока.Аналитика = ВыборкаДетальныеЗаписи.Валюта;
		НоваяСтрока = НаборЗаписейУправленческий.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		НоваяСтрока = НаборЗаписейОтчетПоКурсовымРазницам.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		НоваяСтрока.Сумма = ?(ВыборкаДетальныеЗаписи.ВидДвиженияУправленческий = ВидДвиженияНакопления.Приход, НоваяСтрока.Сумма, -НоваяСтрока.Сумма);
		НоваяСтрока.Аналитика = Строка(ВыборкаДетальныеЗаписи.КассаККМ);
		НоваяСтрока.Раздел = НСтр("ru = 'Денежные средства в кассах ККМ'");
		
	КонецЦикла;
	
	// Денежные средства к поступлению.
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаОстатки.Организация КАК Организация,
	|	&Дата КАК Период,
	|	&Ссылка КАК Регистратор,
	|	ТаблицаОстатки.Касса КАК Касса,
	|	ТаблицаОстатки.ДокументПередачи КАК ДокументПередачи,
	|	ТаблицаОстатки.ДокументПередачи.ВалютаДенежныхСредств КАК Валюта,
	|	ТаблицаОстатки.СуммаОстаток КАК СуммаОстаток,
	|	ТаблицаОстатки.СуммаВалОстаток КАК СуммаВалОстаток,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ КАК ВидДвиженияУправленческий,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0)
	|		ИНАЧЕ -(ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0))
	|	КОНЕЦ КАК Сумма,
	|	&КурсоваяРазница КАК СодержаниеПроводки,
	|	НЕОПРЕДЕЛЕНО КАК СтруктурнаяЕдиница,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.Прочее) КАК НаправлениеДеятельности,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаДоходов,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА 0
	|		ИНАЧЕ -(ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0))
	|	КОНЕЦ КАК СуммаРасходов,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеДоходы)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеРасходы)
	|	КОНЕЦ КАК СчетУчета,
	|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический) КАК СценарийПланирования,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПереводыВПути)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеРасходы)
	|	КОНЕЦ КАК СчетДт,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеДоходы)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПереводыВПути)
	|	КОНЕЦ КАК СчетКт,
	|	НЕОПРЕДЕЛЕНО КАК ВалютаДт,
	|	НЕОПРЕДЕЛЕНО КАК ВалютаКт,
	|	НЕОПРЕДЕЛЕНО КАК ДоговорКонтрагента,
	|	&КурсоваяРазница КАК Содержание
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваКПоступлению.Остатки(&ДатаКон, Организация = &Организация) КАК ТаблицаОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
	|				&ДатаКон,
	|				Валюта В
	|					(ВЫБРАТЬ
	|						Константы.ВалютаУчета
	|					ИЗ
	|						Константы КАК Константы)) КАК КурсыВалютУчетаСрезПоследних
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&ДатаКон, ) КАК КурсыВалютБанковскийСчетКассаСрезПоследних
	|		ПО ТаблицаОстатки.ДокументПередачи.ВалютаДенежныхСредств = КурсыВалютБанковскийСчетКассаСрезПоследних.Валюта
	|ГДЕ
	|	ТаблицаОстатки.СуммаВалОстаток * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) <> ТаблицаОстатки.СуммаОстаток
	|	И (ТаблицаОстатки.СуммаВалОстаток * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ТаблицаОстатки.СуммаОстаток >= 0.005
	|			ИЛИ ТаблицаОстатки.СуммаВалОстаток * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ТаблицаОстатки.СуммаОстаток <= -0.005)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если Окр(ВыборкаДетальныеЗаписи.Сумма, 2) = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		// Движения по регистрам.
		НоваяСтрока = НаборЗаписейДенежныеСредстваКПоступлению.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		НоваяСтрока.ВидДвижения = ВыборкаДетальныеЗаписи.ВидДвиженияУправленческий;
		НоваяСтрока = НаборЗаписейДоходыИРасходы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		НоваяСтрока.Аналитика = ВыборкаДетальныеЗаписи.Валюта;
		НоваяСтрока = НаборЗаписейУправленческий.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		НоваяСтрока = НаборЗаписейОтчетПоКурсовымРазницам.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		НоваяСтрока.Сумма = ?(ВыборкаДетальныеЗаписи.ВидДвиженияУправленческий = ВидДвиженияНакопления.Приход, НоваяСтрока.Сумма, -НоваяСтрока.Сумма);
		НоваяСтрока.Аналитика = Строка(ВыборкаДетальныеЗаписи.Касса);
		НоваяСтрока.Раздел = НСтр("ru = 'Денежные средства к поступлению'");
		
	КонецЦикла;
	
	// Расчеты с персоналом.
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаОстатки.Организация КАК Организация,
	|	&Дата КАК Период,
	|	&Ссылка КАК Регистратор,
	|	ТаблицаОстатки.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ТаблицаОстатки.Сотрудник КАК Сотрудник,
	|	ТаблицаОстатки.Сотрудник.Код КАК СотрудникКод,
	|	ТаблицаОстатки.Валюта КАК Валюта,
	|	ТаблицаОстатки.ПериодРегистрации КАК ПериодРегистрации,
	|	ТаблицаОстатки.СуммаОстаток КАК СуммаОстаток,
	|	ТаблицаОстатки.СуммаВалОстаток КАК СуммаВалОстаток,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ КАК ВидДвиженияУправленческий,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0)
	|		ИНАЧЕ -(ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0))
	|	КОНЕЦ КАК Сумма,
	|	&КурсоваяРазница КАК СодержаниеПроводки,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.Прочее) КАК НаправлениеДеятельности,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА 0
	|		ИНАЧЕ -(ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0))
	|	КОНЕЦ КАК СуммаДоходов,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаРасходов,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеРасходы)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеДоходы)
	|	КОНЕЦ КАК СчетУчета,
	|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический) КАК СценарийПланирования,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеРасходы)
	|		ИНАЧЕ ТаблицаОстатки.Сотрудник.СчетРасчетовСПерсоналом
	|	КОНЕЦ КАК СчетДт,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ТаблицаОстатки.Сотрудник.СчетРасчетовСПерсоналом
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеДоходы)
	|	КОНЕЦ КАК СчетКт,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) < 0
	|				И ТаблицаОстатки.Сотрудник.СчетРасчетовСПерсоналом.Валютный
	|			ТОГДА ТаблицаОстатки.Валюта
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ВалютаДт,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|				И ТаблицаОстатки.Сотрудник.СчетРасчетовСПерсоналом.Валютный
	|			ТОГДА ТаблицаОстатки.Валюта
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ВалютаКт,
	|	&КурсоваяРазница КАК Содержание
	|ИЗ
	|	РегистрНакопления.РасчетыСПерсоналом.Остатки(&ДатаКон, Организация = &Организация) КАК ТаблицаОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
	|				&ДатаКон,
	|				Валюта В
	|					(ВЫБРАТЬ
	|						Константы.ВалютаУчета
	|					ИЗ
	|						Константы КАК Константы)) КАК КурсыВалютУчетаСрезПоследних
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&ДатаКон, ) КАК КурсыВалютБанковскийСчетКассаСрезПоследних
	|		ПО ТаблицаОстатки.Валюта = КурсыВалютБанковскийСчетКассаСрезПоследних.Валюта
	|ГДЕ
	|	ТаблицаОстатки.СуммаВалОстаток * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) <> ТаблицаОстатки.СуммаОстаток
	|	И (ТаблицаОстатки.СуммаВалОстаток * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ТаблицаОстатки.СуммаОстаток >= 0.005
	|			ИЛИ ТаблицаОстатки.СуммаВалОстаток * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ТаблицаОстатки.СуммаОстаток <= -0.005)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если Окр(ВыборкаДетальныеЗаписи.Сумма, 2) = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		// Движения по регистрам.
		НоваяСтрока = НаборЗаписейРасчетыСПерсоналом.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		НоваяСтрока.ВидДвижения = ВыборкаДетальныеЗаписи.ВидДвиженияУправленческий;
		НоваяСтрока = НаборЗаписейДоходыИРасходы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		НоваяСтрока.Аналитика = ВыборкаДетальныеЗаписи.Валюта;
		НоваяСтрока.СтруктурнаяЕдиница = Неопределено;
		НоваяСтрока = НаборЗаписейУправленческий.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		НоваяСтрока = НаборЗаписейОтчетПоКурсовымРазницам.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		НоваяСтрока.Сумма = ?(ВыборкаДетальныеЗаписи.ВидДвиженияУправленческий = ВидДвиженияНакопления.Приход, НоваяСтрока.Сумма, -НоваяСтрока.Сумма);
		НоваяСтрока.Аналитика = СтрШаблон(НСтр("ru = '%1 (%2) / %3 / %4 г.'"), ВыборкаДетальныеЗаписи.Сотрудник,
			ВыборкаДетальныеЗаписи.СотрудникКод, ВыборкаДетальныеЗаписи.СтруктурнаяЕдиница, 
			Формат(ВыборкаДетальныеЗаписи.ПериодРегистрации, НСтр("ru = 'ДФ=''ММММ гггг'''")));
		НоваяСтрока.Раздел = НСтр("ru = 'Расчеты с персоналом'");
		
	КонецЦикла;
	
	// Расчеты с подотчетниками.
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаОстатки.Организация КАК Организация,
	|	&Дата КАК Период,
	|	&Ссылка КАК Регистратор,
	|	ТаблицаОстатки.Сотрудник КАК Сотрудник,
	|	ТаблицаОстатки.Документ КАК Документ,
	|	ТаблицаОстатки.Валюта КАК Валюта,
	|	ТаблицаОстатки.СуммаОстаток КАК СуммаОстаток,
	|	ТаблицаОстатки.СуммаВалОстаток КАК СуммаВалОстаток,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ КАК ВидДвиженияУправленческий,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0)
	|		ИНАЧЕ -(ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0))
	|	КОНЕЦ КАК Сумма,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПоложительнаяКурсоваяРазница)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ОтрицательнаяКурсоваяРазница)
	|	КОНЕЦ КАК Статья,
	|	&КурсоваяРазница КАК СодержаниеПроводки,
	|	НЕОПРЕДЕЛЕНО КАК СтруктурнаяЕдиница,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.Прочее) КАК НаправлениеДеятельности,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаДоходов,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА 0
	|		ИНАЧЕ -(ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0))
	|	КОНЕЦ КАК СуммаРасходов,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеДоходы)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеРасходы)
	|	КОНЕЦ КАК СчетУчета,
	|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический) КАК СценарийПланирования,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ВЫБОР
	|					КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) > 0
	|						ТОГДА ТаблицаОстатки.Сотрудник.СчетРасчетовСПодотчетниками
	|					ИНАЧЕ ТаблицаОстатки.Сотрудник.СчетРасчетовПоПерерасходу
	|				КОНЕЦ
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеРасходы)
	|	КОНЕЦ КАК СчетДт,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеДоходы)
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) > 0
	|					ТОГДА ТаблицаОстатки.Сотрудник.СчетРасчетовСПодотчетниками
	|				ИНАЧЕ ТаблицаОстатки.Сотрудник.СчетРасчетовПоПерерасходу
	|			КОНЕЦ
	|	КОНЕЦ КАК СчетКт,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|				И ВЫБОР
	|					КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) > 0
	|						ТОГДА ТаблицаОстатки.Сотрудник.СчетРасчетовСПодотчетниками.Валютный
	|					ИНАЧЕ ТаблицаОстатки.Сотрудник.СчетРасчетовПоПерерасходу.Валютный
	|				КОНЕЦ
	|			ТОГДА ТаблицаОстатки.Валюта
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ВалютаДт,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) < 0
	|				И ВЫБОР
	|					КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) > 0
	|						ТОГДА ТаблицаОстатки.Сотрудник.СчетРасчетовСПодотчетниками.Валютный
	|					ИНАЧЕ ТаблицаОстатки.Сотрудник.СчетРасчетовПоПерерасходу.Валютный
	|				КОНЕЦ
	|			ТОГДА ТаблицаОстатки.Валюта
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ВалютаКт,
	|	&КурсоваяРазница КАК Содержание
	|ИЗ
	|	РегистрНакопления.РасчетыСПодотчетниками.Остатки(&ДатаКон, Организация = &Организация) КАК ТаблицаОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
	|				&ДатаКон,
	|				Валюта В
	|					(ВЫБРАТЬ
	|						Константы.ВалютаУчета
	|					ИЗ
	|						Константы КАК Константы)) КАК КурсыВалютУчетаСрезПоследних
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&ДатаКон, ) КАК КурсыВалютБанковскийСчетКассаСрезПоследних
	|		ПО ТаблицаОстатки.Валюта = КурсыВалютБанковскийСчетКассаСрезПоследних.Валюта
	|ГДЕ
	|	ТаблицаОстатки.СуммаВалОстаток * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) <> ТаблицаОстатки.СуммаОстаток
	|	И (ТаблицаОстатки.СуммаВалОстаток * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ТаблицаОстатки.СуммаОстаток >= 0.005
	|			ИЛИ ТаблицаОстатки.СуммаВалОстаток * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ТаблицаОстатки.СуммаОстаток <= -0.005)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если Окр(ВыборкаДетальныеЗаписи.Сумма, 2) = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		// Движения по регистрам.
		НоваяСтрока = НаборЗаписейРасчетыСПодотчетниками.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		НоваяСтрока.ВидДвижения = ВыборкаДетальныеЗаписи.ВидДвиженияУправленческий;
		НоваяСтрока = НаборЗаписейДоходыИРасходы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		НоваяСтрока.Аналитика = ВыборкаДетальныеЗаписи.Валюта;
		НоваяСтрока = НаборЗаписейУправленческий.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		НоваяСтрока = НаборЗаписейОтчетПоКурсовымРазницам.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		НоваяСтрока.Сумма = ?(ВыборкаДетальныеЗаписи.ВидДвиженияУправленческий = ВидДвиженияНакопления.Приход, НоваяСтрока.Сумма, -НоваяСтрока.Сумма);
		НоваяСтрока.Аналитика = СтрШаблон(НСтр("ru = '%1 / %2'"), ВыборкаДетальныеЗаписи.Сотрудник, 
			ВыборкаДетальныеЗаписи.Документ);
		НоваяСтрока.Раздел = НСтр("ru = 'Расчеты с подотчетниками'");
		
	КонецЦикла;
	
	// Расчеты с покупателями.
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаОстатки.Организация КАК Организация,
	|	&Дата КАК Период,
	|	&Ссылка КАК Регистратор,
	|	ТаблицаОстатки.ТипРасчетов КАК ТипРасчетов,
	|	ТаблицаОстатки.Контрагент КАК Контрагент,
	|	ТаблицаОстатки.Договор КАК Договор,
	|	ТаблицаОстатки.Документ КАК Документ,
	|	ТаблицаОстатки.Заказ КАК Заказ,
	|	ТаблицаОстатки.СуммаОстаток КАК СуммаОстаток,
	|	ТаблицаОстатки.СуммаВалОстаток КАК СуммаВалОстаток,
	|	ТаблицаОстатки.Договор.ВалютаРасчетов КАК Валюта,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ КАК ВидДвиженияУправленческий,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0)
	|		ИНАЧЕ -(ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0))
	|	КОНЕЦ КАК Сумма,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс / КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность - ЕСТЬNULL(ТаблицаОстатки.СуммаРегОстаток, 0) > 0
	|			ТОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс / КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность - ЕСТЬNULL(ТаблицаОстатки.СуммаРегОстаток, 0)
	|		ИНАЧЕ - (ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс / КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность - ЕСТЬNULL(ТаблицаОстатки.СуммаРегОстаток, 0))
	|	КОНЕЦ КАК СуммаРег,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПоложительнаяКурсоваяРазница)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ОтрицательнаяКурсоваяРазница)
	|	КОНЕЦ КАК Статья,
	|	&КурсоваяРазница КАК СодержаниеПроводки,
	|	НЕОПРЕДЕЛЕНО КАК СтруктурнаяЕдиница,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.Прочее) КАК НаправлениеДеятельности,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаДоходов,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА 0
	|		ИНАЧЕ -(ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0))
	|	КОНЕЦ КАК СуммаРасходов,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеДоходы)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеРасходы)
	|	КОНЕЦ КАК СчетУчета,
	|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический) КАК СценарийПланирования,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ВЫБОР
	|					КОГДА ТаблицаОстатки.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
	|						ТОГДА ТаблицаОстатки.Контрагент.СчетУчетаРасчетовСПокупателем
	|					ИНАЧЕ ТаблицаОстатки.Контрагент.СчетУчетаАвансовПокупателя
	|				КОНЕЦ
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеРасходы)
	|	КОНЕЦ КАК СчетДт,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеДоходы)
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ТаблицаОстатки.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
	|					ТОГДА ТаблицаОстатки.Контрагент.СчетУчетаРасчетовСПокупателем
	|				ИНАЧЕ ТаблицаОстатки.Контрагент.СчетУчетаАвансовПокупателя
	|			КОНЕЦ
	|	КОНЕЦ КАК СчетКт,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|				И ВЫБОР
	|					КОГДА ТаблицаОстатки.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
	|						ТОГДА ТаблицаОстатки.Контрагент.СчетУчетаРасчетовСПокупателем.Валютный
	|					ИНАЧЕ ТаблицаОстатки.Контрагент.СчетУчетаАвансовПокупателя.Валютный
	|				КОНЕЦ
	|			ТОГДА ТаблицаОстатки.Договор.ВалютаРасчетов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ВалютаДт,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) < 0
	|				И ВЫБОР
	|					КОГДА ТаблицаОстатки.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
	|						ТОГДА ТаблицаОстатки.Контрагент.СчетУчетаРасчетовСПокупателем.Валютный
	|					ИНАЧЕ ТаблицаОстатки.Контрагент.СчетУчетаАвансовПокупателя.Валютный
	|				КОНЕЦ
	|			ТОГДА ТаблицаОстатки.Договор.ВалютаРасчетов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ВалютаКт,
	|	&КурсоваяРазница КАК Содержание
	|ИЗ
	|	РегистрНакопления.РасчетыСПокупателями.Остатки(
	|			&ДатаКон,
	|			Организация = &Организация
	|				И ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)) КАК ТаблицаОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
	|				&ДатаКон,
	|				Валюта В
	|					(ВЫБРАТЬ
	|						Константы.ВалютаУчета
	|					ИЗ
	|						Константы КАК Константы)) КАК КурсыВалютУчетаСрезПоследних
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&ДатаКон, ) КАК КурсыВалютБанковскийСчетКассаСрезПоследних
	|		ПО ТаблицаОстатки.Договор.ВалютаРасчетов = КурсыВалютБанковскийСчетКассаСрезПоследних.Валюта
	|ГДЕ
	|	ТаблицаОстатки.СуммаВалОстаток * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) <> ТаблицаОстатки.СуммаОстаток
	|	И (ТаблицаОстатки.СуммаВалОстаток * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ТаблицаОстатки.СуммаОстаток >= 0.005
	|			ИЛИ ТаблицаОстатки.СуммаВалОстаток * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ТаблицаОстатки.СуммаОстаток <= -0.005
	|			ИЛИ ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс / КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность - ТаблицаОстатки.СуммаРегОстаток >= 0.005
	|			ИЛИ ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс / КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность - ТаблицаОстатки.СуммаРегОстаток <= -0.005 )";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если Окр(ВыборкаДетальныеЗаписи.Сумма, 2) = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		// Движения по регистрам.
		НоваяСтрока = НаборЗаписейРасчетыСПокупателями.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		НоваяСтрока.ВидДвижения = ВыборкаДетальныеЗаписи.ВидДвиженияУправленческий;
		НоваяСтрока = НаборЗаписейДоходыИРасходы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		НоваяСтрока.Аналитика = ВыборкаДетальныеЗаписи.Валюта;
		НоваяСтрока = НаборЗаписейУправленческий.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		НоваяСтрока = НаборЗаписейОтчетПоКурсовымРазницам.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		НоваяСтрока.Сумма = ?(ВыборкаДетальныеЗаписи.ВидДвиженияУправленческий = ВидДвиженияНакопления.Приход, НоваяСтрока.Сумма, -НоваяСтрока.Сумма);
		НоваяСтрока.Аналитика = СтрШаблон(НСтр("ru = '%1 / %2 / %3 / %4'"), ВыборкаДетальныеЗаписи.Контрагент,
			ВыборкаДетальныеЗаписи.Договор, ВыборкаДетальныеЗаписи.Документ, ВыборкаДетальныеЗаписи.Заказ);
		НоваяСтрока.Раздел = НСтр("ru = 'Расчеты с покупателями'");
		
	КонецЦикла;
	
	// Расчеты с поставщиками.
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаОстатки.Организация КАК Организация,
	|	&Дата КАК Период,
	|	&Ссылка КАК Регистратор,
	|	ТаблицаОстатки.ТипРасчетов КАК ТипРасчетов,
	|	ТаблицаОстатки.Контрагент КАК Контрагент,
	|	ТаблицаОстатки.Договор КАК Договор,
	|	ТаблицаОстатки.Документ КАК Документ,
	|	ТаблицаОстатки.Заказ КАК Заказ,
	|	ТаблицаОстатки.СуммаОстаток КАК СуммаОстаток,
	|	ТаблицаОстатки.СуммаВалОстаток КАК СуммаВалОстаток,
	|	ТаблицаОстатки.Договор.ВалютаРасчетов КАК Валюта,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ КАК ВидДвиженияУправленческий,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0)
	|		ИНАЧЕ -(ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0))
	|	КОНЕЦ КАК Сумма,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс / КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность - ЕСТЬNULL(ТаблицаОстатки.СуммаРегОстаток, 0) > 0
	|			ТОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс / КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность - ЕСТЬNULL(ТаблицаОстатки.СуммаРегОстаток, 0)
	|		ИНАЧЕ - (ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс / КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность - ЕСТЬNULL(ТаблицаОстатки.СуммаРегОстаток, 0))
	|	КОНЕЦ КАК СуммаРег,
	|	&КурсоваяРазница КАК СодержаниеПроводки,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.Прочее) КАК НаправлениеДеятельности,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА 0
	|		ИНАЧЕ -(ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0))
	|	КОНЕЦ КАК СуммаДоходов,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаРасходов,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеРасходы)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеДоходы)
	|	КОНЕЦ КАК СчетУчета,
	|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический) КАК СценарийПланирования,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеРасходы)
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ТаблицаОстатки.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
	|					ТОГДА ТаблицаОстатки.Контрагент.СчетУчетаРасчетовСПоставщиком
	|				ИНАЧЕ ТаблицаОстатки.Контрагент.СчетУчетаАвансовПоставщику
	|			КОНЕЦ
	|	КОНЕЦ КАК СчетДт,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|			ТОГДА ВЫБОР
	|					КОГДА ТаблицаОстатки.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
	|						ТОГДА ТаблицаОстатки.Контрагент.СчетУчетаРасчетовСПоставщиком
	|					ИНАЧЕ ТаблицаОстатки.Контрагент.СчетУчетаАвансовПоставщику
	|				КОНЕЦ
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеДоходы)
	|	КОНЕЦ КАК СчетКт,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) < 0
	|				И ВЫБОР
	|					КОГДА ТаблицаОстатки.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
	|						ТОГДА ТаблицаОстатки.Контрагент.СчетУчетаРасчетовСПоставщиком.Валютный
	|					ИНАЧЕ ТаблицаОстатки.Контрагент.СчетУчетаАвансовПоставщику.Валютный
	|				КОНЕЦ
	|			ТОГДА ТаблицаОстатки.Договор.ВалютаРасчетов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ВалютаДт,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0) > 0
	|				И ВЫБОР
	|					КОГДА ТаблицаОстатки.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)
	|						ТОГДА ТаблицаОстатки.Контрагент.СчетУчетаРасчетовСПоставщиком.Валютный
	|					ИНАЧЕ ТаблицаОстатки.Контрагент.СчетУчетаАвансовПоставщику.Валютный
	|				КОНЕЦ
	|			ТОГДА ТаблицаОстатки.Договор.ВалютаРасчетов
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ВалютаКт,
	|	&КурсоваяРазница КАК Содержание
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщиками.Остатки(
	|			&ДатаКон,
	|			Организация = &Организация
	|				И ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг)) КАК ТаблицаОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
	|				&ДатаКон,
	|				Валюта В
	|					(ВЫБРАТЬ
	|						Константы.ВалютаУчета
	|					ИЗ
	|						Константы КАК Константы)) КАК КурсыВалютУчетаСрезПоследних
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&ДатаКон, ) КАК КурсыВалютБанковскийСчетКассаСрезПоследних
	|		ПО ТаблицаОстатки.Договор.ВалютаРасчетов = КурсыВалютБанковскийСчетКассаСрезПоследних.Валюта
	|ГДЕ
	|	ТаблицаОстатки.СуммаВалОстаток * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) <> ТаблицаОстатки.СуммаОстаток
	|	И (ТаблицаОстатки.СуммаВалОстаток * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ТаблицаОстатки.СуммаОстаток >= 0.005
	|			ИЛИ ТаблицаОстатки.СуммаВалОстаток * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс * КурсыВалютУчетаСрезПоследних.Кратность / (КурсыВалютУчетаСрезПоследних.Курс * КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность) - ТаблицаОстатки.СуммаОстаток <= -0.005
	|			ИЛИ ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс / КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность - ТаблицаОстатки.СуммаРегОстаток >= 0.005
	|			ИЛИ ЕСТЬNULL(ТаблицаОстатки.СуммаВалОстаток, 0) * КурсыВалютБанковскийСчетКассаСрезПоследних.Курс / КурсыВалютБанковскийСчетКассаСрезПоследних.Кратность - ТаблицаОстатки.СуммаРегОстаток <= -0.005)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если Окр(ВыборкаДетальныеЗаписи.Сумма, 2) = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		// Движения по регистрам.
		НоваяСтрока = НаборЗаписейРасчетыСПоставщиками.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		НоваяСтрока.ВидДвижения = ВыборкаДетальныеЗаписи.ВидДвиженияУправленческий;
		НоваяСтрока = НаборЗаписейДоходыИРасходы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		НоваяСтрока.Аналитика = ВыборкаДетальныеЗаписи.Валюта;
		НоваяСтрока = НаборЗаписейУправленческий.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		НоваяСтрока = НаборЗаписейОтчетПоКурсовымРазницам.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		НоваяСтрока.Сумма = ?(ВыборкаДетальныеЗаписи.ВидДвиженияУправленческий = ВидДвиженияНакопления.Приход, НоваяСтрока.Сумма, -НоваяСтрока.Сумма);
		НоваяСтрока.Аналитика = СтрШаблон(НСтр("ru = '%1 / %2 / %3 / %4'"), ВыборкаДетальныеЗаписи.Контрагент,
			ВыборкаДетальныеЗаписи.Договор, ВыборкаДетальныеЗаписи.Документ, ВыборкаДетальныеЗаписи.Заказ);
		НоваяСтрока.Раздел = НСтр("ru = 'Расчеты с поставщиками'");
		
	КонецЦикла;
	
	// Пишем оставшиеся записи.
	НаборЗаписейДенежныеСредства.Записать(Ложь);
	НаборЗаписейДенежныеСредстваВКассахККМ.Записать(Ложь);
	НаборЗаписейДенежныеСредстваКПоступлению.Записать(Ложь);
	НаборЗаписейДвиженияДенежныхСредств.Записать(Ложь);
	НаборЗаписейРасчетыСПерсоналом.Записать(Ложь);
	НаборЗаписейРасчетыСПодотчетниками.Записать(Ложь);
	НаборЗаписейРасчетыСПокупателями.Записать(Ложь);
	НаборЗаписейРасчетыСПоставщиками.Записать(Ложь);
	НаборЗаписейДоходыИРасходы.Записать(Ложь);
	ТаблицаЗаписей = НаборЗаписейОтчетПоКурсовымРазницам.Выгрузить();
	ТаблицаЗаписей.Свернуть("Период, Активность, Организация, Аналитика, Валюта, Раздел", "Сумма, СуммаДоходов, СуммаРасходов, СуммаОстаток, СуммаВалОстаток");
	НаборЗаписейОтчетПоКурсовымРазницам.Загрузить(ТаблицаЗаписей);
	НаборЗаписейОтчетПоКурсовымРазницам.Записать(Ложь);
	НаборЗаписейУправленческий.Записать(Ложь);
	
КонецПроцедуры

#КонецОбласти


#Область ЗачетАвансаПоЕдиномуНалоговомуСчету

Процедура ЗачетАвансаПоЕдиномуНалоговомуСчету(СтруктураШапкиДокумента, Отказ)
	
	// ПОДГОТОВКА ПРОВЕДЕНИЯ ПО ДАННЫМ ДОКУМЕНТА
	
	ПараметрыПроведения = ПодготовитьПараметрыЗачетАвансаПоЕдиномуНалоговомуСчету(СтруктураШапкиДокумента);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// ФОРМИРОВАНИЕ ДВИЖЕНИЙ
	
	ЕдиныйНалоговыйСчет.ЗачетАвансаПоЕдиномуНалоговомуСчету(
	ПараметрыПроведения, Движения, Отказ);
	
КонецПроцедуры  

Функция ПодготовитьПараметрыЗачетАвансаПоЕдиномуНалоговомуСчету(СтруктураШапки)

	ПараметрыПроведения = Новый Структура;
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Ссылка", СтруктураШапки.Ссылка);
	
	НомераТаблиц = Новый Структура;
	Запрос.Текст = ТекстЗапросаЗачетАвансаПоЕдиномуНалоговомуСчету(НомераТаблиц);
	Результат = Запрос.Выполнить();
	
	Для каждого НомерТаблицы Из НомераТаблиц Цикл
		ПараметрыПроведения.Вставить(НомерТаблицы.Ключ, Результат.Выгрузить());
	КонецЦикла;
	
	Возврат ПараметрыПроведения;

КонецФункции

Функция ТекстЗапросаЗачетАвансаПоЕдиномуНалоговомуСчету(НомераТаблиц)

	НомераТаблиц.Вставить("ТаблицаРеквизиты", НомераТаблиц.Количество());
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ЗакрытиеМесяца.Ссылка КАК Регистратор,
	|	ЗакрытиеМесяца.Организация КАК Организация,
	|	КОНЕЦПЕРИОДА(ЗакрытиеМесяца.Дата, МЕСЯЦ) КАК Период,
	|	ИСТИНА КАК ВыдаватьСообщения,
	|	ЗакрытиеМесяца.ЗачетАвансаПоЕдиномуНалоговомуСчету КАК ВидОперации
	|ИЗ
	|	Документ.ЗакрытиеМесяца КАК ЗакрытиеМесяца
	|ГДЕ
	|	ЗакрытиеМесяца.Ссылка = &Ссылка";
	
	Возврат ТекстЗапроса + ОбщегоНазначенияУНФКлиентСервер.ТекстРазделителяЗапросовПакета();

КонецФункции

Процедура ОтменитьФормированиеЗаписейУСНВПериодеПоВиду(Организация, ПериодФормирования
	, ВидФормирования, ДокументОснование = Неопределено) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ЗаписиУСН.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЗаписиУСН КАК ЗаписиУСН
	|ГДЕ
	|	ЗаписиУСН.Дата МЕЖДУ &НачалоМесяца И &КонецМесяца
	|	И НЕ ЗаписиУСН.ПометкаУдаления
	|	И ЗаписиУСН.Организация = &Организация
	|	И ЗаписиУСН.ВидЗаписей = &ВидФормирования");
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ВидФормирования", ВидФормирования);
	Запрос.УстановитьПараметр("НачалоМесяца", НачалоМесяца(ПериодФормирования));
	Запрос.УстановитьПараметр("КонецМесяца", КонецМесяца(ПериодФормирования)); 
	
	РезультатПоиска = Запрос.Выполнить().Выбрать();
	
	Пока РезультатПоиска.Следующий() Цикл    
		ДокументФормирования = РезультатПоиска.Ссылка.ПолучитьОбъект();  
		ДокументФормирования.Записать(РежимЗаписиДокумента.ОтменаПроведения);  		
	КонецЦикла;
	
КонецПроцедуры

Функция ЗаполнитьСтруктуруШапкиДокумента(Отказ)
	
	ГоловнаяОрганизация = РегламентированнаяОтчетность.ГоловнаяОрганизация(Организация);
	Отказ               = Не ПрослеживаемостьПереопределяемый.УчетнаяПолитикаСуществует(ГоловнаяОрганизация, Дата);
	СтруктураШапки      = Новый Структура();
	
	Если Отказ Тогда
		Возврат СтруктураШапки;
	КонецЕсли;
	
	Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Проведение документа: %1 (%2)'"), СокрЛП(ЭтотОбъект), "Зачет аванса по единому налоговому счету");
	
	СтруктураШапки.Вставить("НачДата",                 НачалоМесяца(Дата));
	СтруктураШапки.Вставить("КонДата",                 КонецМесяца(Дата));
	СтруктураШапки.Вставить("НачГраница",              Новый Граница(СтруктураШапки.НачДата, ВидГраницы.Исключая));
	СтруктураШапки.Вставить("КонГраница",              Новый Граница(СтруктураШапки.КонДата, ВидГраницы.Включая));
	СтруктураШапки.Вставить("НачГода",                 НачалоГода(Дата));
	СтруктураШапки.Вставить("Организация",             Организация);
	СтруктураШапки.Вставить("Ссылка",                  Ссылка);
	СтруктураШапки.Вставить("Дата",                    Дата);
	СтруктураШапки.Вставить("Номер",                   Номер);
	СтруктураШапки.Вставить("Заголовок",               Заголовок);
	СтруктураШапки.Вставить("ГоловноеПодразделение",   ГоловнаяОрганизация);
	СтруктураШапки.Вставить("Предприниматель",         Истина);
	
	ВсяОрганизация = ПрослеживаемостьПереопределяемый.ВсяОрганизация(Организация);
	СписокОП = Новый СписокЗначений;
	Для Каждого ОбособленноеПодразделение Из ВсяОрганизация Цикл
		СписокОП.Добавить(ОбособленноеПодразделение);
	КонецЦикла;
	СтруктураШапки.Вставить("СписокОрганизаций", СписокОП);
	
	ЕстьОбособленныеПодразделения = СписокОП.Количество() > 1;
	СтруктураШапки.Вставить("ЕстьОбособленныеПодразделения", ЕстьОбособленныеПодразделения);
	Возврат СтруктураШапки;
	
КонецФункции

#КонецОбласти

#Область РаботаСОшибкамиЗакрытияМесяца

Процедура ДобавитьОшибкуВТаблицу(ОписаниеОшибки, ВидОперации, Аналитика = Неопределено)
	
	Если Аналитика = Неопределено Тогда
		Аналитика = Документы.ЗаказПокупателя.ПустаяСсылка();
	КонецЕсли;
	
	НоваяСтрока = ДополнительныеСвойства.ДляПроведения.ТаблицаОшибок.Добавить();
	НоваяСтрока.Период = Дата;
	НоваяСтрока.Организация = ДополнительныеСвойства.ДляПроведения.Организация;
	НоваяСтрока.ВидОперации = ВидОперации;
	НоваяСтрока.Аналитика = Аналитика;
	НоваяСтрока.ОписаниеОшибки = ОписаниеОшибки;
	НоваяСтрока.Регистратор = Ссылка;
	НоваяСтрока.Активность = Истина;
	
КонецПроцедуры

Функция СформироватьОписаниеОшибкиРаспределенияЗатрат(СчетУчета, СпособРаспределения, ФильтрПоЗаказ, Сумма)
	
	ТекстСчета = Строка(СчетУчета);
	ТекстСуммы = Строка(Сумма) + " " + ДополнительныеСвойства.ДляПроведения.ОписаниеОшибок.ПредставлениеВалюты;
	ТекстСпособа = ДополнительныеСвойства.ДляПроведения.ОписаниеОшибок.ЗатратыБаза[СпособРаспределения];
	
	Если ЗначениеЗаполнено(ФильтрПоЗаказ) Тогда
		ТекстЗаказа = " " + СтрШаблон(НСтр("ru = 'по %1'"), Строка(ФильтрПоЗаказ));
	Иначе
		ТекстЗаказа = "";	
	КонецЕсли;
	
	ШаблонДопОписания = ДополнительныеСвойства.ДляПроведения.ОписаниеОшибок.ЗатратыДопОписание[СпособРаспределения];
	ТекстДопОписания = СтрШаблон(ШаблонДопОписания, ТекстЗаказа);
	
	ОписаниеОшибки = СтрШаблон(
		НСтр("ru = 'Затрата ""%1"" в сумме %2, распределяемая на выпуск продукции по %3
			| не может быть распределена, т.к. в рассчитываемом периоде не было %4.'"),
		ТекстСчета,
		ТекстСуммы,
		ТекстСпособа,
		ТекстДопОписания);
	
	Возврат ОписаниеОшибки;
	
КонецФункции

Функция СформироватьОписаниеОшибкиРаспределенияРасходов(СчетУчета, СпособРаспределения, Сумма)
	
	ТекстСчета = Строка(СчетУчета);
	ТекстСуммы = Строка(Сумма) + " " + ДополнительныеСвойства.ДляПроведения.ОписаниеОшибок.ПредставлениеВалюты;
	ТекстСпособа = ДополнительныеСвойства.ДляПроведения.ОписаниеОшибок.РасходыБаза[СпособРаспределения];
	ТекстДопОписания = ДополнительныеСвойства.ДляПроведения.ОписаниеОшибок.РасходыДопОписание[СпособРаспределения];
	
	ОписаниеОшибки = СтрШаблон(
		НСтр("ru = 'Расход ""%1"" в сумме %2, распределяемый на финансовый результат по %3
			| не может быть распределен, т.к. в рассчитываемом периоде не было %4.'"),
		ТекстСчета,
		ТекстСуммы,
		ТекстСпособа,
		ТекстДопОписания);
	
	Возврат ОписаниеОшибки;
	
КонецФункции

Процедура ЗафиксироватьОшибкиЗакрытияМесяца()
	
	ТекстСообщения = НСтр("ru = 'При закрытии месяца были сформированы предупреждения.'");
	ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	
	НаборЗаписейОшибкиЗакрытияМесяца = РегистрыСведений.ОшибкиЗакрытияМесяца.СоздатьНаборЗаписей();
	НаборЗаписейОшибкиЗакрытияМесяца.Отбор.Регистратор.Установить(Ссылка);
	
	ТаблицаОшибок = ДополнительныеСвойства.ДляПроведения.ТаблицаОшибок;
	ТаблицаОшибок.Свернуть("Период,Регистратор,Активность,Организация,ВидОперации,ОписаниеОшибки,Аналитика");
	
	НаборЗаписейОшибкиЗакрытияМесяца.Загрузить(ТаблицаОшибок);
	НаборЗаписейОшибкиЗакрытияМесяца.Записать(Истина);
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыИФункцииДляОбеспеченияПроведенияДокумента

// Добавляет дополнительные реквизиты, необходимые для проведения документа в
// переданную структуру.
//
// Параметры:
//  СтруктураДополнительныеСвойства - Структура - Структура дополнительных свойств документа.
//
Процедура ДобавитьРеквизитыВДополнительныеСвойстваДляПроведения(СтруктураДополнительныеСвойства)
	
	НачальнаяГраницаПериода = Новый Граница(НачалоМесяца(Дата), ВидГраницы.Включая);
	КонечнаяГраницаПериода = Новый Граница(КонецМесяца (Дата), ВидГраницы.Включая);
	НачальнаяДатаПериода = НачалоМесяца(Дата);
	КонечнаяДатаПериода = КонецМесяца(Дата);
	ТаблицаОшибок = РегистрыСведений.ОшибкиЗакрытияМесяца.СоздатьНаборЗаписей().ВыгрузитьКолонки();
	
	СтруктураДополнительныеСвойства.ДляПроведения.Вставить("ПустойСчет", ПланыСчетов.Управленческий.ПустаяСсылка());
	
	СтруктураДополнительныеСвойства.ДляПроведения.Вставить("НачальнаяГраницаПериода", НачальнаяГраницаПериода);
	СтруктураДополнительныеСвойства.ДляПроведения.Вставить("КонечнаяГраницаПериода", КонечнаяГраницаПериода);
	СтруктураДополнительныеСвойства.ДляПроведения.Вставить("НачальнаяДатаПериода", НачальнаяДатаПериода);
	СтруктураДополнительныеСвойства.ДляПроведения.Вставить("КонечнаяДатаПериода", КонечнаяДатаПериода);
	СтруктураДополнительныеСвойства.ДляПроведения.Вставить("ТаблицаОшибок", ТаблицаОшибок);
	СтруктураДополнительныеСвойства.ДляПроведения.Вставить("ОписаниеОшибок", Новый Структура);
	
	// Фиксированные литералы для формирования текстов ошибок
	ПредставлениеВалюты = Строка(СтруктураДополнительныеСвойства.ВалютаУчета);
	
	// Расходы
	РасходыБаза = Новый Соответствие;
	РасходыБаза.Вставить(Перечисления.БазыРаспределенияРасходов.ОбъемПродаж, 
		НСтр("ru = 'объему продаж'"));
	РасходыБаза.Вставить(Перечисления.БазыРаспределенияРасходов.ВыручкаОтПродаж, 
		НСтр("ru = 'выручке от продаж'"));
	РасходыБаза.Вставить(Перечисления.БазыРаспределенияРасходов.СебестоимостьПродаж, 
		НСтр("ru = 'себестоимости продаж'"));
	РасходыБаза.Вставить(Перечисления.БазыРаспределенияРасходов.ВаловаяПрибыль, 
		НСтр("ru = 'валовой прибыли'"));
	
	РасходыДопОписание = Новый Соответствие;
	РасходыДопОписание.Вставить(Перечисления.БазыРаспределенияРасходов.ОбъемПродаж, 
		НСтр("ru = 'продаж'"));
	РасходыДопОписание.Вставить(Перечисления.БазыРаспределенияРасходов.ВыручкаОтПродаж, 
		НСтр("ru = 'выручки от продаж'"));
	РасходыДопОписание.Вставить(Перечисления.БазыРаспределенияРасходов.СебестоимостьПродаж, 
		НСтр("ru = 'себестоимости продаж'"));
	РасходыДопОписание.Вставить(Перечисления.БазыРаспределенияРасходов.ВаловаяПрибыль, 
		НСтр("ru = 'валовой прибыли'"));
	
	// Затраты
	ЗатратыБаза = Новый Соответствие;
	ЗатратыБаза.Вставить(Перечисления.БазыРаспределенияРасходов.ОбъемВыпуска, 
		НСтр("ru = 'объему выпуска'"));
	ЗатратыБаза.Вставить(Перечисления.БазыРаспределенияРасходов.ПрямыеЗатраты, 
		НСтр("ru = 'прямым затратам'"));
	
	ЗатратыДопОписание = Новый Соответствие;
	ЗатратыДопОписание.Вставить(Перечисления.БазыРаспределенияРасходов.ОбъемВыпуска, 
		НСтр("ru = 'выпусков продукции%1'"));
	ЗатратыДопОписание.Вставить(Перечисления.БазыРаспределенияРасходов.ПрямыеЗатраты, 
		НСтр("ru = 'распределения прямых затрат%1, указанных в настройке распределения'"));
	
	СтруктураДополнительныеСвойства.ДляПроведения.ОписаниеОшибок.Вставить("РасходыБаза", РасходыБаза);
	СтруктураДополнительныеСвойства.ДляПроведения.ОписаниеОшибок.Вставить("РасходыДопОписание", РасходыДопОписание);
	СтруктураДополнительныеСвойства.ДляПроведения.ОписаниеОшибок.Вставить("ЗатратыБаза", ЗатратыБаза);
	СтруктураДополнительныеСвойства.ДляПроведения.ОписаниеОшибок.Вставить("ЗатратыДопОписание", ЗатратыДопОписание);
	СтруктураДополнительныеСвойства.ДляПроведения.ОписаниеОшибок.Вставить("ПредставлениеВалюты", ПредставлениеВалюты);
	
КонецПроцедуры

// Устанавливает свойство записывать для наборов записей документа в переданное
// значение.
//
// Параметры:
//  ФлагЗаписи   - Булево - Флаг разрешения записи наборов записей.
//
Процедура УстановитьСвойстваНаборовЗаписейДокумента(ФлагЗаписи)
	
	Движения.УзлыКорректировкиСтоимостиСписания.Записывать = ФлагЗаписи;
	Движения.Запасы.Записывать = ФлагЗаписи;
	Движения.Продажи.Записывать = ФлагЗаписи;
	Движения.ДоходыИРасходы.Записывать = ФлагЗаписи;
	Движения.Управленческий.Записывать = ФлагЗаписи;
	Движения.ОшибкиЗакрытияМесяца.Записывать = ФлагЗаписи;
	Движения.ОтчетПоКурсовымРазницам.Записывать = ФлагЗаписи;
	
КонецПроцедуры

Процедура УстановитьБлокировкуРегистров()
	
	СоответствиеРегистровБлокировки = Новый Соответствие;
	Если РасчетПрямыхЗатрат Тогда
		СоответствиеРегистровБлокировки.Вставить("РегистрНакопления.Запасы");
		СоответствиеРегистровБлокировки.Вставить("РегистрНакопления.Продажи");
		СоответствиеРегистровБлокировки.Вставить("РегистрНакопления.ДоходыИРасходы");
		СоответствиеРегистровБлокировки.Вставить("РегистрБухгалтерии.Управленческий");
		СоответствиеРегистровБлокировки.Вставить("РегистрСведений.УзлыКорректировкиСтоимостиСписания");
	КонецЕсли;
	Если РаспределениеЗатрат Тогда
		СоответствиеРегистровБлокировки.Вставить("РегистрНакопления.Запасы");
		СоответствиеРегистровБлокировки.Вставить("РегистрБухгалтерии.Управленческий");
	КонецЕсли;
	Если РасчетФактическойСебестоимости Тогда
		СоответствиеРегистровБлокировки.Вставить("РегистрНакопления.СуммовойУчетВРознице");
		СоответствиеРегистровБлокировки.Вставить("РегистрНакопления.ДоходыИРасходы");
		СоответствиеРегистровБлокировки.Вставить("РегистрБухгалтерии.Управленческий");
	КонецЕсли;
	Если РасчетКурсовыхРазниц Тогда
		СоответствиеРегистровБлокировки.Вставить("РегистрНакопления.ДенежныеСредства");
		СоответствиеРегистровБлокировки.Вставить("РегистрНакопления.ДенежныеСредстваВКассахККМ");
		СоответствиеРегистровБлокировки.Вставить("РегистрНакопления.ДенежныеСредстваКПоступлению");
		СоответствиеРегистровБлокировки.Вставить("РегистрНакопления.РасчетыСПерсоналом");
		СоответствиеРегистровБлокировки.Вставить("РегистрНакопления.РасчетыСПодотчетниками");
		СоответствиеРегистровБлокировки.Вставить("РегистрНакопления.РасчетыСПокупателями");
		СоответствиеРегистровБлокировки.Вставить("РегистрНакопления.РасчетыСПоставщиками");
		СоответствиеРегистровБлокировки.Вставить("РегистрНакопления.ДоходыИРасходы");
		СоответствиеРегистровБлокировки.Вставить("РегистрСведений.ОтчетПоКурсовымРазницам");
		СоответствиеРегистровБлокировки.Вставить("РегистрБухгалтерии.Управленческий");
	КонецЕсли;
	Если РасчетФинансовогоРезультата Тогда
		СоответствиеРегистровБлокировки.Вставить("РегистрНакопления.ДоходыИРасходы");
		СоответствиеРегистровБлокировки.Вставить("РегистрБухгалтерии.Управленческий");
	КонецЕсли;
	
	Если СоответствиеРегистровБлокировки.Количество() > 0 Тогда
		Блокировка = Новый БлокировкаДанных;
		Диапазон = Новый Диапазон(ДополнительныеСвойства.ДляПроведения.НачальнаяДатаПериода, ДополнительныеСвойства.ДляПроведения.КонечнаяДатаПериода);
		Для каждого РегистрБлокировки Из СоответствиеРегистровБлокировки Цикл
			ЭлементБлокировки = Блокировка.Добавить(РегистрБлокировки.Ключ);
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			ЭлементБлокировки.УстановитьЗначение("Организация", Организация);
			ЭлементБлокировки.УстановитьЗначение("Период", Диапазон);
			Если РегистрБлокировки.Ключ = "РегистрНакопления.Запасы"
				ИЛИ РегистрБлокировки.Ключ = "РегистрНакопления.Продажи"
				ИЛИ РегистрБлокировки.Ключ = "РегистрНакопления.ДенежныеСредстваВКассахККМ" Тогда
				ЭлементБлокировки.УстановитьЗначение("ДвижениеЧекаВОткрытойСмене", Ложь);
			КонецЕсли;
		КонецЦикла;
		Попытка
			Блокировка.Заблокировать();
		Исключение
			ЗаписьЖурналаРегистрации(
				НСтр("ru = 'ЗакрытиеМесяца.Ошибка блокировки регистров'"),
				УровеньЖурналаРегистрации.Ошибка, , , ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ВызватьИсключение;
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

Процедура СвернутьЗаписиРегистров()
	
	НаборЗаписейЗапасы = РегистрыНакопления.Запасы.СоздатьНаборЗаписей();
	НаборЗаписейЗапасы.Отбор.Регистратор.Установить(Ссылка);
	СвернутьНаборЗаписейЗапасы(НаборЗаписейЗапасы);
	НаборЗаписейЗапасы.Записать(Истина);
	
	НаборЗаписейДоходыИРасходы = РегистрыНакопления.ДоходыИРасходы.СоздатьНаборЗаписей();
	НаборЗаписейДоходыИРасходы.Отбор.Регистратор.Установить(Ссылка);
	СвернутьНаборЗаписейДоходыИРасходы(НаборЗаписейДоходыИРасходы);
	НаборЗаписейДоходыИРасходы.Записать(Истина);
	
	НаборЗаписейПродажи = РегистрыНакопления.Продажи.СоздатьНаборЗаписей();
	НаборЗаписейПродажи.Отбор.Регистратор.Установить(Ссылка);
	СвернутьНаборЗаписейПродажи(НаборЗаписейПродажи);
	НаборЗаписейПродажи.Записать(Истина);
	
	НаборЗаписейФинансовыйРезультат = РегистрыНакопления.ФинансовыйРезультат.СоздатьНаборЗаписей();
	НаборЗаписейФинансовыйРезультат.Отбор.Регистратор.Установить(Ссылка);
	СвернутьНаборЗаписейФинансовыйРезультат(НаборЗаписейФинансовыйРезультат);
	НаборЗаписейФинансовыйРезультат.Записать(Истина);
	
	НаборЗаписейУправленческий = РегистрыБухгалтерии.Управленческий.СоздатьНаборЗаписей();
	НаборЗаписейУправленческий.Отбор.Регистратор.Установить(Ссылка);
	СвернутьНаборЗаписейУправленческий(НаборЗаписейУправленческий);
	НаборЗаписейУправленческий.Записать(Истина);
	
КонецПроцедуры

Процедура СвернутьНаборЗаписейДоходыИРасходы(НаборЗаписейРегистра)
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДоходыИРасходы.Период,
	|	ДоходыИРасходы.Активность,
	|	ДоходыИРасходы.Организация,
	|	ДоходыИРасходы.СтруктурнаяЕдиница,
	|	ДоходыИРасходы.Проект,
	|	ДоходыИРасходы.НаправлениеДеятельности,
	|	ДоходыИРасходы.ЗаказПокупателя,
	|	ДоходыИРасходы.СчетУчета,
	|	ДоходыИРасходы.Аналитика,
	|	СУММА(ДоходыИРасходы.СуммаДоходов) КАК СуммаДоходов,
	|	СУММА(ДоходыИРасходы.СуммаРасходов) КАК СуммаРасходов,
	|	ДоходыИРасходы.СодержаниеПроводки
	|ИЗ
	|	РегистрНакопления.ДоходыИРасходы КАК ДоходыИРасходы
	|ГДЕ
	|	ДоходыИРасходы.Регистратор = &Регистратор
	|
	|СГРУППИРОВАТЬ ПО
	|	ДоходыИРасходы.Период,
	|	ДоходыИРасходы.Активность,
	|	ДоходыИРасходы.Организация,
	|	ДоходыИРасходы.СтруктурнаяЕдиница,
	|	ДоходыИРасходы.Проект,
	|	ДоходыИРасходы.НаправлениеДеятельности,
	|	ДоходыИРасходы.ЗаказПокупателя,
	|	ДоходыИРасходы.СчетУчета,
	|	ДоходыИРасходы.Аналитика,
	|	ДоходыИРасходы.СодержаниеПроводки
	|
	|ИМЕЮЩИЕ
	|	(СУММА(ДоходыИРасходы.СуммаДоходов) <> 0
	|		ИЛИ СУММА(ДоходыИРасходы.СуммаРасходов) <> 0)";
	
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	
	ТаблицаЗаписейРегистра = Запрос.Выполнить().Выгрузить();
	
	НаборЗаписейРегистра.Загрузить(ТаблицаЗаписейРегистра);
	
КонецПроцедуры

Процедура СвернутьНаборЗаписейЗапасы(НаборЗаписейРегистра)
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Запасы.Период,
	|	Запасы.Активность,
	|	Запасы.ВидДвижения,
	|	Запасы.Организация,
	|	Запасы.СтруктурнаяЕдиница,
	|	Запасы.СчетУчета,
	|	Запасы.Номенклатура,
	|	Запасы.Характеристика,
	|	Запасы.Партия,
	|	Запасы.ЗаказПокупателя,
	|	Запасы.ЗаказНаПроизводство,
	|	СУММА(Запасы.Количество) КАК Количество,
	|	СУММА(Запасы.СуммаБезНДС) КАК СуммаБезНДС,
	|	СУММА(Запасы.Сумма) КАК Сумма,
	|	Запасы.КоррСтруктурнаяЕдиница,
	|	Запасы.КоррСчетУчета,
	|	Запасы.КоррНоменклатура,
	|	Запасы.КоррХарактеристика,
	|	Запасы.КоррПартия,
	|	Запасы.КоррЗаказПокупателя,
	|	Запасы.КоррЗаказНаПроизводство,
	|	Запасы.Спецификация,
	|	Запасы.КоррСпецификация,
	|	Запасы.ЗаказПродажи,
	|	Запасы.Подразделение,
	|	Запасы.Ответственный,
	|	Запасы.ДокументПродажи,
	|	Запасы.СтавкаНДС,
	|	Запасы.ФиксированнаяСтоимость,
	|	Запасы.ЗатратыНаВыпуск,
	|	Запасы.Возврат,
	|	Запасы.СодержаниеПроводки,
	|	Запасы.ПеремещениеВРозницуСуммовойУчет
	|ИЗ
	|	РегистрНакопления.Запасы КАК Запасы
	|ГДЕ
	|	Запасы.Регистратор = &Регистратор
	|
	|СГРУППИРОВАТЬ ПО
	|	Запасы.Период,
	|	Запасы.Активность,
	|	Запасы.ВидДвижения,
	|	Запасы.Организация,
	|	Запасы.СтруктурнаяЕдиница,
	|	Запасы.СчетУчета,
	|	Запасы.Номенклатура,
	|	Запасы.Характеристика,
	|	Запасы.Партия,
	|	Запасы.ЗаказПокупателя,
	|	Запасы.ЗаказНаПроизводство,
	|	Запасы.КоррСтруктурнаяЕдиница,
	|	Запасы.КоррСчетУчета,
	|	Запасы.КоррНоменклатура,
	|	Запасы.КоррХарактеристика,
	|	Запасы.КоррПартия,
	|	Запасы.КоррЗаказПокупателя,
	|	Запасы.КоррЗаказНаПроизводство,
	|	Запасы.Спецификация,
	|	Запасы.КоррСпецификация,
	|	Запасы.ЗаказПродажи,
	|	Запасы.Подразделение,
	|	Запасы.Ответственный,
	|	Запасы.ДокументПродажи,
	|	Запасы.СтавкаНДС,
	|	Запасы.ФиксированнаяСтоимость,
	|	Запасы.ЗатратыНаВыпуск,
	|	Запасы.Возврат,
	|	Запасы.СодержаниеПроводки,
	|	Запасы.ПеремещениеВРозницуСуммовойУчет
	|
	|ИМЕЮЩИЕ
	|	(СУММА(Запасы.Количество) <> 0
	|		ИЛИ СУММА(Запасы.Сумма) <> 0
	|		ИЛИ СУММА(Запасы.СуммаБезНДС) <> 0)";
	
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	
	ТаблицаЗаписейРегистра = Запрос.Выполнить().Выгрузить();
	
	НаборЗаписейРегистра.Загрузить(ТаблицаЗаписейРегистра); 
	
КонецПроцедуры

Процедура СвернутьНаборЗаписейПродажи(НаборЗаписейРегистра)
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Продажи.Период,
	|	Продажи.Активность,
	|	Продажи.Номенклатура,
	|	Продажи.Характеристика,
	|	Продажи.Партия,
	|	Продажи.Документ,
	|	Продажи.СтавкаНДС,
	|	Продажи.Организация,
	|	Продажи.ЗаказПокупателя,
	|	Продажи.Подразделение,
	|	Продажи.Склад,
	|	Продажи.Ответственный,
	|	СУММА(Продажи.Количество) КАК Количество,
	|	СУММА(Продажи.Сумма) КАК Сумма,
	|	СУММА(Продажи.СуммаНДС) КАК СуммаНДС,
	|	СУММА(Продажи.СебестоимостьБезНДС) КАК СебестоимостьБезНДС,
	|	СУММА(Продажи.Себестоимость) КАК Себестоимость,
	|	СУММА(Продажи.СебестоимостьИнт) КАК СебестоимостьИнт,
	|	СУММА(Продажи.СебестоимостьБезНДСИнт) КАК СебестоимостьБезНДСИнт
	|ИЗ
	|	РегистрНакопления.Продажи КАК Продажи
	|ГДЕ
	|	Продажи.Регистратор = &Регистратор
	|
	|СГРУППИРОВАТЬ ПО
	|	Продажи.Период,
	|	Продажи.Активность,
	|	Продажи.Номенклатура,
	|	Продажи.Характеристика,
	|	Продажи.Партия,
	|	Продажи.Документ,
	|	Продажи.СтавкаНДС,
	|	Продажи.Организация,
	|	Продажи.ЗаказПокупателя,
	|	Продажи.Подразделение,
	|	Продажи.Склад,
	|	Продажи.Ответственный
	|
	|ИМЕЮЩИЕ
	|	(СУММА(Продажи.Количество) <> 0
	|		ИЛИ СУММА(Продажи.Сумма) <> 0
	|		ИЛИ СУММА(Продажи.СуммаНДС) <> 0
	|		ИЛИ СУММА(Продажи.СебестоимостьБезНДС) <> 0
	|		ИЛИ СУММА(Продажи.Себестоимость) <> 0)";
	
	Запрос.УстановитьПараметр("Регистратор", Ссылка);

	ТаблицаЗаписейРегистра = Запрос.Выполнить().Выгрузить();
	
	НаборЗаписейРегистра.Загрузить(ТаблицаЗаписейРегистра);
	
КонецПроцедуры

Процедура СвернутьНаборЗаписейФинансовыйРезультат(НаборЗаписейРегистра)
			
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ФинансовыйРезультат.Период,
	|	ФинансовыйРезультат.Активность,
	|	ФинансовыйРезультат.Организация,
	|	ФинансовыйРезультат.СтруктурнаяЕдиница,
	|	ФинансовыйРезультат.Проект,
	|	ФинансовыйРезультат.НаправлениеДеятельности,
	|	ФинансовыйРезультат.ЗаказПокупателя,
	|	ФинансовыйРезультат.СчетУчета,
	|	ФинансовыйРезультат.Аналитика,
	|	СУММА(ФинансовыйРезультат.СуммаДоходов) КАК СуммаДоходов,
	|	СУММА(ФинансовыйРезультат.СуммаРасходов) КАК СуммаРасходов,
	|	ФинансовыйРезультат.СодержаниеПроводки
	|ИЗ
	|	РегистрНакопления.ФинансовыйРезультат КАК ФинансовыйРезультат
	|ГДЕ
	|	ФинансовыйРезультат.Регистратор = &Регистратор
	|
	|СГРУППИРОВАТЬ ПО
	|	ФинансовыйРезультат.Период,
	|	ФинансовыйРезультат.Активность,
	|	ФинансовыйРезультат.Организация,
	|	ФинансовыйРезультат.СтруктурнаяЕдиница,
	|	ФинансовыйРезультат.Проект,
	|	ФинансовыйРезультат.НаправлениеДеятельности,
	|	ФинансовыйРезультат.ЗаказПокупателя,
	|	ФинансовыйРезультат.СчетУчета,
	|	ФинансовыйРезультат.Аналитика,
	|	ФинансовыйРезультат.СодержаниеПроводки
	|
	|ИМЕЮЩИЕ
	|	(СУММА(ФинансовыйРезультат.СуммаДоходов) <> 0
	|		ИЛИ СУММА(ФинансовыйРезультат.СуммаРасходов) <> 0)";

	Запрос.УстановитьПараметр("Регистратор", Ссылка);

	ТаблицаЗаписейРегистра = Запрос.Выполнить().Выгрузить();
	
	НаборЗаписейРегистра.Загрузить(ТаблицаЗаписейРегистра);

КонецПроцедуры

Процедура СвернутьНаборЗаписейУправленческий(НаборЗаписейРегистра)
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Управленческий.Период,
	|	Управленческий.Активность,
	|	Управленческий.СчетДт,
	|	Управленческий.СчетКт,
	|	Управленческий.Организация,
	|	Управленческий.СценарийПланирования,
	|	Управленческий.ВалютаДт,
	|	Управленческий.ВалютаКт,
	|	СУММА(Управленческий.Сумма) КАК Сумма,
	|	СУММА(Управленческий.СуммаВалДт) КАК СуммаВалДт,
	|	СУММА(Управленческий.СуммаВалКт) КАК СуммаВалКт,
	|	Управленческий.Содержание
	|ИЗ
	|	РегистрБухгалтерии.Управленческий КАК Управленческий
	|ГДЕ
	|	Управленческий.Регистратор = &Регистратор
	|
	|СГРУППИРОВАТЬ ПО
	|	Управленческий.Период,
	|	Управленческий.Активность,
	|	Управленческий.СчетДт,
	|	Управленческий.СчетКт,
	|	Управленческий.Организация,
	|	Управленческий.СценарийПланирования,
	|	Управленческий.ВалютаДт,
	|	Управленческий.ВалютаКт,
	|	Управленческий.Содержание
	|
	|ИМЕЮЩИЕ
	|	(СУММА(Управленческий.Сумма) <> 0
	|		ИЛИ СУММА(Управленческий.СуммаВалДт) <> 0
	|		ИЛИ СУММА(Управленческий.СуммаВалКт) <> 0)"; 

	Запрос.УстановитьПараметр("Регистратор", Ссылка);

	ТаблицаЗаписейРегистра = Запрос.Выполнить().Выгрузить();
	
	НаборЗаписейРегистра.Загрузить(ТаблицаЗаписейРегистра);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Иначе

ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");

#КонецЕсли