
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2026, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Определяет настройку интеграции с платежными системами на основании
// данных продажи / возврата
//
// Параметры:
//  Организация - ОпределяемыйТип.ОрганизацияРМК - организация из документа продажи;
//  ТорговыйОбъект - ОпределяемыйТип.ТорговыйОбъектРМК - касса из документа продажи;
//
// Возвращаемое значение:
//  ТаблицаЗначений - настройки интеграции с платежной системой.
//
Функция НастройкиИнтеграции(Организация = Неопределено, ТорговыйОбъект = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация",    Организация);
	Запрос.УстановитьПараметр("ТорговыйОбъект", ТорговыйОбъект);
	
	ИнтеграцияСПлатежнымиСистемамиРМКПереопределяемый.ЗаполнитьТекстЗапросаНастройкиИнтеграции(Запрос.Текст);
	
	Если Не ЗначениеЗаполнено(Запрос.Текст) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Возврат РезультатЗапроса.Выгрузить();
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция НастроенаОплатаПлатежнойСистемой() Экспорт
	
	НастройкиПодключения = Новый Структура();
	НастройкиПодключения.Вставить("ИспользоватьОплатуСБП",                 Ложь);
	НастройкиПодключения.Вставить("ИспользоватьОплатуЮКасса",              Ложь);
	НастройкиПодключения.Вставить("ИспользоватьОплатуПлатежнымиСистемами", Ложь);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация",    Неопределено);
	Запрос.УстановитьПараметр("ТорговыйОбъект", Неопределено);
	
	ИнтеграцияСПлатежнымиСистемамиРМКПереопределяемый.ЗаполнитьТекстЗапросаНастройкиИнтеграции(Запрос.Текст);
	
	Если ЗначениеЗаполнено(Запрос.Текст)Тогда
		
		УстановитьПривилегированныйРежим(Истина);
		
		РезультатЗапроса = Запрос.Выполнить();
		ТипыИнтеграций	 = РезультатЗапроса.Колонки.Интеграция.ТипЗначения;
		
		Для Каждого ТипИнтеграции Из РезультатЗапроса.Колонки.Интеграция.ТипЗначения.Типы() Цикл
			
			МетаданныеОбъекта = Метаданные.НайтиПоТипу(ТипИнтеграции);
			ВидОбъекта        = ?(МетаданныеОбъекта = Неопределено, "", МетаданныеОбъекта.ПолноеИмя());
			
			Если ВидОбъекта = "Справочник.НастройкиПодключенияКСистемеБыстрыхПлатежей" Тогда
				
				НастройкиПодключения.ИспользоватьОплатуСБП                 = Истина;
				
			ИначеЕсли ВидОбъекта = "Справочник.НастройкиОнлайнОплат" Тогда
				
				НастройкиПодключения.ИспользоватьОплатуЮКасса              = Истина;
				
			ИначеЕсли ВидОбъекта = "Справочник.НастройкиПодключенияКПлатежнымСистемам" Тогда
				
				НастройкиПодключения.ИспользоватьОплатуПлатежнымиСистемами = Истина;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат НастройкиПодключения;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	
	Методы.Вставить("СтатусВозвратОплаты", Истина);
	Методы.Вставить("ОтменитьОперациюВФоне", Истина);
	Методы.Вставить("СтатусОплатыВПлатежнойСистеме", Истина);
	Методы.Вставить("ВозвратОплаты", Истина);
	Методы.Вставить("ИдентификаторОплатыВПлатежнойСистеме", Истина);
	
КонецПроцедуры

Функция ИдентификаторОплатыВПлатежнойСистеме(ПараметрыПроцедуры) Экспорт
	
	АдресРезультата = ПоместитьВоВременноеХранилище(Неопределено);
	
	ИнтеграцияСПлатежнымиСистемамиРМКПереопределяемый.ИдентификаторОплатыВПлатежнойСистеме(
		ПараметрыПроцедуры,
		АдресРезультата);
	
	Возврат ПолучитьИзВременногоХранилища(АдресРезультата);
	
КонецФункции

Функция СтатусОплатыВПлатежнойСистеме(ПараметрыПроцедуры) Экспорт
	
	АдресРезультата = ПоместитьВоВременноеХранилище(Неопределено);
	
	ИнтеграцияСПлатежнымиСистемамиРМКПереопределяемый.СтатусОплатыВПлатежнойСистеме(
		ПараметрыПроцедуры,
		АдресРезультата);
	
	Возврат ПолучитьИзВременногоХранилища(АдресРезультата);
	
КонецФункции

Функция ВозвратОплаты(ПараметрыПроцедуры) Экспорт
	
	АдресРезультата = ПоместитьВоВременноеХранилище(Неопределено);
	
	ИнтеграцияСПлатежнымиСистемамиРМКПереопределяемый.ВозвратОплаты(
		ПараметрыПроцедуры,
		АдресРезультата);
	
	Возврат ПолучитьИзВременногоХранилища(АдресРезультата);
	
КонецФункции

Функция СтатусВозвратОплаты(ПараметрыПроцедуры) Экспорт
	
	АдресРезультата = ПоместитьВоВременноеХранилище(Неопределено);
	
	ИнтеграцияСПлатежнымиСистемамиРМКПереопределяемый.СтатусВозвратОплаты(
		ПараметрыПроцедуры,
		АдресРезультата);
	
	Возврат ПолучитьИзВременногоХранилища(АдресРезультата);
	
КонецФункции

Функция ОтменитьОперациюВФоне(ПараметрыОтмены) Экспорт
	
	АдресРезультата = ПоместитьВоВременноеХранилище(Неопределено);
	
	ИнтеграцияСПлатежнымиСистемамиРМКПереопределяемый.ОтменитьОперациюВФоне(
		ПараметрыОтмены,
		АдресРезультата);
	
	Возврат ПолучитьИзВременногоХранилища(АдресРезультата);
	
КонецФункции

#КонецОбласти
