
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИнтерфейсРМКСлужебный.ПрименитьНаФормеМасштабИзПараметров(ЭтотОбъект, Параметры);
	ОбработатьВходныеПараметры();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Подтвердить(Команда)
	
	РезультатКонтроля = Новый Структура("Подтвердить", Истина);
	Закрыть(РезультатКонтроля);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбработатьВходныеПараметры()
	
	Для Каждого СтрокаДанных Из Параметры.ДанныеТоваров Цикл
		НоваяСтрока = ТаблицаТоваров.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДанных);
	КонецЦикла;
	Элементы.ТаблицаТоваров.Шрифт = Параметры.ШрифтТаблицы;
	
КонецПроцедуры

#КонецОбласти