#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ЭтоИнтерфейсВыставлениеСчетов = БизнесПриложениеВыставлениеСчетов.ИспользуетсяИнтерфейсВыставлениеСчетов();
	Назначение = Параметры.Назначение;
	
	БизнесПриложениеВыставлениеСчетов.ПриСозданииНаСервереСписокШаблоныПечатиОфисныхДокументов(ЭтотОбъект);

	Если Параметры.Свойство("Отбор") И Параметры.Отбор.Свойство("Назначение") Тогда
		Назначение = Параметры.Отбор.Назначение;
	КонецЕсли;
	
	Элементы.Список.РежимВыбора = Параметры.РежимВыбора;

	УправлениеФормой();
	ВывестиБаннеры(ЭтоИнтерфейсВыставлениеСчетов);
	
	Если Не ОбщегоНазначенияКлиентСервер.ЭтоВариантИнтерфейса85() Тогда
		СтандартныеПодсистемыСервер.ПереместитьЭлементыВГруппу(Элементы.Список.КоманднаяПанель, Элементы.ФормаКоманднаяПанель);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПриУстановкеНазначения();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НазначениеПриИзменении(Элемент)
	
	ПриУстановкеНазначения();

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбработатьДействиеИнформационногоСообщения(ЭлементИлиКоманда,
	НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	ОбщегоНазначенияКлиент.ОбработатьДействиеИнформационногоСообщения(ЭтотОбъект, ЭлементИлиКоманда,
		НавигационнаяСсылка, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УстановитьСнятьПометкуИспользуется(Команда)

	Если Элементы.Список.ПолучитьСтрокиДляОбработки().Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	Шаблоны = Элементы.Список.ПолучитьСтрокиДляОбработки();
	ШаблонУстановитьСнятьПометкуИспользуется(Шаблоны);

	ОповеститьОбИзменении(Элементы.Список.ТекущиеДанные.Ссылка);
	ПараметрыОповещения = Новый Структура("ЭтоНовый,Назначение", Истина, Элементы.Список.ТекущиеДанные.Назначение);
	Оповестить("Запись_ШаблоныПечатиОфисныхДокументов", ПараметрыОповещения);

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоставляемыеШаблоныДоговоровКонтрагентов(Команда)

	ЗаполнитьПоставляемыеШаблоныДоговоровКонтрагентовНаСервере();
	ОповеститьОбИзменении(Тип("СправочникСсылка.ШаблоныПечатиОфисныхДокументов"));

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоставляемыеШаблоныКоммерческогоПредложения(Команда)

	ЗаполнитьПоставляемыеШаблоныКоммерческогоПредложенияНаСервере();
	ОповеститьОбИзменении(Тип("СправочникСсылка.ШаблоныПечатиОфисныхДокументов"));

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УправлениеФормой()
		
	Если Параметры.РежимВыбора Тогда

		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СписокГруппаЗагрузитьШаблоны",
			"Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Используется",
			"Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СписокУстановитьСнятьПометкуИспользуется",
			"Видимость", Ложь);
		
	Иначе
	
		ОтображениеЗаполнениеПоставляемыхШаблонов =
			ШаблоныПечатиОфисныхДокументов.ПараметрыОтображенияЗаполненияПоставляемыхШаблонов();

		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"СписокЗаполнитьПоставляемыеШаблоныДоговоровКонтрагентов", "Видимость",
			ОтображениеЗаполнениеПоставляемыхШаблонов.ДоговорыКонтрагентов);

		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"СписокЗаполнитьПоставляемыеШаблоныКоммерческогоПредложения", "Видимость",
			ОтображениеЗаполнениеПоставляемыхШаблонов.КоммерческиеПредложения);
			
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ВывестиБаннеры(ЭтоИнтерфейсВыставлениеСчетов)
		
	Если ЭтоИнтерфейсВыставлениеСчетов Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыВажногоСообщения = ОбщегоНазначения.ПараметрыВажногоСообщения();
	ПараметрыВажногоСообщения.ТипСообщения = "Информация";
	ПараметрыВажногоСообщения.КраткоеПредставление = НСтр("ru = 'Когда появятся новые шаблоны?'");
	ПараметрыВажногоСообщения.Сообщение = НСтр(
		"ru = 'Новые шаблоны появятся в командах печати после перезапуска соответствующих форм (например, список Заказов покупателей)'");
	ОбщегоНазначения.ДобавитьВажноеСообщение(ЭтотОбъект, ПараметрыВажногоСообщения);
	ОбщегоНазначения.ВывестиСтатусыИВажныеСообщенияНаФорму(ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура ПриУстановкеНазначения()
	
	Если ЗначениеЗаполнено(Назначение) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "Назначение", Назначение,
			ВидСравненияКомпоновкиДанных.Равно);
	Иначе
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбора(Список.Отбор, "Назначение");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ШаблонУстановитьСнятьПометкуИспользуется(Шаблоны)

	Для Каждого ШаблонСсылка Из Шаблоны Цикл
		ШаблонОбъект = ШаблонСсылка.ПолучитьОбъект();
		ШаблонОбъект.Используется = Не ШаблонОбъект.Используется;
		ШаблонОбъект.Записать();
	КонецЦикла;

	ОбновитьПовторноИспользуемыеЗначения();

КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьПоставляемыеШаблоныДоговоровКонтрагентовНаСервере()

	ШаблоныПечатиОфисныхДокументов.СоздатьПредопределенныеШаблоныДоговоровКонтрагентов();

КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьПоставляемыеШаблоныКоммерческогоПредложенияНаСервере()

	ШаблоныПечатиОфисныхДокументов.СоздатьПредопределенныеШаблоныКоммерческогоПредложения();

КонецПроцедуры

#КонецОбласти