&НаКлиенте
Перем ДополнительныеПараметры;

&НаКлиенте
Процедура ОткрытьФормуРМК(Команда)
	
	Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьНастройкиККТ(Оборудование)
	
	ОбщегоНазначенияРМК.ПроверитьНастройкиККТ(Оборудование, ТорговыйОбъект, ТаблицаОшибок);
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьНастройкиЭквайринга(Оборудование)
	
	ОбщегоНазначенияРМК.ПроверитьНастройкиЭквайринга(Оборудование, ТорговыйОбъект, ТаблицаОшибок);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборВТаблицеОшибок(ИмяКарточки)
	
	Если ИмяКарточки = "Маркировка" Тогда
		СтрокиОшибокКарточкиМаркировка = ТаблицаОшибок.НайтиСтроки(Новый Структура("Карточка", ИмяКарточки));
		
		Если СуществуетВнутреннийТСПИоТ И ЕстьРольЧтениеТСПИоТ И СтрокиОшибокКарточкиМаркировка.Количество() = 0 Тогда
			ПерейтиНаСтраницуТСПИоТ(Неопределено);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Элементы.ТаблицаОшибок.ОтборСтрок = Новый ФиксированнаяСтруктура(Новый Структура("Карточка", ИмяКарточки));
	
	Если СуществуетВнутреннийТСПИоТ И ЕстьРольЧтениеТСПИоТ И ИмяКарточки = "Маркировка" Тогда
		Элементы.ТаблицаОшибокПерейтиНаСтраницуТСПИоТ.Видимость = Истина;
	КонецЕсли;
	
	Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаОшибки;
	
КонецПроцедуры

&НаКлиенте
Процедура КарточкаНажатие(Элемент)
	
	УстановитьОтборВТаблицеОшибок(Сред(Элемент.Имя, 9));
	
КонецПроцедуры

&НаКлиенте
Процедура ВернутьсяНаГлавную(Команда)
	
	Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаКарточки;
	Элементы.ТаблицаОшибок.ОтборСтрок = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОшибокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Не ДоступноИзменениеНастройкиРМК Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаТаблицы = ТаблицаОшибок.НайтиПоИдентификатору(ВыбраннаяСтрока);
	
	ОткрытьНастройкуПоСсылке(СтрокаТаблицы.СсылкаНаЭлемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНастройкуПоСсылке(СсылкаНаЭлемент)
	
	Если ЗначениеЗаполнено(СсылкаНаЭлемент) Тогда
		Если СсылкаНаЭлемент = "ОткрытьНастройкиРазделВидыОплат" Тогда
			ПараметрыОткрытия = Новый Структура;
			ПараметрыОткрытия.Вставить("НастройкаРабочегоМеста", ТекущаяНастройкаРМК);
			ПараметрыОткрытия.Вставить("ИмяРазделаПриОткрытии", "СтраницаВидыОплат");
			ПараметрыОткрытия.Вставить("ИмяЭлементаПриОткрытии", "НастройкиРМКИспользоватьОплатуПлатежнымиКартами");
			ПараметрыОткрытия.Вставить("РабочееМестоКассира", Истина);
			ОткрытьФорму("ОбщаяФорма.НастройкиРабочегоМестаКассира", ПараметрыОткрытия,,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		ИначеЕсли СсылкаНаЭлемент = "ОткрытьНастройкиРазделСерверЛояльности" Тогда
			ПараметрыОткрытия = Новый Структура;
			ПараметрыОткрытия.Вставить("НастройкаРабочегоМеста", ТекущаяНастройкаРМК);
			ПараметрыОткрытия.Вставить("ИмяРазделаПриОткрытии", "СтраницаСерверЛояльности");
			ПараметрыОткрытия.Вставить("ИмяЭлементаПриОткрытии", "ИспользоватьСерверЛояльностиПолучательДанных");
			ОткрытьФорму("ОбщаяФорма.НастройкиРабочегоМестаКассира", ПараметрыОткрытия,,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		ИначеЕсли СсылкаНаЭлемент = "ОткрытьНастройкиРазделПлатежныеСистемыСБП" Тогда
			ПараметрыОткрытия = Новый Структура;
			ПараметрыОткрытия.Вставить("НастройкаРабочегоМеста", ТекущаяНастройкаРМК);
			ПараметрыОткрытия.Вставить("ИмяРазделаПриОткрытии", "СтраницаНастройкиПлатежнымиСистемами");
			ПараметрыОткрытия.Вставить("ИмяЭлементаПриОткрытии", "НастройкиРМКИспользоватьОплатуПлатежнымиСистемами");
			ОткрытьФорму("ОбщаяФорма.НастройкиРабочегоМестаКассира", ПараметрыОткрытия,,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		ИначеЕсли СсылкаНаЭлемент = "ОткрытьНастройкиРазделПлатежныеСистемыНСПК" Тогда
			ПараметрыОткрытия = Новый Структура;
			ПараметрыОткрытия.Вставить("НастройкаРабочегоМеста", ТекущаяНастройкаРМК);
			ПараметрыОткрытия.Вставить("ИмяРазделаПриОткрытии", "СтраницаНастройкиПлатежнымиСистемами");
			ПараметрыОткрытия.Вставить("ИмяЭлементаПриОткрытии", "ИспользоватьОплатуСертификатамиНСПК");
			ОткрытьФорму("ОбщаяФорма.НастройкиРабочегоМестаКассира", ПараметрыОткрытия,,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		ИначеЕсли СсылкаНаЭлемент = "ОткрытьНастройкиРазделПродажиМакс" Тогда
			ПараметрыОткрытия = Новый Структура;
			ПараметрыОткрытия.Вставить("НастройкаРабочегоМеста", ТекущаяНастройкаРМК);
			ПараметрыОткрытия.Вставить("ИмяРазделаПриОткрытии", "СтраницаНастройкиПродажи");
			ПараметрыОткрытия.Вставить("ИмяЭлементаПриОткрытии", "ИспользоватьПодтверждениеВозрастаЧерезMAX");
			ОткрытьФорму("ОбщаяФорма.НастройкиРабочегоМестаКассира", ПараметрыОткрытия,,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		ИначеЕсли СсылкаНаЭлемент = "ОткрытьНастройкиРазделПродажиМаксДисплей" Тогда
			ПараметрыОткрытия = Новый Структура;
			ПараметрыОткрытия.Вставить("НастройкаРабочегоМеста", ТекущаяНастройкаРМК);
			ПараметрыОткрытия.Вставить("ИмяРазделаПриОткрытии", "СтраницаНастройкиПродажи");
			ПараметрыОткрытия.Вставить("ИмяЭлементаПриОткрытии", "ИспользоватьПодтверждениеВозрастаЧерезMAX");
			ОткрытьФорму("ОбщаяФорма.НастройкиРабочегоМестаКассира", ПараметрыОткрытия,,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		ИначеЕсли СсылкаНаЭлемент = "ОткрытьНастройкиРазделМаркировка" Тогда
			ПараметрыОткрытия = Новый Структура;
			ПараметрыОткрытия.Вставить("НастройкаРабочегоМеста", ТекущаяНастройкаРМК);
			ПараметрыОткрытия.Вставить("ИмяРазделаПриОткрытии", "СтраницаМаркировкаИАлкоголь");
			ПараметрыОткрытия.Вставить("ИмяЭлементаПриОткрытии", "НастройкиРМКОжидатьРезультатПроверкиМарок");
			ОткрытьФорму("ОбщаяФорма.НастройкиРабочегоМестаКассира", ПараметрыОткрытия,,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		ИначеЕсли СсылкаНаЭлемент = "ОткрытьНастройкиРазделМаркировкаКега" Тогда
			ПараметрыОткрытия = Новый Структура;
			ПараметрыОткрытия.Вставить("НастройкаРабочегоМеста", ТекущаяНастройкаРМК);
			ПараметрыОткрытия.Вставить("ИмяРазделаПриОткрытии", "СтраницаМаркировкаИАлкоголь");
			ПараметрыОткрытия.Вставить("ИмяЭлементаПриОткрытии", "ПередаватьОтчетыОПодключенииКегКОборудованиюРозливаИзРМК");
			ОткрытьФорму("ОбщаяФорма.НастройкиРабочегоМестаКассира", ПараметрыОткрытия,,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		ИначеЕсли СсылкаНаЭлемент = "ОткрытьНастройкиРазделМаркировкаЕГАИС" Тогда
			ПараметрыОткрытия = Новый Структура;
			ПараметрыОткрытия.Вставить("НастройкаРабочегоМеста", ТекущаяНастройкаРМК);
			ПараметрыОткрытия.Вставить("ИмяРазделаПриОткрытии", "СтраницаМаркировкаИАлкоголь");
			ПараметрыОткрытия.Вставить("ИмяЭлементаПриОткрытии", "ВестиСведенияДляДекларацийПоАлкогольнойПродукции");
			ОткрытьФорму("ОбщаяФорма.НастройкиРабочегоМестаКассира", ПараметрыОткрытия,,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		ИначеЕсли Лев(СсылкаНаЭлемент, 7) = "Открыть" Тогда
			ОбщегоНазначенияРМККлиент.ОткрытьФормуПоОшибкеМонитора(СсылкаНаЭлемент);
		ИначеЕсли ЗначениеЗаполнено(СсылкаНаЭлемент) Тогда
			ПоказатьЗначение(, СсылкаНаЭлемент);
		Иначе
			//например смены неактуальны
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуКарточек()
	
	Карточки.Добавить().Карточка = "ККТ";
	Карточки.Добавить().Карточка = "Эквайринг";
	Карточки.Добавить().Карточка = "Сканер";
	Карточки.Добавить().Карточка = "Весы";
	Карточки.Добавить().Карточка = "Маркировка";
	Карточки.Добавить().Карточка = "ЕГАИС";
	Карточки.Добавить().Карточка = "СерверЛояльности";
	Карточки.Добавить().Карточка = "Дисплей";
	Карточки.Добавить().Карточка = "СБП";
	Карточки.Добавить().Карточка = "НСПК";
	Карточки.Добавить().Карточка = "МАКС";
	Карточки.Добавить().Карточка = "Обмен";
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьТаблицуКарточек();
	
	Интерфейс85 = ОбщегоНазначенияРМККлиентСервер.ЭтоИнтерфейс85();
	ЦветФонаКарточки = ?(Интерфейс85, Новый Цвет(), ЦветаПалитры.СветлоБежевыйРМК);
	
	ЦветаФормы = Новый Структура;
	ЦветаФормы.Вставить("ЦветОшибка", ЦветаПалитры.Красный);
	ЦветаФормы.Вставить("ЦветПредупреждение", ЦветаПалитры.Желтый);
	ЦветаФормы.Вставить("ЦветОк", ЦветаПалитры.Зеленый);
	ЦветаФормы.Вставить("ЦветФонаКарточки", ЦветФонаКарточки);
	
	ТекущаяНастройкаРМК = Параметры.ТекущаяНастройкаРМК;
	ТорговыйОбъект = Параметры.ТорговыйОбъект;
	СтартРМК = Параметры.СтартРМК;
	
	Если Параметры.Свойство("ОткрытьВкладкуСтатусовТСПИоТ") Тогда
		
		ОткрытьВкладкуСтатусовТСПИоТ = Истина;
		
	КонецЕсли;
	
	ПоказыватьНаДисплеиПокупателяQRMAX = ТекущаяНастройкаРМК.ПоказыватьНаДисплеиПокупателяQRMAX;
	ИспользоватьОплатуПлатежнымиКартами = ТекущаяНастройкаРМК.ИспользоватьОплатуПлатежнымиКартами;
	
	ИспользоватьОплатуПлатежнымиСистемами = ТекущаяНастройкаРМК.ИспользоватьОплатуПлатежнымиСистемами;
	ИспользоватьОплатуСертификатамиНСПК = ТекущаяНастройкаРМК.ИспользоватьОплатуСертификатамиНСПК;
	ИспользоватьПодтверждениеВозрастаЧерезMAX = ТекущаяНастройкаРМК.ИспользоватьПодтверждениеВозрастаЧерезMAX;
	
	СкрыватьМониторПриАктуальномСостоянии = ТекущаяНастройкаРМК.СкрыватьМониторПриАктуальномСостоянии;
	
	ОбщегоНазначенияРМК.ЗаполнитьНастройкиМонитораСостояния(ЭтотОбъект);
	
	СуществуетВнутреннийТСПИоТ = Ложь;
	ОбщегоНазначенияРМКПереопределяемый.ПроверитьНастройкиТСПИоТ(СуществуетВнутреннийТСПИоТ);
	
	ЕстьРольДобавлениеИзменениеТСПИоТ = Пользователи.РолиДоступны("ДобавлениеИзменениеТСПИоТ", Пользователи.ТекущийПользователь());
	ЕстьРольЧтениеТСПИоТ = ЕстьРольДобавлениеИзменениеТСПИоТ Или Пользователи.РолиДоступны("ЧтениеТСПИоТ", Пользователи.ТекущийПользователь());
	
	Если Не ЕстьРольДобавлениеИзменениеТСПИоТ Тогда
		Элементы.ГруппаСужебныеКоманды.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АктуализироватьКарточки() Экспорт
	
	ККТСОшибками = Новый Массив;
	
	Для Каждого СтрокаОшибки Из ТаблицаОшибок Цикл
		
		Если ЗначениеЗаполнено(СтрокаОшибки.Оборудование) Тогда
			ЗаполнитьЗначенияСвойств(СтрокаОшибки, ПараметрыОборудования(СтрокаОшибки.Оборудование));
			
			Если СтрокаОшибки.Карточка = "ККТ" Тогда
				ККТСОшибками.Добавить(СтрокаОшибки.Оборудование);
			КонецЕсли;
			
		КонецЕсли;
		
		СтрокиКарточек = Карточки.НайтиСтроки(Новый Структура("Карточка", СтрокаОшибки.Карточка));
		СтрокаКарточки = СтрокиКарточек[0];
		СтрокаКарточки.ЕстьОшибки = Истина;
		
	КонецЦикла;
	
	ЕстьАктуальнаяККТ = Ложь;
	
	Для Каждого СтрокаОборудования Из ТаблицаОборудования Цикл
		Если СтрокаОборудования.Карточка = "ККТ" Тогда
			Если ККТСОшибками.Найти(СтрокаОборудования.Оборудование) = Неопределено Тогда
				ЕстьАктуальнаяККТ = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если Не ЕстьАктуальнаяККТ Тогда
		//Элементы["КарточкаККТ" + "Статус"].Картинка = БиблиотекаКартинок.ОформлениеЗнакКрест;
		Элементы["КарточкаККТ"].Гиперссылка = Истина;
		КритическаяОшибка = Истина;
	КонецЕсли;
	
	КоличествоИспользуемыхКарточек = 0;
	КоличествоПроверенныхКарточек = 0;
	Для Каждого СтрокаКарточки Из Карточки Цикл
		
		ВидимостьКарточки = СтрокаКарточки.Используется;
		
		Если ВидимостьКарточки Тогда 
			КоличествоИспользуемыхКарточек = КоличествоИспользуемыхКарточек + 1;
			
			Если СтрокаКарточки.ПроверкаЗавершена Тогда
				КоличествоПроверенныхКарточек = КоличествоПроверенныхКарточек + 1;
			КонецЕсли;
		КонецЕсли;
		
		Если Не Элементы["Карточка" + СтрокаКарточки.Карточка].Видимость = ВидимостьКарточки Тогда
			Элементы["Карточка" + СтрокаКарточки.Карточка].Видимость = ВидимостьКарточки;
		КонецЕсли;
		
		Если СтрокаКарточки.ВыполнетсяПроверка Тогда
			КартинкаСтатус = БиблиотекаКартинок.ДлительнаяОперацияРМК48;
		ИначеЕсли СтрокаКарточки.ПроверкаЗавершена Тогда
			Если СтрокаКарточки.ЕстьОшибки Тогда
				Если СтрокаКарточки.ЕстьОшибкиКритические Тогда
					КартинкаСтатус = БиблиотекаКартинок.РМКПредупреждение;
				Иначе
					КартинкаСтатус = БиблиотекаКартинок.РМКПредупреждение;
				КонецЕсли;
			Иначе
				КартинкаСтатус = БиблиотекаКартинок.РМКУспешно;
			КонецЕсли;
		Иначе
			КартинкаСтатус = БиблиотекаКартинок.Пустая;
		КонецЕсли;
		
		Если Не Элементы["Карточка" + СтрокаКарточки.Карточка + "Статус"].Картинка = КартинкаСтатус Тогда
			Элементы["Карточка" + СтрокаКарточки.Карточка + "Статус"].Картинка = КартинкаСтатус;
			Элементы["Карточка" + СтрокаКарточки.Карточка].Гиперссылка = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	ПроцентСтатуса = 100 / (КоличествоИспользуемыхКарточек+1) * (КоличествоПроверенныхКарточек+1);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПараметрыОборудования(Оборудование)
	
	Результат = Новый Структура("ТипОборудования, Карточка");
	
	ОбщегоНазначенияРМК.ПараметрыОборудования(Оборудование, Результат);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ОткрытьЭлемент(Команда)
	
	ТекущиеДанные = Элементы.ТаблицаОшибок.ТекущиеДанные;
	
	Если Не ТекущиеДанные = Неопределено Тогда
		ПоказатьЗначение(, ТекущиеДанные.СсылкаНаЭлемент);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ДоступноИзменениеНастройкиРМК = ВладелецФормы.ДоступноИзменениеНастройкиРМК;
	РабочееМесто = ВладелецФормы.РабочееМесто;
	
	Если ОткрытьВкладкуСтатусовТСПИоТ Тогда
		
		Элементы.ВернутьсяНаГлавную1.Видимость = Ложь;
		
		ТаблицаОборудованияВл = ВладелецФормы.ТаблицаОборудования;
		
		Если ТаблицаОборудованияВл.Количество() Тогда
			Для Каждого Стр1 Из ТаблицаОборудованияВл Цикл
				Доб1 = ТаблицаОборудования.Добавить();
				ЗаполнитьЗначенияСвойств(Доб1, Стр1);
				
				Если ЗначениеЗаполнено(Доб1.Оборудование) Тогда
					ЗаполнитьЗначенияСвойств(Доб1, ПараметрыОборудования(Доб1.Оборудование));
				КонецЕсли;
				
			КонецЦикла;
		КонецЕсли;
		
		ПерейтиНаСтраницуТСПИоТ(Неопределено);
		
		Возврат;
		
	КонецЕсли;
	
	Элементы.ТаблицаОшибок.КоманднаяПанель.Видимость = ДоступноИзменениеНастройкиРМК;
	
	Если Не ДоступноИзменениеНастройкиРМК Тогда
		Элементы.НадписьОшибки.Заголовок = "Обнаружены ошибки. Обратитесь к администратору.";
	КонецЕсли;
	
	ВосстановитьСтатусыКарточек();
	
	Для Каждого СтрокаКарточки Из Карточки Цикл
		СтрокаКарточки.Используется = Ложь;
		СтрокаКарточки.ВыполнетсяПроверка = Ложь;
		СтрокаКарточки.ПроверкаЗавершена = Ложь;
		СтрокаКарточки.ЕстьОшибки = Ложь;
		СтрокаКарточки.ЕстьОшибкиКритические = Ложь;
	КонецЦикла;
	
	ОпределитьИспользуемоеОборудование();
	
	Для Каждого СтрокаКарточки Из Карточки Цикл
		Если Не СтрокаКарточки.Используется Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтрокаКарточки.Карточка = "ККТ"
			Или СтрокаКарточки.Карточка = "Эквайринг"
			Или СтрокаКарточки.Карточка = "Сканер"
			Или СтрокаКарточки.Карточка = "Весы"
			Или СтрокаКарточки.Карточка = "Дисплей" Тогда
				СтрокаКарточки.ВыполнетсяПроверка = Истина;
		КонецЕсли;
	КонецЦикла;
	
	АктуализироватьКарточки();
	
	ПодключитьОбработчикОжидания("ПроверитьОборудование", 0.1, Истина);
	
КонецПроцедуры

&НаСервере
Процедура ОпределитьИспользуемоеОборудование()
	
	ОбщегоНазначенияРМК.ОпределитьИспользуемоеОборудование(РабочееМесто, Карточки);
	
	СтрокиКарточек = Карточки.НайтиСтроки(Новый Структура("Карточка", "ККТ"));
	СтрокаКарточки = СтрокиКарточек[0];
	СтрокаКарточки.Используется = Истина;
	
	Если ЕстьВесовыеТовары Тогда
		СтрокиКарточек = Карточки.НайтиСтроки(Новый Структура("Карточка", "Весы"));
		СтрокаКарточки = СтрокиКарточек[0];
		СтрокаКарточки.Используется = Истина;
	КонецЕсли;
	
	СтрокиКарточек = Карточки.НайтиСтроки(Новый Структура("Карточка", "Эквайринг"));
	СтрокаКарточки = СтрокиКарточек[0];
	СтрокаКарточки.Используется = ИспользоватьОплатуПлатежнымиКартами;
	
	//СтрокиКарточек = Карточки.НайтиСтроки(Новый Структура("Карточка", "Сканер"));
	//СтрокаКарточки = СтрокиКарточек[0];
	//СтрокаКарточки.Используется = ЕстьСканер;
	
	СтрокиКарточек = Карточки.НайтиСтроки(Новый Структура("Карточка", "Маркировка"));
	СтрокаКарточки = СтрокиКарточек[0];
	СтрокаКарточки.Используется = ВестиУчетМаркируемойПродукции;
	
	СтрокиКарточек = Карточки.НайтиСтроки(Новый Структура("Карточка", "ЕГАИС"));
	СтрокаКарточки = СтрокиКарточек[0];
	СтрокаКарточки.Используется = ВестиУчетАлкогольнойПродукции;
	
	СтрокиКарточек = Карточки.НайтиСтроки(Новый Структура("Карточка", "СерверЛояльности"));
	СтрокаКарточки = СтрокиКарточек[0];
	СтрокаКарточки.Используется = ИспользоватьСерверЛояльности;
	
	Если ПоказыватьНаДисплеиПокупателяQRMAX Тогда
		СтрокиКарточек = Карточки.НайтиСтроки(Новый Структура("Карточка", "Дисплей"));
		СтрокаКарточки = СтрокиКарточек[0];
		СтрокаКарточки.Используется = Истина;
	КонецЕсли;
	
	СтрокиКарточек = Карточки.НайтиСтроки(Новый Структура("Карточка", "СБП"));
	СтрокаКарточки = СтрокиКарточек[0];
	СтрокаКарточки.Используется = ИспользоватьОплатуПлатежнымиСистемами;
	
	СтрокиКарточек = Карточки.НайтиСтроки(Новый Структура("Карточка", "НСПК"));
	СтрокаКарточки = СтрокиКарточек[0];
	СтрокаКарточки.Используется = ИспользоватьОплатуСертификатамиНСПК;
	
	СтрокиКарточек = Карточки.НайтиСтроки(Новый Структура("Карточка", "МАКС"));
	СтрокаКарточки = СтрокиКарточек[0];
	СтрокаКарточки.Используется = ИспользоватьПодтверждениеВозрастаЧерезMAX;
	
	СтрокиКарточек = Карточки.НайтиСтроки(Новый Структура("Карточка", "Обмен"));
	СтрокаКарточки = СтрокиКарточек[0];
	СтрокаКарточки.Используется = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьОборудование()
	
	Для Каждого СтрокаКарточки Из Карточки Цикл
		Если СтрокаКарточки.Карточка = "ККТ"
			Или СтрокаКарточки.Карточка = "Эквайринг"
			Или СтрокаКарточки.Карточка = "Сканер"
			Или СтрокаКарточки.Карточка = "Весы"
			Или СтрокаКарточки.Карточка = "Дисплей" Тогда
				СтрокаКарточки.ВыполнетсяПроверка = Ложь;
				СтрокаКарточки.ПроверкаЗавершена = Истина;
		КонецЕсли;
	КонецЦикла;
	
	ТаблицаОшибокВл = ВладелецФормы.ТаблицаОшибок;
	ТаблицаОборудованияВл = ВладелецФормы.ТаблицаОборудования;
	
	Если ТаблицаОшибокВл.Количество() Тогда
		Для Каждого Стр1 Из ТаблицаОшибокВл Цикл
			Доб1 = ТаблицаОшибок.Добавить();
			ЗаполнитьЗначенияСвойств(Доб1, Стр1);
		КонецЦикла;
	КонецЕсли;
	
	Если ТаблицаОборудованияВл.Количество() Тогда
		Для Каждого Стр1 Из ТаблицаОборудованияВл Цикл
			Доб1 = ТаблицаОборудования.Добавить();
			ЗаполнитьЗначенияСвойств(Доб1, Стр1);
		КонецЦикла;
	КонецЕсли;
	
	ЕстьККТ = Ложь;
	ЕстьПодключеннаяККТ = Ложь;
	ЕстьЭквайринг = Ложь;
	ЕстьСканер = Ложь;
	ЕстьПодключенныйСканер = Ложь;
	ЕстьВесы = Ложь;
	ЕстьПодключенныеВесы = Ложь;
	ЕстьДисплей = Ложь;
	ЕстьПодключенныйДисплей = Ложь;
	
	Для Каждого СтрокаОборудования Из ТаблицаОборудования Цикл
		
		Если ЗначениеЗаполнено(СтрокаОборудования.Оборудование) Тогда
			ЗаполнитьЗначенияСвойств(СтрокаОборудования, ПараметрыОборудования(СтрокаОборудования.Оборудование));
		КонецЕсли;
		
		Если СтрокаОборудования.Карточка = "Эквайринг" Тогда
			
			ЕстьЭквайринг = Истина;
			
			Если СтрокаОборудования.Подключено Тогда
				ПроверитьНастройкиЭквайринга(СтрокаОборудования.Оборудование);
			КонецЕсли;
			
		ИначеЕсли СтрокаОборудования.Карточка = "ККТ" Тогда
			
			ЕстьККТ = Истина;
			
			Если СтрокаОборудования.Подключено Тогда
				ЕстьПодключеннаяККТ = Истина;
				ПроверитьНастройкиККТ(СтрокаОборудования.Оборудование);
			КонецЕсли;
			
		ИначеЕсли СтрокаОборудования.Карточка = "Дисплей" Тогда
			ЕстьДисплей = Истина;
			Если СтрокаОборудования.Подключено Тогда
				ЕстьПодключенныйДисплей = Истина;
			КонецЕсли;
			
		ИначеЕсли СтрокаОборудования.Карточка = "Сканер" Тогда
			ЕстьСканер = Истина;
			Если СтрокаОборудования.Подключено Тогда
				ЕстьПодключенныйСканер = Истина;
			КонецЕсли;
			
		ИначеЕсли СтрокаОборудования.Карточка = "Весы" Тогда
			ЕстьВесы = Истина;
			Если СтрокаОборудования.Подключено Тогда
				ЕстьПодключенныеВесы = Истина;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЕстьВесовыеТовары И Не ЕстьВесы Тогда
		
		СтрокаОшибки = ТаблицаОшибок.Добавить();
		СтрокаОшибки.Карточка = "Весы";
		СтрокаОшибки.ТекстОшибки = НСтр("ru = 'Есть весовые товары, но нет подключенных весов. Добавьте оборудование.'");
		СтрокаОшибки.ВозможноПерепроверить = Истина;
		СтрокаОшибки.ИспользуетсяОборудование = Истина;
		
	ИначеЕсли ЕстьВесы И Не ЕстьВесовыеТовары Тогда
		
		СтрокаОшибки = ТаблицаОшибок.Добавить();
		СтрокаОшибки.Карточка = "Весы";
		СтрокаОшибки.ТекстОшибки = НСтр("ru = 'Есть подключенные весы, но нет весовых товаров.'");
		СтрокаОшибки.ВозможноПерепроверить = Истина;
		СтрокаОшибки.ИспользуетсяОборудование = Истина;
		
	КонецЕсли;
	
	Если ИспользоватьОплатуПлатежнымиКартами Тогда
		Если Не ЕстьЭквайринг Тогда
			
			СтрокаОшибки = ТаблицаОшибок.Добавить();
			СтрокаОшибки.Карточка = "Эквайринг";
			СтрокаОшибки.ТекстОшибки = НСтр("ru = 'Нет включенного экземпляра оборудования ""Эквайрингового терминала"" в списке подключаемого оборудования.
				|Добавьте оборудование или отключите настройку.'");
			СтрокаОшибки.СсылкаНаЭлемент = "ОткрытьНастройкиРазделВидыОплат";
			СтрокаОшибки.ВозможноПерепроверить = Истина;
			СтрокаОшибки.ИспользуетсяОборудование = Истина;
			СтрокаОшибки.ИспользуетсяНастройка = Истина;
			
		КонецЕсли;
	КонецЕсли;
	
	Если ВестиУчетМаркируемойПродукции Или ВестиУчетАлкогольнойПродукции Тогда
		Если Не ЕстьПодключенныйСканер Тогда
			Если ВестиУчетМаркируемойПродукции Тогда
				СтрокаОшибки = ТаблицаОшибок.Добавить();
				СтрокаОшибки.Карточка = "Маркировка";
				СтрокаОшибки.ТекстОшибки = НСтр("ru = 'Нет включенного экземпляра оборудования ""Сканера штрихкодов"" в списке подключаемого оборудования. Добавьте оборудование.'");
				СтрокаОшибки.СсылкаНаЭлемент = "ОткрытьНастройкиРазделМаркировка";
				СтрокаОшибки.ВозможноПерепроверить = Истина;
				СтрокаОшибки.ИспользуетсяОборудование = Истина;
				СтрокаОшибки.ИспользуетсяНастройка = Истина;
			КонецЕсли;
			Если ВестиУчетАлкогольнойПродукции Тогда
				СтрокаОшибки = ТаблицаОшибок.Добавить();
				СтрокаОшибки.Карточка = "ЕГАИС";
				СтрокаОшибки.ТекстОшибки = НСтр("ru = 'Нет включенного экземпляра оборудования ""Сканера штрихкодов"" в списке подключаемого оборудования. Добавьте оборудование.'");
				СтрокаОшибки.СсылкаНаЭлемент = "ОткрытьНастройкиРазделМаркировкаЕГАИС";
				СтрокаОшибки.ВозможноПерепроверить = Истина;
				СтрокаОшибки.ИспользуетсяОборудование = Истина;
				СтрокаОшибки.ИспользуетсяНастройка = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если ПоказыватьНаДисплеиПокупателяQRMAX Тогда
		Если Не ЕстьДисплей Тогда
			СтрокаОшибки = ТаблицаОшибок.Добавить();
			СтрокаОшибки.Карточка = "Дисплей";
			СтрокаОшибки.ТекстОшибки = НСтр("ru = 'Нет включенного экземпляра оборудования ""Дисплей покупателя"" в списке подключаемого оборудования. Добавьте оборудование или отключите настройку.'");
			СтрокаОшибки.ВозможноПерепроверить = Истина;
			СтрокаОшибки.ИспользуетсяОборудование = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если ИспользоватьОплатуПлатежнымиСистемами Тогда
		ЧужаяНастройкаСБП = Ложь;
		ОтборСБП = Новый Структура("ПлатежнаяСистема", ИнтеграцияСПлатежнымиСистемамиРМККлиентСервер.ПлатежнаяСистемаСБП());
		Если ВладелецФормы.РежимКассыСамообслуживания И ЗначениеЗаполнено(ВладелецФормы.СпособОплатыСБП)
				И ВладелецФормы.ПлатежнаяСистема_ВидыОплат.НайтиСтроки(ОтборСБП).Количество() = 0 Тогда
				
			ШаблонТекстаОшибки
				= НСтр("ru = 'Выбранный в настройках вид оплаты СБП ""%1"" настроен для другого торгового объекта и организации.'");
			СтрокаОшибки = ТаблицаОшибок.Добавить();
			СтрокаОшибки.Карточка = "СБП";
			СтрокаОшибки.ТекстОшибки = СтрШаблон(ШаблонТекстаОшибки, ВладелецФормы.СпособОплатыСБП);
			СтрокаОшибки.СсылкаНаЭлемент = "ОткрытьНастройкиРазделПлатежныеСистемыСБП";
			СтрокаОшибки.ВозможноПерепроверить = Ложь;
			СтрокаОшибки.ИспользуетсяНастройка = Истина;
			ЧужаяНастройкаСБП = Истина;
				
		КонецЕсли;
		Если Не ЧужаяНастройкаСБП И Не ВладелецФормы.ИспользоватьОплатуСБП И Не ВладелецФормы.ИспользоватьОплатуЮКасса Тогда
			
			СтрокаОшибки = ТаблицаОшибок.Добавить();
			СтрокаОшибки.Карточка = "СБП";
			СтрокаОшибки.ТекстОшибки = НСтр("ru = 'Включено использование платежных систем, но не заполнены настройки. Добавьте настройку подключения платежной системы.'");
			СтрокаОшибки.СсылкаНаЭлемент = "ОткрытьНастройкиРазделПлатежныеСистемыСБП";
			СтрокаОшибки.ВозможноПерепроверить = Истина;
			СтрокаОшибки.ИспользуетсяНастройка = Истина;
			
		КонецЕсли;
		
		СтрокиКарточек = Карточки.НайтиСтроки(Новый Структура("Карточка", "СБП"));
		СтрокаКарточки = СтрокиКарточек[0];
		СтрокаКарточки.ПроверкаЗавершена = Истина;
		
	КонецЕсли;
	
	СтрокиКарточек = Карточки.НайтиСтроки(Новый Структура("Карточка", "СерверЛояльности"));
	СтрокаКарточки = СтрокиКарточек[0];
	СтрокаКарточки.ПроверкаЗавершена = Истина;
	
	ОформитьКарточкуСостоянияОбмена();
	
	СтрокиКарточек = Карточки.НайтиСтроки(Новый Структура("Карточка", "Обмен"));
	СтрокаКарточки = СтрокиКарточек[0];
	СтрокаКарточки.ПроверкаЗавершена = Истина;
	
	ПроверитьМаркировку();
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьМаркировку()
	
	Если ВестиУчетМаркируемойПродукции Тогда
		СтрокиКарточек = Карточки.НайтиСтроки(Новый Структура("Карточка", "Маркировка"));
		СтрокаКарточки = СтрокиКарточек[0];
		СтрокаКарточки.ВыполнетсяПроверка = Истина;
		
		АктуализироватьКарточки();
		ПодключитьОбработчикОжидания("ПроверитьМаркировкуСостояние", 0.1, Истина);
		
	Иначе
		ПроверитьЕГАИС();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьМаркировкуСостояние()
	
	ОбщегоНазначенияРМККлиент.ПроверитьМаркировкуСостояние(Этотобъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьЕГАИС() Экспорт
	
	Если ВестиУчетМаркируемойПродукции Тогда
		СтрокиКарточек = Карточки.НайтиСтроки(Новый Структура("Карточка", "Маркировка"));
		СтрокаКарточки = СтрокиКарточек[0];
		СтрокаКарточки.ВыполнетсяПроверка = Ложь;
		СтрокаКарточки.ПроверкаЗавершена = Истина;
	КонецЕсли;
	
	Если ВестиУчетАлкогольнойПродукции Тогда
		СтрокиКарточек = Карточки.НайтиСтроки(Новый Структура("Карточка", "ЕГАИС"));
		СтрокаКарточки = СтрокиКарточек[0];
		СтрокаКарточки.ВыполнетсяПроверка = Истина;
		
		АктуализироватьКарточки();
		ПодключитьОбработчикОжидания("ПроверитьЕГАИССостояние", 0.1, Истина);
	Иначе
		ПроверитьНСПК();
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьЕГАИССостояние()
	
	ОбщегоНазначенияРМККлиент.ПроверитьЕГАИССостояние(Этотобъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьНСПК() Экспорт
	
	Если ВестиУчетАлкогольнойПродукции Тогда
		СтрокиКарточек = Карточки.НайтиСтроки(Новый Структура("Карточка", "ЕГАИС"));
		СтрокаКарточки = СтрокиКарточек[0];
		СтрокаКарточки.ВыполнетсяПроверка = Ложь;
		СтрокаКарточки.ПроверкаЗавершена = Истина;
	КонецЕсли;
	
	Если ИспользоватьОплатуСертификатамиНСПК Тогда
		СтрокиКарточек = Карточки.НайтиСтроки(Новый Структура("Карточка", "НСПК"));
		СтрокаКарточки = СтрокиКарточек[0];
		СтрокаКарточки.ВыполнетсяПроверка = Истина;
		
		АктуализироватьКарточки();
		ПодключитьОбработчикОжидания("ПроверитьНСПКСостояние", 0.1, Истина);
	Иначе
		ПроверитьМАКС();
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьНСПКСостояние()
	
	Если Не ЗначениеЗаполнено(АдресСервисаНСПК) Тогда
		СтрокаОшибки = ТаблицаОшибок.Добавить();
		СтрокаОшибки.Карточка = "НСПК";
		СтрокаОшибки.ТекстОшибки = НСтр("ru = 'Включено использоавние оплаты сертификатами НСПК, но не введен адрес сервиса. Введите адрес сервиса.'");
		СтрокаОшибки.СсылкаНаЭлемент = "ОткрытьНастройкиРазделПлатежныеСистемыНСПК";
		СтрокаОшибки.ВозможноПерепроверить = Истина;
		СтрокаОшибки.ИспользуетсяНастройка = Истина;
		
		ПроверитьМАКС();
		Возврат;
	КонецЕсли;
	
	ТаблицаКассККМОрганизаций = ВладелецФормы.ТаблицаКассККМОрганизаций;
	
	НачатоТестовоеПодключение = Ложь;
	Для Каждого СтрокаКассы Из ТаблицаКассККМОрганизаций Цикл
		
		ПараметрыОперации = ПолучитьПараметрыОперации(СтрокаКассы.КассаККМ);
		Если ЗначениеЗаполнено(ПараметрыОперации.КлючДоступа) Тогда
			ОповещениеМетода = Новый ОписаниеОповещения("ТестовоеПодключениеЗавершение", ЭтотОбъект, ПараметрыОперации);
			ЭлектронныеСертификатыНСПККлиент.НачатьТестовоеПодключение(ОповещениеМетода, ПараметрыОперации);
			НачатоТестовоеПодключение = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Если Не НачатоТестовоеПодключение Тогда
		ПроверитьМАКС();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьМАКС()
	
	Если ИспользоватьОплатуСертификатамиНСПК Тогда
		СтрокиКарточек = Карточки.НайтиСтроки(Новый Структура("Карточка", "НСПК"));
		СтрокаКарточки = СтрокиКарточек[0];
		СтрокаКарточки.ВыполнетсяПроверка = Ложь;
		СтрокаКарточки.ПроверкаЗавершена = Истина;
	КонецЕсли;
	
	Если ИспользоватьПодтверждениеВозрастаЧерезMAX Тогда
		СтрокиКарточек = Карточки.НайтиСтроки(Новый Структура("Карточка", "МАКС"));
		СтрокаКарточки = СтрокиКарточек[0];
		СтрокаКарточки.ВыполнетсяПроверка = Истина;
		
		АктуализироватьКарточки();
		ПодключитьОбработчикОжидания("ПроверитьМАКССостояние", 0.1, Истина);
	Иначе
		ПослеВсехПроверок();
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьМАКССостояние()
	
	ТаблицаКассККМОрганизаций = ВладелецФормы.ТаблицаКассККМОрганизаций;
	
	ЕстьТокенМакс = Ложь;
	Для Каждого СтрокаКассы Из ТаблицаКассККМОрганизаций Цикл
	
		Организация = СтрокаКассы.Организация;
		ТокенМакс = ПроверитьТокенМакс(Организация);
		Если ЗначениеЗаполнено(ТокенМакс) Тогда
			ЕстьТокенМакс = Истина;
			ПроверкиМакс(ТокенМакс);
		КонецЕсли;
		
	КонецЦикла;
	
	Если Не ЕстьТокенМакс Тогда
		
		СтрокаОшибки = ТаблицаОшибок.Добавить();
		СтрокаОшибки.Карточка = "МАКС";
		СтрокаОшибки.ТекстОшибки = НСтр("ru = 'Включено подтверждение возраста через MAX, но не введен токен. Введите токен.'");
		СтрокаОшибки.ВозможноПерепроверить = Истина;
		СтрокаОшибки.СсылкаНаЭлемент = "ОткрытьНастройкиРазделПродажиМакс";
		СтрокаОшибки.ИспользуетсяНастройка = Истина;
		
		ПослеВсехПроверок();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВсехПроверок()
	
	Если ИспользоватьПодтверждениеВозрастаЧерезMAX Тогда
		СтрокиКарточек = Карточки.НайтиСтроки(Новый Структура("Карточка", "МАКС"));
		СтрокаКарточки = СтрокиКарточек[0];
		СтрокаКарточки.ВыполнетсяПроверка = Ложь;
		СтрокаКарточки.ПроверкаЗавершена = Истина;
	КонецЕсли;
	
	АктуализироватьКарточки();
	
	Элементы.СтраницыСтатус.ТекущаяСтраница = Элементы.СтраницаКоманды;
	
	Если ТаблицаОшибок.Количество() = 0 И СкрыватьМониторПриАктуальномСостоянии И СтартРМК Тогда
		Если Открыта() Тогда
			Закрыть();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьСтрокуОписанияИзТаблицыККМ()
	
	РезультатФункции = Неопределено;
	
	ТаблицаКассККМОрганизаций = ВладелецФормы.ТаблицаКассККМОрганизаций;
	ОтборККТ = Новый Структура("ИдентификаторУстройства", ККТ);
	СтрокиККМ = ТаблицаКассККМОрганизаций.НайтиСтроки(ОтборККТ);
	Если СтрокиККМ.Количество() > 0 Тогда
		РезультатФункции = СтрокиККМ[0];
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

&НаКлиенте
Функция СменаОткрыта()

	РезультатФункции = Ложь;
	ДатаСеансаКлиент = ОбщегоНазначенияКлиент.ДатаСеанса();
	
	Если ЗначениеЗаполнено(ККТ) Тогда
		СтрокаККМ = ПолучитьСтрокуОписанияИзТаблицыККМ();
		Если Не СтрокаККМ = Неопределено Тогда
			Если СтрокаККМ.Открыта И СтрокаККМ.ДатаИстеченияСрокаДействия > ДатаСеансаКлиент + 1 Тогда
				РезультатФункции = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

&НаКлиенте
Процедура ОчиститьСтатусыПиот()
	
	СТ_АвторизацияПройдена = Ложь;
	СТ_РегистрацияПройдена = Ложь;
	СТ_ГотовКПроверкеКМOffline = Ложь;
	СТ_ГотовКПроверкеКМOnline = Ложь;
	СТ_АварийныйРежим = Ложь;
	СТ_ПостАварийныйРежим = Ложь;
	СТ_ЛМЧЗГотов = Ложь;
	СТ_ТокенЛМЧЗ = "";
	СТ_ТокенЛМЧЗДатаДействия = "";
	СТ_ЛМЧЗСтатус = "";
	ПИоТ_Имя = "";
	
КонецПроцедуры

// НСПК
&НаКлиенте
Процедура ТестовоеПодключениеЗавершение(РезультатВыполнения, ДополнительныеПараметры) Экспорт 
	
	Если Не РезультатВыполнения.Результат Тогда
		ОписаниеОшибки = НСтр("ru='ОШИБКА: (%1) %2'");
		ОписаниеОшибки = СтрШаблон(ОписаниеОшибки, РезультатВыполнения.КодРезультата, РезультатВыполнения.ОписаниеОшибки); 
		
		СтрокаОшибки = ТаблицаОшибок.Добавить();
		СтрокаОшибки.Карточка = "НСПК";
		СтрокаОшибки.ТекстОшибки = ОписаниеОшибки + НСтр("ru = ' Проверьте настройки подключения.'");
		СтрокаОшибки.СсылкаНаЭлемент = "ОткрытьНастройкиРазделПлатежныеСистемыНСПК";
		СтрокаОшибки.ВозможноПерепроверить = Истина;
		СтрокаОшибки.ИспользуетсяНастройка = Истина;
		
	КонецЕсли;
	
	ПроверитьМАКС();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПараметрыОперации(КассаККМ)
	
	ПараметрыОперации = МенеджерОборудованияРМК.ПараметрыОперацииНСПК();
	ЭлектронныеСертификатыНСПКРМКПереопределяемый.ЗаполнитьПараметрыОперацииНСПКПоКассеККМ(ПараметрыОперации, КассаККМ);
	
	Возврат ПараметрыОперации;
	
КонецФункции

// МАКС
&НаСервере
Функция ПроверитьТокенМакс(Организация)
	
	КлючБезопасногоХранилища = "ТокенОрганизацииMAX";
	
	УстановитьПривилегированныйРежим(Истина);
	ТокенОрганизацииMAX = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(Организация,
		КлючБезопасногоХранилища);
	УстановитьПривилегированныйРежим(Ложь);
		
	Возврат ТокенОрганизацииMAX;
	
КонецФункции

&НаКлиенте
Асинх Процедура ПроверкиМакс(ТокенОрганизации)
	
	Результат = Ждать МенеджерОборудованияКлиент.ПроверитьВозрастАсинх("1", ТокенОрганизации);
	
	Если Не Результат.КодОтвета = 404 Тогда
		СтрокаОшибки = ТаблицаОшибок.Добавить();
		СтрокаОшибки.Карточка = "МАКС";
		СтрокаОшибки.ТекстОшибки = ?(ЗначениеЗаполнено(Результат.ОписаниеОшибки), Результат.ОписаниеОшибки, НСтр("ru = 'Код ошибки: '") + Результат.КодОтвета);
		СтрокаОшибки.СсылкаНаЭлемент = "ОткрытьНастройкиРазделПродажиМакс";
		СтрокаОшибки.ВозможноПерепроверить = Истина;
		СтрокаОшибки.ИспользуетсяНастройка = Истина;
	КонецЕсли;
	
	ПослеВсехПроверок();
	
КонецПроцедуры

// Маркировка
&НаКлиенте
Процедура ПослеАктуализацииСпискаПлощадок(Результат, ДополнительныеПараметры) Экспорт
	
	Если Не Результат = Неопределено Тогда
	
		Если Результат.ЕстьОшибки И ЗначениеЗаполнено(Результат.ТекстОшибки) Тогда
			
			СтрокаОшибки = ТаблицаОшибок.Добавить();
			СтрокаОшибки.Карточка = "Маркировка";
			СтрокаОшибки.ТекстОшибки = Результат.ТекстОшибки;
			СтрокаОшибки.СсылкаНаЭлемент = "ОткрытьНастройкиРазделМаркировка";
			СтрокаОшибки.ВозможноПерепроверить = Истина;
			СтрокаОшибки.ИспользуетсяНастройка = Истина;
			
		ИначеЕсли Результат.ЕстьОшибки Тогда
			
			Если Результат.ОтказОтАвторизации Тогда
				
				СтрокаОшибки = ТаблицаОшибок.Добавить();
				СтрокаОшибки.Карточка = "Маркировка";
				СтрокаОшибки.ТекстОшибки = НСтр("ru = 'Ошибка авторизации в ГИС МТ.'");
				СтрокаОшибки.СсылкаНаЭлемент = "ОткрытьНастройкиРазделМаркировка";
				СтрокаОшибки.ВозможноПерепроверить = Истина;
				СтрокаОшибки.ИспользуетсяНастройка = Истина;
				
			КонецЕсли; 
			
		КонецЕсли;
	
	КонецЕсли;
	
	ТаблицаКассККМОрганизаций = ВладелецФормы.ТаблицаКассККМОрганизаций;
	
	ЗапущенаПроверкаПодключенияТСПИоТ = Ложь;
	ТСПИоТ = Неопределено;
	Для Каждого СтрокаКассы Из ТаблицаКассККМОрганизаций Цикл
		Если ЗначениеЗаполнено(СтрокаКассы.ИдентификаторУстройства) Тогда
			
			НайтиТСПИОТ(СтрокаКассы.ИдентификаторУстройства, ТСПИоТ);
			
			Если ЗначениеЗаполнено(ТСПИоТ) И СтрокаКассы.ВнешнийТСПИоТ Тогда
				ЗапуститьПроверкуПодключенияТСПИоТ(ТСПИоТ);
				ЗапущенаПроверкаПодключенияТСПИоТ = Истина;
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
	Если Не ЗапущенаПроверкаПодключенияТСПИоТ Тогда
		ПроверитьЕГАИС();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НайтиТСПИОТ(Оборудование, ТСПИоТ);
	
	ОбщегоНазначенияРМК.НайтиТСПИОТ(Оборудование, ТСПИоТ);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьПроверкуПодключенияТСПИоТ(ОбъектТСПИоТ)
	
	ОбщегоНазначенияРМККлиент.ЗапуститьПроверкуПодключенияТСПИоТ(ОбъектТСПИоТ, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыполненияПроверкиНастройкиТСПИоТ(Результат, ДополнительныеПараметры) Экспорт
	
	Если Не Результат = Неопределено Тогда
		
		Если Результат.ЕстьОшибки Тогда
			
			ШаблонСообщения = НСтр("ru = 'Не удалось подключиться к ТС ПИоТ.
							|Описание ошибки: %1.'");
							
			ТекстСообщения = СтрШаблон(ШаблонСообщения, Результат.ТекстОшибки);
			
			СтрокаОшибки = ТаблицаОшибок.Добавить();
			СтрокаОшибки.Карточка = "Маркировка";
			СтрокаОшибки.ТекстОшибки = ТекстСообщения;
			СтрокаОшибки.СсылкаНаЭлемент = ДополнительныеПараметры.СсылкаТСПИоТ;
			СтрокаОшибки.ВозможноПерепроверить = Истина;
			СтрокаОшибки.ИспользуетсяНастройка = Истина;
			
		Иначе
			
			Если Результат.Свойство("Результат") И ТипЗнч(Результат.Результат) = Тип("Структура") Тогда
				
				Если ОбщегоНазначенияБПОКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Результат.Результат, "НастройкиЭкземпляраТСПИоТ")
					И Результат.Результат.НастройкиЭкземпляраТСПИоТ <> Неопределено Тогда
					
					НастройкиЭкземпляраТСПИоТ                = Результат.Результат.НастройкиЭкземпляраТСПИоТ;
					НомерФискальногоНакопителяПоДаннымТСПИоТ = НастройкиЭкземпляраТСПИоТ.НомерФискальногоНакопителя;
					ИННПоДаннымТСПИоТ                        = НастройкиЭкземпляраТСПИоТ.ИНН;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ПроверитьЕГАИС();
	
КонецПроцедуры

// ЕГАИС
&НаКлиенте
Процедура ПослеПроверкиПодключенияКУТМ(РезультатПроверки, НастройкаОбмена, КодФСРАР) Экспорт
	
	КодФСРАРИзУТМ = РезультатПроверки.КодФСРАР;
	
	Если ЗначениеЗаполнено(КодФСРАРИзУТМ)
		И КодФСРАРИзУТМ = КодФСРАР Тогда
		
		ПодключениеНастроеноКорректно = Истина;
		УказанПравильныйКодФСРАР      = Истина;
		
	ИначеЕсли КодФСРАРИзУТМ = "WebClient" Тогда
		
		ПодключениеНастроеноКорректно = Истина;
		УказанПравильныйКодФСРАР      = Истина;
		
	ИначеЕсли ЗначениеЗаполнено(КодФСРАРИзУТМ) Тогда
		
		СтрокаОшибки = ТаблицаОшибок.Добавить();
		СтрокаОшибки.Карточка = "ЕГАИС";
		СтрокаОшибки.ТекстОшибки = НСтр("ru = 'Указан не верный код ФСРАР. Исправьте на верный.'");
		СтрокаОшибки.СсылкаНаЭлемент = "ОткрытьРегистрНастройкиОбменаЕГАИС";
		СтрокаОшибки.ВозможноПерепроверить = Истина;
		СтрокаОшибки.ИспользуетсяНастройка = Истина;
		
	Иначе
		
		СтрокаОшибки = ТаблицаОшибок.Добавить();
		СтрокаОшибки.Карточка = "ЕГАИС";
		СтрокаОшибки.ТекстОшибки = РезультатПроверки.ТекстОшибки;
		СтрокаОшибки.СсылкаНаЭлемент = "ОткрытьРегистрНастройкиОбменаЕГАИС";
		СтрокаОшибки.ВозможноПерепроверить = Истина;
		СтрокаОшибки.ИспользуетсяНастройка = Истина;
		
	КонецЕсли;
	
	ПроверитьНСПК();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	ВладелецФормы.ОткрытаФормаМонитораСостояния = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если КритическаяОшибка Тогда
		//ВладелецФормы.Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПереподключитьОборудование(Команда)
	
	ТаблицаОборудования.Очистить();
	ВладелецФормы.ТаблицаОборудования.Очистить();

	МассивДляУдаления = Новый Массив;
	Для Каждого СтрокаОшибки Из ТаблицаОшибок Цикл
		Если СтрокаОшибки.ВозможноПерепроверить Тогда
			МассивДляУдаления.Добавить(СтрокаОшибки);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого СтрокаДляУдаления Из МассивДляУдаления Цикл
		ТаблицаОшибок.Удалить(СтрокаДляУдаления);
	КонецЦикла;
	
	ТаблицаОшибокВл = ВладелецФормы.ТаблицаОшибок;
	
	МассивДляУдаления = Новый Массив;
	Для Каждого СтрокаОшибки Из ТаблицаОшибокВл Цикл
		Если СтрокаОшибки.ВозможноПерепроверить Тогда
			МассивДляУдаления.Добавить(СтрокаОшибки);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого СтрокаДляУдаления Из МассивДляУдаления Цикл
		ТаблицаОшибокВл.Удалить(СтрокаДляУдаления);
	КонецЦикла;
	
	ВосстановитьСтатусыКарточек();
	
	Для Каждого СтрокаКарточки Из Карточки Цикл
		СтрокаКарточки.Используется = Ложь;
		СтрокаКарточки.ВыполнетсяПроверка = Ложь;
		СтрокаКарточки.ПроверкаЗавершена = Ложь;
		СтрокаКарточки.ЕстьОшибки = Ложь;
		СтрокаКарточки.ЕстьОшибкиКритические = Ложь;
	КонецЦикла;
	
	ОпределитьИспользуемоеОборудование();
	
	Для Каждого СтрокаКарточки Из Карточки Цикл
		Если Не СтрокаКарточки.Используется Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтрокаКарточки.Карточка = "ККТ"
			Или СтрокаКарточки.Карточка = "Эквайринг"
			Или СтрокаКарточки.Карточка = "Сканер"
			Или СтрокаКарточки.Карточка = "Весы"
			Или СтрокаКарточки.Карточка = "Дисплей" Тогда
				СтрокаКарточки.ВыполнетсяПроверка = Истина;
		КонецЕсли;
	КонецЦикла;
	
	АктуализироватьКарточки();
	
	ВладелецФормы.РанееПодключенныеТипыОборудования = МенеджерОборудованияРМККлиентСервер.ПараметрыТипыОборудования();
	
	ВладелецФормы.НастроитьВспомогательноеПодключаемоеОборудование();
	
	ПодключитьОбработчикОжидания("ПроверитьОборудование", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ВосстановитьСтатусыКарточек()
	
	Для Каждого ЭлементСтрокаКарточек Из Элементы.ГруппаОсновная.ПодчиненныеЭлементы Цикл
		Для Каждого ЭлементКарточка Из ЭлементСтрокаКарточек.ПодчиненныеЭлементы Цикл
			Элементы[ЭлементКарточка.Имя].ЦветФона = ЦветаФормы.ЦветФонаКарточки;
			Элементы[ЭлементКарточка.Имя + "Статус"].Картинка = БиблиотекаКартинок.Пустая;
			Элементы[ЭлементКарточка.Имя + "Статус"].ЦветТекста = ЦветаФормы.ЦветПредупреждение;
			ЭлементКарточка.Гиперссылка = Ложь;
		КонецЦикла;
	КонецЦикла;
	
	Элементы.СтраницыСтатус.ТекущаяСтраница = Элементы.СтраницаОбщийСтатус;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОшибокПриАктивизацииСтроки(Элемент)
	
	УстановитьДоступностьПоТекущейСтрокеТаблицыОшибок();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьПоТекущейСтрокеТаблицыОшибок()
	
	ТекущиеДанные = Элементы.ТаблицаОшибок.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Элементы.ТаблицаОшибокОткрытьОборудование.Доступность = Ложь;
		Элементы.ТаблицаОшибокОткрытьНастройку.Доступность = Ложь;
		Возврат;
	КонецЕсли;
	
	Элементы.ТаблицаОшибокОткрытьОборудование.Доступность = ТекущиеДанные.ИспользуетсяОборудование;
	Элементы.ТаблицаОшибокОткрытьНастройку.Доступность = ТекущиеДанные.ИспользуетсяНастройка
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНастройку(Команда)
	
	ТекущиеДанные = Элементы.ТаблицаОшибок.ТекущиеДанные;
	
	ОткрытьНастройкуПоСсылке(ТекущиеДанные.СсылкаНаЭлемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОборудование(Команда)
	
	ТекущиеДанные = Элементы.ТаблицаОшибок.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.Оборудование) Тогда
		ПоказатьЗначение(, ТекущиеДанные.Оборудование);
	Иначе
		ОткрытьФорму("Справочник.ПодключаемоеОборудование.ФормаСписка");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОформитьКарточкуСостоянияОбмена()
	
	ОбщегоНазначенияРМК.ОформитьКарточкуСостоянияОбмена(ЭтотОбъект);
	
КонецПроцедуры 

// ТС ПИоТ
&НаКлиенте
Процедура ПерейтиНаСтраницуТСПИоТ(Команда)
	
	Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаТСПИоТ;
	
	
	ДополнительныеПараметры = МенеджерОборудованияКлиентСервер.ДополнительныеПараметрыОперации(Истина);
	ПараметрыОперации = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыОткрытияЗакрытияСмены();
	ДополнительныеПараметры = Новый Структура("Кассир, Пользователь", ВладелецФормы.Объект.Кассир, ВладелецФормы.Объект.ПользовательБД);
	ОбщегоНазначенияРМКВызовСервера.ЗаполнитьПараметрыКассираДляПечати(ПараметрыОперации, ДополнительныеПараметры);
	
	КассирФИО = ПараметрыОперации.Кассир;
	КассирИНН = ПараметрыОперации.КассирИНН;
	
	КонтрольнаяМарка = "";
	
	СТ_РегистрацияПройдена = Ложь;
	СТ_АварийныйРежим = Ложь;
	СТ_ЛМЧЗГотов = Ложь;
	СТ_АвторизацияПройдена = Ложь;
	СТ_ГотовКПроверкеКМOnline = Ложь;
	СТ_ГотовКПроверкеКМOffline = Ложь;
	СТ_АварийныйРежим = Ложь;
	СТ_ПостАварийныйРежим = Ложь;
	СТ_Error = "";
	
	СписокККТ = Элементы.ККТ.СписокВыбора;
	СписокККТ.Очистить();
	ККТ = Неопределено;
	
	Для Каждого Об1 из ТаблицаОборудования Цикл
		Если Об1.Карточка = "ККТ" Тогда
			
			Если Не ЗначениеЗаполнено(Об1.Оборудование) Тогда
				Продолжить;
			КонецЕсли;
			
			
			ТСПИОТ = Неопределено;
			НайтиТСПИОТ(Об1.Оборудование, ТСПИОТ);
			
			Если ЗначениеЗаполнено(ТСПИОТ) Тогда
				Если Не ЗначениеЗаполнено(ККТ) Тогда
					ККТ = Об1.Оборудование;
					ТСПИОТККТ = ТСПИОТ.Ссылка;
					ЗапросСтатуса(Неопределено);
				КонецЕсли;
				СписокККТ.Добавить(Об1.Оборудование);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Аутентификация(Команда)
	
	Если Не ЗначениеЗаполнено(ККТ) Тогда
		ПоказатьПредупреждение(Неопределено, НСтр("ru='ККТ не выбран.'"));
		Возврат;
	КонецЕсли;
	
	Элементы.СтраницаСтатусТСПИоТИдетНастройка.Видимость = Истина;
	
	ОповещениеПриЗавершении = Новый ОписаниеОповещения("ПослеПроверкиСтатусаГотовностиТСПИоТ", ЭтотОбъект);
	ОборудованиеЧекопечатающиеУстройстваКлиент.НачатьРаботуПИоТ(ОповещениеПриЗавершении, УникальныйИдентификатор, ККТ, , ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапросСтатуса(Команда)
	
	Если Не ЗначениеЗаполнено(ККТ) Тогда
		ПоказатьПредупреждение(Неопределено, НСтр("ru='ККТ не выбран.'"));
		Возврат;
	КонецЕсли;
	
	Если СменаОткрыта() Тогда
	
		ПараметрыОперации = Неопределено;
		
		ОповещениеПриЗавершении = Новый ОписаниеОповещения("КомандаВыполнитьЗавершение", ЭтотОбъект);
		ОборудованиеЧекопечатающиеУстройстваКлиент.НачатьПолучениеСтатусаПИоТ(ОповещениеПриЗавершении,
			УникальныйИдентификатор, ККТ, ПараметрыОперации, ДополнительныеПараметры);
	Иначе
		ОчиститьСтатусыПиот();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучениеСлужебнойИнформации(Команда)
	
	Если Не ЗначениеЗаполнено(ККТ) Тогда
		ПоказатьПредупреждение(Неопределено, НСтр("ru='ККТ не выбран.'"));
		Возврат;
	КонецЕсли;
	
	ПараметрыОперации = Неопределено;
	
	ОповещениеПриЗавершении = Новый ОписаниеОповещения("КомандаВыполнитьЗавершение", ЭтотОбъект);
	ОборудованиеЧекопечатающиеУстройстваКлиент.НачатьПолучениеСлужебнойИнформацииПИоТ(ОповещениеПриЗавершении, УникальныйИдентификатор, ККТ, ПараметрыОперации, ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьЭкземплярСРегистрацииПИоТ(Команда)
	
	Если Не ЗначениеЗаполнено(ККТ) Тогда
		ПоказатьПредупреждение(Неопределено, НСтр("ru='ККТ не выбран.'"));
		Возврат;
	КонецЕсли;
	
	ПараметрыОперации = Неопределено;
	
	ОповещениеПриЗавершении = Новый ОписаниеОповещения("КомандаВыполнитьЗавершение", ЭтотОбъект);
	ОборудованиеЧекопечатающиеУстройстваКлиент.НачатьСнятьЭкземплярСРегистрацииПИоТ(ОповещениеПриЗавершении, УникальныйИдентификатор, ККТ, ПараметрыОперации, ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьПроверки(Команда)
	
	ВыполнитьУдаленниеФискальныеОперацииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьУдаленниеФискальныеОперацииНаСервере()
	
	НаборЗаписей = РегистрыСведений.ФискальныеОперации.СоздатьНаборЗаписей();
	НаборЗаписей.Записать();
	
	НаборЗаписей = РегистрыСведений.ОперацииПроверкиКМ.СоздатьНаборЗаписей();
	НаборЗаписей.Записать();
	
	НаборЗаписей = РегистрыСведений.СобытияЭксплуатацииТСПИоТ.СоздатьНаборЗаписей();
	НаборЗаписей.Записать();
	
КонецПроцедуры



&НаКлиенте
Процедура ФайлЛогированияНажатиеЗавершение(КодВозврата, ДополнительныйПараметр) Экспорт
	Возврат;
КонецПроцедуры

&НаКлиенте
Процедура ФайлЛогированияНажатие(Элемент)
	
	Оповещение = Новый ОписаниеОповещения("ФайлЛогированияНажатиеЗавершение", ЭтотОбъект);
	НачатьЗапускПриложения(Оповещение, ПИоТ_ПустьКЛогам,, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФискальныеОперацииНажатие(Элемент)
	
	ПараметрыВыполненияКоманды = Новый Структура;
	ПараметрыВыполненияКоманды.Вставить("Источник", ЭтаФорма);
	ПараметрыВыполненияКоманды.Вставить("Уникальность", УникальныйИдентификатор);
	ПараметрыВыполненияКоманды.Вставить("Окно",);
	МенеджерОборудованияКлиент.ОткрытьФискальныеОперации(Неопределено, ПараметрыВыполненияКоманды);
	
КонецПроцедуры

// Завершения

&НаКлиенте
Процедура ПослеПроверкиСтатусаГотовностиТСПИоТ(РезультатВыполнения, Параметры) Экспорт
	
	Если РезультатВыполнения.Свойство("СтатусСостояния") И  РезультатВыполнения.СтатусСостояния <> Неопределено  Тогда
		ОбновитьСтатусСостояния(РезультатВыполнения.СтатусСостояния);
		Если Не СТ_ГотовКПроверкеКМOnline Или Не СТ_ГотовКПроверкеКМOffline Тогда
			ПодключитьОбработчикОжидания("ПроверкаСтатусаГотовностиТСПИоТ", 1, Истина);
		Иначе
			УстройствоЗанято = Ложь;
			Элементы.СтраницаСтатусТСПИоТИдетНастройка.Видимость = Ложь;
		КонецЕсли
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаСтатусаГотовностиТСПИоТ() Экспорт
	
	ОповещениеПослеВыполнения = Новый ОписаниеОповещения("ПослеПроверкиСтатусаГотовностиТСПИоТ", ЭтотОбъект);
	
	ПараметрыОперации = Неопределено;
	
	ОповещениеПриЗавершении = Новый ОписаниеОповещения("ПослеПроверкиСтатусаГотовностиТСПИоТ", ЭтотОбъект);
	ОборудованиеЧекопечатающиеУстройстваКлиент.НачатьПолучениеСтатусаПИоТ(ОповещениеПриЗавершении, УникальныйИдентификатор, ККТ, ПараметрыОперации, ДополнительныеПараметры);
	
КонецПроцедуры

// После 
&НаКлиенте
Процедура КомандаВыполнитьЗавершение(РезультатВыполнения, Параметры) Экспорт
	
	ОчиститьСообщения();
	УстройствоЗанято = Ложь;
	
	Если РезультатВыполнения.Результат Тогда
		Если РезультатВыполнения.Свойство("ФискальныеДанные") Тогда
			ОбновитьДанные(РезультатВыполнения.ФискальныеДанные);
		Иначе
			ОбновитьДанные(РезультатВыполнения);
		КонецЕсли;
		
		Если РезультатВыполнения.Свойство("СлужебнаяИнформация") Тогда
			СлужебнаяИнформация = РезультатВыполнения.СлужебнаяИнформация;
			ПИоТ_Имя = СлужебнаяИнформация.Наименование + " " + СлужебнаяИнформация.Версия;
			ПИоТ_ПустьКЛогам = СлужебнаяИнформация.ПустьКЛогам;
			ПИоТ_ПустьКФайламСобытия = СлужебнаяИнформация.ПустьКФайламСобытия;
		КонецЕсли;
		
		Если РезультатВыполнения.Свойство("СтатусСостояния") И  РезультатВыполнения.СтатусСостояния <> Неопределено Тогда 
			ОбновитьСтатусСостояния(РезультатВыполнения.СтатусСостояния);
		КонецЕсли;
		
	Иначе
		ТекстПроЗакрытуюСмену = НСтр("ru='смена не открыта'");
		ТекстСообщения = РезультатВыполнения.ОписаниеОшибки;
		Если СтрНайти(ТекстСообщения, ТекстПроЗакрытуюСмену) > 0 И СменаОткрыта() Тогда
			ТекстСообщения = НСтр("ru='Выполняется обновление статуса ФН, пожалуйста, обновите позднее.'");
		КонецЕсли;
		ОбщегоНазначенияБПОКлиент.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПодключитьЗавершение(РезультатВыполнения, Параметры) Экспорт
	
	ОчиститьСообщения();
	Элементы.ГруппаИнфо.Доступность = Истина;
	Элементы.ОткрытьФайлЛогирования.Доступность = Истина;
	
	НомерСмены  = Неопределено;
	НомерЧека   = Неопределено;
	СтатусСмены = Неопределено;
	
	Если РезультатВыполнения.Результат Тогда
		Если РезультатВыполнения.Свойство("ФискальныеДанные") Тогда
			ОбновитьДанные(РезультатВыполнения.ФискальныеДанные);
		КонецЕсли;
		
		ПараметрыОперации = Неопределено;
		ОповещениеПриЗавершении = Новый ОписаниеОповещения("КомандаВыполнитьЗавершение", ЭтотОбъект);
		ОборудованиеЧекопечатающиеУстройстваКлиент.НачатьПолучениеСлужебнойИнформацииПИоТ(ОповещениеПриЗавершении, УникальныйИдентификатор, ККТ, ПараметрыОперации, ДополнительныеПараметры);
		
	Иначе
		ТекстСообщения = РезультатВыполнения.ОписаниеОшибки;
		ОбщегоНазначенияБПОКлиент.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанные(РезультатВыполнения);
	
	Если РезультатВыполнения.Свойство("НомерЧекаККТ") Тогда
		НомерЧека = РезультатВыполнения.НомерЧекаККТ;
	КонецЕсли;
		
	Если РезультатВыполнения.Свойство("НомерСменыККТ") Тогда
		НомерСмены = РезультатВыполнения.НомерСменыККТ;
	КонецЕсли;
		
	Если РезультатВыполнения.Свойство("СтатусСмены") Тогда
		Если РезультатВыполнения.СтатусСмены = 1 Тогда
			СтатусСмены = НСтр("ru='Закрыта'")
		ИначеЕсли РезультатВыполнения.СтатусСмены = 2 Тогда
			СтатусСмены = НСтр("ru='Открыта'")
		Иначе
			СтатусСмены = НСтр("ru='Истекла'")
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСтатусСостояния(СтатусСостояния);
	
	СТ_РегистрацияПройдена = СтатусСостояния.РегистрацияПройдена;
	СТ_ГотовКПроверкеКМOnline = СтатусСостояния.ГотовКПроверкеКМOnline; 
	СТ_ГотовКПроверкеКМOffline = СтатусСостояния.ГотовКПроверкеКМOffline; 
	СТ_АварийныйРежим = СтатусСостояния.АварийныйРежим;
	СТ_ПостАварийныйРежим = СтатусСостояния.ПостАварийныйРежим;
	СТ_ЛМЧЗГотов = СтатусСостояния.ЛМЧЗГотов;
	СТ_АвторизацияПройдена = СтатусСостояния.АвторизацияПройдена;
	Если СтатусСостояния.Свойство("ЛМЧЗСтатусТекст") Тогда
		СТ_ЛМЧЗСтатус = СтатусСостояния.ЛМЧЗСтатусТекст;
	Иначе
		СТ_ЛМЧЗСтатус = СтатусСостояния.ЛМЧЗСтатус;
	КонецЕсли;
	СТ_Error = СтатусСостояния.ТекстОшибки;
	
	СТ_ТокенЛМЧЗ =  СтатусСостояния.ТокенЛМЧЗ;
	СТ_ТокенЛМЧЗДатаДействия = СтрЗаменить(СтатусСостояния.ТокенЛМЧЗДатаДействия, "T", " ");
	
	ПолучениеСлужебнойИнформации(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ККТПриИзменении(Элемент)
	
	ТСПИОТ = Неопределено;
	НайтиТСПИОТ(ККТ, ТСПИОТ);
	
	Если ЗначениеЗаполнено(ТСПИОТ) Тогда
		ТСПИОТККТ = ТСПИОТ.Ссылка;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСобытияЭксплуатацииТСПИоТНажатие(Элемент)
	
	МенеджерОборудованияТСПИОТКлиент.ОткрытьСобытияЭксплуатацииТСПИоТ(ККТ);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОперацииПроверкиКМНажатие(Элемент)
	
	ПараметрыВыполненияКоманды = Новый Структура;
	ПараметрыВыполненияКоманды.Вставить("Источник", ЭтаФорма);
	ПараметрыВыполненияКоманды.Вставить("Уникальность", УникальныйИдентификатор);
	ПараметрыВыполненияКоманды.Вставить("Окно",);
	
	МенеджерОборудованияМаркировкаКлиент.ОткрытьОперацииПроверкиКМ(Неопределено, ПараметрыВыполненияКоманды);
	
КонецПроцедуры

&НаКлиенте
Процедура ККТОткрытие(Элемент, СтандартнаяОбработка)
	
	Если Не ЕстьРольДобавлениеИзменениеТСПИоТ Тогда
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры



