#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды     
		
	ПечатьДокументовУНФ.УстановитьОтображениеПодменюПечати(Элементы.ПодменюПечать);
	
	ДинамическиеСпискиУНФ.ОтображатьТолькоВремяДляТекущейДаты(Список);
	
	// ПоложениеТаблицыДетали
	КлючОбъекта = СтрЗаменить(ИмяФормы, ".", "");
	ПанельДеталиРазвернута = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(КлючОбъекта, 
		"ПанельДеталиРазвернута", Истина);
	
	ПоложениеТаблицыДетали = ПерсональныеНастройкиРУНФ.Прочитать("ПоложениеТаблицыДеталиВУстановкахЦенНоменклатуры");
	
	ЭтоМобильныйКлиент = ОбщегоНазначения.ЭтоМобильныйКлиент();
	Если ЭтоМобильныйКлиент Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, 
			"ФормаНастроитьФорму", "Видимость", Ложь);
		ПоложениеТаблицыДетали = Перечисления.ПоложениеТаблицыДетали.ВПравойПанели;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ПоложениеТаблицыДетали) Тогда
		ПоложениеТаблицыДетали = Перечисления.ПоложениеТаблицыДетали.ВПравойПанели;
	КонецЕсли;
	
	НастроитьПоложениеПанелиДетали(ЭтотОбъект);
	// Конец ПоложениеТаблицыДетали
	
	// УНФ.ОтборыСписка
	Если Параметры.РежимВыбора Тогда
		
		РежимБлокировкиПриОткрытииОкна = РежимБлокировкиПриОткрытииОкнаФормы.БлокироватьВладельца;
		ВариантОтборовФормы = "ВыборПодбор";  
		
		Если Параметры.Отбор.Свойство("Автор") Тогда
			УстановитьМеткуИОтборСписка("Автор", "ГруппаОтборАвтор", Параметры.Отбор.Автор);
		КонецЕсли;
		
		Если Параметры.Отбор.Свойство("ДокументОснование") Тогда
			УстановитьМеткуИОтборСписка("ДокументОснование", "ГруппаОтборОснование", Параметры.Отбор.ДокументОснование);
		КонецЕсли;
				
	Иначе
		ВариантОтборовФормы = "";
	КонецЕсли;
	
	РаботаСОтборами.ОпределитьПорядокПредопределенныхОтборов(ЭтотОбъект);
	РаботаСОтборами.ВосстановитьНастройкиОтборов(ЭтотОбъект, Список, , , , ВариантОтборовФормы);
	//Конец УНФ.ОтборыСписка
		
	ВремяЗадержкиОбработчиковОжидания = 0.3;
	
	// ОбратнаяСвязь
	ОбратнаяСвязь.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ОбратнаяСвязь
	
	АдаптацияТакси();
	ОбновитьСчетчикФильтровПоДаннымМеток();
	
КонецПроцедуры  

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ВремяЗадержкиОбработчиковОжидания = ДокументыУНФКлиент.ВремяЗадержкиОбработчиковОжидания();

КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если НЕ ЗавершениеРаботы Тогда
		//УНФ.ОтборыСписка
		СохранитьНастройкиОтборов();
		//Конец УНФ.ОтборыСписка
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_УстановкаЦенНоменклатуры" И ТипЗнч(Параметр) = Тип(
		"ДокументСсылка.УстановкаЦенНоменклатуры") Тогда
		Если Параметр = Элементы.Список.ТекущаяСтрока Тогда
			ПроверитьОбновитьДеталиПоДокументу(Ложь);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НадписьОткрытьДокументОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьТекущийДокумент(Элементы.Список.ТекущаяСтрока);
		
КонецПроцедуры

&НаКлиенте
Процедура НадписьПодСпискомОткрытьДокументОбработкаНавигационнойСсылки(Элемент,
	НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьТекущийДокумент(Элементы.Список.ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура ПраваяПанельСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)  
	
	ПроверитьОбновитьДеталиПоДокументу(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеПериодаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка) 
	
	СтандартнаяОбработка = Ложь;
	РаботаСОтборамиКлиент.ПредставлениеПериодаВыбратьПериод(ЭтотОбъект, "Список", "Дата");

КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеПериодаОчистка(Элемент, СтандартнаяОбработка)
	
	РаботаСОтборамиКлиент.СброситьОтборПоПериоду(ЭтотОбъект, "Список", "Дата");
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеПериодаТаксиНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь; 
	РаботаСОтборамиКлиент.ПредставлениеПериодаВыбратьПериод(ЭтотОбъект, "Список", "Дата");
	
КонецПроцедуры

&НаКлиенте
Процедура ИндексФильтрыНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь; 
	 	
	СвернутьРазвернутьПанельОтборов();  
	
	ТекущаяСтраница = Элементы.ФильтрыНастройкиИДопИнфо;
	Элементы.ПраваяПанельСтраницы.ТекущаяСтраница = ТекущаяСтраница;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначокФильтрыНажатие(Элемент)
	
	СвернутьРазвернутьПанельОтборов();
	
	ТекущаяСтраница = Элементы.ФильтрыНастройкиИДопИнфо;
	Элементы.ПраваяПанельСтраницы.ТекущаяСтраница = ТекущаяСтраница;
	
КонецПроцедуры 

&НаКлиенте
Процедура ЗначокДеталиНажатие(Элемент)
	
	СвернутьРазвернутьПанельОтборов();
	ТекущаяСтраница = Элементы.Детали;
	Элементы.ПраваяПанельСтраницы.ТекущаяСтраница = ТекущаяСтраница;
	
	ПроверитьОбновитьДеталиПоДокументу(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборОснованиеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьМеткуИОтборСписка("ДокументОснование", Элемент.Родитель.Имя, ВыбранноеЗначение);
	ВыбранноеЗначение = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборАвторОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьМеткуИОтборСписка("Автор", Элемент.Родитель.Имя, ВыбранноеЗначение);
	ВыбранноеЗначение = Неопределено;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	ОбновитьДеталиДокумента = ВидимыДанныеДетали();
	
	Если ОбновитьДеталиДокумента Тогда
		ПодключитьОбработчикОжидания("СписокПриАктивизацииСтрокиОбработчик", ВремяЗадержкиОбработчиковОжидания, Истина);
	КонецЕсли;
		
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриНаведении(Элемент, Строка, Поле)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	Для каждого СтрокаСписка Из Строки Цикл
	
		СтрокаСписка.Значение.Данные.ВидыЦен = 
			Документы.УстановкаЦенНоменклатуры.ПолучитьПредставлениеВыбранныхВидовЦен(СтрокаСписка.Ключ);
	
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура НастройкиМинимальныхЦен(Команда)
	
	ОткрытьФорму("Справочник.СтруктурныеЕдиницы.Форма.ФормаУказанияМинимальныхЦен");
	
КонецПроцедуры

&НаКлиенте
Процедура СвернутьПравуюПанель(Команда)     
	 
	СвернутьРазвернутьПанельОтборов();  
	
КонецПроцедуры   

&НаКлиенте
Процедура СброситьВсеОтборы(Команда)
	РаботаСОтборамиКлиент.СброситьОтборПоПериоду(ЭтотОбъект, "Список", "Дата");
	СброситьВсеМеткиОтбораНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура НастроитьОтборы(Команда)
	
	ИмяРеквизитаСписка = "Список";
	ИмяТЧДанныеМеток = "ДанныеМеток";
	ИмяТЧДанныеОтборов = "ДанныеОтборов";
	ИмяГруппыОтборов = "ГруппаОтборы";
	ИмяПредопределенныеОтборыПоУмолчанию = "ПредопределенныеОтборыПоУмолчанию";
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяРеквизитаСписка", ИмяРеквизитаСписка);
	ДополнительныеПараметры.Вставить("ИмяТЧДанныеМеток", ИмяТЧДанныеМеток);
	ДополнительныеПараметры.Вставить("ИмяТЧДанныеОтборов", ИмяТЧДанныеОтборов);
	ДополнительныеПараметры.Вставить("ИмяГруппыОтборов", ИмяГруппыОтборов);
	ДополнительныеПараметры.Вставить("ИмяПредопределенныеОтборыПоУмолчанию", ИмяПредопределенныеОтборыПоУмолчанию);
	
	РаботаСОтборамиКлиент.НастроитьОтборыНажатие(ЭтотОбъект, ПараметрыОткрытияФормыСНастройкамиОтборов(ДополнительныеПараметры), ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьФорму(Команда)
	
	ОткрытьФормуНастройки(Истина);
	СтатистикаИспользованияФормКлиент.ПриИнтерактивномДействии(ЭтотОбъект, Элементы.ФормаНастроитьФорму, "Нажатие");

КонецПроцедуры

&НаКлиенте
Процедура СвернутьРазвернутьДетали(Команда)
	
	ПанельДеталиРазвернута = НЕ ПанельДеталиРазвернута;
	ОбработатьПанельПредпросмотра();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура АдаптацияТакси()
	
	СвойствоВидимость = "Видимость";
	
	Интерфейс85 = ОбщегоНазначенияКлиентСервер.ЭтоВариантИнтерфейса85();
	ИнтерфейсТакси = Не Интерфейс85;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ИндексФильтрыТакси", 
			СвойствоВидимость, ИнтерфейсТакси);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ИндексФильтры", 
			СвойствоВидимость, Интерфейс85);
			
	Элементы.ГруппаГлобальныеКоманды.Видимость = ИнтерфейсТакси;
	 	
	Если ИнтерфейсТакси Тогда
		
		Элементы.Переместить(Элементы.ГруппаСоздать, КоманднаяПанель, Элементы.ГруппаВажныеКоманды);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаДетали",
			"ВертикальныйИнтервал", ИнтервалМеждуЭлементамиФормы.Авто);
		
	КонецЕсли;
	
	Элементы.ПредставлениеПериода.Видимость = Интерфейс85;
	Элементы.ПредставлениеПериодаТакси.Видимость = ИнтерфейсТакси; 
	
КонецПроцедуры 


&НаСервере
Процедура ОбновитьСчетчикФильтровПоДаннымМеток()
	
	ПериодЗаВсеВремя = НСтр("ru = 'Период: за все время'");
	
	Если ЗначениеЗаполнено(ПредставлениеПериода) И ПредставлениеПериода = ПериодЗаВсеВремя Тогда
		КоличествоФильтров = ДанныеМеток.Количество();
	ИначеЕсли ЗначениеЗаполнено(ПредставлениеПериода) И ПредставлениеПериода <> ПериодЗаВсеВремя Тогда
		КоличествоФильтров = ДанныеМеток.Количество() + 1;
	Иначе
		КоличествоФильтров = ДанныеМеток.Количество();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкиОтборов()
	
	РаботаСОтборами.СохранитьНастройкиОтборов(ЭтотОбъект);
	
	КлючОбъекта = СтрЗаменить(ИмяФормы, ".", "");
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(КлючОбъекта, 
		"ПанельДеталиРазвернута", ПанельДеталиРазвернута);
	
КонецПроцедуры

#Область ОбратнаяСвязь

&НаКлиенте
Процедура Подключаемый_ОбратнаяСвязьБольшеНеПоказывать(Команда)
	
	ОбратнаяСвязьКлиент.ОбратнаяСвязьБольшеНеПоказывать(ЭтотОбъект, Истина);
	ВосстановитьПравуюПанельПослеОпроса();
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбратнаяСвязьПройтиСейчас(Команда)
	
	ПараметрыФормы = Новый Структура("ИнтерактивноеОткрытие", Ложь);
	ОбработкаЗавершения = Новый ОписаниеОповещения("ОпросНачалоРаботыЗавершение", ЭтотОбъект);
	ОткрытьФорму("Обработка.ОбратнаяСвязь.Форма.ОпросНачалоРаботы", ПараметрыФормы, , , , , ОбработкаЗавершения);
	ВосстановитьПравуюПанельПослеОпроса();
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбратнаяСвязьОтложить(Команда)
	
	ОбратнаяСвязьКлиент.ОбратнаяСвязьОтложить(ЭтотОбъект);
	ВосстановитьПравуюПанельПослеОпроса();
	
КонецПроцедуры

&НаКлиенте
Процедура ОпросНачалоРаботыЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Структура") И Результат.Свойство("ОпросЗавершен") Тогда
		Если Результат.ОпросЗавершен Тогда
			ОбратнаяСвязьКлиент.ОбратнаяСвязьБольшеНеПоказывать(ЭтотОбъект);
			ВосстановитьПравуюПанельПослеОпроса();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВосстановитьПравуюПанельПослеОпроса() Экспорт
	
	ИмяРеквизитаНачальноеСостояниеПравойПанели = "ОбратнаяСвязь_НачальноеСостояниеПравойПанели";
	ИмяРеквизитаПоказыватьОпрос = "ОбратнаяСвязь_ПоказыватьОпрос";
	ЭтотОбъект[ИмяРеквизитаПоказыватьОпрос] = Ложь;
	Если ЭтотОбъект[ИмяРеквизитаНачальноеСостояниеПравойПанели] Тогда
		СвернутьРазвернутьПанельОтборов();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиБиблиотек

// СтандартныеПодсистемы.ПодключаемыеКоманды
//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Элементы.Список);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Элементы.Список);
КонецПроцедуры

//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область Отбор

&НаСервере
Процедура УстановитьМеткуИОтборСписка(ИмяПоляОтбораСписка, ГруппаРодительМетки, ВыбранноеЗначение, ПредставлениеЗначения="")
	
	Если ГруппаРодительМетки = "ГруппаОтборОплата" Тогда
		ПредставлениеЗначения = РаботаСОтборами.СформироватьПредставлениеМеткиОплата(ВыбранноеЗначение);
		Если ИмяПоляОтбораСписка = "НомерКартинкиОплаты" Тогда
			ВыбранноеЗначение = РаботаСОтборами.НомерКартинкиПоСтатусуОплаты(ВыбранноеЗначение);
		КонецЕсли;
	ИначеЕсли ПредставлениеЗначения = "" Тогда
		ПредставлениеЗначения = Строка(ВыбранноеЗначение);
	КонецЕсли;
	
	РаботаСОтборами.ПрикрепитьМеткуОтбора(ЭтотОбъект, ИмяПоляОтбораСписка, ГруппаРодительМетки, ВыбранноеЗначение, ПредставлениеЗначения);
	РаботаСОтборами.УстановитьОтборСписка(ЭтотОбъект, Список, ИмяПоляОтбораСписка);
	
	ОбновитьСчетчикФильтровПоДаннымМеток();
	
КонецПроцедуры

//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_МеткаОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки,
	СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;

	МеткаИД = Сред(Элемент.Имя, СтрДлина("Метка_") + 1);
	УдалитьМеткуОтбора(МеткаИД);

КонецПроцедуры

&НаСервере
Процедура УдалитьМеткуОтбора(МеткаИД)
	
	РаботаСОтборами.УдалитьМеткуОтбораСервер(ЭтотОбъект, Список, МеткаИД);
	ОбновитьСчетчикФильтровПоДаннымМеток();
	
КонецПроцедуры

&НаСервере
Функция ПараметрыОткрытияФормыСНастройкамиОтборов(ДополнительныеПараметры)
	
	Возврат РаботаСОтборами.ПараметрыДляОткрытияФормыСНастройкамиОтборов(ЭтотОбъект, ДополнительныеПараметры);
	
КонецФункции

&НаКлиенте
Процедура НастройкаОтборовЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НастройкаОтборовЗавершениеНаСервере(Результат.АдресВыбранныеОтборы, Результат.АдресУдаленныеОтборы,
		ДополнительныеПараметры);
	
КонецПроцедуры

&НаСервере
Процедура НастройкаОтборовЗавершениеНаСервере(АдресВыбранныеОтборы, АдресУдаленныеОтборы, ДополнительныеПараметры)
	
	РаботаСОтборами.НастройкаОтборовЗавершение(ЭтотОбъект, АдресВыбранныеОтборы, АдресУдаленныеОтборы,
		ДополнительныеПараметры);
	
КонецПроцедуры

//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ОтборПриИзменении(Элемент)
	
	Подключаемый_ОтборПриИзмененииНаСервере(Элемент.Имя, Элемент.Родитель.Имя);
	
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ОтборПриИзмененииНаСервере(ЭлементИмя, ЭлементРодительИмя)
	
	РаботаСОтборами.Подключаемый_ОтборПриИзменении(ЭтотОбъект, ЭлементИмя, ЭлементРодительИмя);
	
КонецПроцедуры

//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ОтборОчистка(Элемент)
	
	Подключаемый_ОтборОчисткаНаСервере(Элемент.Имя, Элемент.Родитель.Имя);
	
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ОтборОчисткаНаСервере(ЭлементИмя, ЭлементРодительИмя)
	
	РаботаСОтборами.Подключаемый_ОтборОчистка(ЭтотОбъект, ЭлементИмя);

КонецПроцедуры

&НаСервере
Процедура СброситьВсеМеткиОтбораНаСервере()
	РаботаСОтборами.УдалитьМеткиОтбораСервер(ЭтотОбъект, Список);
КонецПроцедуры

&НаКлиенте
Процедура СвернутьРазвернутьПанельОтборов() 
	
	НовоеЗначениеВидимость = НЕ Элементы.ПраваяПанельСтраницы.Видимость;
	РаботаСОтборамиКлиент.СвернутьРазвернутьПанельОтборов(ЭтотОбъект, НовоеЗначениеВидимость);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтрокиОбработчик()
	
	Если ОбновитьДеталиДокумента Тогда
		ОбновитьДанныеПравойПанели(Ложь, ОбновитьДеталиДокумента);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеПравойПанели(ОбновитьКИ, ОбновитьДД)
	
	Если ОбновитьДД Тогда
		ЗаполнитьПанельДетали();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуНастройки(ПередаватьВидДокумента)
	
	СтруктураПараметров = Новый Структура;
	
	Если ПередаватьВидДокумента Тогда
		СтруктураПараметров.Вставить("ВидДокумента", НСтр("ru = 'список установок цен номенклатуры'"));
	КонецЕсли;
	
	Заголовки = Новый Структура;
	Заголовки.Вставить("ПоложениеТаблицыДеталиВУстановкахЦенНоменклатуры",
		НСтр("ru = 'Положение таблицы ""Запасы""'"));
	
	СтруктураПараметров.Вставить("БылиВнесеныИзменения", Ложь);
	СтруктураПараметров.Вставить("ПоложениеТаблицыДеталиВУстановкахЦенНоменклатуры",
		ПоложениеТаблицыДетали);
	СтруктураПараметров.Вставить("Заголовки", Заголовки);
		
	ОткрытьФорму("ОбщаяФорма.ШапкаТабличнаяЧасть", СтруктураПараметров, , , , , 
		Новый ОписаниеОповещения("ШапкаТабличнаяЧастьЗавершение", ЭтотОбъект));

КонецПроцедуры

&НаКлиенте
Процедура ШапкаТабличнаяЧастьЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Структура") И Результат.БылиВнесеныИзменения Тогда
		Если ПоложениеТаблицыДетали <> Результат.ПоложениеТаблицыДеталиВУстановкахЦенНоменклатуры Тогда
			ПоложениеТаблицыДетали = Результат.ПоложениеТаблицыДеталиВУстановкахЦенНоменклатуры;
			НастроитьПоложениеПанелиДетали(ЭтотОбъект);
			ДеталиВидимы = ВидимыДанныеДетали();
			Если ДеталиВидимы Тогда
				ЗаполнитьПанельДетали();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#Область ПредпросмотрДокумента

&НаКлиенте
Процедура ПроверитьОбновитьДеталиПоДокументу(ОбновитьКИ)
	
	ОбновитьДетали = ВидимыДанныеДетали();
	Если ОбновитьДетали Тогда
		ОбновитьДанныеПравойПанели(Ложь, ОбновитьДетали);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьТекущийДокумент(СсылкаНаДокумент)
	
	Если СсылкаНаДокумент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьЗначениеАсинх(СсылкаНаДокумент);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьПанельПредпросмотра()
	
	Если ПанельДеталиРазвернута Тогда
		КартинкаКоманды = БиблиотекаКартинок.СтрелкаРазвернутаяГруппа;
	Иначе
		КартинкаКоманды = БиблиотекаКартинок.СтрелкаСвернутаяГруппа;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СвернутьРазвернутьДетали", "Картинка",
			КартинкаКоманды);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаДеталиДокумента",
		"Видимость", ПанельДеталиРазвернута);
		
	ЗаполнитьПанельДетали();
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьПоложениеПанелиДетали(Форма)
	
	Элементы = Форма.Элементы;
	ДеталиВПравойПанели = Форма.ПоложениеТаблицыДетали = ПредопределенноеЗначение(
		"Перечисление.ПоложениеТаблицыДетали.ВПравойПанели");
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СодержаниеДокумента", "Видимость",
		ДеталиВПравойПанели);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаДеталиРеквизитыДокумента",
		"Видимость", Не ДеталиВПравойПанели);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаДетали", "Видимость",
		Не ДеталиВПравойПанели);
	
	ПанельДеталиРазвернута = Форма.ПанельДеталиРазвернута;
	
	Если ПанельДеталиРазвернута Тогда
		Элементы.СвернутьРазвернутьДетали.Картинка = БиблиотекаКартинок.СтрелкаРазвернутаяГруппа;
	Иначе
		Элементы.СвернутьРазвернутьДетали.Картинка = БиблиотекаКартинок.СтрелкаСвернутаяГруппа;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаДеталиДокумента", 
		"Видимость", ПанельДеталиРазвернута);
	
КонецПроцедуры

&НаКлиенте
Функция ВидимыДанныеДетали()
	
	Результат = Ложь;
	
	Если ТипЗнч(Элементы.Список.ТекущаяСтрока) = Тип("СтрокаГруппировкиДинамическогоСписка") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Элементы.Список.ТекущаяСтрока = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ДеталиВПравойПанели = ПоложениеТаблицыДетали = ПредопределенноеЗначение(
		"Перечисление.ПоложениеТаблицыДетали.ВПравойПанели");
	ТекущаяСтраницаДетали = Элементы.ПраваяПанельСтраницы.ТекущаяСтраница = Элементы.Детали;
	ПраваяПанельСвернута = Элементы.ПраваяПанельСвернутая.Видимость;

	Если ДеталиВПравойПанели И Не ПраваяПанельСвернута И ТекущаяСтраницаДетали
		ИЛИ Не ДеталиВПравойПанели И ПанельДеталиРазвернута
		ИЛИ Не ДеталиВПравойПанели И Не ПанельДеталиРазвернута И ТекущаяСтраницаДетали Тогда
			Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьПанельДетали()
	
	ТекущийДокумент = Элементы.Список.ТекущаяСтрока;
	Если ТекущийДокумент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДеталиПодСписком = Элементы.ГруппаДетали.Видимость И ПанельДеталиРазвернута;
	ДеталиВПравойПанели = Не Элементы.ПраваяПанельСвернутая.Видимость
		И Элементы.ПраваяПанельСтраницы.ТекущаяСтраница = Элементы.Детали;
	
	Если Не (ДеталиПодСписком Или ДеталиВПравойПанели) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 100
	|	УстановкаЦенНоменклатурыЗапасы.НомерСтроки КАК НомерСтроки,
	|	УстановкаЦенНоменклатурыЗапасы.Номенклатура КАК Номенклатура,
	|	УстановкаЦенНоменклатурыЗапасы.Характеристика КАК Характеристика,
	|	УстановкаЦенНоменклатурыЗапасы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	УстановкаЦенНоменклатурыЗапасы.ВидЦены КАК ВидЦены,
	|	УстановкаЦенНоменклатурыЗапасы.Цена КАК Цена
	|ИЗ
	|	Документ.УстановкаЦенНоменклатуры.Запасы КАК УстановкаЦенНоменклатурыЗапасы
	|ГДЕ
	|	УстановкаЦенНоменклатурыЗапасы.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(*) КАК КоличествоСтрок
	|ИЗ
	|	Документ.УстановкаЦенНоменклатуры.Запасы КАК УстановкаЦенНоменклатурыЗапасы
	|ГДЕ
	|	УстановкаЦенНоменклатурыЗапасы.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ТекущийДокумент);
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	ТаблицаЗапасы = МассивРезультатов[0].Выгрузить();
	НомерСтроки = 1;
	СодержаниеДокумента.Очистить();
	Для каждого СтрокаТаблицы Из ТаблицаЗапасы Цикл
		НоваяСтрокаСодержание = СодержаниеДокумента.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаСодержание, СтрокаТаблицы);
		НоваяСтрокаСодержание.НомерСтроки = НомерСтроки;
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла;
	
	ДанныеОКоличестве = МассивРезультатов[1].Выбрать();
	КоличествоСтрокВДокументе = 0;
	Если ДанныеОКоличестве.Следующий() Тогда
		КоличествоСтрокВДокументе = ДанныеОКоличестве.КоличествоСтрок;
	КонецЕсли;
	
	ВидимостьОткрытьДокумент = КоличествоСтрокВДокументе > 100;
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "НадписьОткрытьДокумент",
		"Видимость", ВидимостьОткрытьДокумент);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "НадписьПодСпискомОткрытьДокумент",
		"Видимость", ВидимостьОткрытьДокумент);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецОбласти
