// Регистрация УправлениеНебольшойФирмой 3.0.14: ОбменСУРМК от 16.06.2026 12:14:21
#Область СлужебныйПрограммныйИнтерфейс

// Возвращает представление регистрации.
// Возвращаемое значение:
//  Строка.
Функция ИнформацияОПравилах() Экспорт

	Параметры = ПараметрыРегистрации();
	ШаблонТекста = НСтр("ru = 'Правила регистрации объектов этой информационной базы (%1 версия %2) от %3'");
	
	Возврат СтроковыеФункции.ФорматированнаяСтрока(ШаблонТекста, 
		Параметры.СинонимКонфигурации, Параметры.ВерсияКонфигурации, Параметры.ДатаВремяСоздания);	
	
КонецФункции

// Возвращает ключевые параметры регистрации в виде структуры.
// Возвращаемое значение:
//  Структура.
Функция ПараметрыРегистрации() Экспорт
	Результат = Новый Структура();
	Наименование = НСтр("ru = 'УправлениеНебольшойФирмой 3.0.14: ОбменСУРМК'");
	Результат.Вставить("Наименование", Наименование);
	Результат.Вставить("ДатаВремяСоздания", Дата(2026,6,16,12,14,0));
	Результат.Вставить("ПланаОбмена", "ОбменСУРМК");
	Результат.Вставить("Конфигурация", Метаданные.Имя);
	СинонимКонфигурации = Метаданные.Синоним;
	ТекстСинонимКонфигурации = НСтр("ru = '%1'");
	ТекстСинонимКонфигурации = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСинонимКонфигурации, СинонимКонфигурации);
	Результат.Вставить("СинонимКонфигурации", ТекстСинонимКонфигурации);
	Результат.Вставить("ВерсияКонфигурации", Метаданные.Версия);

	Возврат Результат;
КонецФункции

// Заполняет таблицу правил регистрации объектов.
//
// Параметры:
//  ПравилаРегистрацииОбъектов - ТаблицаЗначений - таблица значений, в которую добавляются правила
//  ИмяМенеджераРегистрации - Строка - Имя модуля менеджера правил регистрации объектов 
Процедура ИнициализацияПравилРегистрации(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации) Экспорт
	Если ПравилаРегистрацииОбъектов.Колонки.Найти("Идентификатор") = Неопределено Тогда
		ПравилаРегистрацииОбъектов.Колонки.Добавить("Идентификатор");
	КонецЕсли;
	ДобавитьПРО_Справочник_Организации(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Справочник_БанковскиеСчета(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Справочник_КассыККМ(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Справочник_СтруктурныеЕдиницы(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Справочник_ВидыЦен(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Справочник_СпособыОплаты(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Справочник_СпособыОплаты2(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Справочник_Контрагенты(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Справочник_КлассификаторЕдиницИзмерения(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Справочник_Номенклатура(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Справочник_ХарактеристикиНоменклатуры(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Справочник_КатегорииНоменклатуры(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Справочник_Номенклатура2(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Справочник_Номенклатура3(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Справочник_ДисконтныеКарты(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Справочник_ФизическиеЛица(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Справочник_ПричиныВозврата(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Справочник_СерииНоменклатуры(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Справочник_ПалитраТоваровРМК(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Справочник_Номенклатура4(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Справочник_Номенклатура5(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Справочник_Пользователи(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Справочник_Сотрудники(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Документ_УстановкаЦенНоменклатуры(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Документ_ЗаказПокупателя(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Документ_ПриходнаяНакладная(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_РегистрСведений_ЦеныНоменклатуры(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_РегистрСведений_ШтрихкодыНоменклатуры(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_РегистрСведений_ОстаткиТоваров(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_РегистрСведений_СистемыНалогообложенияОрганизаций(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_РегистрСведений_НастройкиУчетаНДС(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
	ДобавитьПРО_Справочник_Контрагенты2(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации);
КонецПроцедуры

// Обработчик события ПередОбработкой правила регистрации 
// Параметры:
//  ПРО - СтрокаТаблицыЗначений - Правило регистрации объекта
//  Отказ - Булево - Отказ от выполнения правила регистрации.
//  Объект - КонстантаМенеджерЗначения
//         - СправочникОбъект
//         - ДокументОбъект
//         - ПланВидовХарактеристикОбъект
//         - ПланСчетовОбъект
//         - ПланВидовРасчетаОбъект
//         - БизнесПроцессОбъект
//         - ЗадачаОбъект
//         - РегистрСведенийНаборЗаписей
//         - РегистрНакопленияНаборЗаписей
//         - РегистрБухгалтерииНаборЗаписей
//         - РегистрРасчетаНаборЗаписей - объект для которого выполняется правило регистрации.
//  ОбъектМетаданных - ОбъектМетаданных - Объект метаданных, соответствующий объекту.
//  Выгрузка - Булево - контекст выполнения правила регистрации, если Истина то происходит выгрузка объекта.
Процедура ПередОбработкой(ПРО, Отказ, Объект, ОбъектМетаданных, Выгрузка) Экспорт
	Если ПРО.Идентификатор = "Справочник_Номенклатура4" Тогда 
		ПРО_Справочник_Номенклатура4_ПередОбработкой(ПРО, Отказ, Объект, ОбъектМетаданных, Выгрузка);
	ИначеЕсли ПРО.Идентификатор = "Документ_ЗаказПокупателя" Тогда 
		ПРО_Документ_ЗаказПокупателя_ПередОбработкой(ПРО, Отказ, Объект, ОбъектМетаданных, Выгрузка);
	КонецЕсли;
КонецПроцедуры

// Обработчик события ПриОбработке правила регистрации
// Параметры:
//  Отказ - Булево - Отказ от выполнения правила регистрации.
//  ПРО - СтрокаТаблицыЗначений - Правило регистрации объекта
//  Объект - КонстантаМенеджерЗначения
//         - СправочникОбъект
//         - ДокументОбъект
//         - ПланВидовХарактеристикОбъект
//         - ПланСчетовОбъект
//         - ПланВидовРасчетаОбъект
//         - БизнесПроцессОбъект
//         - ЗадачаОбъект
//         - РегистрСведенийНаборЗаписей
//         - РегистрНакопленияНаборЗаписей
//         - РегистрБухгалтерииНаборЗаписей
//         - РегистрРасчетаНаборЗаписей - объект для которого выполняется правило регистрации.
//  ТекстЗапроса - Строка - текст запроса для определения узлов получателей.
//  ПараметрыЗапроса - Структура - параметры запроса для определения узлов получателей.
//  ИспользоватьКэш - Булево - использование платформенного механизма повторно используемых значений.
//  Выгрузка - Булево - контекст выполнения правила регистрации, если Истина то происходит выгрузка объекта. 
//  ДополнительныеСвойства - Структура.
Процедура ПриОбработке(Отказ, ПРО, Объект, ТекстЗапроса, ПараметрыЗапроса, ИспользоватьКэш, Выгрузка, ДополнительныеСвойства) Экспорт
	Если ПРО.Идентификатор = "Справочник_ПалитраТоваровРМК" Тогда 
		ПРО_Справочник_ПалитраТоваровРМК_ПриОбработке(Отказ, ПРО, Объект, ТекстЗапроса, ПараметрыЗапроса, ИспользоватьКэш, Выгрузка, ДополнительныеСвойства);
	ИначеЕсли ПРО.Идентификатор = "Справочник_Номенклатура4" Тогда 
		ПРО_Справочник_Номенклатура4_ПриОбработке(Отказ, ПРО, Объект, ТекстЗапроса, ПараметрыЗапроса, ИспользоватьКэш, Выгрузка, ДополнительныеСвойства);
	ИначеЕсли ПРО.Идентификатор = "Документ_УстановкаЦенНоменклатуры" Тогда 
		ПРО_Документ_УстановкаЦенНоменклатуры_ПриОбработке(Отказ, ПРО, Объект, ТекстЗапроса, ПараметрыЗапроса, ИспользоватьКэш, Выгрузка, ДополнительныеСвойства);
	ИначеЕсли ПРО.Идентификатор = "РегистрСведений_ОстаткиТоваров" Тогда 
		ПРО_РегистрСведений_ОстаткиТоваров_ПриОбработке(Отказ, ПРО, Объект, ТекстЗапроса, ПараметрыЗапроса, ИспользоватьКэш, Выгрузка, ДополнительныеСвойства);
	КонецЕсли;
КонецПроцедуры

// Обработчик события ПриОбработкеДополнительный правила регистрации 
// Параметры:
//  Отказ - Булево - Отказ от выполнения правила регистрации.
//  ПРО - СтрокаТаблицыЗначений - Правило регистрации объекта
//  Объект - КонстантаМенеджерЗначения
//         - СправочникОбъект
//         - ДокументОбъект
//         - ПланВидовХарактеристикОбъект
//         - ПланСчетовОбъект
//         - ПланВидовРасчетаОбъект
//         - БизнесПроцессОбъект
//         - ЗадачаОбъект
//         - РегистрСведенийНаборЗаписей
//         - РегистрНакопленияНаборЗаписей
//         - РегистрБухгалтерииНаборЗаписей
//         - РегистрРасчетаНаборЗаписей - объект для которого выполняется правило регистрации.
//  ТекстЗапроса - Строка - текст запроса для определения узлов получателей.
//  ПараметрыЗапроса - Структура - параметры запроса для определения узлов получателей.
//  ИспользоватьКэш - Булево - использование платформенного механизма повторно используемых значений.
//  ДополнительныеСвойства - Структура.
Процедура ПриОбработкеДополнительный(Отказ, ПРО, Объект, ТекстЗапроса, ПараметрыЗапроса, ИспользоватьКэш, ДополнительныеСвойства) Экспорт
	Если ПРО.Идентификатор = "Справочник_ПалитраТоваровРМК" Тогда 
		ПРО_Справочник_ПалитраТоваровРМК_ПриОбработкеДополнительный(Отказ, ПРО, Объект, ТекстЗапроса, ПараметрыЗапроса, ИспользоватьКэш, ДополнительныеСвойства);
	ИначеЕсли ПРО.Идентификатор = "Справочник_Номенклатура4" Тогда 
		ПРО_Справочник_Номенклатура4_ПриОбработкеДополнительный(Отказ, ПРО, Объект, ТекстЗапроса, ПараметрыЗапроса, ИспользоватьКэш, ДополнительныеСвойства);
	ИначеЕсли ПРО.Идентификатор = "Документ_УстановкаЦенНоменклатуры" Тогда 
		ПРО_Документ_УстановкаЦенНоменклатуры_ПриОбработкеДополнительный(Отказ, ПРО, Объект, ТекстЗапроса, ПараметрыЗапроса, ИспользоватьКэш, ДополнительныеСвойства);
	ИначеЕсли ПРО.Идентификатор = "РегистрСведений_ОстаткиТоваров" Тогда 
		ПРО_РегистрСведений_ОстаткиТоваров_ПриОбработкеДополнительный(Отказ, ПРО, Объект, ТекстЗапроса, ПараметрыЗапроса, ИспользоватьКэш, ДополнительныеСвойства);
	КонецЕсли;
КонецПроцедуры

// Обработчик события ПослеОбработки правила регистрации 
// Параметры:    
//  ПРО - СтрокаТаблицыЗначений - Правило регистрации объекта
//  Отказ - Булево - Отказ от выполнения правила регистрации.
//  Объект - КонстантаМенеджерЗначения
//         - СправочникОбъект
//         - ДокументОбъект
//         - ПланВидовХарактеристикОбъект
//         - ПланСчетовОбъект
//         - ПланВидовРасчетаОбъект
//         - БизнесПроцессОбъект
//         - ЗадачаОбъект
//         - РегистрСведенийНаборЗаписей
//         - РегистрНакопленияНаборЗаписей
//         - РегистрБухгалтерииНаборЗаписей
//         - РегистрРасчетаНаборЗаписей - объект для которого выполняется правило регистрации.
//  ОбъектМетаданных - ОбъектМетаданных - Объект метаданных, соответствующий объекту.
//  Получатели - Массив - список узлов-получателей, на которых будет зарегистрирован объект.
//  Выгрузка - Булево - контекст выполнения правила регистрации, если Истина то происходит выгрузка объекта.
Процедура ПослеОбработки(ПРО, Отказ, Объект, ОбъектМетаданных, Получатели, Выгрузка) Экспорт
	Если ПРО.Идентификатор = "Справочник_ПалитраТоваровРМК" Тогда 
		ПРО_Справочник_ПалитраТоваровРМК_ПослеОбработки(ПРО, Отказ, Объект, ОбъектМетаданных, Получатели, Выгрузка);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
#Область СлужебныеПроцедурыИФункции
Процедура ВыполнитьПравилаРегистрацииДляОбъекта(Объект, ИмяПланаОбмена, Отправитель)
	ОбменДаннымиСобытия.ВыполнитьПравилаРегистрацииДляОбъекта(Объект, ИмяПланаОбмена, Отправитель);
КонецПроцедуры

Процедура УстановитьОтборы(ПравилоРегистрации, ОтборПоСвойствамПланаОбмена, ОтборПоСвойствамОбъекта)
	Обработка = Обработки.ЗагрузкаПравилРегистрацииОбъектов.Создать();
	
	ПравилаXML = Новый ЧтениеXML;
	
	//ОтборПоСвойствамПланаОбмена
	ПравилоРегистрации.ОтборПоСвойствамПланаОбмена = ОбменДаннымиСервер.ИнициализацияТаблицыОтборПоСвойствамПланаОбмена().Скопировать();
	
	ПравилаXML.УстановитьСтроку(ОтборПоСвойствамПланаОбмена);
	ПравилаXML.Прочитать();
	Обработка.ЗагрузитьДеревоОтбораПоСвойствамПланаОбмена(ПравилаXML, ПравилоРегистрации.ОтборПоСвойствамПланаОбмена);
	
	Обработка.Регистрация = Новый Структура("ИмяПланаОбмена", ПравилоРегистрации.ИмяПланаОбмена);
	Обработка.ПодготовитьПравилоРегистрацииПоСвойствамПланаОбмена(ПравилоРегистрации);
	
	//ОтборПоСвойствамОбъекта
	ПравилаXML.УстановитьСтроку(ОтборПоСвойствамОбъекта);
	ПравилаXML.Прочитать();
	
	ПравилоРегистрации.ОтборПоСвойствамОбъекта = ОбменДаннымиСервер.ИнициализацияТаблицыОтборПоСвойствамОбъекта().Скопировать();
	Обработка.ЗагрузитьДеревоОтбораПоСвойствамОбъекта(ПравилаXML, ПравилоРегистрации.ОтборПоСвойствамОбъекта);
КонецПроцедуры 

#Область Справочник_Организации
Процедура ДобавитьПРО_Справочник_Организации(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Справочник_Организации";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Справочник.Организации";
	НовоеПравило.ИмяПланаОбмена = "ОбменСУРМК";
	НовоеПравило.ИмяРеквизитаФлага = "";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Ложь;
		
	УстановитьОтборы(НовоеПравило, 
		Справочник_Организации_ОтборПоСвойствамПланаОбмена(),
		ПустойОтборПоСвойствамОбъекта());
КонецПроцедуры

Функция Справочник_Организации_ОтборПоСвойствамПланаОбмена()
	Возврат "<ОтборПоСвойствамПланаОбмена>
			|	<ЭлементОтбора>
			|		<ЭтоСтрокаКонстанты>false</ЭтоСтрокаКонстанты>
			|		<ТипСвойстваОбъекта>СправочникСсылка.Организации</ТипСвойстваОбъекта>
			|		<СвойствоПланаОбмена>[Организации].Организация</СвойствоПланаОбмена>
			|		<ВидСравнения>Равно</ВидСравнения>
			|		<СвойствоОбъекта>Ссылка</СвойствоОбъекта>
			|		<ТаблицаСвойствОбъекта>
			|			<Свойство>
			|				<Наименование>Ссылка</Наименование>
			|				<Тип>СправочникСсылка.Организации</Тип>
			|				<Вид>Свойство</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствОбъекта>
			|		<ТаблицаСвойствПланаОбмена>
			|			<Свойство>
			|				<Наименование>[Организации]</Наименование>
			|				<Вид>ТабличнаяЧасть</Вид>
			|			</Свойство>
			|			<Свойство>
			|				<Наименование>Организация</Наименование>
			|				<Тип>СправочникСсылка.Организации</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствПланаОбмена>
			|	</ЭлементОтбора>
			|	<ЭлементОтбора>
			|		<ЭтоСтрокаКонстанты>true</ЭтоСтрокаКонстанты>
			|		<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|		<СвойствоПланаОбмена>ИспользоватьОтборПоОрганизациям</СвойствоПланаОбмена>
			|		<ВидСравнения>Равно</ВидСравнения>
			|		<СвойствоОбъекта>true</СвойствоОбъекта>
			|		<ТаблицаСвойствПланаОбмена>
			|			<Свойство>
			|				<Наименование>ИспользоватьОтборПоОрганизациям</Наименование>
			|				<Тип>Булево</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствПланаОбмена>
			|	</ЭлементОтбора>
			|</ОтборПоСвойствамПланаОбмена>";
КонецФункции

#КонецОбласти
#Область Справочник_БанковскиеСчета
Процедура ДобавитьПРО_Справочник_БанковскиеСчета(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Справочник_БанковскиеСчета";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Справочник.БанковскиеСчета";
	НовоеПравило.ИмяПланаОбмена = "ОбменСУРМК";
	НовоеПравило.ИмяРеквизитаФлага = "";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Ложь;
		
	УстановитьОтборы(НовоеПравило, 
		Справочник_БанковскиеСчета_ОтборПоСвойствамПланаОбмена(),
		ПустойОтборПоСвойствамОбъекта());
КонецПроцедуры

Функция Справочник_БанковскиеСчета_ОтборПоСвойствамПланаОбмена()
	Возврат "<ОтборПоСвойствамПланаОбмена>
			|	<ЭлементОтбора>
			|		<ЭтоСтрокаКонстанты>false</ЭтоСтрокаКонстанты>
			|		<ТипСвойстваОбъекта>СправочникСсылка.БанковскиеСчета</ТипСвойстваОбъекта>
			|		<СвойствоПланаОбмена>[Организации].Организация</СвойствоПланаОбмена>
			|		<ВидСравнения>Равно</ВидСравнения>
			|		<СвойствоОбъекта>Владелец</СвойствоОбъекта>
			|		<ТаблицаСвойствОбъекта>
			|			<Свойство>
			|				<Наименование>Владелец</Наименование>
			|				<Тип>СправочникСсылка.Контрагенты</Тип>
			|				<Вид>Свойство</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствОбъекта>
			|		<ТаблицаСвойствПланаОбмена>
			|			<Свойство>
			|				<Наименование>[Организации]</Наименование>
			|				<Вид>ТабличнаяЧасть</Вид>
			|			</Свойство>
			|			<Свойство>
			|				<Наименование>Организация</Наименование>
			|				<Тип>СправочникСсылка.Организации</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствПланаОбмена>
			|	</ЭлементОтбора>
			|	<ЭлементОтбора>
			|		<ЭтоСтрокаКонстанты>true</ЭтоСтрокаКонстанты>
			|		<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|		<СвойствоПланаОбмена>ИспользоватьОтборПоОрганизациям</СвойствоПланаОбмена>
			|		<ВидСравнения>Равно</ВидСравнения>
			|		<СвойствоОбъекта>true</СвойствоОбъекта>
			|		<ТаблицаСвойствПланаОбмена>
			|			<Свойство>
			|				<Наименование>ИспользоватьОтборПоОрганизациям</Наименование>
			|				<Тип>Булево</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствПланаОбмена>
			|	</ЭлементОтбора>
			|</ОтборПоСвойствамПланаОбмена>";
КонецФункции

#КонецОбласти
#Область Справочник_КассыККМ
Процедура ДобавитьПРО_Справочник_КассыККМ(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Справочник_КассыККМ";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Справочник.КассыККМ";
	НовоеПравило.ИмяПланаОбмена = "ОбменСУРМК";
	НовоеПравило.ИмяРеквизитаФлага = "";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Ложь;
		
	УстановитьОтборы(НовоеПравило, 
		Справочник_КассыККМ_ОтборПоСвойствамПланаОбмена(),
		ПустойОтборПоСвойствамОбъекта());
КонецПроцедуры

Функция Справочник_КассыККМ_ОтборПоСвойствамПланаОбмена()
	Возврат "<ОтборПоСвойствамПланаОбмена>
			|	<ЭлементОтбора>
			|		<ЭтоСтрокаКонстанты>false</ЭтоСтрокаКонстанты>
			|		<ТипСвойстваОбъекта>СправочникСсылка.КассыККМ</ТипСвойстваОбъекта>
			|		<СвойствоПланаОбмена>[КассыККМ].КассаККМ</СвойствоПланаОбмена>
			|		<ВидСравнения>Равно</ВидСравнения>
			|		<СвойствоОбъекта>Ссылка</СвойствоОбъекта>
			|		<ТаблицаСвойствОбъекта>
			|			<Свойство>
			|				<Наименование>Ссылка</Наименование>
			|				<Тип>СправочникСсылка.КассыККМ</Тип>
			|				<Вид>Свойство</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствОбъекта>
			|		<ТаблицаСвойствПланаОбмена>
			|			<Свойство>
			|				<Наименование>[КассыККМ]</Наименование>
			|				<Вид>ТабличнаяЧасть</Вид>
			|			</Свойство>
			|			<Свойство>
			|				<Наименование>КассаККМ</Наименование>
			|				<Тип>СправочникСсылка.КассыККМ</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствПланаОбмена>
			|	</ЭлементОтбора>
			|</ОтборПоСвойствамПланаОбмена>";
КонецФункции

#КонецОбласти
#Область Справочник_СтруктурныеЕдиницы
Процедура ДобавитьПРО_Справочник_СтруктурныеЕдиницы(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Справочник_СтруктурныеЕдиницы";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Справочник.СтруктурныеЕдиницы";
	НовоеПравило.ИмяПланаОбмена = "ОбменСУРМК";
	НовоеПравило.ИмяРеквизитаФлага = "";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Ложь;
		
	УстановитьОтборы(НовоеПравило, 
		Справочник_СтруктурныеЕдиницы_ОтборПоСвойствамПланаОбмена(),
		ПустойОтборПоСвойствамОбъекта());
КонецПроцедуры

Функция Справочник_СтруктурныеЕдиницы_ОтборПоСвойствамПланаОбмена()
	Возврат "<ОтборПоСвойствамПланаОбмена>
			|	<ЭлементОтбора>
			|		<ЭтоСтрокаКонстанты>false</ЭтоСтрокаКонстанты>
			|		<ТипСвойстваОбъекта>СправочникСсылка.СтруктурныеЕдиницы</ТипСвойстваОбъекта>
			|		<СвойствоПланаОбмена>ТорговыйОбъект</СвойствоПланаОбмена>
			|		<ВидСравнения>Равно</ВидСравнения>
			|		<СвойствоОбъекта>Ссылка</СвойствоОбъекта>
			|		<ТаблицаСвойствОбъекта>
			|			<Свойство>
			|				<Наименование>Ссылка</Наименование>
			|				<Тип>СправочникСсылка.СтруктурныеЕдиницы</Тип>
			|				<Вид>Свойство</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствОбъекта>
			|		<ТаблицаСвойствПланаОбмена>
			|			<Свойство>
			|				<Наименование>ТорговыйОбъект</Наименование>
			|				<Тип>СправочникСсылка.СтруктурныеЕдиницы</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствПланаОбмена>
			|	</ЭлементОтбора>
			|</ОтборПоСвойствамПланаОбмена>";
КонецФункции

#КонецОбласти
#Область Справочник_ВидыЦен
Процедура ДобавитьПРО_Справочник_ВидыЦен(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Справочник_ВидыЦен";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Справочник.ВидыЦен";
	НовоеПравило.ИмяПланаОбмена = "ОбменСУРМК";
	НовоеПравило.ИмяРеквизитаФлага = "";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Ложь;
		
	УстановитьОтборы(НовоеПравило, 
		Справочник_ВидыЦен_ОтборПоСвойствамПланаОбмена(),
		ПустойОтборПоСвойствамОбъекта());
КонецПроцедуры

Функция Справочник_ВидыЦен_ОтборПоСвойствамПланаОбмена()
	Возврат "<ОтборПоСвойствамПланаОбмена>
			|	<ЭлементОтбора>
			|		<ЭтоСтрокаКонстанты>false</ЭтоСтрокаКонстанты>
			|		<ТипСвойстваОбъекта>СправочникСсылка.ВидыЦен</ТипСвойстваОбъекта>
			|		<СвойствоПланаОбмена>ВидЦен</СвойствоПланаОбмена>
			|		<ВидСравнения>Равно</ВидСравнения>
			|		<СвойствоОбъекта>Ссылка</СвойствоОбъекта>
			|		<ТаблицаСвойствОбъекта>
			|			<Свойство>
			|				<Наименование>Ссылка</Наименование>
			|				<Тип>СправочникСсылка.ВидыЦен</Тип>
			|				<Вид>Свойство</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствОбъекта>
			|		<ТаблицаСвойствПланаОбмена>
			|			<Свойство>
			|				<Наименование>ВидЦен</Наименование>
			|				<Тип>СправочникСсылка.ВидыЦен</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствПланаОбмена>
			|	</ЭлементОтбора>
			|</ОтборПоСвойствамПланаОбмена>";
КонецФункции

#КонецОбласти
#Область Справочник_СпособыОплаты
Процедура ДобавитьПРО_Справочник_СпособыОплаты(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Справочник_СпособыОплаты";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Справочник.СпособыОплаты";
	НовоеПравило.ИмяПланаОбмена = "ОбменСУРМК";
	НовоеПравило.ИмяРеквизитаФлага = "";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Ложь;
		
	УстановитьОтборы(НовоеПравило, 
		Справочник_СпособыОплаты_ОтборПоСвойствамПланаОбмена(),
		Справочник_СпособыОплаты_ОтборПоСвойствамОбъекта());
КонецПроцедуры

Функция Справочник_СпособыОплаты_ОтборПоСвойствамПланаОбмена()
	Возврат "<ОтборПоСвойствамПланаОбмена>
			|	<Группа>
			|		<БулевоЗначениеГруппы>И</БулевоЗначениеГруппы>
			|		<ЭлементОтбора>
			|			<ЭтоСтрокаКонстанты>false</ЭтоСтрокаКонстанты>
			|			<ТипСвойстваОбъекта>СправочникСсылка.Организации</ТипСвойстваОбъекта>
			|			<СвойствоПланаОбмена>[Организации].Организация</СвойствоПланаОбмена>
			|			<ВидСравнения>Равно</ВидСравнения>
			|			<СвойствоОбъекта>Организация</СвойствоОбъекта>
			|			<ТаблицаСвойствОбъекта>
			|				<Свойство>
			|					<Наименование>Организация</Наименование>
			|					<Тип>СправочникСсылка.Организации</Тип>
			|					<Вид>Реквизит</Вид>
			|				</Свойство>
			|			</ТаблицаСвойствОбъекта>
			|			<ТаблицаСвойствПланаОбмена>
			|				<Свойство>
			|					<Наименование>[Организации]</Наименование>
			|					<Вид>ТабличнаяЧасть</Вид>
			|				</Свойство>
			|				<Свойство>
			|					<Наименование>Организация</Наименование>
			|					<Тип>СправочникСсылка.Организации</Тип>
			|					<Вид>Реквизит</Вид>
			|				</Свойство>
			|			</ТаблицаСвойствПланаОбмена>
			|		</ЭлементОтбора>
			|		<ЭлементОтбора>
			|			<ЭтоСтрокаКонстанты>false</ЭтоСтрокаКонстанты>
			|			<ТипСвойстваОбъекта>СправочникСсылка.КассыККМ</ТипСвойстваОбъекта>
			|			<СвойствоПланаОбмена>[КассыККМ].КассаККМ</СвойствоПланаОбмена>
			|			<ВидСравнения>Равно</ВидСравнения>
			|			<СвойствоОбъекта>Касса</СвойствоОбъекта>
			|			<ТаблицаСвойствОбъекта>
			|				<Свойство>
			|					<Наименование>Касса</Наименование>
			|					<Тип>СправочникСсылка.КассыККМ</Тип>
			|					<Вид>Реквизит</Вид>
			|				</Свойство>
			|			</ТаблицаСвойствОбъекта>
			|			<ТаблицаСвойствПланаОбмена>
			|				<Свойство>
			|					<Наименование>[КассыККМ]</Наименование>
			|					<Вид>ТабличнаяЧасть</Вид>
			|				</Свойство>
			|				<Свойство>
			|					<Наименование>КассаККМ</Наименование>
			|					<Тип>СправочникСсылка.КассыККМ</Тип>
			|					<Вид>Реквизит</Вид>
			|				</Свойство>
			|			</ТаблицаСвойствПланаОбмена>
			|		</ЭлементОтбора>
			|	</Группа>
			|</ОтборПоСвойствамПланаОбмена>";
КонецФункции

Функция Справочник_СпособыОплаты_ОтборПоСвойствамОбъекта()
	Возврат "<ОтборПоСвойствамОбъекта>
			|	<ЭлементОтбора>
			|		<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|		<ВидСравнения>Равно</ВидСравнения>
			|		<СвойствоОбъекта>ПометкаУдаления</СвойствоОбъекта>
			|		<Вид>ЗначениеКонстанты</Вид>
			|		<ЗначениеКонстанты>false</ЗначениеКонстанты>
			|		<ТаблицаСвойствОбъекта>
			|			<Свойство>
			|				<Наименование>ПометкаУдаления</Наименование>
			|				<Тип>Булево</Тип>
			|				<Вид>Свойство</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствОбъекта>
			|	</ЭлементОтбора>
			|</ОтборПоСвойствамОбъекта>";
КонецФункции

#КонецОбласти
#Область Справочник_СпособыОплаты2
Процедура ДобавитьПРО_Справочник_СпособыОплаты2(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Справочник_СпособыОплаты2";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Справочник.СпособыОплаты";
	НовоеПравило.ИмяПланаОбмена = "ОбменСУРМК";
	НовоеПравило.ИмяРеквизитаФлага = "";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Ложь;
		
	УстановитьОтборы(НовоеПравило, 
		Справочник_СпособыОплаты2_ОтборПоСвойствамПланаОбмена(),
		Справочник_СпособыОплаты2_ОтборПоСвойствамОбъекта());
КонецПроцедуры

Функция Справочник_СпособыОплаты2_ОтборПоСвойствамПланаОбмена()
	Возврат "<ОтборПоСвойствамПланаОбмена>
			|	<ЭлементОтбора>
			|		<ЭтоСтрокаКонстанты>false</ЭтоСтрокаКонстанты>
			|		<ТипСвойстваОбъекта>СправочникСсылка.Организации</ТипСвойстваОбъекта>
			|		<СвойствоПланаОбмена>[Организации].Организация</СвойствоПланаОбмена>
			|		<ВидСравнения>Равно</ВидСравнения>
			|		<СвойствоОбъекта>Организация</СвойствоОбъекта>
			|		<ТаблицаСвойствОбъекта>
			|			<Свойство>
			|				<Наименование>Организация</Наименование>
			|				<Тип>СправочникСсылка.Организации</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствОбъекта>
			|		<ТаблицаСвойствПланаОбмена>
			|			<Свойство>
			|				<Наименование>[Организации]</Наименование>
			|				<Вид>ТабличнаяЧасть</Вид>
			|			</Свойство>
			|			<Свойство>
			|				<Наименование>Организация</Наименование>
			|				<Тип>СправочникСсылка.Организации</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствПланаОбмена>
			|	</ЭлементОтбора>
			|</ОтборПоСвойствамПланаОбмена>";
КонецФункции

Функция Справочник_СпособыОплаты2_ОтборПоСвойствамОбъекта()
	Возврат "<ОтборПоСвойствамОбъекта>
			|	<Группа>
			|		<БулевоЗначениеГруппы>ИЛИ</БулевоЗначениеГруппы>
			|		<ЭлементОтбора>
			|			<ТипСвойстваОбъекта>ПеречислениеСсылка.ТипыСпособовОплат</ТипСвойстваОбъекта>
			|			<ВидСравнения>Равно</ВидСравнения>
			|			<СвойствоОбъекта>Тип</СвойствоОбъекта>
			|			<Вид>АлгоритмЗначения</Вид>
			|			<ЗначениеКонстанты>Значение = Перечисления.ТипыСпособовОплат.СБП;</ЗначениеКонстанты>
			|			<ТаблицаСвойствОбъекта>
			|				<Свойство>
			|					<Наименование>Тип</Наименование>
			|					<Тип>ПеречислениеСсылка.ТипыСпособовОплат</Тип>
			|					<Вид>Реквизит</Вид>
			|				</Свойство>
			|			</ТаблицаСвойствОбъекта>
			|		</ЭлементОтбора>
			|		<ЭлементОтбора>
			|			<ТипСвойстваОбъекта>ПеречислениеСсылка.ТипыСпособовОплат</ТипСвойстваОбъекта>
			|			<ВидСравнения>Равно</ВидСравнения>
			|			<СвойствоОбъекта>Тип</СвойствоОбъекта>
			|			<Вид>АлгоритмЗначения</Вид>
			|			<ЗначениеКонстанты>Значение = Перечисления.ТипыСпособовОплат.ЮKassa;</ЗначениеКонстанты>
			|			<ТаблицаСвойствОбъекта>
			|				<Свойство>
			|					<Наименование>Тип</Наименование>
			|					<Тип>ПеречислениеСсылка.ТипыСпособовОплат</Тип>
			|					<Вид>Реквизит</Вид>
			|				</Свойство>
			|			</ТаблицаСвойствОбъекта>
			|		</ЭлементОтбора>
			|		<ЭлементОтбора>
			|			<ТипСвойстваОбъекта>ПеречислениеСсылка.ТипыСпособовОплат</ТипСвойстваОбъекта>
			|			<ВидСравнения>Равно</ВидСравнения>
			|			<СвойствоОбъекта>Тип</СвойствоОбъекта>
			|			<Вид>АлгоритмЗначения</Вид>
			|			<ЗначениеКонстанты>Значение = Перечисления.ТипыСпособовОплат.ЯндексПэй;</ЗначениеКонстанты>
			|			<ТаблицаСвойствОбъекта>
			|				<Свойство>
			|					<Наименование>Тип</Наименование>
			|					<Тип>ПеречислениеСсылка.ТипыСпособовОплат</Тип>
			|					<Вид>Реквизит</Вид>
			|				</Свойство>
			|			</ТаблицаСвойствОбъекта>
			|		</ЭлементОтбора>
			|	</Группа>
			|	<ЭлементОтбора>
			|		<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|		<ВидСравнения>Равно</ВидСравнения>
			|		<СвойствоОбъекта>ПометкаУдаления</СвойствоОбъекта>
			|		<Вид>ЗначениеКонстанты</Вид>
			|		<ЗначениеКонстанты>false</ЗначениеКонстанты>
			|		<ТаблицаСвойствОбъекта>
			|			<Свойство>
			|				<Наименование>ПометкаУдаления</Наименование>
			|				<Тип>Булево</Тип>
			|				<Вид>Свойство</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствОбъекта>
			|	</ЭлементОтбора>
			|</ОтборПоСвойствамОбъекта>";
КонецФункции

#КонецОбласти
#Область Справочник_Контрагенты
Процедура ДобавитьПРО_Справочник_Контрагенты(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Справочник_Контрагенты";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Справочник.Контрагенты";
	НовоеПравило.ИмяПланаОбмена = "ОбменСУРМК";
	НовоеПравило.ИмяРеквизитаФлага = "РежимВыгрузкиПриНеобходимости";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Ложь;
		
	УстановитьОтборы(НовоеПравило, 
		ПустойОтборПоСвойствамПланаОбмена(),
		ПустойОтборПоСвойствамОбъекта());
КонецПроцедуры

#КонецОбласти
#Область Справочник_КлассификаторЕдиницИзмерения
Процедура ДобавитьПРО_Справочник_КлассификаторЕдиницИзмерения(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Справочник_КлассификаторЕдиницИзмерения";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Справочник.КлассификаторЕдиницИзмерения";
	НовоеПравило.ИмяПланаОбмена = "ОбменСУРМК";
	НовоеПравило.ИмяРеквизитаФлага = "РежимВыгрузкиПриНеобходимости";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Ложь;
		
	УстановитьОтборы(НовоеПравило, 
		ПустойОтборПоСвойствамПланаОбмена(),
		ПустойОтборПоСвойствамОбъекта());
КонецПроцедуры

#КонецОбласти
#Область Справочник_Номенклатура
Процедура ДобавитьПРО_Справочник_Номенклатура(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Справочник_Номенклатура";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Справочник.Номенклатура";
	НовоеПравило.ИмяПланаОбмена = "ОбменСУРМК";
	НовоеПравило.ИмяРеквизитаФлага = "";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Ложь;
		
	УстановитьОтборы(НовоеПравило, 
		ПустойОтборПоСвойствамПланаОбмена(),
		Справочник_Номенклатура_ОтборПоСвойствамОбъекта());
КонецПроцедуры

Функция Справочник_Номенклатура_ОтборПоСвойствамОбъекта()
	Возврат "<ОтборПоСвойствамОбъекта>
			|	<ЭлементОтбора>
			|		<ТипСвойстваОбъекта>ПеречислениеСсылка.ТипыНоменклатуры</ТипСвойстваОбъекта>
			|		<ВидСравнения>Равно</ВидСравнения>
			|		<СвойствоОбъекта>ТипНоменклатуры</СвойствоОбъекта>
			|		<Вид>АлгоритмЗначения</Вид>
			|		<ЗначениеКонстанты>Значение = Перечисления.ТипыНоменклатуры.ПодарочныйСертификат;</ЗначениеКонстанты>
			|		<ТаблицаСвойствОбъекта>
			|			<Свойство>
			|				<Наименование>ТипНоменклатуры</Наименование>
			|				<Тип>ПеречислениеСсылка.ТипыНоменклатуры</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствОбъекта>
			|	</ЭлементОтбора>
			|</ОтборПоСвойствамОбъекта>";
КонецФункции

#КонецОбласти
#Область Справочник_ХарактеристикиНоменклатуры
Процедура ДобавитьПРО_Справочник_ХарактеристикиНоменклатуры(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Справочник_ХарактеристикиНоменклатуры";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Справочник.ХарактеристикиНоменклатуры";
	НовоеПравило.ИмяПланаОбмена = "ОбменСУРМК";
	НовоеПравило.ИмяРеквизитаФлага = "РежимВыгрузкиПриНеобходимости";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Ложь;
		
	УстановитьОтборы(НовоеПравило, 
		ПустойОтборПоСвойствамПланаОбмена(),
		ПустойОтборПоСвойствамОбъекта());
КонецПроцедуры

#КонецОбласти
#Область Справочник_КатегорииНоменклатуры
Процедура ДобавитьПРО_Справочник_КатегорииНоменклатуры(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Справочник_КатегорииНоменклатуры";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Справочник.КатегорииНоменклатуры";
	НовоеПравило.ИмяПланаОбмена = "ОбменСУРМК";
	НовоеПравило.ИмяРеквизитаФлага = "";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Ложь;
		
	УстановитьОтборы(НовоеПравило, 
		ПустойОтборПоСвойствамПланаОбмена(),
		ПустойОтборПоСвойствамОбъекта());
КонецПроцедуры

#КонецОбласти
#Область Справочник_Номенклатура2
Процедура ДобавитьПРО_Справочник_Номенклатура2(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Справочник_Номенклатура2";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Справочник.Номенклатура";
	НовоеПравило.ИмяПланаОбмена = "ОбменСУРМК";
	НовоеПравило.ИмяРеквизитаФлага = "РежимВыгрузкиПриНеобходимости";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Ложь;
		
	УстановитьОтборы(НовоеПравило, 
		Справочник_Номенклатура2_ОтборПоСвойствамПланаОбмена(),
		ОтборПоСвойствамОбъекта_1());
КонецПроцедуры

Функция Справочник_Номенклатура2_ОтборПоСвойствамПланаОбмена()
	Возврат "<ОтборПоСвойствамПланаОбмена>
			|	<ЭлементОтбора>
			|		<ЭтоСтрокаКонстанты>true</ЭтоСтрокаКонстанты>
			|		<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|		<СвойствоПланаОбмена>ВыгружатьТолькоТоварыПалитры</СвойствоПланаОбмена>
			|		<ВидСравнения>Равно</ВидСравнения>
			|		<СвойствоОбъекта>false</СвойствоОбъекта>
			|		<ТаблицаСвойствПланаОбмена>
			|			<Свойство>
			|				<Наименование>ВыгружатьТолькоТоварыПалитры</Наименование>
			|				<Тип>Булево</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствПланаОбмена>
			|	</ЭлементОтбора>
			|</ОтборПоСвойствамПланаОбмена>";
КонецФункции

#КонецОбласти
#Область Справочник_Номенклатура3
Процедура ДобавитьПРО_Справочник_Номенклатура3(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Справочник_Номенклатура3";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Справочник.Номенклатура";
	НовоеПравило.ИмяПланаОбмена = "ОбменСУРМК";
	НовоеПравило.ИмяРеквизитаФлага = "";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Ложь;
		
	УстановитьОтборы(НовоеПравило, 
		ПустойОтборПоСвойствамПланаОбмена(),
		Справочник_Номенклатура3_ОтборПоСвойствамОбъекта());
КонецПроцедуры

Функция Справочник_Номенклатура3_ОтборПоСвойствамОбъекта()
	Возврат "<ОтборПоСвойствамОбъекта>
			|	<Группа>
			|		<БулевоЗначениеГруппы>И</БулевоЗначениеГруппы>
			|		<ЭлементОтбора>
			|			<ТипСвойстваОбъекта>ПеречислениеСсылка.ТипыНоменклатуры</ТипСвойстваОбъекта>
			|			<ВидСравнения>Равно</ВидСравнения>
			|			<СвойствоОбъекта>ТипНоменклатуры</СвойствоОбъекта>
			|			<Вид>АлгоритмЗначения</Вид>
			|			<ЗначениеКонстанты>Значение = Перечисления.ТипыНоменклатуры.Услуга;</ЗначениеКонстанты>
			|			<ТаблицаСвойствОбъекта>
			|				<Свойство>
			|					<Наименование>ТипНоменклатуры</Наименование>
			|					<Тип>ПеречислениеСсылка.ТипыНоменклатуры</Тип>
			|					<Вид>Реквизит</Вид>
			|				</Свойство>
			|			</ТаблицаСвойствОбъекта>
			|		</ЭлементОтбора>
			|		<ЭлементОтбора>
			|			<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|			<ВидСравнения>Равно</ВидСравнения>
			|			<СвойствоОбъекта>ЭтоГруппа</СвойствоОбъекта>
			|			<Вид>ЗначениеКонстанты</Вид>
			|			<ЗначениеКонстанты>false</ЗначениеКонстанты>
			|			<ТаблицаСвойствОбъекта>
			|				<Свойство>
			|					<Наименование>ЭтоГруппа</Наименование>
			|					<Тип>Булево</Тип>
			|					<Вид>Свойство</Вид>
			|				</Свойство>
			|			</ТаблицаСвойствОбъекта>
			|		</ЭлементОтбора>
			|		<ЭлементОтбора>
			|			<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|			<ВидСравнения>Равно</ВидСравнения>
			|			<СвойствоОбъекта>ЭтоАгентскаяУслуга</СвойствоОбъекта>
			|			<Вид>ЗначениеКонстанты</Вид>
			|			<ЗначениеКонстанты>true</ЗначениеКонстанты>
			|			<ТаблицаСвойствОбъекта>
			|				<Свойство>
			|					<Наименование>ЭтоАгентскаяУслуга</Наименование>
			|					<Тип>Булево</Тип>
			|					<Вид>Реквизит</Вид>
			|				</Свойство>
			|			</ТаблицаСвойствОбъекта>
			|		</ЭлементОтбора>
			|	</Группа>
			|</ОтборПоСвойствамОбъекта>";
КонецФункции

#КонецОбласти
#Область Справочник_ДисконтныеКарты
Процедура ДобавитьПРО_Справочник_ДисконтныеКарты(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Справочник_ДисконтныеКарты";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Справочник.ДисконтныеКарты";
	НовоеПравило.ИмяПланаОбмена = "ОбменСУРМК";
	НовоеПравило.ИмяРеквизитаФлага = "";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Ложь;
		
	УстановитьОтборы(НовоеПравило, 
		Справочник_ДисконтныеКарты_ОтборПоСвойствамПланаОбмена(),
		ПустойОтборПоСвойствамОбъекта());
КонецПроцедуры

Функция Справочник_ДисконтныеКарты_ОтборПоСвойствамПланаОбмена()
	Возврат "<ОтборПоСвойствамПланаОбмена>
			|	<ЭлементОтбора>
			|		<ЭтоСтрокаКонстанты>true</ЭтоСтрокаКонстанты>
			|		<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|		<СвойствоПланаОбмена>ХранитьКартыЛояльностиВРМК</СвойствоПланаОбмена>
			|		<ВидСравнения>Равно</ВидСравнения>
			|		<СвойствоОбъекта>true</СвойствоОбъекта>
			|		<ТаблицаСвойствПланаОбмена>
			|			<Свойство>
			|				<Наименование>ХранитьКартыЛояльностиВРМК</Наименование>
			|				<Тип>Булево</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствПланаОбмена>
			|	</ЭлементОтбора>
			|</ОтборПоСвойствамПланаОбмена>";
КонецФункции

#КонецОбласти
#Область Справочник_ФизическиеЛица
Процедура ДобавитьПРО_Справочник_ФизическиеЛица(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Справочник_ФизическиеЛица";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Справочник.ФизическиеЛица";
	НовоеПравило.ИмяПланаОбмена = "ОбменСУРМК";
	НовоеПравило.ИмяРеквизитаФлага = "";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Ложь;
		
	УстановитьОтборы(НовоеПравило, 
		Справочник_ФизическиеЛица_ОтборПоСвойствамПланаОбмена(),
		ПустойОтборПоСвойствамОбъекта());
КонецПроцедуры

Функция Справочник_ФизическиеЛица_ОтборПоСвойствамПланаОбмена()
	Возврат "<ОтборПоСвойствамПланаОбмена>
			|	<Группа>
			|		<БулевоЗначениеГруппы>ИЛИ</БулевоЗначениеГруппы>
			|		<ЭлементОтбора>
			|			<ЭтоСтрокаКонстанты>true</ЭтоСтрокаКонстанты>
			|			<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|			<СвойствоПланаОбмена>ВыгружатьФизическихЛиц</СвойствоПланаОбмена>
			|			<ВидСравнения>Равно</ВидСравнения>
			|			<СвойствоОбъекта>true</СвойствоОбъекта>
			|			<ТаблицаСвойствПланаОбмена>
			|				<Свойство>
			|					<Наименование>ВыгружатьФизическихЛиц</Наименование>
			|					<Тип>Булево</Тип>
			|					<Вид>Реквизит</Вид>
			|				</Свойство>
			|			</ТаблицаСвойствПланаОбмена>
			|		</ЭлементОтбора>
			|		<Группа>
			|			<БулевоЗначениеГруппы>И</БулевоЗначениеГруппы>
			|			<ЭлементОтбора>
			|				<ЭтоСтрокаКонстанты>true</ЭтоСтрокаКонстанты>
			|				<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|				<СвойствоПланаОбмена>ВыгружатьФизическихЛицЧастично</СвойствоПланаОбмена>
			|				<ВидСравнения>Равно</ВидСравнения>
			|				<СвойствоОбъекта>true</СвойствоОбъекта>
			|				<ТаблицаСвойствПланаОбмена>
			|					<Свойство>
			|						<Наименование>ВыгружатьФизическихЛицЧастично</Наименование>
			|						<Тип>Булево</Тип>
			|						<Вид>Реквизит</Вид>
			|					</Свойство>
			|				</ТаблицаСвойствПланаОбмена>
			|			</ЭлементОтбора>
			|			<ЭлементОтбора>
			|				<ЭтоСтрокаКонстанты>false</ЭтоСтрокаКонстанты>
			|				<ТипСвойстваОбъекта>СправочникСсылка.ФизическиеЛица</ТипСвойстваОбъекта>
			|				<СвойствоПланаОбмена>СписокФизическихЛицДляВыгрузки.ФизическоеЛицо</СвойствоПланаОбмена>
			|				<ВидСравнения>Равно</ВидСравнения>
			|				<СвойствоОбъекта>Ссылка</СвойствоОбъекта>
			|				<ТаблицаСвойствОбъекта>
			|					<Свойство>
			|						<Наименование>Ссылка</Наименование>
			|						<Тип>СправочникСсылка.ФизическиеЛица</Тип>
			|						<Вид>Свойство</Вид>
			|					</Свойство>
			|				</ТаблицаСвойствОбъекта>
			|				<ТаблицаСвойствПланаОбмена>
			|					<Свойство>
			|						<Наименование>[СписокФизическихЛицДляВыгрузки]</Наименование>
			|						<Вид>ТабличнаяЧасть</Вид>
			|					</Свойство>
			|					<Свойство>
			|						<Наименование>ФизическоеЛицо</Наименование>
			|						<Тип>СправочникСсылка.ФизическиеЛица</Тип>
			|						<Вид>Реквизит</Вид>
			|					</Свойство>
			|				</ТаблицаСвойствПланаОбмена>
			|			</ЭлементОтбора>
			|		</Группа>
			|	</Группа>
			|</ОтборПоСвойствамПланаОбмена>";
КонецФункции

#КонецОбласти
#Область Справочник_ПричиныВозврата
Процедура ДобавитьПРО_Справочник_ПричиныВозврата(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Справочник_ПричиныВозврата";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Справочник.ПричиныВозврата";
	НовоеПравило.ИмяПланаОбмена = "ОбменСУРМК";
	НовоеПравило.ИмяРеквизитаФлага = "";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Ложь;
		
	УстановитьОтборы(НовоеПравило, 
		ПустойОтборПоСвойствамПланаОбмена(),
		ПустойОтборПоСвойствамОбъекта());
КонецПроцедуры

#КонецОбласти
#Область Справочник_СерииНоменклатуры
Процедура ДобавитьПРО_Справочник_СерииНоменклатуры(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Справочник_СерииНоменклатуры";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Справочник.СерииНоменклатуры";
	НовоеПравило.ИмяПланаОбмена = "ОбменСУРМК";
	НовоеПравило.ИмяРеквизитаФлага = "";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Ложь;
		
	УстановитьОтборы(НовоеПравило, 
		Справочник_СерииНоменклатуры_ОтборПоСвойствамПланаОбмена(),
		ПустойОтборПоСвойствамОбъекта());
КонецПроцедуры

Функция Справочник_СерииНоменклатуры_ОтборПоСвойствамПланаОбмена()
	Возврат "<ОтборПоСвойствамПланаОбмена>
			|	<ЭлементОтбора>
			|		<ЭтоСтрокаКонстанты>true</ЭтоСтрокаКонстанты>
			|		<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|		<СвойствоПланаОбмена>ВыгружатьСерии</СвойствоПланаОбмена>
			|		<ВидСравнения>Равно</ВидСравнения>
			|		<СвойствоОбъекта>true</СвойствоОбъекта>
			|		<ТаблицаСвойствПланаОбмена>
			|			<Свойство>
			|				<Наименование>ВыгружатьСерии</Наименование>
			|				<Тип>Булево</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствПланаОбмена>
			|	</ЭлементОтбора>
			|</ОтборПоСвойствамПланаОбмена>";
КонецФункции

#КонецОбласти
#Область Справочник_ПалитраТоваровРМК
Процедура ДобавитьПРО_Справочник_ПалитраТоваровРМК(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Справочник_ПалитраТоваровРМК";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Справочник.ПалитраТоваровРМК";
	НовоеПравило.ИмяПланаОбмена = "ОбменСУРМК";
	НовоеПравило.ИмяРеквизитаФлага = "";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Истина;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Истина;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Истина;
		
	УстановитьОтборы(НовоеПравило, 
		ПустойОтборПоСвойствамПланаОбмена(),
		ПустойОтборПоСвойствамОбъекта());
КонецПроцедуры

Процедура ПРО_Справочник_ПалитраТоваровРМК_ПриОбработкеДополнительный(Отказ, ПРО, Объект, ТекстЗапроса, ПараметрыЗапроса, ИспользоватьКэш, ДополнительныеСвойства)
	Если Не Объект.ДополнительныеСвойства.Свойство("РегистрацияПалитры") Тогда
	
		ИспользоватьКэш = Ложь;
	
		РезультатПроверки = ОбщегоназначенияРМК.ПолучитьРезультатПроверкиЗацикленностиПалитры(Объект.Ссылка, Неопределено);
		Если РезультатПроверки.ЕстьЗацикливание Тогда
			ПалитраИРодители = Новый Массив;
		Иначе
			ПалитраИРодители = ИнтерфейсРМКСлужебный.ПолучитьИерархиюРодителейПалитры(Объект.Ссылка);
		КонецЕсли;
	
		ПараметрыЗапроса.Вставить("ПалитраИРодители", ПалитраИРодители);
	
		ТекстЗапроса = "ВЫБРАТЬ
		|	ОбменСУРМК.Ссылка КАК Ссылка
		|ИЗ
		|	ПланОбмена.ОбменСУРМК.ПалитрыТоваровДляВыгрузки КАК ОбменСУРМКПалитрыТоваровДляВыгрузки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланОбмена.ОбменСУРМК КАК ОбменСУРМК
		|		ПО ОбменСУРМКПалитрыТоваровДляВыгрузки.Ссылка = ОбменСУРМК.Ссылка
		|ГДЕ
		|	ОбменСУРМКПалитрыТоваровДляВыгрузки.ПалитраТоваровРМК В(&СвойствоОбъекта_ПалитраИРодители)
		|	И НЕ ОбменСУРМК.ЭтотУзел
		|	И НЕ ОбменСУРМК.ПометкаУдаления
		|[УсловиеОтбораПоРеквизитуФлагу]";
		
	КонецЕсли;
КонецПроцедуры

Процедура ПРО_Справочник_ПалитраТоваровРМК_ПриОбработке(Отказ, ПРО, Объект, ТекстЗапроса, ПараметрыЗапроса, ИспользоватьКэш, Выгрузка, ДополнительныеСвойства)
	Если Не Объект.ДополнительныеСвойства.Свойство("РегистрацияПалитры") Тогда
	
		ИспользоватьКэш = Ложь;
	
		РезультатПроверки = ОбщегоназначенияРМК.ПолучитьРезультатПроверкиЗацикленностиПалитры(Объект.Ссылка, Неопределено);
		Если РезультатПроверки.ЕстьЗацикливание Тогда
			ПалитраИРодители = Новый Массив;
		Иначе
			ПалитраИРодители = ИнтерфейсРМКСлужебный.ПолучитьИерархиюРодителейПалитры(Объект.Ссылка);
		КонецЕсли;
	
		ПараметрыЗапроса.Вставить("ПалитраИРодители", ПалитраИРодители);
	
		ТекстЗапроса = "ВЫБРАТЬ
		|	ОбменСУРМК.Ссылка КАК Ссылка
		|ИЗ
		|	ПланОбмена.ОбменСУРМК.ПалитрыТоваровДляВыгрузки КАК ОбменСУРМКПалитрыТоваровДляВыгрузки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланОбмена.ОбменСУРМК КАК ОбменСУРМК
		|		ПО ОбменСУРМКПалитрыТоваровДляВыгрузки.Ссылка = ОбменСУРМК.Ссылка
		|ГДЕ
		|	ОбменСУРМКПалитрыТоваровДляВыгрузки.ПалитраТоваровРМК В(&СвойствоОбъекта_ПалитраИРодители)
		|	И НЕ ОбменСУРМК.ЭтотУзел
		|	И НЕ ОбменСУРМК.ПометкаУдаления
		|[УсловиеОтбораПоРеквизитуФлагу]";
		
	КонецЕсли;
КонецПроцедуры

Процедура ПРО_Справочник_ПалитраТоваровРМК_ПослеОбработки(ПРО, Отказ, Объект, ОбъектМетаданных, Получатели, Выгрузка)
	//Регистрация добавленных в палитру вложенных палитр и Номенклатуры добавленной в составы всех палитр.
	Если Не Выгрузка
		И Получатели.Количество() > 0
		И Не Объект.ДополнительныеСвойства.Свойство("РегистрацияПалитры") Тогда
	
		МассивПалитрыДоИзменения = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Объект.Ссылка);
		ВложенныеПалитры = ИнтерфейсРМКСлужебный.ПолучитьВложенныеПалитры(МассивПалитрыДоИзменения);
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивПалитрыДоИзменения, ВложенныеПалитры, Истина);
	
		МассивПалитрыПослеИзменения = Объект.Состав.ВыгрузитьКолонку("Палитра");
		ВложенныеПалитрыПослеИзменения = ИнтерфейсРМКСлужебный.ПолучитьВложенныеПалитры(МассивПалитрыПослеИзменения);
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивПалитрыПослеИзменения, ВложенныеПалитрыПослеИзменения, Истина);
	
		МассивДобавленныеПалитры = ОбщегоНазначенияКлиентСервер.РазностьМассивов(МассивПалитрыПослеИзменения, МассивПалитрыДоИзменения);
	
		Для каждого ЭлементМассива Из МассивДобавленныеПалитры Цикл
			Если ЗначениеЗаполнено(ЭлементМассива) Тогда
				ПалитраОбъект = ЭлементМассива.ПолучитьОбъект();
	
				ПалитраОбъект.ДополнительныеСвойства.Вставить("РегистрацияПалитры");
				ВыполнитьПравилаРегистрацииДляОбъекта(ПалитраОбъект, ПРО.ИмяПланаОбмена, Неопределено);
			КонецЕсли;
		КонецЦикла;
	
		ТекстЗапроса = "
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ПалитраТоваровРМКСостав.Номенклатура КАК Номенклатура
			|ИЗ
			|	Справочник.ПалитраТоваровРМК.Состав КАК ПалитраТоваровРМКСостав
			|ГДЕ
			|	ПалитраТоваровРМКСостав.Ссылка В(&МассивДобавленныеПалитры)
			|	И ПалитраТоваровРМКСостав.Номенклатура ССЫЛКА Справочник.Номенклатура
			|";
	
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("МассивДобавленныеПалитры", МассивДобавленныеПалитры);
	
		Запрос.Текст = ТекстЗапроса;
	
		СсылкаСостав = Запрос.Выполнить().Выгрузить();
	
		МассивТоварыДобавленныеПалитры = СсылкаСостав.ВыгрузитьКолонку("Номенклатура");
	
		ТекстЗапроса = "
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ПалитраТоваровРМКСостав.Номенклатура КАК Номенклатура
			|ИЗ
			|	Справочник.ПалитраТоваровРМК.Состав КАК ПалитраТоваровРМКСостав
			|ГДЕ
			|	ПалитраТоваровРМКСостав.Ссылка В(&МассивПалитрыДоИзменения)
			|	И ПалитраТоваровРМКСостав.Номенклатура ССЫЛКА Справочник.Номенклатура
			|";
	
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("МассивПалитрыДоИзменения", МассивПалитрыДоИзменения);
	
		Запрос.Текст = ТекстЗапроса;
	
		СсылкаСостав = Запрос.Выполнить().Выгрузить();
	
		МассивТоварыПалитрыДоИзменения = СсылкаСостав.ВыгрузитьКолонку("Номенклатура");
		МассивТоварыПалитрыПослеИзменения = Объект.Состав.ВыгрузитьКолонку("Номенклатура");
	
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивТоварыПалитрыПослеИзменения, МассивТоварыДобавленныеПалитры, Истина);
	
		МассивТоварыПалитры = ОбщегоНазначенияКлиентСервер.РазностьМассивов(МассивТоварыПалитрыПослеИзменения, МассивТоварыПалитрыДоИзменения);
	
		Для каждого ЭлементМассива Из МассивТоварыПалитры Цикл
			Если ЗначениеЗаполнено(ЭлементМассива) Тогда
				ТоварОбъект = ЭлементМассива.ПолучитьОбъект();
	
				ТоварОбъект.ДополнительныеСвойства.Вставить("РегистрацияПалитры");
				ВыполнитьПравилаРегистрацииДляОбъекта(ТоварОбъект, ПРО.ИмяПланаОбмена, Неопределено);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти
#Область Справочник_Номенклатура4
Процедура ДобавитьПРО_Справочник_Номенклатура4(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Справочник_Номенклатура4";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Справочник.Номенклатура";
	НовоеПравило.ИмяПланаОбмена = "ОбменСУРМК";
	НовоеПравило.ИмяРеквизитаФлага = "";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Истина;
	НовоеПравило.ЕстьОбработчикПриОбработке = Истина;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Истина;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Ложь;
		
	УстановитьОтборы(НовоеПравило, 
		Справочник_Номенклатура4_ОтборПоСвойствамПланаОбмена(),
		ОтборПоСвойствамОбъекта_1());
КонецПроцедуры

Функция Справочник_Номенклатура4_ОтборПоСвойствамПланаОбмена()
	Возврат "<ОтборПоСвойствамПланаОбмена>
			|	<ЭлементОтбора>
			|		<ЭтоСтрокаКонстанты>true</ЭтоСтрокаКонстанты>
			|		<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|		<СвойствоПланаОбмена>ВыгружатьТолькоТоварыПалитры</СвойствоПланаОбмена>
			|		<ВидСравнения>Равно</ВидСравнения>
			|		<СвойствоОбъекта>true</СвойствоОбъекта>
			|		<ТаблицаСвойствПланаОбмена>
			|			<Свойство>
			|				<Наименование>ВыгружатьТолькоТоварыПалитры</Наименование>
			|				<Тип>Булево</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствПланаОбмена>
			|	</ЭлементОтбора>
			|</ОтборПоСвойствамПланаОбмена>";
КонецФункции

Процедура ПРО_Справочник_Номенклатура4_ПередОбработкой(ПРО, Отказ, Объект, ОбъектМетаданных, Выгрузка)
	//Вся регистрация Номенклатуры идет при добавлении в Палитры.
	Если НЕ Объект.ЭтоГруппа Тогда
		Отказ = Объект.ЭтоНовый();
	КонецЕсли;
КонецПроцедуры

Процедура ПРО_Справочник_Номенклатура4_ПриОбработкеДополнительный(Отказ, ПРО, Объект, ТекстЗапроса, ПараметрыЗапроса, ИспользоватьКэш, ДополнительныеСвойства)
	Если Не Объект.ЭтоГруппа
			И Не Объект.ПометкаУдаления
			И Не Объект.ДополнительныеСвойства.Свойство("РегистрацияПалитры") Тогда
	
			ИспользоватьКэш = Ложь;
	
			Текст = "
				|ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	ПалитраТоваровРМКСостав.Ссылка КАК Ссылка
				|ИЗ
				|	Справочник.ПалитраТоваровРМК.Состав КАК ПалитраТоваровРМКСостав
				|ГДЕ
				|	ПалитраТоваровРМКСостав.Номенклатура = &Номенклатура
				|";
	
			Запрос = Новый Запрос(Текст);
			Запрос.УстановитьПараметр("Номенклатура", Объект.Ссылка);
	
			Выборка = Запрос.Выполнить().Выбрать();
	
			МассивПалитрыВладельцы = Новый Массив;
			
			Пока Выборка.Следующий() Цикл
				Родители = ИнтерфейсРМКСлужебный.ПолучитьИерархиюРодителейПалитры(Выборка.Ссылка);
				Если Родители.Количество() > 0 Тогда
					Для Каждого ЭлементМассива Из Родители Цикл
						Если МассивПалитрыВладельцы.Найти(ЭлементМассива) = Неопределено Тогда
							МассивПалитрыВладельцы.Добавить(ЭлементМассива);
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
			КонецЦикла;
	
			ПараметрыЗапроса.Вставить("МассивПалитрыВладельцы", МассивПалитрыВладельцы);
	
			ТекстЗапроса = "
				|ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	ПланОбменаОсновнаяТаблица.Ссылка КАК Ссылка
				|ИЗ
				|	ПланОбмена.ОбменСУРМК КАК ПланОбменаОсновнаяТаблица
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланОбмена.ОбменСУРМК.ПалитрыТоваровДляВыгрузки КАК ПалитрыУзла
				|		ПО (ПалитрыУзла.Ссылка = ПланОбменаОсновнаяТаблица.Ссылка)
				|ГДЕ
				|	ПалитрыУзла.ПалитраТоваровРМК В(&СвойствоОбъекта_МассивПалитрыВладельцы)
				|	И ПланОбменаОсновнаяТаблица.ВыгружатьТолькоТоварыПалитры
				|	И НЕ ПланОбменаОсновнаяТаблица.ЭтотУзел
				|	И НЕ ПланОбменаОсновнаяТаблица.ПометкаУдаления
				|[УсловиеОтбораПоРеквизитуФлагу]
				|";
		КонецЕсли;
КонецПроцедуры

Процедура ПРО_Справочник_Номенклатура4_ПриОбработке(Отказ, ПРО, Объект, ТекстЗапроса, ПараметрыЗапроса, ИспользоватьКэш, Выгрузка, ДополнительныеСвойства)
	Если Не Объект.ЭтоГруппа
			И Не Объект.ПометкаУдаления
			И Не Объект.ДополнительныеСвойства.Свойство("РегистрацияПалитры") Тогда
	
			ИспользоватьКэш = Ложь;
	
			Текст = "
				|ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	ПалитраТоваровРМКСостав.Ссылка КАК Ссылка
				|ИЗ
				|	Справочник.ПалитраТоваровРМК.Состав КАК ПалитраТоваровРМКСостав
				|ГДЕ
				|	ПалитраТоваровРМКСостав.Номенклатура = &Номенклатура
				|";
	
			Запрос = Новый Запрос(Текст);
			Запрос.УстановитьПараметр("Номенклатура", Объект.Ссылка);
	
			Выборка = Запрос.Выполнить().Выбрать();
	
			МассивПалитрыВладельцы = Новый Массив;
			
			Пока Выборка.Следующий() Цикл
				Родители = ИнтерфейсРМКСлужебный.ПолучитьИерархиюРодителейПалитры(Выборка.Ссылка);
				Если Родители.Количество() > 0 Тогда
					Для Каждого ЭлементМассива Из Родители Цикл
						Если МассивПалитрыВладельцы.Найти(ЭлементМассива) = Неопределено Тогда
							МассивПалитрыВладельцы.Добавить(ЭлементМассива);
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
			КонецЦикла;
	
			ПараметрыЗапроса.Вставить("МассивПалитрыВладельцы", МассивПалитрыВладельцы);
	
			ТекстЗапроса = "
				|ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	ПланОбменаОсновнаяТаблица.Ссылка КАК Ссылка
				|ИЗ
				|	ПланОбмена.ОбменСУРМК КАК ПланОбменаОсновнаяТаблица
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланОбмена.ОбменСУРМК.ПалитрыТоваровДляВыгрузки КАК ПалитрыУзла
				|		ПО (ПалитрыУзла.Ссылка = ПланОбменаОсновнаяТаблица.Ссылка)
				|ГДЕ
				|	ПалитрыУзла.ПалитраТоваровРМК В(&СвойствоОбъекта_МассивПалитрыВладельцы)
				|	И ПланОбменаОсновнаяТаблица.ВыгружатьТолькоТоварыПалитры
				|	И НЕ ПланОбменаОсновнаяТаблица.ЭтотУзел
				|	И НЕ ПланОбменаОсновнаяТаблица.ПометкаУдаления
				|[УсловиеОтбораПоРеквизитуФлагу]
				|";
		КонецЕсли;
КонецПроцедуры
#КонецОбласти
#Область Справочник_Номенклатура5
Процедура ДобавитьПРО_Справочник_Номенклатура5(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Справочник_Номенклатура5";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Справочник.Номенклатура";
	НовоеПравило.ИмяПланаОбмена = "ОбменСУРМК";
	НовоеПравило.ИмяРеквизитаФлага = "РежимВыгрузкиПриНеобходимости";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Ложь;
		
	УстановитьОтборы(НовоеПравило, 
		ПустойОтборПоСвойствамПланаОбмена(),
		Справочник_Номенклатура5_ОтборПоСвойствамОбъекта());
КонецПроцедуры

Функция Справочник_Номенклатура5_ОтборПоСвойствамОбъекта()
	Возврат "<ОтборПоСвойствамОбъекта>
			|	<ЭлементОтбора>
			|		<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|		<ВидСравнения>Равно</ВидСравнения>
			|		<СвойствоОбъекта>ЭтоГруппа</СвойствоОбъекта>
			|		<Вид>ЗначениеКонстанты</Вид>
			|		<ЗначениеКонстанты>true</ЗначениеКонстанты>
			|		<ТаблицаСвойствОбъекта>
			|			<Свойство>
			|				<Наименование>ЭтоГруппа</Наименование>
			|				<Тип>Булево</Тип>
			|				<Вид>Свойство</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствОбъекта>
			|	</ЭлементОтбора>
			|</ОтборПоСвойствамОбъекта>";
КонецФункции

#КонецОбласти
#Область Справочник_Пользователи
Процедура ДобавитьПРО_Справочник_Пользователи(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Справочник_Пользователи";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Справочник.Пользователи";
	НовоеПравило.ИмяПланаОбмена = "ОбменСУРМК";
	НовоеПравило.ИмяРеквизитаФлага = "";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Ложь;
		
	УстановитьОтборы(НовоеПравило, 
		Справочник_Пользователи_ОтборПоСвойствамПланаОбмена(),
		ПустойОтборПоСвойствамОбъекта());
КонецПроцедуры

Функция Справочник_Пользователи_ОтборПоСвойствамПланаОбмена()
	Возврат "<ОтборПоСвойствамПланаОбмена>
			|	<ЭлементОтбора>
			|		<ЭтоСтрокаКонстанты>false</ЭтоСтрокаКонстанты>
			|		<ТипСвойстваОбъекта>СправочникСсылка.Пользователи</ТипСвойстваОбъекта>
			|		<СвойствоПланаОбмена>ТаблицаНастройкиПользователей.ПользовательСсылка</СвойствоПланаОбмена>
			|		<ВидСравнения>Равно</ВидСравнения>
			|		<СвойствоОбъекта>Ссылка</СвойствоОбъекта>
			|		<ТаблицаСвойствОбъекта>
			|			<Свойство>
			|				<Наименование>Ссылка</Наименование>
			|				<Тип>СправочникСсылка.Пользователи</Тип>
			|				<Вид>Свойство</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствОбъекта>
			|		<ТаблицаСвойствПланаОбмена>
			|			<Свойство>
			|				<Наименование>[ТаблицаНастройкиПользователей]</Наименование>
			|				<Вид>ТабличнаяЧасть</Вид>
			|			</Свойство>
			|			<Свойство>
			|				<Наименование>ПользовательСсылка</Наименование>
			|				<Тип>СправочникСсылка.Пользователи</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствПланаОбмена>
			|	</ЭлементОтбора>
			|</ОтборПоСвойствамПланаОбмена>";
КонецФункции

#КонецОбласти
#Область Справочник_Сотрудники
Процедура ДобавитьПРО_Справочник_Сотрудники(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Справочник_Сотрудники";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Справочник.Сотрудники";
	НовоеПравило.ИмяПланаОбмена = "ОбменСУРМК";
	НовоеПравило.ИмяРеквизитаФлага = "";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Ложь;
		
	УстановитьОтборы(НовоеПравило, 
		Справочник_Сотрудники_ОтборПоСвойствамПланаОбмена(),
		ПустойОтборПоСвойствамОбъекта());
КонецПроцедуры

Функция Справочник_Сотрудники_ОтборПоСвойствамПланаОбмена()
	Возврат "<ОтборПоСвойствамПланаОбмена>
			|	<ЭлементОтбора>
			|		<ЭтоСтрокаКонстанты>false</ЭтоСтрокаКонстанты>
			|		<ТипСвойстваОбъекта>СправочникСсылка.Сотрудники</ТипСвойстваОбъекта>
			|		<СвойствоПланаОбмена>ТаблицаНастройкиПользователей.СотрудникСсылка</СвойствоПланаОбмена>
			|		<ВидСравнения>Равно</ВидСравнения>
			|		<СвойствоОбъекта>Ссылка</СвойствоОбъекта>
			|		<ТаблицаСвойствОбъекта>
			|			<Свойство>
			|				<Наименование>Ссылка</Наименование>
			|				<Тип>СправочникСсылка.Сотрудники</Тип>
			|				<Вид>Свойство</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствОбъекта>
			|		<ТаблицаСвойствПланаОбмена>
			|			<Свойство>
			|				<Наименование>[ТаблицаНастройкиПользователей]</Наименование>
			|				<Вид>ТабличнаяЧасть</Вид>
			|			</Свойство>
			|			<Свойство>
			|				<Наименование>СотрудникСсылка</Наименование>
			|				<Тип>СправочникСсылка.Сотрудники</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствПланаОбмена>
			|	</ЭлементОтбора>
			|</ОтборПоСвойствамПланаОбмена>";
КонецФункции

#КонецОбласти
#Область Документ_УстановкаЦенНоменклатуры
Процедура ДобавитьПРО_Документ_УстановкаЦенНоменклатуры(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Документ_УстановкаЦенНоменклатуры";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Документ.УстановкаЦенНоменклатуры";
	НовоеПравило.ИмяПланаОбмена = "ОбменСУРМК";
	НовоеПравило.ИмяРеквизитаФлага = "";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Истина;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Истина;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Ложь;
		
	УстановитьОтборы(НовоеПравило, 
		Документ_УстановкаЦенНоменклатуры_ОтборПоСвойствамПланаОбмена(),
		ПустойОтборПоСвойствамОбъекта());
КонецПроцедуры

Функция Документ_УстановкаЦенНоменклатуры_ОтборПоСвойствамПланаОбмена()
	Возврат "<ОтборПоСвойствамПланаОбмена>
			|	<ЭлементОтбора>
			|		<ЭтоСтрокаКонстанты>false</ЭтоСтрокаКонстанты>
			|		<ТипСвойстваОбъекта>Дата</ТипСвойстваОбъекта>
			|		<СвойствоПланаОбмена>ДатаНачалаВыгрузкиДокументов</СвойствоПланаОбмена>
			|		<ВидСравнения>БольшеИлиРавно</ВидСравнения>
			|		<СвойствоОбъекта>Дата</СвойствоОбъекта>
			|		<ТаблицаСвойствОбъекта>
			|			<Свойство>
			|				<Наименование>Дата</Наименование>
			|				<Тип>Дата</Тип>
			|				<Вид>Свойство</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствОбъекта>
			|		<ТаблицаСвойствПланаОбмена>
			|			<Свойство>
			|				<Наименование>ДатаНачалаВыгрузкиДокументов</Наименование>
			|				<Тип>Дата</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствПланаОбмена>
			|	</ЭлементОтбора>
			|</ОтборПоСвойствамПланаОбмена>";
КонецФункции

Процедура ПРО_Документ_УстановкаЦенНоменклатуры_ПриОбработкеДополнительный(Отказ, ПРО, Объект, ТекстЗапроса, ПараметрыЗапроса, ИспользоватьКэш, ДополнительныеСвойства)
	ИспользоватьКэш = Ложь;
	
	ТЧВидыЦен = Объект.Запасы.Выгрузить(, "ВидЦены");
	ТЧВидыЦен.Свернуть("ВидЦены");
	
	ВидыЦен = ТЧВидыЦен.ВыгрузитьКолонку("ВидЦены");
	
	Запрос = Новый Запрос("ВЫБРАТЬ
		|	ВидыЦен.Ссылка
		|ИЗ
		|	Справочник.ВидыЦен КАК ВидыЦен
		|ГДЕ
		|	НЕ ВидыЦен.ПометкаУдаления
		|	И ВидыЦен.Ссылка В (&ВидыЦен)");
						  
	Запрос.Параметры.Вставить("ВидыЦен", ВидыЦен);
	
	ВидыЦен = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	Если ВидыЦен.Количество() = 0 Тогда
		Отказ = Истина;
	Иначе
	
		ПараметрыЗапроса.Вставить("ВидыЦен", ВидыЦен);
	
		ТекстЗапроса = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПланОбменаОсновнаяТаблица.Ссылка КАК Ссылка
		|ИЗ
		|	ПланОбмена.ОбменСУРМК КАК ПланОбменаОсновнаяТаблица
		|ГДЕ
		|	ПланОбменаОсновнаяТаблица.ДатаНачалаВыгрузкиДокументов <= &СвойствоОбъекта_Дата
		|	И НЕ ПланОбменаОсновнаяТаблица.ЭтотУзел
		|	И НЕ ПланОбменаОсновнаяТаблица.ПометкаУдаления
		|   И ПланОбменаОсновнаяТаблица.ВидЦен В(&СвойствоОбъекта_ВидыЦен)
		|[УсловиеОтбораПоРеквизитуФлагу]";
		
	КонецЕсли;
КонецПроцедуры

Процедура ПРО_Документ_УстановкаЦенНоменклатуры_ПриОбработке(Отказ, ПРО, Объект, ТекстЗапроса, ПараметрыЗапроса, ИспользоватьКэш, Выгрузка, ДополнительныеСвойства)
	ИспользоватьКэш = Ложь;
	
	ТЧВидыЦен = Объект.Запасы.Выгрузить(, "ВидЦены");
	ТЧВидыЦен.Свернуть("ВидЦены");
	
	ВидыЦен = ТЧВидыЦен.ВыгрузитьКолонку("ВидЦены");
	
	Запрос = Новый Запрос("ВЫБРАТЬ
		|	ВидыЦен.Ссылка
		|ИЗ
		|	Справочник.ВидыЦен КАК ВидыЦен
		|ГДЕ
		|	НЕ ВидыЦен.ПометкаУдаления
		|	И ВидыЦен.Ссылка В (&ВидыЦен)");
						  
	Запрос.Параметры.Вставить("ВидыЦен", ВидыЦен);
	
	ВидыЦен = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	Если ВидыЦен.Количество() = 0 Тогда
		Отказ = Истина;
	Иначе
	
		ПараметрыЗапроса.Вставить("ВидыЦен", ВидыЦен);
	
		ТекстЗапроса = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПланОбменаОсновнаяТаблица.Ссылка КАК Ссылка
		|ИЗ
		|	ПланОбмена.ОбменСУРМК КАК ПланОбменаОсновнаяТаблица
		|ГДЕ
		|	ПланОбменаОсновнаяТаблица.ДатаНачалаВыгрузкиДокументов <= &СвойствоОбъекта_Дата
		|	И НЕ ПланОбменаОсновнаяТаблица.ЭтотУзел
		|	И НЕ ПланОбменаОсновнаяТаблица.ПометкаУдаления
		|   И ПланОбменаОсновнаяТаблица.ВидЦен В(&СвойствоОбъекта_ВидыЦен)
		|[УсловиеОтбораПоРеквизитуФлагу]";
		
	КонецЕсли;
КонецПроцедуры
#КонецОбласти
#Область Документ_ЗаказПокупателя
Процедура ДобавитьПРО_Документ_ЗаказПокупателя(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Документ_ЗаказПокупателя";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Документ.ЗаказПокупателя";
	НовоеПравило.ИмяПланаОбмена = "ОбменСУРМК";
	НовоеПравило.ИмяРеквизитаФлага = "";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Истина;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Ложь;
		
	УстановитьОтборы(НовоеПравило, 
		Документ_ЗаказПокупателя_ОтборПоСвойствамПланаОбмена(),
		ОтборПоСвойствамОбъекта_2());
КонецПроцедуры

Функция Документ_ЗаказПокупателя_ОтборПоСвойствамПланаОбмена()
	Возврат "<ОтборПоСвойствамПланаОбмена>
			|	<ЭлементОтбора>
			|		<ЭтоСтрокаКонстанты>true</ЭтоСтрокаКонстанты>
			|		<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|		<СвойствоПланаОбмена>ВыгружатьЗаказы</СвойствоПланаОбмена>
			|		<ВидСравнения>Равно</ВидСравнения>
			|		<СвойствоОбъекта>true</СвойствоОбъекта>
			|		<ТаблицаСвойствПланаОбмена>
			|			<Свойство>
			|				<Наименование>ВыгружатьЗаказы</Наименование>
			|				<Тип>Булево</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствПланаОбмена>
			|	</ЭлементОтбора>
			|	<ЭлементОтбора>
			|		<ЭтоСтрокаКонстанты>false</ЭтоСтрокаКонстанты>
			|		<ТипСвойстваОбъекта>Дата</ТипСвойстваОбъекта>
			|		<СвойствоПланаОбмена>ДатаНачалаВыгрузкиДокументов</СвойствоПланаОбмена>
			|		<ВидСравнения>БольшеИлиРавно</ВидСравнения>
			|		<СвойствоОбъекта>Дата</СвойствоОбъекта>
			|		<ТаблицаСвойствОбъекта>
			|			<Свойство>
			|				<Наименование>Дата</Наименование>
			|				<Тип>Дата</Тип>
			|				<Вид>Свойство</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствОбъекта>
			|		<ТаблицаСвойствПланаОбмена>
			|			<Свойство>
			|				<Наименование>ДатаНачалаВыгрузкиДокументов</Наименование>
			|				<Тип>Дата</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствПланаОбмена>
			|	</ЭлементОтбора>
			|	<Группа>
			|		<БулевоЗначениеГруппы>ИЛИ</БулевоЗначениеГруппы>
			|		<ЭлементОтбора>
			|			<ЭтоСтрокаКонстанты>false</ЭтоСтрокаКонстанты>
			|			<ТипСвойстваОбъекта>СправочникСсылка.Организации</ТипСвойстваОбъекта>
			|			<СвойствоПланаОбмена>Организации.Организация</СвойствоПланаОбмена>
			|			<ВидСравнения>Равно</ВидСравнения>
			|			<СвойствоОбъекта>Организация</СвойствоОбъекта>
			|			<ТаблицаСвойствОбъекта>
			|				<Свойство>
			|					<Наименование>Организация</Наименование>
			|					<Тип>СправочникСсылка.Организации</Тип>
			|					<Вид>Реквизит</Вид>
			|				</Свойство>
			|			</ТаблицаСвойствОбъекта>
			|			<ТаблицаСвойствПланаОбмена>
			|				<Свойство>
			|					<Наименование>[Организации]</Наименование>
			|					<Вид>ТабличнаяЧасть</Вид>
			|				</Свойство>
			|				<Свойство>
			|					<Наименование>Организация</Наименование>
			|					<Тип>СправочникСсылка.Организации</Тип>
			|					<Вид>Реквизит</Вид>
			|				</Свойство>
			|			</ТаблицаСвойствПланаОбмена>
			|		</ЭлементОтбора>
			|		<ЭлементОтбора>
			|			<ЭтоСтрокаКонстанты>true</ЭтоСтрокаКонстанты>
			|			<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|			<СвойствоПланаОбмена>ИспользоватьОтборПоОрганизациям</СвойствоПланаОбмена>
			|			<ВидСравнения>Равно</ВидСравнения>
			|			<СвойствоОбъекта>false</СвойствоОбъекта>
			|			<ТаблицаСвойствПланаОбмена>
			|				<Свойство>
			|					<Наименование>ИспользоватьОтборПоОрганизациям</Наименование>
			|					<Тип>Булево</Тип>
			|					<Вид>Реквизит</Вид>
			|				</Свойство>
			|			</ТаблицаСвойствПланаОбмена>
			|		</ЭлементОтбора>
			|	</Группа>
			|</ОтборПоСвойствамПланаОбмена>";
КонецФункции

Процедура ПРО_Документ_ЗаказПокупателя_ПередОбработкой(ПРО, Отказ, Объект, ОбъектМетаданных, Выгрузка)
	Отказ = Объект.Запасы.Количество() = 0 Или РаботаСЗаявкамиКлиентСервер.ЭтоЗаявка(Объект.ВидОперации);
КонецПроцедуры
#КонецОбласти
#Область Документ_ПриходнаяНакладная
Процедура ДобавитьПРО_Документ_ПриходнаяНакладная(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Документ_ПриходнаяНакладная";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Документ.ПриходнаяНакладная";
	НовоеПравило.ИмяПланаОбмена = "ОбменСУРМК";
	НовоеПравило.ИмяРеквизитаФлага = "";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Ложь;
		
	УстановитьОтборы(НовоеПравило, 
		Документ_ПриходнаяНакладная_ОтборПоСвойствамПланаОбмена(),
		ОтборПоСвойствамОбъекта_2());
КонецПроцедуры

Функция Документ_ПриходнаяНакладная_ОтборПоСвойствамПланаОбмена()
	Возврат "<ОтборПоСвойствамПланаОбмена>
			|	<ЭлементОтбора>
			|		<ЭтоСтрокаКонстанты>false</ЭтоСтрокаКонстанты>
			|		<ТипСвойстваОбъекта>Дата</ТипСвойстваОбъекта>
			|		<СвойствоПланаОбмена>ДатаНачалаВыгрузкиДокументов</СвойствоПланаОбмена>
			|		<ВидСравнения>БольшеИлиРавно</ВидСравнения>
			|		<СвойствоОбъекта>Дата</СвойствоОбъекта>
			|		<ТаблицаСвойствОбъекта>
			|			<Свойство>
			|				<Наименование>Дата</Наименование>
			|				<Тип>Дата</Тип>
			|				<Вид>Свойство</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствОбъекта>
			|		<ТаблицаСвойствПланаОбмена>
			|			<Свойство>
			|				<Наименование>ДатаНачалаВыгрузкиДокументов</Наименование>
			|				<Тип>Дата</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствПланаОбмена>
			|	</ЭлементОтбора>
			|	<ЭлементОтбора>
			|		<ЭтоСтрокаКонстанты>false</ЭтоСтрокаКонстанты>
			|		<ТипСвойстваОбъекта>СправочникСсылка.СтруктурныеЕдиницы</ТипСвойстваОбъекта>
			|		<СвойствоПланаОбмена>ТорговыйОбъект</СвойствоПланаОбмена>
			|		<ВидСравнения>Равно</ВидСравнения>
			|		<СвойствоОбъекта>СтруктурнаяЕдиница</СвойствоОбъекта>
			|		<ТаблицаСвойствОбъекта>
			|			<Свойство>
			|				<Наименование>СтруктурнаяЕдиница</Наименование>
			|				<Тип>СправочникСсылка.СтруктурныеЕдиницы</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствОбъекта>
			|		<ТаблицаСвойствПланаОбмена>
			|			<Свойство>
			|				<Наименование>ТорговыйОбъект</Наименование>
			|				<Тип>СправочникСсылка.СтруктурныеЕдиницы</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствПланаОбмена>
			|	</ЭлементОтбора>
			|	<Группа>
			|		<БулевоЗначениеГруппы>ИЛИ</БулевоЗначениеГруппы>
			|		<ЭлементОтбора>
			|			<ЭтоСтрокаКонстанты>false</ЭтоСтрокаКонстанты>
			|			<ТипСвойстваОбъекта>СправочникСсылка.Организации</ТипСвойстваОбъекта>
			|			<СвойствоПланаОбмена>[Организации].Организация</СвойствоПланаОбмена>
			|			<ВидСравнения>Равно</ВидСравнения>
			|			<СвойствоОбъекта>Организация</СвойствоОбъекта>
			|			<ТаблицаСвойствОбъекта>
			|				<Свойство>
			|					<Наименование>Организация</Наименование>
			|					<Тип>СправочникСсылка.Организации</Тип>
			|					<Вид>Реквизит</Вид>
			|				</Свойство>
			|			</ТаблицаСвойствОбъекта>
			|			<ТаблицаСвойствПланаОбмена>
			|				<Свойство>
			|					<Наименование>[Организации]</Наименование>
			|					<Вид>ТабличнаяЧасть</Вид>
			|				</Свойство>
			|				<Свойство>
			|					<Наименование>Организация</Наименование>
			|					<Тип>СправочникСсылка.Организации</Тип>
			|					<Вид>Реквизит</Вид>
			|				</Свойство>
			|			</ТаблицаСвойствПланаОбмена>
			|		</ЭлементОтбора>
			|		<ЭлементОтбора>
			|			<ЭтоСтрокаКонстанты>true</ЭтоСтрокаКонстанты>
			|			<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|			<СвойствоПланаОбмена>ИспользоватьОтборПоОрганизациям</СвойствоПланаОбмена>
			|			<ВидСравнения>Равно</ВидСравнения>
			|			<СвойствоОбъекта>false</СвойствоОбъекта>
			|			<ТаблицаСвойствПланаОбмена>
			|				<Свойство>
			|					<Наименование>ИспользоватьОтборПоОрганизациям</Наименование>
			|					<Тип>Булево</Тип>
			|					<Вид>Реквизит</Вид>
			|				</Свойство>
			|			</ТаблицаСвойствПланаОбмена>
			|		</ЭлементОтбора>
			|	</Группа>
			|</ОтборПоСвойствамПланаОбмена>";
КонецФункции

#КонецОбласти
#Область РегистрСведений_ЦеныНоменклатуры
Процедура ДобавитьПРО_РегистрСведений_ЦеныНоменклатуры(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "РегистрСведений_ЦеныНоменклатуры";
	
	НовоеПравило.ОбъектМетаданныхИмя = "РегистрСведений.ЦеныНоменклатуры";
	НовоеПравило.ИмяПланаОбмена = "ОбменСУРМК";
	НовоеПравило.ИмяРеквизитаФлага = "";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Ложь;
		
	УстановитьОтборы(НовоеПравило, 
		РегистрСведений_ЦеныНоменклатуры_ОтборПоСвойствамПланаОбмена(),
		ПустойОтборПоСвойствамОбъекта());
КонецПроцедуры

Функция РегистрСведений_ЦеныНоменклатуры_ОтборПоСвойствамПланаОбмена()
	Возврат "<ОтборПоСвойствамПланаОбмена>
			|	<ЭлементОтбора>
			|		<ЭтоСтрокаКонстанты>false</ЭтоСтрокаКонстанты>
			|		<ТипСвойстваОбъекта>Дата</ТипСвойстваОбъекта>
			|		<СвойствоПланаОбмена>ДатаНачалаВыгрузкиДокументов</СвойствоПланаОбмена>
			|		<ВидСравнения>БольшеИлиРавно</ВидСравнения>
			|		<СвойствоОбъекта>Период</СвойствоОбъекта>
			|		<ТаблицаСвойствОбъекта>
			|			<Свойство>
			|				<Наименование>Период</Наименование>
			|				<Тип>Дата</Тип>
			|				<Вид>Свойство</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствОбъекта>
			|		<ТаблицаСвойствПланаОбмена>
			|			<Свойство>
			|				<Наименование>ДатаНачалаВыгрузкиДокументов</Наименование>
			|				<Тип>Дата</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствПланаОбмена>
			|	</ЭлементОтбора>
			|	<ЭлементОтбора>
			|		<ЭтоСтрокаКонстанты>false</ЭтоСтрокаКонстанты>
			|		<ТипСвойстваОбъекта>СправочникСсылка.ВидыЦен</ТипСвойстваОбъекта>
			|		<СвойствоПланаОбмена>ВидЦен</СвойствоПланаОбмена>
			|		<ВидСравнения>Равно</ВидСравнения>
			|		<СвойствоОбъекта>ВидЦен</СвойствоОбъекта>
			|		<ТаблицаСвойствОбъекта>
			|			<Свойство>
			|				<Наименование>ВидЦен</Наименование>
			|				<Тип>СправочникСсылка.ВидыЦен</Тип>
			|				<Вид>Измерение</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствОбъекта>
			|		<ТаблицаСвойствПланаОбмена>
			|			<Свойство>
			|				<Наименование>ВидЦен</Наименование>
			|				<Тип>СправочникСсылка.ВидыЦен</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствПланаОбмена>
			|	</ЭлементОтбора>
			|</ОтборПоСвойствамПланаОбмена>";
КонецФункции

#КонецОбласти
#Область РегистрСведений_ШтрихкодыНоменклатуры
Процедура ДобавитьПРО_РегистрСведений_ШтрихкодыНоменклатуры(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "РегистрСведений_ШтрихкодыНоменклатуры";
	
	НовоеПравило.ОбъектМетаданныхИмя = "РегистрСведений.ШтрихкодыНоменклатуры";
	НовоеПравило.ИмяПланаОбмена = "ОбменСУРМК";
	НовоеПравило.ИмяРеквизитаФлага = "";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Ложь;
		
	УстановитьОтборы(НовоеПравило, 
		ПустойОтборПоСвойствамПланаОбмена(),
		РегистрСведений_ШтрихкодыНоменклатуры_ОтборПоСвойствамОбъекта());
КонецПроцедуры

Функция РегистрСведений_ШтрихкодыНоменклатуры_ОтборПоСвойствамОбъекта()
	Возврат "<ОтборПоСвойствамОбъекта>
			|	<Группа>
			|		<БулевоЗначениеГруппы>ИЛИ</БулевоЗначениеГруппы>
			|		<ЭлементОтбора>
			|			<ТипСвойстваОбъекта>ПеречислениеСсылка.ТипыНоменклатуры</ТипСвойстваОбъекта>
			|			<ВидСравнения>Равно</ВидСравнения>
			|			<СвойствоОбъекта>Номенклатура.ТипНоменклатуры</СвойствоОбъекта>
			|			<Вид>АлгоритмЗначения</Вид>
			|			<ЗначениеКонстанты>Значение = Перечисления.ТипыНоменклатуры.Запас;</ЗначениеКонстанты>
			|			<ТаблицаСвойствОбъекта>
			|				<Свойство>
			|					<Наименование>Номенклатура</Наименование>
			|					<Тип>СправочникСсылка.Номенклатура</Тип>
			|					<Вид>Измерение</Вид>
			|				</Свойство>
			|				<Свойство>
			|					<Наименование>ТипНоменклатуры</Наименование>
			|					<Тип>ПеречислениеСсылка.ТипыНоменклатуры</Тип>
			|					<Вид>Реквизит</Вид>
			|				</Свойство>
			|			</ТаблицаСвойствОбъекта>
			|		</ЭлементОтбора>
			|		<ЭлементОтбора>
			|			<ТипСвойстваОбъекта>ПеречислениеСсылка.ТипыНоменклатуры</ТипСвойстваОбъекта>
			|			<ВидСравнения>Равно</ВидСравнения>
			|			<СвойствоОбъекта>Номенклатура.ТипНоменклатуры</СвойствоОбъекта>
			|			<Вид>АлгоритмЗначения</Вид>
			|			<ЗначениеКонстанты>Значение = Перечисления.ТипыНоменклатуры.Услуга;</ЗначениеКонстанты>
			|			<ТаблицаСвойствОбъекта>
			|				<Свойство>
			|					<Наименование>Номенклатура</Наименование>
			|					<Тип>СправочникСсылка.Номенклатура</Тип>
			|					<Вид>Измерение</Вид>
			|				</Свойство>
			|				<Свойство>
			|					<Наименование>ТипНоменклатуры</Наименование>
			|					<Тип>ПеречислениеСсылка.ТипыНоменклатуры</Тип>
			|					<Вид>Реквизит</Вид>
			|				</Свойство>
			|			</ТаблицаСвойствОбъекта>
			|		</ЭлементОтбора>
			|		<ЭлементОтбора>
			|			<ТипСвойстваОбъекта>ПеречислениеСсылка.ТипыНоменклатуры</ТипСвойстваОбъекта>
			|			<ВидСравнения>Равно</ВидСравнения>
			|			<СвойствоОбъекта>Номенклатура.ТипНоменклатуры</СвойствоОбъекта>
			|			<Вид>АлгоритмЗначения</Вид>
			|			<ЗначениеКонстанты>Значение = Перечисления.ТипыНоменклатуры.ПодарочныйСертификат;</ЗначениеКонстанты>
			|			<ТаблицаСвойствОбъекта>
			|				<Свойство>
			|					<Наименование>Номенклатура</Наименование>
			|					<Тип>СправочникСсылка.Номенклатура</Тип>
			|					<Вид>Измерение</Вид>
			|				</Свойство>
			|				<Свойство>
			|					<Наименование>ТипНоменклатуры</Наименование>
			|					<Тип>ПеречислениеСсылка.ТипыНоменклатуры</Тип>
			|					<Вид>Реквизит</Вид>
			|				</Свойство>
			|			</ТаблицаСвойствОбъекта>
			|		</ЭлементОтбора>
			|	</Группа>
			|</ОтборПоСвойствамОбъекта>";
КонецФункции

#КонецОбласти
#Область РегистрСведений_ОстаткиТоваров
Процедура ДобавитьПРО_РегистрСведений_ОстаткиТоваров(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "РегистрСведений_ОстаткиТоваров";
	
	НовоеПравило.ОбъектМетаданныхИмя = "РегистрСведений.ОстаткиТоваров";
	НовоеПравило.ИмяПланаОбмена = "ОбменСУРМК";
	НовоеПравило.ИмяРеквизитаФлага = "";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Истина;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Истина;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Ложь;
		
	УстановитьОтборы(НовоеПравило, 
		РегистрСведений_ОстаткиТоваров_ОтборПоСвойствамПланаОбмена(),
		ПустойОтборПоСвойствамОбъекта());
КонецПроцедуры

Функция РегистрСведений_ОстаткиТоваров_ОтборПоСвойствамПланаОбмена()
	Возврат "<ОтборПоСвойствамПланаОбмена>
			|	<ЭлементОтбора>
			|		<ЭтоСтрокаКонстанты>false</ЭтоСтрокаКонстанты>
			|		<ТипСвойстваОбъекта>СправочникСсылка.СтруктурныеЕдиницы</ТипСвойстваОбъекта>
			|		<СвойствоПланаОбмена>ТорговыйОбъект</СвойствоПланаОбмена>
			|		<ВидСравнения>Равно</ВидСравнения>
			|		<СвойствоОбъекта>СтруктурнаяЕдиница</СвойствоОбъекта>
			|		<ТаблицаСвойствОбъекта>
			|			<Свойство>
			|				<Наименование>СтруктурнаяЕдиница</Наименование>
			|				<Тип>СправочникСсылка.СтруктурныеЕдиницы</Тип>
			|				<Вид>Измерение</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствОбъекта>
			|		<ТаблицаСвойствПланаОбмена>
			|			<Свойство>
			|				<Наименование>ТорговыйОбъект</Наименование>
			|				<Тип>СправочникСсылка.СтруктурныеЕдиницы</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствПланаОбмена>
			|	</ЭлементОтбора>
			|	<ЭлементОтбора>
			|		<ЭтоСтрокаКонстанты>false</ЭтоСтрокаКонстанты>
			|		<ТипСвойстваОбъекта>СправочникСсылка.Организации</ТипСвойстваОбъекта>
			|		<СвойствоПланаОбмена>Организации.Организация</СвойствоПланаОбмена>
			|		<ВидСравнения>Равно</ВидСравнения>
			|		<СвойствоОбъекта>Организация</СвойствоОбъекта>
			|		<ТаблицаСвойствОбъекта>
			|			<Свойство>
			|				<Наименование>Организация</Наименование>
			|				<Тип>СправочникСсылка.Организации</Тип>
			|				<Вид>Измерение</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствОбъекта>
			|		<ТаблицаСвойствПланаОбмена>
			|			<Свойство>
			|				<Наименование>[Организации]</Наименование>
			|				<Вид>ТабличнаяЧасть</Вид>
			|			</Свойство>
			|			<Свойство>
			|				<Наименование>Организация</Наименование>
			|				<Тип>СправочникСсылка.Организации</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствПланаОбмена>
			|	</ЭлементОтбора>
			|	<ЭлементОтбора>
			|		<ЭтоСтрокаКонстанты>true</ЭтоСтрокаКонстанты>
			|		<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|		<СвойствоПланаОбмена>ВыгружатьОстаткиНоменклатуры</СвойствоПланаОбмена>
			|		<ВидСравнения>Равно</ВидСравнения>
			|		<СвойствоОбъекта>true</СвойствоОбъекта>
			|		<ТаблицаСвойствПланаОбмена>
			|			<Свойство>
			|				<Наименование>ВыгружатьОстаткиНоменклатуры</Наименование>
			|				<Тип>Булево</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствПланаОбмена>
			|	</ЭлементОтбора>
			|</ОтборПоСвойствамПланаОбмена>";
КонецФункции

Процедура ПРО_РегистрСведений_ОстаткиТоваров_ПриОбработкеДополнительный(Отказ, ПРО, Объект, ТекстЗапроса, ПараметрыЗапроса, ИспользоватьКэш, ДополнительныеСвойства)
	ИспользоватьКэш = Ложь;
	
	МассивСкладов = Новый Массив;
	
	Если ЗначениеЗаполнено(Объект.СтруктурнаяЕдиница) Тогда
		СкладОстатков = Объект.СтруктурнаяЕдиница;
	
	      МассивСкладов.Добавить(СкладОстатков);
	
		Если ЗначениеЗаполнено(СкладОстатков.Родитель)
			И СкладОстатков.Родитель.ТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.МагазинГруппаСкладов Тогда
	
	            МассивСкладов.Добавить(СкладОстатков.Родитель);
		КонецЕсли;
	
		ПараметрыЗапроса.Вставить("СтруктурнаяЕдиница", МассивСкладов);
	
	Иначе	
		Отказ = Истина;
	КонецЕсли;
	
	ПараметрыЗапроса.Вставить("Организация", Объект.Организация);
	
	ТекстЗапроса = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПланОбменаОсновнаяТаблица.Ссылка КАК Ссылка
		|ИЗ
		|	ПланОбмена.ОбменСУРМК КАК ПланОбменаОсновнаяТаблица
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПланОбмена.ОбменСУРМК.Организации КАК ОбменСУРМКОрганизации
		|		ПО (ПланОбменаОсновнаяТаблица.Ссылка = ОбменСУРМКОрганизации.Ссылка)
		|ГДЕ
		|	ПланОбменаОсновнаяТаблица.ВыгружатьОстаткиНоменклатуры
		|	И НЕ ПланОбменаОсновнаяТаблица.ЭтотУзел
		|	И НЕ ПланОбменаОсновнаяТаблица.ПометкаУдаления
		|     И ПланОбменаОсновнаяТаблица.ТорговыйОбъект В(&СвойствоОбъекта_СтруктурнаяЕдиница)
		|     И ОбменСУРМКОрганизации.Организация = &СвойствоОбъекта_Организация
		|[УсловиеОтбораПоРеквизитуФлагу]";
КонецПроцедуры

Процедура ПРО_РегистрСведений_ОстаткиТоваров_ПриОбработке(Отказ, ПРО, Объект, ТекстЗапроса, ПараметрыЗапроса, ИспользоватьКэш, Выгрузка, ДополнительныеСвойства)
	ИспользоватьКэш = Ложь;
	
	МассивСкладов = Новый Массив;
	
	Если ЗначениеЗаполнено(Объект.СтруктурнаяЕдиница) Тогда
		СкладОстатков = Объект.СтруктурнаяЕдиница;
	
	      МассивСкладов.Добавить(СкладОстатков);
	
		Если ЗначениеЗаполнено(СкладОстатков.Родитель)
			И СкладОстатков.Родитель.ТипСтруктурнойЕдиницы = Перечисления.ТипыСтруктурныхЕдиниц.МагазинГруппаСкладов Тогда
	
	            МассивСкладов.Добавить(СкладОстатков.Родитель);
		КонецЕсли;
	
		ПараметрыЗапроса.Вставить("СтруктурнаяЕдиница", МассивСкладов);
	
	Иначе	
		Отказ = Истина;
	КонецЕсли;
	
	ПараметрыЗапроса.Вставить("Организация", Объект.Организация);
	
	ТекстЗапроса = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПланОбменаОсновнаяТаблица.Ссылка КАК Ссылка
		|ИЗ
		|	ПланОбмена.ОбменСУРМК КАК ПланОбменаОсновнаяТаблица
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПланОбмена.ОбменСУРМК.Организации КАК ОбменСУРМКОрганизации
		|		ПО (ПланОбменаОсновнаяТаблица.Ссылка = ОбменСУРМКОрганизации.Ссылка)
		|ГДЕ
		|	ПланОбменаОсновнаяТаблица.ВыгружатьОстаткиНоменклатуры
		|	И НЕ ПланОбменаОсновнаяТаблица.ЭтотУзел
		|	И НЕ ПланОбменаОсновнаяТаблица.ПометкаУдаления
		|     И ПланОбменаОсновнаяТаблица.ТорговыйОбъект В(&СвойствоОбъекта_СтруктурнаяЕдиница)
		|     И ОбменСУРМКОрганизации.Организация = &СвойствоОбъекта_Организация
		|[УсловиеОтбораПоРеквизитуФлагу]";
КонецПроцедуры
#КонецОбласти
#Область РегистрСведений_СистемыНалогообложенияОрганизаций
Процедура ДобавитьПРО_РегистрСведений_СистемыНалогообложенияОрганизаций(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "РегистрСведений_СистемыНалогообложенияОрганизаций";
	
	НовоеПравило.ОбъектМетаданныхИмя = "РегистрСведений.СистемыНалогообложенияОрганизаций";
	НовоеПравило.ИмяПланаОбмена = "ОбменСУРМК";
	НовоеПравило.ИмяРеквизитаФлага = "";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Ложь;
		
	УстановитьОтборы(НовоеПравило, 
		ОтборПоСвойствамПланаОбмена_1(),
		ПустойОтборПоСвойствамОбъекта());
КонецПроцедуры

#КонецОбласти
#Область РегистрСведений_НастройкиУчетаНДС
Процедура ДобавитьПРО_РегистрСведений_НастройкиУчетаНДС(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "РегистрСведений_НастройкиУчетаНДС";
	
	НовоеПравило.ОбъектМетаданныхИмя = "РегистрСведений.НастройкиУчетаНДС";
	НовоеПравило.ИмяПланаОбмена = "ОбменСУРМК";
	НовоеПравило.ИмяРеквизитаФлага = "";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Ложь;
		
	УстановитьОтборы(НовоеПравило, 
		ОтборПоСвойствамПланаОбмена_1(),
		ПустойОтборПоСвойствамОбъекта());
КонецПроцедуры

#КонецОбласти
#Область Справочник_Контрагенты2
Процедура ДобавитьПРО_Справочник_Контрагенты2(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Справочник_Контрагенты2";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Справочник.Контрагенты";
	НовоеПравило.ИмяПланаОбмена = "ОбменСУРМК";
	НовоеПравило.ИмяРеквизитаФлага = "";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Ложь;
		
	УстановитьОтборы(НовоеПравило, 
		Справочник_Контрагенты2_ОтборПоСвойствамПланаОбмена(),
		Справочник_Контрагенты2_ОтборПоСвойствамОбъекта());
КонецПроцедуры

Функция Справочник_Контрагенты2_ОтборПоСвойствамПланаОбмена()
	Возврат "<ОтборПоСвойствамПланаОбмена>
			|	<ЭлементОтбора>
			|		<ЭтоСтрокаКонстанты>true</ЭтоСтрокаКонстанты>
			|		<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|		<СвойствоПланаОбмена>ВыгружатьПоставщиков</СвойствоПланаОбмена>
			|		<ВидСравнения>Равно</ВидСравнения>
			|		<СвойствоОбъекта>true</СвойствоОбъекта>
			|		<ТаблицаСвойствПланаОбмена>
			|			<Свойство>
			|				<Наименование>ВыгружатьПоставщиков</Наименование>
			|				<Тип>Булево</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствПланаОбмена>
			|	</ЭлементОтбора>
			|</ОтборПоСвойствамПланаОбмена>";
КонецФункции

Функция Справочник_Контрагенты2_ОтборПоСвойствамОбъекта()
	Возврат "<ОтборПоСвойствамОбъекта>
			|	<ЭлементОтбора>
			|		<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|		<ВидСравнения>Равно</ВидСравнения>
			|		<СвойствоОбъекта>Поставщик</СвойствоОбъекта>
			|		<Вид>ЗначениеКонстанты</Вид>
			|		<ЗначениеКонстанты>true</ЗначениеКонстанты>
			|		<ТаблицаСвойствОбъекта>
			|			<Свойство>
			|				<Наименование>Поставщик</Наименование>
			|				<Тип>Булево</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствОбъекта>
			|	</ЭлементОтбора>
			|</ОтборПоСвойствамОбъекта>";
КонецФункции

#КонецОбласти

Функция ОтборПоСвойствамОбъекта_1()
	Возврат "<ОтборПоСвойствамОбъекта>
			|	<ЭлементОтбора>
			|		<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|		<ВидСравнения>Равно</ВидСравнения>
			|		<СвойствоОбъекта>ЭтоАгентскаяУслуга</СвойствоОбъекта>
			|		<Вид>ЗначениеКонстанты</Вид>
			|		<ЗначениеКонстанты>false</ЗначениеКонстанты>
			|		<ТаблицаСвойствОбъекта>
			|			<Свойство>
			|				<Наименование>ЭтоАгентскаяУслуга</Наименование>
			|				<Тип>Булево</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствОбъекта>
			|	</ЭлементОтбора>
			|	<ЭлементОтбора>
			|		<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|		<ВидСравнения>Равно</ВидСравнения>
			|		<СвойствоОбъекта>ЭтоГруппа</СвойствоОбъекта>
			|		<Вид>ЗначениеКонстанты</Вид>
			|		<ЗначениеКонстанты>false</ЗначениеКонстанты>
			|		<ТаблицаСвойствОбъекта>
			|			<Свойство>
			|				<Наименование>ЭтоГруппа</Наименование>
			|				<Тип>Булево</Тип>
			|				<Вид>Свойство</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствОбъекта>
			|	</ЭлементОтбора>
			|	<Группа>
			|		<БулевоЗначениеГруппы>ИЛИ</БулевоЗначениеГруппы>
			|		<ЭлементОтбора>
			|			<ТипСвойстваОбъекта>ПеречислениеСсылка.ТипыНоменклатуры</ТипСвойстваОбъекта>
			|			<ВидСравнения>Равно</ВидСравнения>
			|			<СвойствоОбъекта>ТипНоменклатуры</СвойствоОбъекта>
			|			<Вид>АлгоритмЗначения</Вид>
			|			<ЗначениеКонстанты>Значение = Перечисления.ТипыНоменклатуры.Запас;</ЗначениеКонстанты>
			|			<ТаблицаСвойствОбъекта>
			|				<Свойство>
			|					<Наименование>ТипНоменклатуры</Наименование>
			|					<Тип>ПеречислениеСсылка.ТипыНоменклатуры</Тип>
			|					<Вид>Реквизит</Вид>
			|				</Свойство>
			|			</ТаблицаСвойствОбъекта>
			|		</ЭлементОтбора>
			|		<ЭлементОтбора>
			|			<ТипСвойстваОбъекта>ПеречислениеСсылка.ТипыНоменклатуры</ТипСвойстваОбъекта>
			|			<ВидСравнения>Равно</ВидСравнения>
			|			<СвойствоОбъекта>ТипНоменклатуры</СвойствоОбъекта>
			|			<Вид>АлгоритмЗначения</Вид>
			|			<ЗначениеКонстанты>Значение = Перечисления.ТипыНоменклатуры.Услуга;</ЗначениеКонстанты>
			|			<ТаблицаСвойствОбъекта>
			|				<Свойство>
			|					<Наименование>ТипНоменклатуры</Наименование>
			|					<Тип>ПеречислениеСсылка.ТипыНоменклатуры</Тип>
			|					<Вид>Реквизит</Вид>
			|				</Свойство>
			|			</ТаблицаСвойствОбъекта>
			|		</ЭлементОтбора>
			|	</Группа>
			|</ОтборПоСвойствамОбъекта>" ;
КонецФункции

Функция ОтборПоСвойствамОбъекта_2()
	Возврат "<ОтборПоСвойствамОбъекта>
			|	<ЭлементОтбора>
			|		<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|		<ВидСравнения>Равно</ВидСравнения>
			|		<СвойствоОбъекта>Проведен</СвойствоОбъекта>
			|		<Вид>ЗначениеКонстанты</Вид>
			|		<ЗначениеКонстанты>true</ЗначениеКонстанты>
			|		<ТаблицаСвойствОбъекта>
			|			<Свойство>
			|				<Наименование>Проведен</Наименование>
			|				<Тип>Булево</Тип>
			|				<Вид>Свойство</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствОбъекта>
			|	</ЭлементОтбора>
			|</ОтборПоСвойствамОбъекта>" ;
КонецФункции

Функция ПустойОтборПоСвойствамОбъекта()
	Возврат "<ОтборПоСвойствамОбъекта/>" ;
КонецФункции

Функция ОтборПоСвойствамПланаОбмена_1()
	Возврат "<ОтборПоСвойствамПланаОбмена>
			|	<ЭлементОтбора>
			|		<ЭтоСтрокаКонстанты>false</ЭтоСтрокаКонстанты>
			|		<ТипСвойстваОбъекта>СправочникСсылка.Организации</ТипСвойстваОбъекта>
			|		<СвойствоПланаОбмена>Организации.Организация</СвойствоПланаОбмена>
			|		<ВидСравнения>Равно</ВидСравнения>
			|		<СвойствоОбъекта>Организация</СвойствоОбъекта>
			|		<ТаблицаСвойствОбъекта>
			|			<Свойство>
			|				<Наименование>Организация</Наименование>
			|				<Тип>СправочникСсылка.Организации</Тип>
			|				<Вид>Измерение</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствОбъекта>
			|		<ТаблицаСвойствПланаОбмена>
			|			<Свойство>
			|				<Наименование>[Организации]</Наименование>
			|				<Вид>ТабличнаяЧасть</Вид>
			|			</Свойство>
			|			<Свойство>
			|				<Наименование>Организация</Наименование>
			|				<Тип>СправочникСсылка.Организации</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствПланаОбмена>
			|	</ЭлементОтбора>
			|</ОтборПоСвойствамПланаОбмена>" ;
КонецФункции

Функция ПустойОтборПоСвойствамПланаОбмена()
	Возврат "<ОтборПоСвойствамПланаОбмена/>" ;
КонецФункции

#КонецОбласти
