#Область ПрограммныйИнтерфейс

// Выполняет операции после обработки облачного задания
// 
// Параметры:
//  ДокументОперации - ДокументСсылка - Документ-основание.
//  Касса - СправочникСсылка.ПодключаемоеОборудование - подключаемое оборудование.
//  ПараметрыОперации - Структура
//  ОбъектОбработан - Булево
Процедура ЧекОблачногоЗаданияОбработан(ДокументОперации, Касса, ПараметрыОперации, ОбъектОбработан) Экспорт
	
	Перем ИдентификаторЧекаВОчереди;
	СтандартнаяОбработка = Истина;
	
	ОборудованиеЧекопечатающиеОблачныеККТПереопределяемый.ПриПолученииИдентификатораЧека(ДокументОперации, ИдентификаторЧекаВОчереди, СтандартнаяОбработка);
	Если СтандартнаяОбработка Тогда
		ИдентификаторЧекаВОчереди = ОбщегоНазначенияБПО.ЗначениеРеквизитаОбъекта(ДокументОперации, "ИдентификаторЧекаВОчереди");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИдентификаторЧекаВОчереди) Тогда
		ИдентификаторЧека = ИдентификаторЧекаВОчереди;
	Иначе
		ИдентификаторЧека = ДокументОперации;
	КонецЕсли;
	ДанныеЧекаВОчереди = РаспределеннаяФискализация.ДанныеЧекаВОчереди(ИдентификаторЧека);
	
	Если ЗначениеЗаполнено(ДанныеЧекаВОчереди) Тогда
		ПараметрыОперацииЧека = ДанныеЧекаВОчереди.ДанныеЧека;
	Иначе
		ПараметрыОперацииЧека = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыОперацииФискализацииЧека();
		ПараметрыОперацииЧека.ДокументОснование = ДокументОперации;
		РаспределеннаяФискализацияПереопределяемый.ЗаполнитьДанныеФискализации(ПараметрыОперацииЧека, ДокументОперации);
	КонецЕсли;
	
	ТекстОшибки = "";
	Если ПараметрыОперации.СтатусОперации = "Выполнена" Тогда
		СтатусЧекаВОчереди = Перечисления.СтатусЧекаККТВОчереди.Фискализирован;
		СтатусЧекаВСервисе = Перечисления.СтатусыОперацийВСервисеОблачныхКасс.Выполнена; 
		РезультатПробития  = Истина;
	Иначе
		СтатусЧекаВОчереди = Перечисления.СтатусЧекаККТВОчереди.Ошибка;
		СтатусЧекаВСервисе = Перечисления.СтатусыОперацийВСервисеОблачныхКасс.Ошибка;
		РезультатПробития  = Ложь;
	КонецЕсли;
	
	Если РезультатПробития Тогда
		ФискальныеДанныеЧека = ПараметрыОперации.ДанныеДляОбработки;
		
		ПараметрыФискализацииXML = ОборудованиеЧекопечатающиеУстройства.ПараметрыФискализацииЧека();
		ВерсияФФДККТ11 = "1.2"; // Признак ФФД 1.1
		
		ПараметрыФискализацииXML.РегистрационныйНомерККТ = "";
		ПараметрыФискализацииXML.ЗаводскойНомерФН  = "";
		ПараметрыФискализацииXML.ШиринаСтроки      = 0;
		ПараметрыФискализацииXML.РевизияИнтерфейса = 4004;
		ПараметрыФискализацииXML.ДокументОснование = ПараметрыОперацииЧека.ДокументОснование;
		ПараметрыФискализацииXML.ИдентификаторФискальнойЗаписи = ПараметрыОперацииЧека.ИдентификаторФискальнойЗаписи;
		ПараметрыФискализацииXML.Организация       = ПараметрыОперацииЧека.Организация;
		ПараметрыФискализацииXML.ТорговыйОбъект    = ПараметрыОперацииЧека.ТорговыйОбъект;
		ПараметрыФискализацииXML.ДополнительныйРеквизит = ПараметрыОперацииЧека.ДополнительныйРеквизит;  
		ПараметрыФискализацииXML.СубъектПерсональныхДанных = ПараметрыОперацииЧека.СубъектПерсональныхДанных;
		ПараметрыФискализацииXML.ЕстьПерсональныеДанные    = ПараметрыОперацииЧека.ЕстьПерсональныеДанные;
		ПараметрыФискализацииXML.Кассир       = ПараметрыОперацииЧека.Кассир;
		ПараметрыФискализацииXML.КассирИНН    = ПараметрыОперацииЧека.КассирИНН;
		ПараметрыФискализацииXML.Электронно   = ПараметрыОперацииЧека.Электронно;
		ПараметрыФискализацииXML.Отправляет1СSMS   = ПараметрыОперацииЧека.Отправляет1СSMS;
		ПараметрыФискализацииXML.ВерсияФФДККТ11    = ПараметрыОперацииЧека;
		ПараметрыФискализацииXML.ЕдиныйЧек         = ПараметрыОперацииЧека.ЕдиныйЧек;
		ПараметрыФискализацииXML.ТипДокумента = Перечисления.ТипыФискальныхДокументовККТ.КассовыйЧек;
		
		ОборудованиеЧекопечатающиеУстройства.СформироватьXMLПакетДляФискализацияЧека(ПараметрыОперацииЧека, ПараметрыФискализацииXML);
		
		РезультатВыполнения = МенеджерОборудованияКлиентСервер.ПараметрыВыполненияОперацииНаОборудовании(РезультатПробития, Неопределено, Касса);
		
		РезультатВыполнения.Вставить("НомерСменыККТ" , ФискальныеДанныеЧека.shiftNumber);
		РезультатВыполнения.Вставить("НомерЧекаККТ"  , ФискальныеДанныеЧека.receiptNumber);
		РезультатВыполнения.Вставить("СтатусСмены", 2);
		РезультатВыполнения.Вставить("ДатаВремяЧека"          , ПреобразоватьДату(ФискальныеДанныеЧека.receiptDate));
		РезультатВыполнения.Вставить("ФискальныйПризнак"      , ФискальныеДанныеЧека.FNSign);
		РезультатВыполнения.Вставить("АдресСайтаПроверки"     , ФискальныеДанныеЧека.addressSiteInspections);
		РезультатВыполнения.Вставить("РегистрационныйНомерККТ", ФискальныеДанныеЧека.KKTSerialNumber);
		РезультатВыполнения.Вставить("ОперацияЗаписана"       , Истина);
		РезультатВыполнения.Вставить("НомерФискальногоНакопителя"       , ФискальныеДанныеЧека.FNSerialNumber);
		РезультатВыполнения.Вставить("ДанныеXML", ПараметрыФискализацииXML.ДанныеЧекаXML);
		
		ФискальнаяОперацияЧека = ОборудованиеЧекопечатающиеУстройства.ДанныеФискальнойОперации(ДокументОперации);
		Если ФискальнаяОперацияЧека = Неопределено Тогда
			Попытка
				// Записать фискальную операцию.
				ОборудованиеЧекопечатающиеОблачныеККТВызовСервера.ЗаписатьФискальнуюОперацию(ПараметрыОперацииЧека, РезультатВыполнения);
			Исключение
				#Если НЕ МобильноеПриложениеСервер Тогда
				ЗаписьЖурналаРегистрации(НСтр("ru = 'Запись фискальной операции чека'",
					ОбщегоНазначенияБПО.КодОсновногоЯзыка()),
					УровеньЖурналаРегистрации.Ошибка,,,
					ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
				#КонецЕсли
				Возврат;
			КонецПопытки;
		Иначе
			ОбъектОбработан = Истина;
			Возврат
		КонецЕсли;
	Иначе
		ОбъектОбработан = Истина;
	КонецЕсли;
	
	РаспределеннаяФискализацияПереопределяемый.ОбработатьСтатусПостановкиЧекаВОблачныйСервис(
		ДокументОперации, 
		ПараметрыОперации.СтатусОперации, 
		ПараметрыОперацииЧека, 
		ТекстОшибки);
	
	РаспределеннаяФискализация.ЗаписатьСтатусЧекаВОчереди(ПараметрыОперацииЧека, СтатусЧекаВОчереди, Касса, , СтатусЧекаВСервисе, ОбъектОбработан);
	
КонецПроцедуры

Функция СтатусПробитияЧека(ДокументОперации) Экспорт
	
	МодульОблачныхКасс = ОбщегоНазначенияБПО.ОбщийМодуль("ОблачныеКассы");
	Возврат МодульОблачныхКасс.СтатусПробитияЧека(ДокументОперации, 30);
	
КонецФункции

// Создает новое оборудование облачной ККТ
// 
// Параметры:
//  Организация - ОпределяемыйТип.ОрганизацияБПО - организация подключаемого оборудования.
//  Наименование - Строка - наименование облачной ККТ.
//
// Возвращаемое значение:
//  СправочникСсылка.ПодключаемоеОборудование.
//
Функция НовоеОборудованиеОблачнойККТ(Организация, Наименование) Экспорт
	
	НачатьТранзакцию();
	Попытка
		
		БлокировкаДанных = Новый БлокировкаДанных();
		ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("Справочник.ПодключаемоеОборудование");
		БлокировкаДанных.Заблокировать();
		
		НовоеОборудование = Справочники.ПодключаемоеОборудование.СоздатьЭлемент();
		НовоеОборудование.Организация = Организация;
		НовоеОборудование.Наименование = Наименование;
		НовоеОборудование.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ОблачнаяККТ;
		НовоеОборудование.ТипПодключения = Перечисления.ТипыПодключенияОборудования.ОбщийДоступ;
		НовоеОборудование.ДрайверОборудования = ПредопределенноеЗначение("Справочник.ДрайверыОборудования.ОбработчикОблачныхККТ");
		НовоеОборудование.УстройствоИспользуется = Истина;
		НовоеОборудование.СпособФорматноЛогическогоКонтроля = Перечисления.СпособыФорматноЛогическогоКонтроля.РазделятьСтроки;
		НовоеОборудование.ДопустимоеРасхождениеФорматноЛогическогоКонтроля = 0.01;
		НовоеОборудование.Записать();
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ОбщегоНазначенияБПО.ЗаписатьОшибкуВЖурналРегистрации(
		НСтр("ru = 'Обновление информационной базы'", ОбщегоНазначенияБПО.КодОсновногоЯзыка()),
		ТекстОшибки);
	КонецПопытки;
	
	Возврат НовоеОборудование.Ссылка;
	
КонецФункции

// Выполняет преобразование данных чека к формату облачной ККТ.
// 
// Параметры:
//  ДанныеЧека - см.ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыОперацииФискализацииЧека - структура данных чека.
//
// Возвращаемое значение:
//  Структура - структура данных в формате облачного сервиса.
//
Функция ДанныеВФорматеОблачныхККТ(ПараметрыДокумента) Экспорт
	
	ПозицииЧека  = ПараметрыДокумента.ПозицииЧека;
	ТаблицаОплат = ПараметрыДокумента.ТаблицаОплат;
	
	ТипРасчета = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.КодРасчетаДенежнымиСредствами(ПараметрыДокумента.ТипРасчета);
	СистемаНалогообложения = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.КодСистемыНалогообложенияККТ(ПараметрыДокумента.СистемаНалогообложения);
	
	ПараметрыПробития = ПараметрыПробитияЧека();
	ПараметрыШапкиЧека = ПараметрыШапкиЧека();
	
	ПараметрыШапкиЧека.cashierName = ПараметрыДокумента.Кассир;
	Если Не ПустаяСтрока(ПараметрыДокумента.КассирИНН) Тогда 
		ПараметрыШапкиЧека.Вставить("cashierINN", ПараметрыДокумента.КассирИНН);
	КонецЕсли;
	ПараметрыШапкиЧека.operationType = ТипРасчета;
	ПараметрыШапкиЧека.taxationSystem = СистемаНалогообложения + 1;
	
	Если Не ПустаяСтрока(ПараметрыДокумента.ОтправительEmail) Тогда
		ПараметрыШапкиЧека.Вставить("senderEmail", ПараметрыДокумента.ОтправительEmail);
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(ПараметрыДокумента.АдресРасчетов) Тогда   
		ПараметрыШапкиЧека.Вставить("saleAddress", ПараметрыДокумента.АдресРасчетов);
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(ПараметрыДокумента.МестоРасчетов) Тогда  
		ПараметрыШапкиЧека.saleLocation = ПараметрыДокумента.МестоРасчетов;
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(ПараметрыДокумента.ПокупательEmail) Тогда  
		ПараметрыШапкиЧека.Вставить("customerEmail", СокрЛП(ПараметрыДокумента.ПокупательEmail));
	КонецЕсли;
	
	Если ПараметрыДокумента.Интернет Тогда
		ПараметрыШапкиЧека.Вставить("internetPayment", ПараметрыДокумента.Интернет);
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(ПараметрыДокумента.ЧасоваяЗона) И НЕ ПараметрыДокумента.ЧасоваяЗона = 0 Тогда
		ПараметрыШапкиЧека.Вставить("timeZone", ПараметрыДокумента.ЧасоваяЗона);
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(ПараметрыДокумента.ПокупательНомер) Тогда  
		ПокупательНомер = МенеджерОборудованияКлиентСервер.АбонентскийНомерФорматФФД(ПараметрыДокумента.ПокупательНомер);
		ПараметрыШапкиЧека.Вставить("customerPhone", ПокупательНомер);
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(ПараметрыДокумента.НомерАвтомата) Тогда
		ПараметрыШапкиЧека.Вставить("automatNumber", ПараметрыДокумента.НомерАвтомата);
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(ПараметрыДокумента.ПризнакАгента) Тогда
		
		ПризнакАгента = ОборудованиеЧекопечатающиеУстройстваРФКлиентСервер.КодПризнакаАгента(ПараметрыДокумента.ПризнакАгента);
		ПараметрыШапкиЧека.Вставить("agentType", ПризнакАгента);
		ДанныеАгента = ПараметрыДокумента.ДанныеАгента;
		ПараметрыАгента = ЗаполнитьДанныеАгента(ДанныеАгента);
		Если ЗначениеЗаполнено(ПараметрыАгента) Тогда
			ПараметрыШапкиЧека.Вставить("agentData", ПараметрыАгента);
		КонецЕсли;
	
	КонецЕсли;
	
	Если ПараметрыДокумента.Свойство("ДанныеКоррекции") Тогда
		ПараметрыКоррекции = ПараметрыКоррекции();
		ДанныеКоррекции = ПараметрыДокумента.ДанныеКоррекции;
		ТипКоррекции = ?(ПустаяСтрока(ДанныеКоррекции.ТипКоррекции), 0, ДанныеКоррекции.ТипКоррекции);   
		ПараметрыКоррекции.type = ТипКоррекции;
		Если Не ПустаяСтрока(ДанныеКоррекции.ДатаКоррекции) Тогда
			ПараметрыКоррекции.date = НачалоДня(ДанныеКоррекции.ДатаКоррекции);
		КонецЕсли;
		Если Не ПустаяСтрока(ДанныеКоррекции.НомерПредписания) Тогда
			ПараметрыКоррекции.number = ДанныеКоррекции.НомерПредписания;
		КонецЕсли;
		Если Не ПустаяСтрока(ДанныеКоррекции.ОписаниеКоррекции) Тогда
			ПараметрыКоррекции.description = ДанныеКоррекции.ОписаниеКоррекции;
		КонецЕсли;
		ПараметрыШапкиЧека.isCorrection = Истина;
		ПараметрыШапкиЧека.Вставить("correctionData", ПараметрыКоррекции);
	Иначе
		ПараметрыШапкиЧека.isCorrection = Ложь;
	КонецЕсли;
	
	Если ПараметрыДокумента.Свойство("ДанныеПоставщика") И НЕ ПустаяСтрока(ПараметрыДокумента.ДанныеПоставщика.Наименование) Тогда
		ПараметрыПоставщика = ЗаполнитьДанныеПоставщика(ПараметрыДокумента.ДанныеПоставщика);
		ПараметрыШапкиЧека.Вставить("vendorData", ПараметрыПоставщика);
	КонецЕсли;
	
	Если ПараметрыДокумента.Свойство("ОперационныйРеквизит") И Не ПустаяСтрока(ПараметрыДокумента.ОперационныйРеквизит.ИдентификаторОперации) Тогда
		ПараметрыОперационногоРеквизита = ПараметрыОперационногоРеквизита();
		ОперационныйРеквизит = ПараметрыДокумента.ОперационныйРеквизит;
		Если Не ПустаяСтрока(ОперационныйРеквизит.ДанныеОперации) Тогда
			ПараметрыОперационногоРеквизита.operationData = ОперационныйРеквизит.ДанныеОперации;
		КонецЕсли;
		Если Не ПустаяСтрока(ОперационныйРеквизит.ИдентификаторОперации) Тогда
			ПараметрыОперационногоРеквизита.operationID = ОперационныйРеквизит.ИдентификаторОперации
		КонецЕсли;
		Если Не ПустаяСтрока(ОперационныйРеквизит.ДатаВремяОперации) Тогда
			ПараметрыОперационногоРеквизита.dateTime = ОперационныйРеквизит.ДатаВремяОперации;
		КонецЕсли;
		ПараметрыШапкиЧека.Вставить("operationalAttribute", ПараметрыОперационногоРеквизита);
	КонецЕсли;
	
	Если ПараметрыДокумента.Свойство("ОтраслевойРеквизит") И Не ПустаяСтрока(ПараметрыДокумента.ОтраслевойРеквизит.ИдентификаторФОИВ) Тогда
		ПараметрыОтраслевогоРеквизита = ПараметрыОтраслевогоРеквизита();
		ОтраслевойРеквизит = ПараметрыДокумента.ОтраслевойРеквизит;
		Если Не ПустаяСтрока(ОтраслевойРеквизит.ИдентификаторФОИВ) Тогда
			ПараметрыОтраслевогоРеквизита.identifierFOIV = ОтраслевойРеквизит.ИдентификаторФОИВ;
		КонецЕсли;
		Если Не ПустаяСтрока(ОтраслевойРеквизит.ДатаДокументаОснования) Тогда
			ПараметрыОтраслевогоРеквизита.documentDate = ОтраслевойРеквизит.ДатаДокументаОснования
		КонецЕсли;
		Если Не ПустаяСтрока(ОтраслевойРеквизит.НомерДокументаОснования) Тогда
			ПараметрыОтраслевогоРеквизита.documentNumber = ОтраслевойРеквизит.НомерДокументаОснования;
		КонецЕсли;
		Если Не ПустаяСтрока(ОтраслевойРеквизит.ЗначениеРеквизита) Тогда
			ПараметрыОтраслевогоРеквизита.attributeValue = ОтраслевойРеквизит.ЗначениеРеквизита;
		КонецЕсли;
		ПараметрыШапкиЧека.Вставить("industryAttribute", ПараметрыОтраслевогоРеквизита);
	КонецЕсли;
	
	СведенияОПокупателе = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыПерсональныеДанныеПокупателя();
	МенеджерОборудованияВызовСервераПереопределяемый.ОбработкаЗаполненияПерсональныхДанных(СведенияОПокупателе, ПараметрыДокумента.СубъектПерсональныхДанных, 
		ПараметрыДокумента.ТипПерсональныхДанных, ПараметрыДокумента.ДатаВремя); 
	Если Не ПустаяСтрока(ПараметрыДокумента.СведенияОПокупателе.Покупатель) Тогда
		ЗаписатьСведенияОПокупателе(ПараметрыШапкиЧека, ПараметрыДокумента, СведенияОПокупателе);
	КонецЕсли;
	
	ПараметрыПробития.documentHeader = ПараметрыШапкиЧека;
	СуммаЧека = 0;
	
	Если ПараметрыДокумента.ПозицииЧека <> Неопределено Тогда
		Для Каждого ПозицияЧека Из ПараметрыДокумента.ПозицииЧека Цикл
			Если ПозицияЧека.Свойство("ФискальнаяСтрока") Тогда
				ПараметрыТовараЧека = ПараметрыТовараЧека();
				Если ПозицияЧека.ЦенаСоСкидками = 0 И ПозицияЧека.Сумма > 0 И ПозицияЧека.Количество > 0 Тогда
					ЦенаСоСкидками = Окр(ПозицияЧека.Сумма / ПозицияЧека.Количество, 2); 
				Иначе
					ЦенаСоСкидками = ПозицияЧека.ЦенаСоСкидками; 
				КонецЕсли;
				ПараметрыТовараЧека.name = Лев(ПозицияЧека.Наименование, 128); // Наименование товара.
				ПараметрыТовараЧека.quantity = ПозицияЧека.Количество; // Количество товара.
				ПараметрыТовараЧека.priceWithDiscount = ЦенаСоСкидками; // Цена единицы товара с учетом скидок/наценок.
				ПараметрыТовараЧека.amountWithDiscount = ПозицияЧека.Сумма; // Конечная сумма по позиции чека с учетом всех скидок/наценок.
				ПараметрыТовараЧека.VATRate = ?(ПустаяСтрока(ПозицияЧека.СтавкаНДС), Неопределено, ПозицияЧека.СтавкаНДС);
				ПараметрыТовараЧека.VATAmount = ПозицияЧека.СуммаНДС;
				СуммаЧека = СуммаЧека + ПозицияЧека.Сумма;
				
				Если ПозицияЧека.Свойство("ПризнакСпособаРасчета") И НЕ ПустаяСтрока(ПозицияЧека.ПризнакСпособаРасчета) Тогда
					ПризнакСпособаРасчета = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.КодПризнакаСпособаРасчета(ПозицияЧека.ПризнакСпособаРасчета);
					ПараметрыТовараЧека.paymentMethod = ПризнакСпособаРасчета;
				КонецЕсли;
				
				Если ПозицияЧека.Свойство("ПризнакПредметаРасчета") И НЕ ПустаяСтрока(ПозицияЧека.ПризнакПредметаРасчета) Тогда
					ПризнакСпособаРасчета = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.КодПризнакаПредметаРасчета(ПозицияЧека.ПризнакПредметаРасчета);
					ПараметрыТовараЧека.calculationSubject = ПризнакСпособаРасчета;
				КонецЕсли;
				
				Если ПозицияЧека.Свойство("ПризнакАгентаПоПредметуРасчета") И НЕ ПустаяСтрока(ПозицияЧека.ПризнакАгентаПоПредметуРасчета) Тогда
					ПризнакАгентаПоПредметуРасчета = ОборудованиеЧекопечатающиеУстройстваРФКлиентСервер.КодПризнакаАгента(ПозицияЧека.ПризнакАгентаПоПредметуРасчета);
					ПараметрыТовараЧека.Вставить("calculationAgent", ПризнакАгентаПоПредметуРасчета);
					ПараметрыАгента = ЗаполнитьДанныеАгента(ПозицияЧека.ДанныеАгента);
					Если ЗначениеЗаполнено(ПараметрыАгента) Тогда
						ПараметрыШапкиЧека.Вставить("agentData", ПараметрыАгента);
					КонецЕсли;
				КонецЕсли;
				
				Если ПозицияЧека.Свойство("ДанныеПоставщика") И НЕ ПустаяСтрока(ПозицияЧека.ДанныеПоставщика.Наименование) Тогда
					ПараметрыПоставщика = ЗаполнитьДанныеПоставщика(ПозицияЧека.ДанныеПоставщика);
					ПараметрыТовараЧека.Вставить("vendorData", ПараметрыПоставщика);
				КонецЕсли;
				
				Если ПозицияЧека.Свойство("КодЕдиницыИзмерения") И НЕ ПустаяСтрока(ПозицияЧека.КодЕдиницыИзмерения) Тогда
					МераКоличестваПредметаРасчета = ОборудованиеЧекопечатающиеУстройстваРФКлиентСервер.МераКоличестваПредметаРасчетаПоКодуЕдиницыИзмерения(ПозицияЧека.КодЕдиницыИзмерения);
					МераКоличестваПредметаРасчета = ОборудованиеЧекопечатающиеУстройстваРФКлиентСервер.КодМерыКоличестваПредметаРасчетаККТ(МераКоличестваПредметаРасчета);
					ПараметрыТовараЧека.measureOfQuantity = МераКоличестваПредметаРасчета;
				КонецЕсли;
				
				ДробноеКоличествоУказано = Ложь;
				ДробноеКоличество = ПозицияЧека.ДробноеКоличество;
				Если Не ПустаяСтрока(ДробноеКоличество.Числитель) И Не ПустаяСтрока(ДробноеКоличество.Знаменатель) Тогда
					Если Число(ДробноеКоличество.Числитель) > 0 И Число(ДробноеКоличество.Знаменатель) > 0 Тогда 
						ДробноеКоличествоУказано = Истина;
					КонецЕсли;
				КонецЕсли;
				
				Если ДробноеКоличествоУказано Тогда
					МераКоличестваПредметаРасчета = 0;
					ПараметрыТовараЧека.MeasureOfQuantity = МераКоличестваПредметаРасчета;
					ПараметрыДробногоКоличества = ПараметрыДробногоКоличества();
					ПараметрыДробногоКоличества.Numerator = ДробноеКоличество.Числитель;
					ПараметрыДробногоКоличества.Denominator = ДробноеКоличество.Знаменатель;
					ПараметрыТовараЧека.Вставить("fractionalQuantity", ПараметрыДробногоКоличества);
				Иначе
					Если ОборудованиеЧекопечатающиеУстройства.ВедетсяОбъемноСортовойУчет() И ПозицияЧека.ОбъемноСортовойУчет И Не ПустаяСтрока(ПозицияЧека.КоличествоВесовогоТовара) Тогда
						МераКоличестваПредметаРасчета = 11; // Килограмм
					Иначе
						МераКоличестваПредметаРасчета = ОборудованиеЧекопечатающиеУстройстваРФКлиентСервер.МераКоличестваПредметаРасчетаПоКодуЕдиницыИзмерения(ПозицияЧека.КодЕдиницыИзмерения);
						МераКоличестваПредметаРасчета = ОборудованиеЧекопечатающиеУстройстваРФКлиентСервер.КодМерыКоличестваПредметаРасчетаККТ(МераКоличестваПредметаРасчета);
					КонецЕсли;
					ПараметрыТовараЧека.measureOfQuantity = МераКоличестваПредметаРасчета;
				КонецЕсли;
				
				ЗаписатьДанныеКодаТоварнойНоменклатуры(ПараметрыТовараЧека, ПозицияЧека, ТипРасчета, ДробноеКоличествоУказано);
				
				Если Не ПустаяСтрока(ПозицияЧека.КонтрольнаяМарка) Тогда
					ПараметрыТовараЧека.Вставить("markingCode", ПозицияЧека.КонтрольнаяМарка);
				КонецЕсли;
				
				Если Не ПустаяСтрока(ПозицияЧека.ДополнительныйРеквизит) Тогда
					ПараметрыТовараЧека.Вставить("additionalAttribute", ПозицияЧека.ДополнительныйРеквизит);
				КонецЕсли;
				
				Если Не ПустаяСтрока(ПозицияЧека.СуммаАкциза) Тогда
					ПараметрыТовараЧека.Вставить("exciseAmount", ПозицияЧека.СуммаАкциза);
				КонецЕсли;
				
				Если Не ПустаяСтрока(ПозицияЧека.НомерТаможеннойДекларации) Тогда
					ПараметрыТовараЧека.Вставить("customsDeclaration", ПозицияЧека.НомерТаможеннойДекларации);
				КонецЕсли;
				
				Если Не ПустаяСтрока(ПозицияЧека.КодСтраныПроисхожденияТовара) Тогда
					ПараметрыТовараЧека.Вставить("countryOfOrigin", ПозицияЧека.КодСтраныПроисхожденияТовара);
				КонецЕсли;
				
				Если ПозицияЧека.Свойство("ОтраслевойРеквизит") И Не ПустаяСтрока(ПозицияЧека.ОтраслевойРеквизит.ИдентификаторФОИВ) Тогда
					ПараметрыОтраслевогоРеквизита = ПараметрыОтраслевогоРеквизита();
					ОтраслевойРеквизит = ПозицияЧека.ОтраслевойРеквизит;
					Если Не ПустаяСтрока(ОтраслевойРеквизит.ИдентификаторФОИВ) Тогда
						ПараметрыОтраслевогоРеквизита.identifierFOIV = ОтраслевойРеквизит.ИдентификаторФОИВ;
					КонецЕсли;
					Если Не ПустаяСтрока(ОтраслевойРеквизит.ДатаДокументаОснования) Тогда
						ПараметрыОтраслевогоРеквизита.documentDate = ОтраслевойРеквизит.ДатаДокументаОснования
					КонецЕсли;
					Если Не ПустаяСтрока(ОтраслевойРеквизит.НомерДокументаОснования) Тогда
						ПараметрыОтраслевогоРеквизита.documentNumber = ОтраслевойРеквизит.НомерДокументаОснования;
					КонецЕсли;
					Если Не ПустаяСтрока(ОтраслевойРеквизит.ЗначениеРеквизита) Тогда
						ПараметрыОтраслевогоРеквизита.attributeValue = ОтраслевойРеквизит.ЗначениеРеквизита;
					КонецЕсли;
					ПараметрыТовараЧека.Вставить("industryAttribute", ПараметрыОтраслевогоРеквизита);
				КонецЕсли;
				
				ПараметрыПробития.items.Добавить(ПараметрыТовараЧека);
				
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	// Таблица оплат
	СуммаОплатЧека = 0;
	СуммаНаличные       = 0;
	СуммаЭлектронно     = 0;
	СуммаПредоплата     = 0;
	СуммаПостоплата     = 0;
	СуммаПредоставление = 0;
	ИндексОплатыНаличными = Неопределено;
	
	Если ТаблицаОплат <> Неопределено Тогда
		ПараметрыОплатЧека = ПараметрыОплатЧека();
		
		Для ИндексОплаты = 0 По ТаблицаОплат.Количество() - 1 Цикл
			Если ТаблицаОплат[ИндексОплаты].ТипОплаты = Перечисления.ТипыОплатыККТ.Электронно Тогда
				СуммаЭлектронно = СуммаЭлектронно + ТаблицаОплат[ИндексОплаты].Сумма;
			ИначеЕсли ТаблицаОплат[ИндексОплаты].ТипОплаты = Перечисления.ТипыОплатыККТ.Предоплата Тогда
				СуммаПредоплата = СуммаПредоплата + ТаблицаОплат[ИндексОплаты].Сумма;
			ИначеЕсли ТаблицаОплат[ИндексОплаты].ТипОплаты = Перечисления.ТипыОплатыККТ.Постоплата Тогда
				СуммаПостоплата = СуммаПостоплата + ТаблицаОплат[ИндексОплаты].Сумма;
			ИначеЕсли ТаблицаОплат[ИндексОплаты].ТипОплаты = Перечисления.ТипыОплатыККТ.ВстречноеПредоставление Тогда
				СуммаПредоставление = СуммаПредоставление + ТаблицаОплат[ИндексОплаты].Сумма;
			Иначе
				СуммаНаличные = СуммаНаличные + ТаблицаОплат[ИндексОплаты].Сумма;
				ИндексОплатыНаличными = ИндексОплаты;
			КонецЕсли;
		КонецЦикла;
		СуммаОплатЧека = СуммаЭлектронно + СуммаПредоплата + СуммаПостоплата + СуммаПредоставление + СуммаНаличные;
		
		ПараметрыОплатЧека.cash        = СуммаНаличные;
		ПараметрыОплатЧека.electronic  = СуммаЭлектронно;
		ПараметрыОплатЧека.barter      = СуммаПредоставление;
		ПараметрыОплатЧека.postPayment = СуммаПостоплата;
		ПараметрыОплатЧека.prePayment  = СуммаПредоплата;
		
		ЗаполнитьЗначенияСвойств(ПараметрыПробития.payments, ПараметрыОплатЧека);
		
	КонецЕсли;
	
	Если СуммаОплатЧека > СуммаЧека Тогда
		
		РазницаСумм = (СуммаОплатЧека - СуммаЧека);
		
		Если СуммаНаличные > РазницаСумм Тогда
			СуммаНаличные = СуммаНаличные - РазницаСумм;
			Если ИндексОплатыНаличными <> Неопределено Тогда
				ТаблицаОплат[ИндексОплатыНаличными].Сумма = СуммаНаличные;
			КонецЕсли;
		КонецЕсли;
		
		ПараметрыПробития.payments.cash = СуммаНаличные;
		
	КонецЕсли;
	
	Возврат ПараметрыПробития;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция СтатусКассы(ИдентификаторОборудования) Экспорт
	
	МодульОблачныхКасс = ОбщегоНазначенияБПО.ОбщийМодуль("ОблачныеКассы");
	Возврат МодульОблачныхКасс.СостояниеКассы(ИдентификаторОборудования);
	
КонецФункции

Функция ПробитьЧек(ДокументОперации, ИдентификаторОборудования, ПараметрыДокумента) Экспорт
	
	РезультатФискализацииЧека = ФискализацияЧека(ДокументОперации, ИдентификаторОборудования, ПараметрыДокумента);
	
	Если РезультатФискализацииЧека.Свойство("РезультатПроверкиФЛК") Тогда
		
		РезультатВыполнения = МенеджерОборудованияКлиентСервер.ПараметрыВыполненияОперацииНаОборудовании(РезультатФискализацииЧека, РезультатФискализацииЧека.ТекстОшибки, 
			ИдентификаторОборудования);
		
		#Если НЕ МобильноеПриложениеСервер Тогда
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Ошибка форматно логического контроля при пробитии чека облачной кассы.'",
			ОбщегоНазначенияБПО.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,
			ДокументОперации,,
			РезультатФискализацииЧека.ТекстОшибки);
		#КонецЕсли
		
		ОбщегоНазначенияБПО.СообщитьПользователю(СтрШаблон(НСтр("ru = 'Ошибка форматно логического контроля при пробитии чека облачной кассы. %1. Подробнее в журнале регистрации'"), 
			РезультатФискализацииЧека.ТекстОшибки));
		
		Возврат РезультатВыполнения;
		
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИдентификаторУстройства", ИдентификаторОборудования);
	ДополнительныеПараметры.Вставить("ПараметрыОперации", ПараметрыДокумента);
	
	РезультатВыполненияОперации = РезультатВыполненияОперации(РезультатФискализацииЧека, ДополнительныеПараметры);
	ОбработатьРезультатФискализации(РезультатВыполненияОперации, ПараметрыДокумента);
	
	Возврат РезультатФискализацииЧека;
	
КонецФункции

// Выполняет фискализацию чека
// 
// Параметры:
//  ДокументОперации - ОпределяемыйТип.ОснованиеФискальнойОперацииБПО
//  ИдентификаторОборудования - СправочникСсылка.ПодключаемоеОборудование 
//  ПараметрыДокумента - см. ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыОперацииФискализацииЧека
//
// Возвращаемое значение:
//  Структура    
Функция ФискализацияЧека(ДокументОперации, ИдентификаторОборудования, ПараметрыДокумента) Экспорт
	
	СтандартнаяОбработка = Истина;
	ОборудованиеЧекопечатающиеОблачныеККТПереопределяемый.ДополнитьДанныеДляОблачнойККТ(ПараметрыДокумента, СтандартнаяОбработка);
	
	ОписаниеОшибки = "";
	СтруктураПроверкиФЛК = Новый Структура;
	Если ОбщегоНазначенияБПО.ИспользуетсяФорматноЛогическийКонтроль() Тогда
		МодульФорматноЛогическийКонтроль = ОбщегоНазначенияБПО.ОбщийМодуль("ФорматноЛогическийКонтроль");
		Если НЕ МодульФорматноЛогическийКонтроль.ВыполненаПроверкаОбязательностиИПравильностиЗаполненияТэгов(ПараметрыДокумента, 
			ИдентификаторОборудования, ОписаниеОшибки) Тогда
			СтруктураПроверкиФЛК.Вставить("РезультатПроверкиФЛК", Ложь);
			СтруктураПроверкиФЛК.Вставить("ТекстОшибки", ОписаниеОшибки);
			Возврат СтруктураПроверкиФЛК;
		КонецЕсли;
		МодульФорматноЛогическийКонтроль.ПривестиДанныеКТребуемомуФормату(ПараметрыДокумента);
	КонецЕсли;
	
	ПараметрыПробития = ДанныеВФорматеОблачныхККТ(ПараметрыДокумента);
	
	МодульОблачныхКасс = ОбщегоНазначенияБПО.ОбщийМодуль("ОблачныеКассы");
	Возврат МодульОблачныхКасс.ПробитьЧек(ДокументОперации, ИдентификаторОборудования, ПараметрыПробития);
	
КонецФункции

Процедура ПолучитьСтатусПробитияЧека(ДокументОперации, ДополнительныеПараметры) Экспорт
	
	РезультатПроверкиСтатуса = СтатусПробитияЧека(ДокументОперации);
	РезультатВыполненияОперации = РезультатВыполненияОперации(РезультатПроверкиСтатуса, ДополнительныеПараметры);
	ОбработатьРезультатФискализации(РезультатВыполненияОперации, ДополнительныеПараметры.ПараметрыОперации);
	
КонецПроцедуры 

Процедура ПриЗаписиДанныхФискализацииЗаказа(ПараметрыФискализации) Экспорт
	
	ДанныеВФорматеБПО = ДанныеВФорматеБПОПоДаннымОблачнойККТ(ПараметрыФискализации);
	
	ДанныеВФорматеБПО.ДокументОснование = ПараметрыФискализации.ДокументОперации;
	ДанныеВФорматеБПО.ОблачнаяККТ = Истина;
	РаспределеннаяФискализация.ДобавитьЧекВОчередьЧековККТ(ДанныеВФорматеБПО, Неопределено, Ложь);
	
КонецПроцедуры

// Выполняет фискализацию чека
// 
// Параметры:
//  ДокументОперации - ОпределяемыйТип.ОснованиеФискальнойОперацииБПО
//  ИдентификаторОборудования - СправочникСсылка.ПодключаемоеОборудование 
//  ПараметрыДокумента - см. ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыОперацииФискализацииЧека
//
// Возвращаемое значение:
//  Структура    
Функция НачатьПроверкуКМПИоТ(ИдентификаторОборудования, ПараметрыПроверкиМарок) Экспорт
	
	ПараметрыПроверкиМарокВПИоТ = Новый Структура;
	
	МассивДляПроверкиМарок = Новый Массив;
	Для Каждого Марка Из ПараметрыПроверкиМарок Цикл
		
		СтруктураМаркиДляПроверки = Новый Структура;
		СтруктураМаркиДляПроверки.Вставить("code", Марка.ПолныйКодМаркировки);
		Если Марка.Свойство("ИдентификаторГруппы") Тогда
			СтруктураМаркиДляПроверки.Вставить("groupId", Марка.ИдентификаторГруппы);
		КонецЕсли;
		МассивДляПроверкиМарок.Добавить(СтруктураМаркиДляПроверки);
		
	КонецЦикла;
	
	МодульОблачныхКасс = ОбщегоНазначенияБПО.ОбщийМодуль("ОблачныеКассы");
	РезультатПроверки = МодульОблачныхКасс.НачатьПроверкуКМПИоТ(ИдентификаторОборудования, ПараметрыПроверкиМарок);
	
	РезультатПроверкиОбработанный = ПривестиРезультатКФорматуГОСИС(РезультатПроверки);
	
	Возврат РезультатПроверкиОбработанный;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция РезультатВыполненияОперации(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат.ДанныеОперации.СтатусОперации = "Выполняется"
		Или Результат.ДанныеОперации.СтатусОперации = "Выполнена" Тогда
		РезультатПробития = Истина;
	Иначе
		РезультатПробития = Ложь;
	КонецЕсли;
	
	СтатусОперации = Результат.ДанныеОперации.СтатусОперации;
	РезультатВыполнения = МенеджерОборудованияКлиентСервер.ПараметрыВыполненияОперацииНаОборудовании(РезультатПробития, Неопределено, ДополнительныеПараметры.ИдентификаторУстройства);
	РезультатВыполнения.СтатусВОблачнойКассе = Результат.ДанныеОперации.СтатусОперации;
	
	Если Не РезультатПробития Тогда
		
		РезультатВыполнения.Вставить("ОписаниеОшибки", Результат.СообщениеОбОшибке);
		
	#Если НЕ МобильноеПриложениеСервер Тогда
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Запись статуса чека в очереди'",
			ОбщегоНазначенияБПО.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,
			ДополнительныеПараметры.ПараметрыОперации.ДокументОснование,,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	#КонецЕсли
		
	Иначе
		
		Если Результат.ДанныеОперации.СтатусОперации = "Выполнена" Тогда
			
			ПараметрыФискализацииXML = ОборудованиеЧекопечатающиеУстройства.ПараметрыФискализацииЧека();
			ВерсияФФДККТ11 = "1.2"; // Признак ФФД 1.1
			
			ПараметрыФискализацииXML.РегистрационныйНомерККТ = "";
			ПараметрыФискализацииXML.ЗаводскойНомерФН  = "";
			ПараметрыФискализацииXML.ШиринаСтроки      = 0;
			ПараметрыФискализацииXML.РевизияИнтерфейса = 4004;
			ПараметрыФискализацииXML.ДокументОснование = ДополнительныеПараметры.ПараметрыОперации.ДокументОснование;
			ПараметрыФискализацииXML.ИдентификаторФискальнойЗаписи = ДополнительныеПараметры.ПараметрыОперации.ИдентификаторФискальнойЗаписи;
			ПараметрыФискализацииXML.Организация       = ДополнительныеПараметры.ПараметрыОперации.Организация;
			ПараметрыФискализацииXML.ТорговыйОбъект    = ДополнительныеПараметры.ПараметрыОперации.ТорговыйОбъект;
			ПараметрыФискализацииXML.ДополнительныйРеквизит = ДополнительныеПараметры.ПараметрыОперации.ДополнительныйРеквизит;  
			ПараметрыФискализацииXML.СубъектПерсональныхДанных = ДополнительныеПараметры.ПараметрыОперации.СубъектПерсональныхДанных;
			ПараметрыФискализацииXML.ЕстьПерсональныеДанные    = ДополнительныеПараметры.ПараметрыОперации.ЕстьПерсональныеДанные;
			ПараметрыФискализацииXML.Кассир       = ДополнительныеПараметры.ПараметрыОперации.Кассир;
			ПараметрыФискализацииXML.КассирИНН    = ДополнительныеПараметры.ПараметрыОперации.КассирИНН;
			ПараметрыФискализацииXML.Электронно   = ДополнительныеПараметры.ПараметрыОперации.Электронно;
			ПараметрыФискализацииXML.Отправляет1СSMS   = ДополнительныеПараметры.ПараметрыОперации.Отправляет1СSMS;
			ПараметрыФискализацииXML.ВерсияФФДККТ11    = ВерсияФФДККТ11;
			ПараметрыФискализацииXML.ЕдиныйЧек         = ДополнительныеПараметры.ПараметрыОперации.ЕдиныйЧек;
			ПараметрыФискализацииXML.ТипДокумента = Перечисления.ТипыФискальныхДокументовККТ.КассовыйЧек;
			
			ОборудованиеЧекопечатающиеУстройства.СформироватьXMLПакетДляФискализацияЧека(ДополнительныеПараметры.ПараметрыОперации, ПараметрыФискализацииXML);
			
			РезультатОперации = Результат.Результат;
			
			РезультатВыполнения.Вставить("НомерСменыККТ" , РезультатОперации.shiftNumber);
			РезультатВыполнения.Вставить("НомерЧекаККТ"  , РезультатОперации.receiptNumber);
			РезультатВыполнения.Вставить("СтатусСмены", 2);
			РезультатВыполнения.Вставить("ДатаВремяЧека"          , ПреобразоватьДату(РезультатОперации.receiptDate));
			РезультатВыполнения.Вставить("ФискальныйПризнак"      , РезультатОперации.FNSign);
			РезультатВыполнения.Вставить("АдресСайтаПроверки"     , РезультатОперации.addressSiteInspections);
			РезультатВыполнения.Вставить("РегистрационныйНомерККТ", РезультатОперации.KKTSerialNumber);
			РезультатВыполнения.Вставить("ОперацияЗаписана"       , Истина);
			РезультатВыполнения.Вставить("НомерФискальногоНакопителя"       , РезультатОперации.FNSerialNumber); 
			РезультатВыполнения.Вставить("ДанныеXML", ПараметрыФискализацииXML.ДанныеЧекаXML);
			
			Попытка
				// Записать фискальную операцию.
				ОборудованиеЧекопечатающиеОблачныеККТВызовСервера.ЗаписатьФискальнуюОперацию(ДополнительныеПараметры.ПараметрыОперации, РезультатВыполнения);
			Исключение
				РезультатВыполнения.ОперацияЗаписана = Ложь;
			КонецПопытки;
			
		Иначе
			РезультатВыполнения.Вставить("ПараметрыОперации", ДополнительныеПараметры.ПараметрыОперации);
			РезультатВыполнения.Вставить("ИдентификаторУстройства", ДополнительныеПараметры.ИдентификаторУстройства);
		КонецЕсли;
		
	КонецЕсли;
	
	РаспределеннаяФискализацияПереопределяемый.ОбработатьСтатусПостановкиЧекаВОблачныйСервис(ДополнительныеПараметры.ПараметрыОперации.ДокументОснование, СтатусОперации, ДополнительныеПараметры.ПараметрыОперации, Результат.СообщениеОбОшибке);
	
	Возврат РезультатВыполнения;
	
КонецФункции

Процедура ОбработатьРезультатФискализации(РезультатВыполнения, ОбщиеПараметры) Экспорт
	
	Если РезультатВыполнения.Результат И РезультатВыполнения.СтатусВОблачнойКассе = "Выполняется" Тогда
		СтатусОперацииВСервисе = Перечисления.СтатусыОперацийВСервисеОблачныхКасс.Выполняется; 
		СтатусЧека = ПредопределенноеЗначение("Перечисление.СтатусЧекаККТВОчереди.Фискализируется");
	ИначеЕсли РезультатВыполнения.Результат И РезультатВыполнения.СтатусВОблачнойКассе = "Выполнена" Тогда
		СтатусОперацииВСервисе = Перечисления.СтатусыОперацийВСервисеОблачныхКасс.Выполнена;
		СтатусЧека = ПредопределенноеЗначение("Перечисление.СтатусЧекаККТВОчереди.Фискализирован");
		ТекстСообщения = "";
	ИначеЕсли РезультатВыполнения.Результат И РезультатВыполнения.СтатусВОблачнойКассе = "" Тогда
		СтатусОперацииВСервисе = Перечисления.СтатусыОперацийВСервисеОблачныхКасс.ПустаяСсылка();
		СтатусЧека = ПредопределенноеЗначение("Перечисление.СтатусЧекаККТВОчереди.Фискализирован");
		ТекстСообщения = "";
	Иначе
		СтатусОперацииВСервисе = Перечисления.СтатусыОперацийВСервисеОблачныхКасс.Ошибка;
		СтатусЧека = ПредопределенноеЗначение("Перечисление.СтатусЧекаККТВОчереди.Ошибка");
		ТекстСообщения = РезультатВыполнения.ОписаниеОшибки;
	КонецЕсли;
	
	Если РезультатВыполнения.Свойство("ДополнительныеПараметры") Тогда
		ОбщиеПараметры.Вставить("ДополнительныеПараметры", РезультатВыполнения.ДополнительныеПараметры);
	КонецЕсли;
	
	РаспределеннаяФискализация.ЗаписатьСтатусЧекаВОчереди(ОбщиеПараметры, СтатусЧека, Неопределено, ТекстСообщения, СтатусОперацииВСервисе);
	
КонецПроцедуры

Функция ЗаполнитьДанныеАгента(ДанныеАгента) 
	
	ПараметрыАгента = Новый Структура();
	Если Не ПустаяСтрока(ДанныеАгента.ПлатежныйАгент.Операция) Тогда // Операция платежного агента
		ПараметрыАгента.Вставить("agentOperation", ДанныеАгента.ПлатежныйАгент.Операция);
	КонецЕсли;
	Если Не ПустаяСтрока(ДанныеАгента.ПлатежныйАгент.Телефон) Тогда // Телефон платежного агента            
		Телефон = МенеджерОборудованияКлиентСервер.АбонентскийНомерФорматФФД(ДанныеАгента.ПлатежныйАгент.Телефон);
		ПараметрыАгента.Вставить("agentPhone", Телефон);
	КонецЕсли;
	Если Не ПустаяСтрока(ДанныеАгента.ОператорПоПриемуПлатежей.Телефон) Тогда // Телефон оператора по приему платежей         
		Телефон = МенеджерОборудованияКлиентСервер.АбонентскийНомерФорматФФД(ДанныеАгента.ОператорПоПриемуПлатежей.Телефон);
		ПараметрыАгента.Вставить("paymentProcessorPhone", Телефон);
	КонецЕсли;
	Если Не ПустаяСтрока(ДанныеАгента.ОператорПеревода.Телефон) Тогда // Телефон оператора перевода           
		Телефон = МенеджерОборудованияКлиентСервер.АбонентскийНомерФорматФФД(ДанныеАгента.ОператорПеревода.Телефон);
		ПараметрыАгента.Вставить("acquirerOperatorPhone", Телефон);
	КонецЕсли;
	Если Не ПустаяСтрока(ДанныеАгента.ОператорПеревода.Наименование) Тогда // Наименование оператора перевода
		ПараметрыАгента.Вставить("acquirerOperatorName", ДанныеАгента.ОператорПеревода.Наименование);
	КонецЕсли;
	Если Не ПустаяСтрока(ДанныеАгента.ОператорПеревода.Адрес) Тогда // Адрес оператора перевода
		ПараметрыАгента.Вставить("acquirerOperatorAddress", ДанныеАгента.ОператорПеревода.Адрес);
	КонецЕсли;
	Если Не ПустаяСтрока(ДанныеАгента.ОператорПеревода.ИНН) Тогда // ИНН оператора перевода
		ПараметрыАгента.Вставить("acquirerOperatorINN", ДанныеАгента.ОператорПеревода.ИНН);
	КонецЕсли;
	
	Если ПараметрыАгента.Количество() = 0 Тогда
		ПараметрыАгента = Неопределено;
	КонецЕсли;
	
	Возврат ПараметрыАгента;
	
КонецФункции

Функция ЗаполнитьДанныеПоставщика(ДанныеПоставщика) 
	
	ПараметрыПоставщика = Новый Структура;
	Если Не ПустаяСтрока(ДанныеПоставщика.Телефон) Тогда // Телефон поставщика      
		Телефон = МенеджерОборудованияКлиентСервер.АбонентскийНомерФорматФФД(ДанныеПоставщика.Телефон);
		ПараметрыПоставщика.Вставить("phone", Телефон);
	КонецЕсли;
	Если Не ПустаяСтрока(ДанныеПоставщика.Наименование) Тогда // Наименование поставщика
		ПараметрыПоставщика.Вставить("name", ДанныеПоставщика.Наименование);
	КонецЕсли;
	Если Не ПустаяСтрока(ДанныеПоставщика.ИНН) Тогда // ИНН поставщика
		ПараметрыПоставщика.Вставить("INN", ДанныеПоставщика.ИНН);
	КонецЕсли;
	
	Возврат ПараметрыПоставщика;
	
КонецФункции

Процедура ЗаписатьСведенияОПокупателе(ПараметрыШапкиЧека, ПараметрыДокумента, СведенияОПокупателе);
	
	ПараметрыПокупателя = Новый Структура;
	
	ТипПерсональныхДанных = ПараметрыДокумента.ТипПерсональныхДанных;
	Покупатель = ПараметрыДокумента.СведенияОПокупателе.Покупатель;
	Если ПустаяСтрока(Покупатель) Тогда
		Покупатель = ПараметрыДокумента.Получатель;
	КонецЕсли;
	
	Если СведенияОПокупателе <> Неопределено И ТипПерсональныхДанных <> Неопределено И ТипПерсональныхДанных = Перечисления.ТипыПерсональныхДанныхККТ.ИНН Тогда
		ПокупательИНН = СведенияОПокупателе.ИНН
	Иначе
		ПокупательИНН = ПараметрыДокумента.СведенияОПокупателе.ПокупательИНН;
	КонецЕсли;
	
	Если ПустаяСтрока(ПокупательИНН) Тогда
		ПокупательИНН = ПараметрыДокумента.ПолучательИНН;
	КонецЕсли;
	
	Если Не ПустаяСтрока(Покупатель) Тогда
		ПараметрыПокупателя.Вставить("Info", Покупатель);
	КонецЕсли;
	Если Не ПустаяСтрока(ПокупательИНН) Тогда
		ПараметрыПокупателя.Вставить("INN", ПокупательИНН);
	КонецЕсли;
	Если Не ПустаяСтрока(ПараметрыДокумента.СведенияОПокупателе.ПокупательАдрес) Тогда
		ПараметрыПокупателя.Вставить("Address", ПараметрыДокумента.СведенияОПокупателе.ПокупательАдрес);
	КонецЕсли;
	
	Если СведенияОПокупателе <> Неопределено И ТипПерсональныхДанных <> Неопределено И ТипПерсональныхДанных = Перечисления.ТипыПерсональныхДанныхККТ.ПаспортныеДанные Тогда
		
		Если Не ПустаяСтрока(СведенияОПокупателе.Гражданство) Тогда
			ПараметрыПокупателя.Вставить("Citizenship", СведенияОПокупателе.Гражданство);
		КонецЕсли;
		
		Если Не ПустаяСтрока(СведенияОПокупателе.ВидДокумента) Тогда
			ВидДокумента = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.КодВидДокументаУдостоверяющегоЛичность(СведенияОПокупателе.ВидДокумента);
			ПараметрыПокупателя.Вставить("DocumentTypeCode", ВидДокумента);
		КонецЕсли;
		
		Если Не ПустаяСтрока(СведенияОПокупателе.ДанныеДокумента) Тогда
			ПараметрыПокупателя.Вставить("DocumentData", СведенияОПокупателе.ДанныеДокумента);
		КонецЕсли;
		
		Если Не ПустаяСтрока(СведенияОПокупателе.ДатаРождения) Тогда
			// АПК: 1367-выкл, АПК: СведенияОПокупателе-выкл особенность локального законодательства
			ДатаРождения = Формат(СведенияОПокупателе.ДатаРождения, "ДФ=""дд.ММ.гггг""");
			// АПК: 1367-вкл, АПК: 335-вкл 
			ПараметрыПокупателя.Вставить("DateOfBirth", ДатаРождения);
		КонецЕсли;
		
	КонецЕсли;
	
	ПараметрыШапкиЧека.Вставить("customerDetail" ,ПараметрыПокупателя);
	
КонецПроцедуры

Процедура ЗаписатьДанныеКодаТоварнойНоменклатуры(ПараметрыТовараЧека, Позиция, ТипРасчета, ДробноеКоличество);
	
	ДанныеКодаТоварнойНоменклатуры = Позиция.ДанныеКодаТоварнойНоменклатуры;
	ДанныеКодаТовара = Неопределено;
	
	МодульМенеджерОборудованияМаркировка = ОбщегоНазначенияБПО.ОбщийМодуль("МенеджерОборудованияМаркировка");
	Если НЕ ПустаяСтрока(Позиция.КодВидаНоменклатурнойКлассификации) Тогда
		ДанныеКодаТовара = МодульМенеджерОборудованияМаркировка.РазобратьШтриховойКодТовара(Позиция.КодВидаНоменклатурнойКлассификации);
	ИначеЕсли НЕ ПустаяСтрока(Позиция.ШтрихкодBase64) Тогда
		ДанныеКодаТовара = МодульМенеджерОборудованияМаркировка.РазобратьШтриховойКодТовара(Позиция.ШтрихкодBase64, Истина);
	Иначе
		ДанныеКодаТовара = МодульМенеджерОборудованияМаркировка.РазобратьШтриховойКодТовара(Позиция.Штрихкод);
	КонецЕсли;
	
	ТипыИдентификаторов = МенеджерОборудованияМаркировка.КодТовараЗаполняетсяДляТиповИдентификаторов();
	
	Если НЕ ПустаяСтрока(ДанныеКодаТовара.ШтрихкодBase64) Тогда // Запись тега 1163
		Если ПустаяСтрока(Позиция.КонтрольнаяМарка) И ТипыИдентификаторов.Найти(ДанныеКодаТовара.ТипИдентификатораТовара)<> Неопределено Тогда
			ПараметрыКодаТовара = Новый Структура;
			Если ДанныеКодаТовара.ТипИдентификатораТовара = Перечисления.ТипыИдентификаторовТовараККТ.ИзделияИзНатуральногоМеха Тогда
				ПараметрыКодаТовара.Вставить(ДанныеКодаТовара.НаименованиеРеквизита, МенеджерОборудованияКлиентСервер.Base64ВШтрихкод(ДанныеКодаТовара.ШтрихкодBase64));
				// Заполнение отраслевых реквизитов в соответствии с требованиями ЦРПТ по ТипИдентификатораТовара
				МенеджерОборудованияМаркировка.ЗаполнитьОтраслевойРеквизитИзделияИзНатуральногоМеха(Позиция);
			ИначеЕсли ДанныеКодаТовара.ТипИдентификатораТовара = Перечисления.ТипыИдентификаторовТовараККТ.КодТовараНеРаспознан Тогда
				ПараметрыКодаТовара.Вставить(ДанныеКодаТовара.НаименованиеРеквизита, ДанныеКодаТовара.EAN);
			Иначе
				ШтрихкодBase64 = МенеджерОборудованияМаркировка.ШтрихкодДляТега1163Base64(ДанныеКодаТовара);
				НаименованиеРеквизита = СтрЗаменить(ДанныеКодаТовара.НаименованиеРеквизита,".","_");
				ПараметрыКодаТовара.Вставить(НаименованиеРеквизита, ШтрихкодBase64);
			КонецЕсли;
			ПараметрыТовараЧека.Вставить("goodCodeData", ПараметрыКодаТовара);
		КонецЕсли;
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(ПараметрыКодаТовара) ИЛИ НЕ ПустаяСтрока(Позиция.КонтрольнаяМарка) Тогда
		
		Если ТипРасчета = 1 Тогда
			Если ДробноеКоличество Тогда
				ПланируемыйСтатусТовара = 2;
			Иначе
				ПланируемыйСтатусТовара = 1;
			КонецЕсли;
		ИначеЕсли ТипРасчета = 2 Тогда
			Если ДробноеКоличество Тогда
				ПланируемыйСтатусТовара = 4;
			Иначе
				ПланируемыйСтатусТовара = 3;
			КонецЕсли;
		КонецЕсли;
		ПараметрыТовараЧека.Вставить("plannedStatus", ПланируемыйСтатусТовара);
		
	КонецЕсли;
	
	Если ДанныеКодаТовара.ТипИдентификатораТовара = Перечисления.ТипыИдентификаторовТовараККТ.КодТовараВФорматеDataMatrixGS1 И ДанныеКодаТовара.ТехническийКод Тогда
		МенеджерОборудованияМаркировка.ЗаполнитьОтраслевойРеквизитМолочнаяПродукцияСНечитаемымиКМ(Позиция);
	КонецЕсли;
	
КонецПроцедуры

// Функция возвращает дату в формате UNIX-даты с добавлением смещения по часовому поясу.
//
// Параметры:
//  НеформатированнаяДата - Строка
//
// Возвращаемое значение:
//  Дата 
Функция ПреобразоватьДату(НеформатированнаяДата) Экспорт
	
	НеформатированнаяДата = СтрЗаменить(НеформатированнаяДата, "-", "");
	НеформатированнаяДата = СтрЗаменить(НеформатированнаяДата, ":", "");
	НеформатированнаяДата = СтрЗаменить(НеформатированнаяДата, "T", "");
	НеформатированнаяДата = Лев(СокрЛП(НеформатированнаяДата), СтрДлина(СокрЛП(НеформатированнаяДата))); 
	ФорматированнаяДата = Дата(НеформатированнаяДата);
	
	Возврат ФорматированнаяДата;
	
КонецФункции

#Область Конструкторы

Функция ПараметрыПробитияЧека()
	
	ПараметрыПробитияЧека = Новый Структура;
	ПараметрыПробитияЧека.Вставить("documentHeader", ПараметрыШапкиЧека());
	ПараметрыПробитияЧека.Вставить("items",          Новый Массив);
	ПараметрыПробитияЧека.Вставить("payments",       ПараметрыОплатЧека());
	
	Возврат ПараметрыПробитияЧека;
	
КонецФункции

Функция ПараметрыШапкиЧека()
	
	ПараметрыШапкиЧека = Новый Структура;
	ПараметрыШапкиЧека.Вставить("cashierName", "");
	ПараметрыШапкиЧека.Вставить("operationType", 1);
	ПараметрыШапкиЧека.Вставить("isCorrection", Ложь);
	ПараметрыШапкиЧека.Вставить("taxationSystem", 0);
	ПараметрыШапкиЧека.Вставить("saleLocation", "");
	
	Возврат ПараметрыШапкиЧека;
	
КонецФункции

Функция ПараметрыКоррекции()
	
	ПараметрыКоррекции = Новый Структура;
	ПараметрыКоррекции.Вставить("type", 0);
	ПараметрыКоррекции.Вставить("number", "");
	ПараметрыКоррекции.Вставить("description", "");
	ПараметрыКоррекции.Вставить("date", Дата(2024,10,10));
	
	Возврат ПараметрыКоррекции;
	
КонецФункции

Функция ПараметрыОтраслевогоРеквизита()
	
	ПараметрыОтраслевогоРеквизита = Новый Структура;
	ПараметрыОтраслевогоРеквизита.Вставить("identifierFOIV", "");
	ПараметрыОтраслевогоРеквизита.Вставить("documentDate", Дата(1,1,1));
	ПараметрыОтраслевогоРеквизита.Вставить("documentNumber", "");
	ПараметрыОтраслевогоРеквизита.Вставить("attributeValue", "");
	
	Возврат ПараметрыОтраслевогоРеквизита;
	
КонецФункции

Функция ПараметрыОперационногоРеквизита()
	
	ПараметрыОперационногоРеквизита = Новый Структура;
	ПараметрыОперационногоРеквизита.Вставить("dateTime", Дата(1,1,1));
	ПараметрыОперационногоРеквизита.Вставить("operationID", "");
	ПараметрыОперационногоРеквизита.Вставить("operationData", "");
	
	Возврат ПараметрыОперационногоРеквизита;
	
КонецФункции

Функция ПараметрыТовараЧека()
	
	ПараметрыТовараЧека = Новый Структура;
	ПараметрыТовараЧека.Вставить("name", "");
	ПараметрыТовараЧека.Вставить("quantity", 1);
	ПараметрыТовараЧека.Вставить("priceWithDiscount", 0);
	ПараметрыТовараЧека.Вставить("amountWithDiscount", 0);
	ПараметрыТовараЧека.Вставить("VATRate", 20);
	ПараметрыТовараЧека.Вставить("VATAmount", 0);
	ПараметрыТовараЧека.Вставить("paymentMethod", 4);
	ПараметрыТовараЧека.Вставить("calculationSubject", 1);
	ПараметрыТовараЧека.Вставить("measureOfQuantity", 255);
	
	Возврат ПараметрыТовараЧека;
	
КонецФункции

Функция ПараметрыДробногоКоличества()
	
	ПараметрыДробногоКоличества = Новый Структура;
	ПараметрыДробногоКоличества.Вставить("numerator", 0);
	ПараметрыДробногоКоличества.Вставить("denominator", 0);
	
	Возврат ПараметрыДробногоКоличества;
	
КонецФункции

Функция ПараметрыОплатЧека()
	
	ПараметрыОплатЧека = Новый Структура;
	ПараметрыОплатЧека.Вставить("cash");
	ПараметрыОплатЧека.Вставить("electronic");
	ПараметрыОплатЧека.Вставить("barter");
	ПараметрыОплатЧека.Вставить("postPayment");
	ПараметрыОплатЧека.Вставить("prePayment");
	
	Возврат ПараметрыОплатЧека;
	
КонецФункции

Функция ПривестиРезультатКФорматуГОСИС(РезультатПроверки)
	
	Если РезультатПроверки.ДанныеОперации.СтатусОперации = "Выполнена" Тогда
		РезультатПробития = Истина;
	Иначе
		РезультатПробития = Ложь;
	КонецЕсли; 
	
	РезультатВыполнения = МенеджерОборудованияКлиентСервер.ПараметрыВыполненияОперацииНаОборудовании(РезультатПробития);
	
	ДанныеПроверкиМарок = РезультатПроверки.result;
	
	МассивРезультатовПроверок = Новый Массив;
	Результат = Новый Структура;
	Для Каждого РезультатПроверкиМарки Из ДанныеПроверкиМарок Цикл
		СтруктураРезультата = Новый Структура;
		Если СтруктураРезультата.Свойство("code") Тогда
			СтруктураРезультата.Вставить("code", РезультатПроверкиМарки.code);
		КонецЕсли;
		Если СтруктураРезультата.Свойство("description") Тогда
			СтруктураРезультата.Вставить("description", РезультатПроверкиМарки.description);
		КонецЕсли;
		Если СтруктураРезультата.Свойство("requestId") Тогда
			СтруктураРезультата.Вставить("requestId", РезультатПроверкиМарки.requestId);
		КонецЕсли;
		Если СтруктураРезультата.Свойство("requestTimestamp") Тогда
			СтруктураРезультата.Вставить("requestTimestamp", РезультатПроверкиМарки.requestTimestamp);
		КонецЕсли;
		Если СтруктураРезультата.Свойство("isCheckedOffline") Тогда
			СтруктураРезультата.Вставить("isCheckedOffline", РезультатПроверкиМарки.isCheckedOffline);
		КонецЕсли;
		Если СтруктураРезультата.Свойство("instanceId") Тогда
			СтруктураРезультата.Вставить("instanceId", РезультатПроверкиМарки.instanceId);
		КонецЕсли;
		Если СтруктураРезультата.Свойство("blackListVersion") Тогда
			СтруктураРезультата.Вставить("blackListVersion", РезультатПроверкиМарки.blackListVersion);
		КонецЕсли;
		
		МассивКодов = Новый Массив;
		Для Каждого ЭлементКода Из РезультатПроверкиМарки.codes Цикл
			
			СтруктураКода = Новый Структура;
			Если СтруктураКода.Свойство("cis") Тогда
				СтруктураКода.Вставить("cis", ЭлементКода.cis);
			КонецЕсли;
			
			Если СтруктураКода.codeState.Свойство("verified") Тогда
				СтруктураКода.Вставить("Verified", ЭлементКода.codeState.verified);
			КонецЕсли;
			Если СтруктураКода.codeState.Свойство("valid") Тогда
				СтруктураКода.Вставить("Valid", ЭлементКода.codeState.valid);
			КонецЕсли;
			Если СтруктураКода.codeState.Свойство("realizable") Тогда
				СтруктураКода.Вставить("Realizable", ЭлементКода.codeState.realizable);
			КонецЕсли;
			Если СтруктураКода.codeState.Свойство("found") Тогда
				СтруктураКода.Вставить("Found", ЭлементКода.codeState.found);
			КонецЕсли;
			Если СтруктураКода.codeState.Свойство("Utilized") Тогда
				СтруктураКода.Вставить("Utilized", ЭлементКода.codeState.utilized);
			КонецЕсли;
			Если СтруктураКода.codeState.Свойство("parent") Тогда
				СтруктураКода.Вставить("Parent", ЭлементКода.codeState.parent);
			КонецЕсли;
			Если СтруктураКода.codeState.Свойство("printView") Тогда
				СтруктураКода.Вставить("PrintView", ЭлементКода.codeState.printView);
			КонецЕсли;
			Если СтруктураКода.codeState.Свойство("grayZone") Тогда
				СтруктураКода.Вставить("GrayZone", ЭлементКода.codeState.grayZone);
			КонецЕсли;
			Если СтруктураКода.codeState.Свойство("IsBlocked") Тогда
				СтруктураКода.Вставить("IsBlocked", ЭлементКода.codeState.isBlocked);
			КонецЕсли;
			Если СтруктураКода.codeState.Свойство("ogvs") Тогда
				СтруктураКода.Вставить("codeState_ogvs", ЭлементКода.codeState.ogvs);
			КонецЕсли;
			Если СтруктураКода.codeState.Свойство("isOwner") Тогда
				СтруктураКода.Вставить("IsOwner", ЭлементКода.codeState.isOwner);
			КонецЕсли;
			Если СтруктураКода.codeState.codeState.Свойство("sold") Тогда
				СтруктураКода.Вставить("Sold", ЭлементКода.codeState.sold);
			КонецЕсли;
			Если СтруктураКода.codeState.Свойство("isTracking") Тогда
				СтруктураКода.Вставить("IsTracking", ЭлементКода.codeState.isTracking);
			КонецЕсли;
			Если СтруктураКода.codeState.Свойство("errorCode") Тогда
				СтруктураКода.Вставить("ErrorCode", ЭлементКода.codeState.errorCode);
			КонецЕсли;
			Если СтруктураКода.codeState.Свойство("errorMessage") Тогда
				СтруктураКода.Вставить("ErrorMessage", ЭлементКода.codeState.errorMessage);
			КонецЕсли;
			
			Если СтруктураКода.productInfo.Свойство("gtin") Тогда
				СтруктураКода.Вставить("gtin", ЭлементКода.productInfo.gtin);
			КонецЕсли;
			Если СтруктураКода.productInfo.Свойство("producerINN") Тогда
				СтруктураКода.Вставить("ProducerINN", ЭлементКода.productInfo.producerINN);
			КонецЕсли;
			Если СтруктураКода.productInfo.Свойство("packageType") Тогда
				СтруктураКода.Вставить("packageType", ЭлементКода.productInfo.packageType);
			КонецЕсли;
			Если СтруктураКода.productInfo.Свойство("mrp") Тогда
				СтруктураКода.Вставить("mrp", ЭлементКода.productInfo.mrp);
			КонецЕсли;
			Если СтруктураКода.productInfo.Свойство("groupIds") Тогда
				СтруктураКода.Вставить("groupIds", ЭлементКода.productInfo.groupIds);
			КонецЕсли;
			
			Если СтруктураКода.productInfo.producitondata.Свойство("productionDate") Тогда
				СтруктураКода.Вставить("productionDate", ЭлементКода.productInfo.productionData.productionDate);
			КонецЕсли;
			Если СтруктураКода.productInfo.producitondata.Свойство("expirationDate") Тогда
				СтруктураКода.Вставить("expirationDate", ЭлементКода.productInfo.productionData.expirationDate);
			КонецЕсли;
			
			Если СтруктураКода.productInfo.producitondata.Свойство("expirationDatesData") Тогда
				МассивСроковГодности = Новый Массив;
				Для Каждого ЭлементСрока Из ЭлементКода.productInfo.productionData.expirationDatesData Цикл
					СтруктураСрока = Новый Структура;
					Если НЕ СтруктураСрока.Свойство("index") Тогда
						СтруктураСрока.Вставить("index", ЭлементСрока.index);
					КонецЕсли;
					Если НЕ СтруктураСрока.Свойство("date") Тогда
						СтруктураСрока.Вставить("date", ЭлементСрока.date);
					КонецЕсли;
					МассивСроковГодности.Добавить(СтруктураСрока);
				КонецЦикла;
				СтруктураКода.Вставить("expirationDatesData", МассивСроковГодности);
			КонецЕсли;
			
			Если СтруктураКода.productInfo.Свойство("productionVeterinaryDocument") Тогда
				СтруктураКода.Вставить("productionVeterinaryDocument", ЭлементКода.productInfo.productionVeterinaryDocument);
			КонецЕсли;
			Если СтруктураКода.productInfo.Свойство("productWeight") Тогда
				СтруктураКода.Вставить("productWeight", ЭлементКода.productInfo.productWeight);
			КонецЕсли;
			Если СтруктураКода.productInfo.Свойство("eliminationState") Тогда
				СтруктураКода.Вставить("eliminationState", ЭлементКода.productInfo.eliminationState);
			КонецЕсли;
			Если СтруктураКода.productInfo.Свойство("smp") Тогда
				СтруктураКода.Вставить("smp", ЭлементКода.productInfo.smp);
			КонецЕсли;
			Если СтруктураКода.productInfo.Свойство("innerUnitCount") Тогда
				СтруктураКода.Вставить("innerUnitCount", ЭлементКода.productInfo.innerUnitCount);
			КонецЕсли;
			Если СтруктураКода.productInfo.Свойство("soldUnitCount") Тогда
				СтруктураКода.Вставить("soldUnitCount", ЭлементКода.productInfo.soldUnitCount);
			КонецЕсли;
			Если СтруктураКода.productInfo.Свойство("productionSerialNumber") Тогда
				СтруктураКода.Вставить("productionSerialNumber", ЭлементКода.productInfo.productionSerialNumber);
			КонецЕсли;
			Если СтруктураКода.productInfo.Свойство("productionBatchNumber") Тогда
				СтруктураКода.Вставить("productionBatchNumber", ЭлементКода.productInfo.productionBatchNumber);
			КонецЕсли;
			Если СтруктураКода.productInfo.Свойство("factorySerialNumber") Тогда
				СтруктураКода.Вставить("factorySerialNumber", ЭлементКода.productInfo.factorySerialNumber);
			КонецЕсли;
			Если СтруктураКода.productInfo.Свойство("packageQuantity") Тогда
				СтруктураКода.Вставить("packageQuantity", ЭлементКода.productInfo.packageQuantity);
			КонецЕсли;
			
			МассивКодов.Добавить(СтруктураКода);
			
		КонецЦикла;
		СтруктураРезультата.Вставить("codes", МассивКодов);
		МассивРезультатовПроверок.Добавить(СтруктураРезультата);
	КонецЦикла;
	Результат.Вставить("codesResponse", МассивРезультатовПроверок);
	
	РезультатВыполнения.Вставить("РезультатПроверки", Результат);
	
	Возврат РезультатВыполнения;
	
КонецФункции

#КонецОбласти

#Область ПроцедурыОбратногоФормированияДанных

Функция ДанныеВФорматеБПОПоДаннымОблачнойККТ(ПараметрыФискализации)
	
	ОбщиеПараметры = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыОперацииФискализацииЧека();
	
	ПараметрыШапкиЧека = ПараметрыФискализации.ДанныеЧека.documentHeader;
	ОбщиеПараметры.Кассир = ПараметрыШапкиЧека.cashierName;
	Если ПараметрыШапкиЧека.Свойство("cashierINN") Тогда 
		ОбщиеПараметры.КассирИНН = ПараметрыШапкиЧека.cashierINN;
	КонецЕсли;
	ОбщиеПараметры.ТипРасчета = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.РасчетДенежнымиСредствамиПоКоду(ПараметрыШапкиЧека.operationType);
	ОбщиеПараметры.СистемаНалогообложения = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.СистемаНалогообложенияККТПоКоду(ПараметрыШапкиЧека.taxationSystem - 1);
	
	Если ПараметрыШапкиЧека.Свойство("senderEmail") Тогда
		ОбщиеПараметры.ОтправительEmail = ПараметрыШапкиЧека.senderEmail;
	КонецЕсли;
	
	Если ПараметрыШапкиЧека.Свойство("saleAddress") Тогда
		ОбщиеПараметры.АдресРасчетов = ПараметрыШапкиЧека.saleAddress;
	КонецЕсли;

	Если ПараметрыШапкиЧека.Свойство("saleLocation") Тогда
		ОбщиеПараметры.МестоРасчетов = ПараметрыШапкиЧека.saleLocation;
	КонецЕсли;

	Если ПараметрыШапкиЧека.Свойство("customerEmail") Тогда
		ОбщиеПараметры.ПокупательEmail = ПараметрыШапкиЧека.customerEmail;
	КонецЕсли;

	Если ПараметрыШапкиЧека.Свойство("internetPayment") Тогда
		ОбщиеПараметры.Интернет = ПараметрыШапкиЧека.internetPayment;
	КонецЕсли;

	Если ПараметрыШапкиЧека.Свойство("timeZone") Тогда
		ОбщиеПараметры.ЧасоваяЗона = ПараметрыШапкиЧека.timeZone;
	КонецЕсли;

	Если ПараметрыШапкиЧека.Свойство("customerPhone") Тогда
		ОбщиеПараметры.ПокупательНомер = ПараметрыШапкиЧека.customerPhone;
	КонецЕсли;

	Если ПараметрыШапкиЧека.Свойство("automatNumber") Тогда
		ОбщиеПараметры.НомерАвтомата = ПараметрыШапкиЧека.automatNumber;
	КонецЕсли;

	Если ПараметрыШапкиЧека.Свойство("agentType") Тогда
		ОбщиеПараметры.ПризнакАгента = ОборудованиеЧекопечатающиеУстройстваРФКлиентСервер.ПризнакАгентаПоКоду(ПараметрыШапкиЧека.agentType);
		Если ПараметрыШапкиЧека.Свойство("agentData") Тогда
			ОбщиеПараметры.ДанныеАгента = ЗаполнитьДанныеАгентаПоДаннымОблачнойККТ(ПараметрыШапкиЧека.agentData);
		КонецЕсли;	
	КонецЕсли;

	Если ПараметрыШапкиЧека.Свойство("correctionData") Тогда
		ОбщиеПараметры.ДанныеКоррекции = ЗаполнитьДанныеКоррекцииПоДаннымОблачнойККТ(ПараметрыШапкиЧека.correctionData);
	КонецЕсли;
	
	Если ПараметрыШапкиЧека.Свойство("vendorData") Тогда
		ОбщиеПараметры.ДанныеПоставщика = ЗаполнитьДанныеПоставщикаПоДаннымОблачнойККТ(ПараметрыШапкиЧека.vendorData);
	КонецЕсли;

	Если ПараметрыШапкиЧека.Свойство("operationalAttribute") Тогда
		ОбщиеПараметры.ОперационныйРеквизит = ЗаполнитьДанныеОперационногоРеквизитаПоДаннымОблачнойККТ(ПараметрыШапкиЧека.operationalAttribute);
	КонецЕсли;

	Если ПараметрыШапкиЧека.Свойство("industryAttribute") Тогда
		ОбщиеПараметры.ОтраслевойРеквизит = ЗаполнитьОтраслевойРеквизитПоДаннымОблачнойККТ(ПараметрыШапкиЧека.industryAttribute);
	КонецЕсли;

	Если ПараметрыШапкиЧека.Свойство("customerDetail") Тогда
		СведенияОПокупателе = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыПерсональныеДанныеПокупателя();
		СведенияОПокупателе.Вставить("Покупатель", "");
		СведенияОПокупателе.Вставить("ПокупательИНН", "");
		СведенияОПокупателе.Вставить("Получатель", "");
		СведенияОПокупателе.Вставить("ПолучательИНН", "");
			СведенияОПокупателе.Вставить("ПокупательАдрес", "");
		
		ПараметрыПокупателя = ПараметрыШапкиЧека.customerDetail;
		
		Если ПараметрыПокупателя.Свойство("Info") Тогда
			СведенияОПокупателе.Покупатель = ПараметрыПокупателя.Info;
			СведенияОПокупателе.Получатель = ПараметрыПокупателя.Info;
		КонецЕсли;
		
		Если ПараметрыПокупателя.Свойство("INN") Тогда
			СведенияОПокупателе.ПокупательИНН = ПараметрыПокупателя.INN;
			СведенияОПокупателе.ПолучательИНН = ПараметрыПокупателя.INN;
		КонецЕсли;
		
		Если ПараметрыПокупателя.Свойство("Address") Тогда
			СведенияОПокупателе.ПокупательАдрес = ПараметрыПокупателя.Address;
		КонецЕсли;
		
		СведенияОПокупателе = ЗаполнитьСведенияОПокупателеПоДаннымОблачнойККТ(ПараметрыПокупателя);
		
		ОбщиеПараметры.СведенияОПокупателе = СведенияОПокупателе;
	КонецЕсли;
	
	Если ПараметрыФискализации.ДанныеЧека.Свойство("items") Тогда
		ОбщиеПараметры.Вставить("ПозицииЧека", Новый Массив);
		
		Для Каждого ПозицияЧекаОблако Из ПараметрыФискализации.ДанныеЧека.items Цикл
			
			ПозицияЧека = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыФискальнойСтрокиЧека();
			
			Если ПозицияЧекаОблако.Свойство("name") Тогда
				ПозицияЧека.Наименование = ПозицияЧекаОблако.name;
			КонецЕсли;
			
			Если ПозицияЧекаОблако.Свойство("quantity") Тогда
				ПозицияЧека.Количество = ПозицияЧекаОблако.quantity;
			КонецЕсли;
			
			Если ПозицияЧекаОблако.Свойство("priceWithDiscount") Тогда
				ПозицияЧека.ЦенаСоСкидками = ПозицияЧекаОблако.priceWithDiscount;
			КонецЕсли;
			
			Если ПозицияЧекаОблако.Свойство("amountWithDiscount") Тогда
				ПозицияЧека.Сумма = ПозицияЧекаОблако.amountWithDiscount;
			КонецЕсли;
			
			Если ПозицияЧекаОблако.Свойство("VATRate") Тогда
				ПозицияЧека.СтавкаНДС = ПозицияЧекаОблако.VATRate;
			КонецЕсли;
			
			Если ПозицияЧекаОблако.Свойство("VATAmount") Тогда
				ПозицияЧека.СуммаНДС = ПозицияЧекаОблако.VATAmount;
			КонецЕсли;
			
			Если ПозицияЧекаОблако.Свойство("paymentMethod") Тогда
				ПозицияЧека.ПризнакСпособаРасчета = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПризнакСпособаРасчетаПоКоду(ПозицияЧекаОблако.paymentMethod);
			КонецЕсли;
			
			Если ПозицияЧекаОблако.Свойство("calculationSubject") Тогда
				ПозицияЧека.ПризнакПредметаРасчета = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПризнакПредметаРасчетаПоКоду(ПозицияЧекаОблако.calculationSubject);
			КонецЕсли;
			
			Если ПозицияЧекаОблако.Свойство("calculationAgent") Тогда
				ПозицияЧека.ПризнакАгентаПоПредметуРасчета = ОборудованиеЧекопечатающиеУстройстваРФКлиентСервер.ПризнакАгентаПоКоду(ПозицияЧекаОблако.calculationAgent);
			КонецЕсли;
			
			Если ПозицияЧекаОблако.Свойство("agentData") Тогда
				ПозицияЧека.ДанныеАгента = ЗаполнитьДанныеАгентаПоДаннымОблачнойККТ(ПозицияЧекаОблако.agentData);
			КонецЕсли;
			
			Если ПозицияЧекаОблако.Свойство("vendorData") Тогда
				ПозицияЧека.ДанныеПоставщика = ЗаполнитьДанныеПоставщикаПозицииПоДаннымОблачнойККТ(ПозицияЧекаОблако.vendorData);
			КонецЕсли;
			
			Если ПозицияЧекаОблако.Свойство("measureOfQuantity") Тогда
				ПозицияЧека.КодЕдиницыИзмерения = ОборудованиеЧекопечатающиеУстройстваРФКлиентСервер.КодЕдиницыИзмеренияПоККТКоду(ПозицияЧекаОблако.measureOfQuantity);
			КонецЕсли;
			
			Если ПозицияЧекаОблако.Свойство("fractionalQuantity") Тогда
				ПозицияЧека.ДробноеКоличество = ЗаполнитьДанныеДробногоКоличестваПоДаннымОблачнойККТ(ПозицияЧекаОблако.fractionalQuantity);
			КонецЕсли;
			
			Если ПозицияЧекаОблако.Свойство("markingCode") Тогда
				ПозицияЧека.КонтрольнаяМарка = ПозицияЧекаОблако.markingCode;
			КонецЕсли;
			
			Если ПозицияЧекаОблако.Свойство("additionalAttribute") Тогда
				ПозицияЧека.ДополнительныйРеквизит = ПозицияЧекаОблако.additionalAttribute;
			КонецЕсли;
			
			Если ПозицияЧекаОблако.Свойство("exciseAmount") Тогда
				ПозицияЧека.СуммаАкциза = ПозицияЧекаОблако.exciseAmount;
			КонецЕсли;
			
			Если ПозицияЧекаОблако.Свойство("customsDeclaration") Тогда
				ПозицияЧека.НомерТаможеннойДекларации = ПозицияЧекаОблако.customsDeclaration;
			КонецЕсли;
			
			Если ПозицияЧекаОблако.Свойство("countryOfOrigin") Тогда
				ПозицияЧека.КодСтраныПроисхожденияТовара = ПозицияЧекаОблако.countryOfOrigin;
			КонецЕсли;
			
			Если ПозицияЧекаОблако.Свойство("industryAttribute") Тогда
				ПозицияЧека.ОтраслевойРеквизит = ЗаполнитьОтраслевойРеквизитПозицииПоДаннымОблачнойККТ(ПозицияЧекаОблако.industryAttribute);
			КонецЕсли;
			
			Если ПозицияЧекаОблако.Свойство("productCode") Тогда
				ПозицияЧека.КодТоварнойНоменклатуры = ПозицияЧекаОблако.productCode;
			КонецЕсли;
			
			ОбщиеПараметры.ПозицииЧека.Добавить(ПозицияЧека);
			
		КонецЦикла;
	КонецЕсли;
	
	ОплатыЧека = ПараметрыФискализации.ДанныеЧека.payments;
	
	Если ОплатыЧека.cash <> 0 Тогда
		СтрокаОплаты = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыСтрокиОплаты();
		СтрокаОплаты.ТипОплаты = ПредопределенноеЗначение("Перечисление.ТипыОплатыККТ.Наличные"); 
		СтрокаОплаты.Сумма     = ОплатыЧека.cash;
		ОбщиеПараметры.Добавить(СтрокаОплаты);
	КонецЕсли;
	Если ОплатыЧека.electronic <> 0 Тогда
		СтрокаОплаты = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыСтрокиОплаты();
		СтрокаОплаты.ТипОплаты = ПредопределенноеЗначение("Перечисление.ТипыОплатыККТ.Электронно"); 
		СтрокаОплаты.Сумма     = ОплатыЧека.electronic;
		ОбщиеПараметры.Добавить(СтрокаОплаты);
	КонецЕсли;
	Если ОплатыЧека.barter <> 0 Тогда
		СтрокаОплаты = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыСтрокиОплаты();
		СтрокаОплаты.ТипОплаты = ПредопределенноеЗначение("Перечисление.ТипыОплатыККТ.ВстречноеПредоставление"); 
		СтрокаОплаты.Сумма     = ОплатыЧека.barter;
		ОбщиеПараметры.Добавить(СтрокаОплаты);
	КонецЕсли;
	Если ОплатыЧека.prePayment <> 0 Тогда
		СтрокаОплаты = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыСтрокиОплаты();
		СтрокаОплаты.ТипОплаты = ПредопределенноеЗначение("Перечисление.ТипыОплатыККТ.Предоплата"); 
		СтрокаОплаты.Сумма     = ОплатыЧека.prePayment;
		ОбщиеПараметры.Добавить(СтрокаОплаты);
	КонецЕсли;
	Если ОплатыЧека.postPayement <> 0 Тогда
		СтрокаОплаты = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыСтрокиОплаты();
		СтрокаОплаты.ТипОплаты = ПредопределенноеЗначение("Перечисление.ТипыОплатыККТ.Постоплата"); 
		СтрокаОплаты.Сумма     = ОплатыЧека.postPayement;
		ОбщиеПараметры.Добавить(СтрокаОплаты);
	КонецЕсли;
	
	Возврат ОбщиеПараметры;
	
КонецФункции

Функция ЗаполнитьДанныеПоставщикаПоДаннымОблачнойККТ(ПараметрыПоставщика) 
	
	ДанныеПоставщика = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыДанныеПоставщика();
	
	Если ПараметрыПоставщика.Свойство("phone") Тогда
		ДанныеПоставщика.Телефон = ПараметрыПоставщика.phone;
	КонецЕсли;
	
	Если ПараметрыПоставщика.Свойство("name") Тогда
		ДанныеПоставщика.Наименование = ПараметрыПоставщика.name;
	КонецЕсли;
	
	Если ПараметрыПоставщика.Свойство("INN") Тогда
		ДанныеПоставщика.ИНН = ПараметрыПоставщика.INN;
	КонецЕсли;
	
	Возврат ДанныеПоставщика;
	
КонецФункции

Функция ЗаполнитьДанныеКоррекцииПоДаннымОблачнойККТ(ПараметрыКоррекции) 
	
	ДанныеКоррекции = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыДанныеКоррекции();
	
	Если ПараметрыКоррекции.Свойство("type") Тогда
		ДанныеКоррекции.ТипКоррекции = ПараметрыКоррекции.type;
	КонецЕсли;
	
	Если ПараметрыКоррекции.Свойство("description") Тогда
		ДанныеКоррекции.ОписаниеКоррекции = ПараметрыКоррекции.description;
	КонецЕсли;
	
	Если ПараметрыКоррекции.Свойство("date") Тогда
		ДанныеКоррекции.ДатаКоррекции = ПараметрыКоррекции.date;
	КонецЕсли;
	
	Если ПараметрыКоррекции.Свойство("number") Тогда
		ДанныеКоррекции.НомерПредписания = ПараметрыКоррекции.number;
	КонецЕсли;
	
	Возврат ДанныеКоррекции;
	
КонецФункции

Функция ЗаполнитьДанныеОперационногоРеквизитаПоДаннымОблачнойККТ(ПараметрыОперационногоРеквизита) 
	
	ОперационныйРеквизит = Новый Структура;
	ОперационныйРеквизит.Вставить("ИдентификаторОперации", "");
	ОперационныйРеквизит.Вставить("ДанныеОперации", "");
	ОперационныйРеквизит.Вставить("ДатаВремяОперации", Дата(1,1,1));
	
	Если ПараметрыОперационногоРеквизита.Свойство("operationData") Тогда
		ОперационныйРеквизит.ДанныеОперации = ПараметрыОперационногоРеквизита.operationData;
	КонецЕсли;
	
	Если ПараметрыОперационногоРеквизита.Свойство("operationID") Тогда
		ОперационныйРеквизит.ИдентификаторОперации = ПараметрыОперационногоРеквизита.operationID;
	КонецЕсли;
	
	Если ПараметрыОперационногоРеквизита.Свойство("dateTime") Тогда
		ОперационныйРеквизит.ДатаВремяОперации = ПараметрыОперационногоРеквизита.dateTime;
	КонецЕсли;
	
	Возврат ОперационныйРеквизит;
	
КонецФункции

Функция ЗаполнитьОтраслевойРеквизитПоДаннымОблачнойККТ(ПараметрыОтраслевогоРеквизита) 
	
	ОтраслевойРеквизит = Новый Структура;
	ОтраслевойРеквизит.Вставить("ИдентификаторФОИВ", "");
	ОтраслевойРеквизит.Вставить("ДатаДокументаОснования", "");
	ОтраслевойРеквизит.Вставить("НомерДокументаОснования", "");
	ОтраслевойРеквизит.Вставить("ЗначениеРеквизита", "");
	
	Если ПараметрыОтраслевогоРеквизита.Свойство("identifierFOIV") Тогда
		ОтраслевойРеквизит.ИдентификаторФОИВ = ПараметрыОтраслевогоРеквизита.identifierFOIV;
	КонецЕсли;
	
	Если ПараметрыОтраслевогоРеквизита.Свойство("documentDate") Тогда
		ОтраслевойРеквизит.ДатаДокументаОснования = ПараметрыОтраслевогоРеквизита.documentDate;
	КонецЕсли;
	
	Если ПараметрыОтраслевогоРеквизита.Свойство("documentNumber") Тогда
		ОтраслевойРеквизит.НомерДокументаОснования = ПараметрыОтраслевогоРеквизита.documentNumber;
	КонецЕсли;
	
	Если ПараметрыОтраслевогоРеквизита.Свойство("attributeValue") Тогда
		ОтраслевойРеквизит.ЗначениеРеквизита = ПараметрыОтраслевогоРеквизита.attributeValue;
	КонецЕсли;
	
	Возврат ОтраслевойРеквизит;
	
КонецФункции

Функция ЗаполнитьСведенияОПокупателеПоДаннымОблачнойККТ(ПараметрыПокупателя) 
	
	СведенияОПокупателе = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыПерсональныеДанныеПокупателя();
	
	Если ПараметрыПокупателя.Свойство("INN") Тогда
		СведенияОПокупателе.ИНН = ПараметрыПокупателя.INN;
	КонецЕсли;
	
	Если ПараметрыПокупателя.Свойство("DateOfBirth") Тогда
		СведенияОПокупателе.ДатаРождения =  ПараметрыПокупателя.DateOfBirth;
	КонецЕсли;
	
	Если ПараметрыПокупателя.Свойство("Citizenship") Тогда
		СведенияОПокупателе.Гражданство = ПараметрыПокупателя.Citizenship;
	КонецЕсли;
	
	Если ПараметрыПокупателя.Свойство("DocumentTypeCode") Тогда
		СведенияОПокупателе.ВидДокумента = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ВидДокументаУдостоверяющегоЛичностьПоКоду(ПараметрыПокупателя.DocumentTypeCode);
	КонецЕсли;
	
	Если ПараметрыПокупателя.Свойство("DocumentData") Тогда
		СведенияОПокупателе.ДанныеДокумента = ПараметрыПокупателя.DocumentData;
	КонецЕсли;
	
	Возврат СведенияОПокупателе;
	
КонецФункции

Функция ЗаполнитьДанныеПоставщикаПозицииПоДаннымОблачнойККТ(ПараметрыПоставщика) 
	
	ДанныеПоставщика = Новый Структура;
	ДанныеПоставщика.Вставить("Наименование", "");
	ДанныеПоставщика.Вставить("Телефон", "");
	ДанныеПоставщика.Вставить("ИНН", "");
	
	Если ПараметрыПоставщика.Свойство("name") Тогда
		ДанныеПоставщика.Наименование = ПараметрыПоставщика.name;
	КонецЕсли;
	
	Если ПараметрыПоставщика.Свойство("phone") Тогда
		ДанныеПоставщика.Телефон = ПараметрыПоставщика.phone;
	КонецЕсли;
	
	Если ПараметрыПоставщика.Свойство("INN") Тогда
		ДанныеПоставщика.ИНН = ПараметрыПоставщика.INN;
	КонецЕсли;
	
	Возврат ДанныеПоставщика;
	
КонецФункции

Функция ЗаполнитьОтраслевойРеквизитПозицииПоДаннымОблачнойККТ(ПараметрыОтраслевогоРеквизита) 
	
	ОтраслевойРеквизит = Новый Структура;
	ОтраслевойРеквизит.Вставить("ИдентификаторФОИВ", "");
	ОтраслевойРеквизит.Вставить("ДатаДокументаОснования", "");
	ОтраслевойРеквизит.Вставить("НомерДокументаОснования", "");
	ОтраслевойРеквизит.Вставить("ЗначениеРеквизита", "");
	
	Если ПараметрыОтраслевогоРеквизита.Свойство("identifierFOIV") Тогда
		ОтраслевойРеквизит.ИдентификаторФОИВ = ПараметрыОтраслевогоРеквизита.identifierFOIV;
	КонецЕсли;
	
	Если ПараметрыОтраслевогоРеквизита.Свойство("documentDate") Тогда
		ОтраслевойРеквизит.ДатаДокументаОснования = ПараметрыОтраслевогоРеквизита.documentDate;
	КонецЕсли;
	
	Если ПараметрыОтраслевогоРеквизита.Свойство("documentNumber") Тогда
		ОтраслевойРеквизит.НомерДокументаОснования = ПараметрыОтраслевогоРеквизита.documentNumber;
	КонецЕсли;
	
	Если ПараметрыОтраслевогоРеквизита.Свойство("attributeValue") Тогда
		ОтраслевойРеквизит.ЗначениеРеквизита = ПараметрыОтраслевогоРеквизита.attributeValue;
	КонецЕсли;
	
	Возврат ОтраслевойРеквизит;
	
КонецФункции

Функция ЗаполнитьДанныеДробногоКоличестваПоДаннымОблачнойККТ(ПараметрыДробногоКоличества)
	
	ДробноеКоличество = Новый Структура;
	ДробноеКоличество.Вставить("Числитель", "");
	ДробноеКоличество.Вставить("Знаменатель", "");
	
	Если ПараметрыДробногоКоличества.Свойство("numerator") Тогда
		ДробноеКоличество.Числитель = ПараметрыДробногоКоличества.numerator;
	КонецЕсли;
	
	Если ПараметрыДробногоКоличества.Свойство("denominator") Тогда
		ДробноеКоличество.Знаменатель = ПараметрыДробногоКоличества.denominator;
	КонецЕсли;
	
	Возврат ДробноеКоличество;
	
КонецФункции

Функция ЗаполнитьДанныеАгентаПоДаннымОблачнойККТ(ПараметрыАгента) 
	
	ДанныеАгента = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыДанныеАгента();
	
	Если ПараметрыАгента.Свойство("agentOperation") Тогда
		ДанныеАгента.ПлатежныйАгент.Операция = ПараметрыАгента.agentOperation;
	КонецЕсли;
	
	Если ПараметрыАгента.Свойство("agentPhone") Тогда
		ДанныеАгента.ПлатежныйАгент.Телефон = ПараметрыАгента.agentPhone;
	КонецЕсли;
	
	Если ПараметрыАгента.Свойство("paymentProcessorPhone") Тогда
		ДанныеАгента.ОператорПоПриемуПлатежей.Телефон = ПараметрыАгента.paymentProcessorPhone;
	КонецЕсли;
	
	Если ПараметрыАгента.Свойство("acquirerOperatorPhone") Тогда
		ДанныеАгента.ОператорПеревода.Телефон = ПараметрыАгента.acquirerOperatorPhone;
	КонецЕсли;
	
	Если ПараметрыАгента.Свойство("acquirerOperatorName") Тогда
		ДанныеАгента.ОператорПеревода.Наименование = ПараметрыАгента.acquirerOperatorName;
	КонецЕсли;
	
	Если ПараметрыАгента.Свойство("acquirerOperatorAddress") Тогда
		ДанныеАгента.ОператорПеревода.Адрес = ПараметрыАгента.acquirerOperatorAddress;
	КонецЕсли;
	
	Если ПараметрыАгента.Свойство("acquirerOperatorINN") Тогда
		ДанныеАгента.ОператорПеревода.ИНН = ПараметрыАгента.acquirerOperatorINN;
	КонецЕсли;
	
	Возврат ДанныеАгента;
	
КонецФункции
#КонецОбласти 

#КонецОбласти
