
#Область ПрограммныйИнтерфейс

// Выполняет открытие формы печати шаблона офисного документа
//
// Параметры:
//  ПараметрКоманды  - Структура - структура, содержащая параметры:
//   * СкрыватьФорму - Булево - Отображать форму. Если Истина, то сразу запускается формирование файла.
//   	Значение по умолчанию - Ложь.
//   * ДополнительныеПараметры - Структура:
//    	* ШаблонПечатиОфисныхДокументов - СправочникСсылка.ШаблоныПечатиОфисныхДокументов
//    	* ОбъектыПечати - Массив из ОпределяемыйТип.ОбъектыПечатиОфисныхДокументов
//
Процедура ОткрытьПечатьПоШаблонуОфисногоДокумента(ПараметрКоманды) Экспорт
	
	ШаблонПечати =  ПараметрКоманды.ДополнительныеПараметры.ШаблонПечатиОфисныхДокументов;
	СкрыватьФорму = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрКоманды, "СкрыватьФорму", Ложь);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ШаблонПечати",  ШаблонПечати);
	ПараметрыФормы.Вставить("ОбъектыПечати", ПараметрКоманды.ОбъектыПечати);
	ПараметрыФормы.Вставить("СкрыватьФорму", СкрыватьФорму);
	
	ОткрытьФорму("Справочник.ШаблоныПечатиОфисныхДокументов.Форма.ФормаПечати", ПараметрыФормы);
	
КонецПроцедуры

// Выполняет открытие списка шаблонов печати с отбором по назначению шаблона
//
// Параметры:
//  Назначение  - ПеречислениеСсылка.НазначенияШаблоновПечатиОфисныхДокументов - Назначение шаблона печати
//
Процедура ОткрытьШаблоныПечатиОфисныхДокументов(Назначение = Неопределено) Экспорт
	
	ПараметрыФормы = Новый Структура;
	Если Назначение <> Неопределено Тогда
		ПараметрыФормы.Вставить("Отбор", Новый Структура("Назначение", Назначение));
	КонецЕсли;
	ОткрытьФорму("Справочник.ШаблоныПечатиОфисныхДокументов.ФормаСписка", ПараметрыФормы);
	
КонецПроцедуры

// Устанавливает признак появления новой команды для группы команд печати
//
// Параметры:
//  ГруппаКомандПечати  - ГруппаКнопокФормы 
//
Процедура УстановитьПризнакПоявленияНовойКомандыПечати(ГруппаКомандПечати) Экспорт
	
	Если ЗначениеЗаполнено(ГруппаКомандПечати.Картинка) Тогда
		Возврат;
	КонецЕсли;
	
	ГруппаКомандПечати.Картинка  = БиблиотекаКартинок.ВосклицательныйЗнакКрасный;
	ТекстПоявлениеНовойКоманды   = НСтр("ru='требуется переоткрыть форму'");
	ГруппаКомандПечати.Заголовок = СтрШаблон("%1 (%2)", ГруппаКомандПечати.Заголовок, 
		ТекстПоявлениеНовойКоманды); 	
КонецПроцедуры

// Возвращает последний выбранный шаблон.
// 
// Параметры:
//  ИмяФормы - Строка - Ключ объекта для сохранения
// 
// Возвращаемое значение:
//  СправочникСсылка.ШаблоныПечатиОфисныхДокументов
Функция ПоследнийВыбранныйШаблон(ИмяФормы) Экспорт
 
	Возврат ШаблоныПечатиОфисныхДокументовВызовСервера.ПоследнийВыбранныйШаблон(ИмяФормы);
	
КонецФункции

// Сохраняет шаблон в хралищие общих настроек для последующей загрузки.
//
// Параметры:
//  ИмяФормы - Строка - Ключ объекта для сохранения
//  ШаблонПечати - СправочникСсылка.ШаблоныПечатиОфисныхДокументов - Сохраняемое значение
//
Процедура СохранитьШаблонКакПоследнийВыбранный(ИмяФормы, ШаблонПечати) Экспорт

	ШаблоныПечатиОфисныхДокументовВызовСервера.СохранитьШаблонКакПоследнийВыбранный(ИмяФормы, ШаблонПечати);
	
КонецПроцедуры

// Открывает форму выбора шаблонов печати офисных документов с позиционированием на определенном элементе.
//
// Параметры:
//   Владелец - ФормаКлиентскогоПриложения - Форма, из которой открывается подбор
//   Назначение - ПеречислениеСсылка.НазначенияШаблоновПечатиОфисныхДокументов - Назначение шаблона для отбора
//   ЭлементДляПозицинирования - СправочникСсылка.ШаблоныПечатиОфисныхДокументов - Элемент для позиционирования
//   ОписаниеОповещения - ОписаниеОповещения - описание оповещения, вызываемого после закрытия формы
//   
Процедура ОткрытьФормуВыбораШаблонаПоНазначению(Владелец, Назначение, ЭлементДляПозицинирования,
	ОписаниеОповещения = Неопределено) Экспорт
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Назначение", Назначение);
	ПараметрыОтбора.Вставить("ПометкаУдаления", Ложь);
	
	// В динамическом списке открываемой формы значению 0 соответствует шаблон, у которого установлен признак
	// "Используется" и для которого задан файл макета.
	ПараметрыОтбора.Вставить("Используется", 0);
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("РежимВыбора", Истина);
	
	Если ЗначениеЗаполнено(ЭлементДляПозицинирования) Тогда
		ПараметрыОткрытия.Вставить("ТекущаяСтрока", ЭлементДляПозицинирования);
	КонецЕсли;
	
	ПараметрыОткрытия.Вставить("Отбор", ПараметрыОтбора);
	
	ОткрытьФорму("Справочник.ШаблоныПечатиОфисныхДокументов.ФормаВыбора", ПараметрыОткрытия, Владелец, , , ,
		ОписаниеОповещения, РежимБлокировкиПриОткрытииОкнаФормы.БлокироватьВладельца);
		
КонецПроцедуры

// Открывает форму выбора шаблона для отправки созданного по шаблону печати офисного файла по электронной почте.
// После выбора шаблона открывается форма нового письма с прикрепленным созданным офисным файлом
//
// Параметры:
//   Форма - ФормаКлиентскогоПриложения - Форма-источник
//   Предмет - ДокументСсылка, СправочникСсылка - Предмет формирования
//   Назначение - ПеречислениеСсылка.НазначенияШаблоновПечатиОфисныхДокументов
//   ПоследнийВыбранныйШаблон - СправочникСсылка.ШаблоныПечатиОфисныхДокументов - Последний выбранный для формирования
//   	шаблон
//
Процедура ОтправитьПоЭлектроннойПочте(Форма, Предмет, Назначение, ПоследнийВыбранныйШаблон) Экспорт

	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Форма",    Форма);
	ДополнительныеПараметры.Вставить("Предмет",  Предмет);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОтправитьПоЭлектроннойПочтеЗавершение", ЭтотОбъект,
		ДополнительныеПараметры);
	ОткрытьФормуВыбораШаблонаПоНазначению(Неопределено, Назначение, ПоследнийВыбранныйШаблон, ОписаниеОповещения);

КонецПроцедуры

// Формирует файл офисного документа и сохраняет выбранный шаблон для последующего выбора в списке
// 
// Параметры:
//  ИмяФормы - Строка - Имя формы, используется для сохранения выбранного шаблона
//  Шаблон - СправочникСсылка.ШаблоныПечатиОфисныхДокументов
//  Документ - ОпределяемыйТип.ОбъектыПечатиОфисныхДокументов
//  СкрыватьФорму - Булево - Не отображать форму перед формированием
//  
Процедура СформироватьФайлОфисногоДокумента(ИмяФормы, Шаблон, Документ, СкрыватьФорму = Ложь) Экспорт
		
	ОбъектыПечати = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Документ);
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ШаблонПечатиОфисныхДокументов", Шаблон);
	
	ПараметрыПечатиШаблона = Новый Структура;
	ПараметрыПечатиШаблона.Вставить("ОбъектыПечати",           ОбъектыПечати);
	ПараметрыПечатиШаблона.Вставить("ДополнительныеПараметры", ДополнительныеПараметры);
	ПараметрыПечатиШаблона.Вставить("СкрыватьФорму",           СкрыватьФорму);
		
	ОткрытьПечатьПоШаблонуОфисногоДокумента(ПараметрыПечатиШаблона);		
	СохранитьШаблонКакПоследнийВыбранный(ИмяФормы, Шаблон);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Открывает форму выбора стандартного (поставляемого) шаблона печати офисного документа с заданным назначением.
//
// Параметры:
//   ОписаниеОповещения - ОписаниеОповещения - Описание оповещения, выполняемого после закрытия формы
//   Назначение - ПеречислениеСсылка.НазначенияШаблоновПечатиОфисныхДокументов
//   СкрытьВыборназначения - Булево - Скрывать поле выбора назначения
//   
Процедура ВыбратьСтандартныйШаблон(ОписаниеОповещения, Назначение, СкрытьВыборназначения = Ложь) Экспорт

	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Назначение", Назначение);
	ПараметрыОткрытия.Вставить("СкрытьВыборназначения", СкрытьВыборназначения);

	ОткрытьФорму("Справочник.ШаблоныПечатиОфисныхДокументов.Форма.ВыборСтандартногоШаблона", ПараметрыОткрытия, , , , ,
		ОписаниеОповещения, РежимБлокировкиПриОткрытииОкнаФормы.БлокироватьВладельца);
		
КонецПроцедуры

// см. ШаблоныПечатиОфисныхДокументов.КоличествоСтандартныхШаблонов
Функция КоличествоСтандартныхШаблонов(Назначение = Неопределено) Экспорт
	
	Возврат ШаблоныПечатиОфисныхДокументовВызовСервера.КоличествоСтандартныхШаблонов(Назначение);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОтправитьПоЭлектроннойПочтеЗавершение(ШаблонПечати, ДополнительныеПараметры) Экспорт
	
	Если Не ЗначениеЗаполнено(ШаблонПечати) Тогда
		Возврат;
	КонецЕсли;
	
	ИмяФормы = ДополнительныеПараметры.Форма.ИмяФормы; 
	ИдентификаторКоманды = ШаблоныПечатиОфисныхДокументовВызовСервера.ИдентификаторКомандыПечатиШаблона(
		ИмяФормы, ДополнительныеПараметры.Предмет, ШаблонПечати);
	
	Если ПустаяСтрока(ИдентификаторКоманды) Тогда
		ИмяСобытия = ШаблоныПечатиОфисныхДокументовКлиентСервер.ИмяСобытияЖурналаРегистрации();
		ТекстСобщения = СтрШаблон(
			НСтр("ru = 'Не найдена соответствующая шаблону печати команда. Обратитесь в техническую поддержку. Шаблон печати: %1, предмет: %2'"),
			ШаблонПечати, ДополнительныеПараметры.Предмет);
		ЖурналРегистрацииКлиент.ДобавитьСообщениеДляЖурналаРегистрации(ИмяСобытия, "Ошибка", ТекстСобщения, , Истина);
		
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСобщения);
		Возврат;
	КонецЕсли;
	
	ИдентификаторыПечатныхФорм = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ИдентификаторКоманды);
	
	ДополнительныеПараметрыКоманды = Новый Структура;
	ДополнительныеПараметрыКоманды.Вставить("ИдентификаторыПечатныхФорм", ИдентификаторыПечатныхФорм);
	ДополнительныеПараметрыКоманды.Вставить("НастройкиФорматаВложений", УправлениеПечатьюКлиент.НастройкиСохранения());
	
	ОписаниеКоманды = Новый Структура;
	ОписаниеКоманды.Вставить("ДополнительныеПараметры", ДополнительныеПараметрыКоманды);
	
	ПараметрыВыполненияКоманды = ПодключаемыеКомандыКлиент.ПараметрыВыполненияКоманды();
	ПараметрыВыполненияКоманды.Форма = ДополнительныеПараметры.Форма;
	ПараметрыВыполненияКоманды.ОписаниеКоманды = ОписаниеКоманды;
	
	ЭлектроннаяПочтаУНФКлиент.ОтправитьПечатныеФормыПоПочте(ДополнительныеПараметры.Предмет, ПараметрыВыполненияКоманды);
		
КонецПроцедуры

#КонецОбласти