#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИспользуетсяБСП = ОбщегоНазначенияБПО.ИспользуетсяБСП();
	ИспользуетсяПечатьБСП = Ложь;
	ИспользуютсяПодключаемыеКомандыБСП = Ложь;
	
	Если ИспользуетсяБСП Тогда
		ИспользуетсяПечатьБСП = ОбщегоНазначенияБПО.ПодсистемаСуществует("СтандартныеПодсистемы.Печать");
		ИспользуютсяПодключаемыеКомандыБСП =
			ОбщегоНазначенияБПО.ПодсистемаСуществует("СтандартныеПодсистемы.ПодключаемыеКоманды");
	КонецЕсли;
	
	ЭтотОбъект.ИспользуетсяПечатьБСП = ИспользуетсяПечатьБСП;
	ЭтотОбъект.ИспользуютсяПодключаемыеКомандыБСП = ИспользуютсяПодключаемыеКомандыБСП;
	Элементы.СписокПечатьИнструкцииПокупателяMAX.Видимость = ИспользуетсяПечатьБСП;
	
	// Вызов БСП
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	Если ИспользуютсяПодключаемыеКомандыБСП Тогда
		МодульПодключаемыеКоманды = ОбщегоНазначенияБПО.ОбщийМодуль("ПодключаемыеКоманды");
		МодульПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	// Конец Вызов БСП
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	ОбновитьПодключаемыеКоманды();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриНаведении(Элемент, Строка, Поле)
	
	ОбновитьПодключаемыеКоманды();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПечатьИнструкцииПокупателяMAX(Команда)
	
	Если Не ИспользуетсяПечатьБСП Тогда
		Возврат;
	КонецЕсли;
	
	ТабличныйДокумент = МакетИнструкцииПокупателяMAXНаСервере();
	
	МодульУправлениеПечатьюКлиент = ОбщегоНазначенияБПОКлиент.ОбщийМодуль("УправлениеПечатьюКлиент");
	ИдентификаторПечатнойФормы = "ИнструкцияПокупателяMAX";
	КоллекцияПечатныхФорм = МодульУправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм(
		ИдентификаторПечатнойФормы);
	ПечатнаяФорма = МодульУправлениеПечатьюКлиент.ОписаниеПечатнойФормы(
		КоллекцияПечатныхФорм, ИдентификаторПечатнойФормы);
	
	ПечатнаяФорма.СинонимМакета = НСтр("ru = 'Инструкция покупателя MAX'");
	ПечатнаяФорма.ТабличныйДокумент = ТабличныйДокумент;
	ПечатнаяФорма.ТабличныйДокумент.АвтоМасштаб = Истина;
	
	МодульУправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция МакетИнструкцииПокупателяMAXНаСервере()
	
	Возврат МенеджерОборудования.МакетИнструкцииПокупателяMAX();
	
КонецФункции

&НаКлиенте
Процедура ОбновитьПодключаемыеКоманды()
	
	// Вызов БСП
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	Если ИспользуютсяПодключаемыеКомандыБСП Тогда
		МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияБПОКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
		МодульПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	// Конец Вызов БСП
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	
	// Вызов БСП
	Если ИспользуютсяПодключаемыеКомандыБСП Тогда
		МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияБПОКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
		МодульПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Элементы.Список);
	КонецЕсли;
	// Конец Вызов БСП
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры)
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(Знач ПараметрыВыполнения)
	
	// Вызов БСП
	Если ИспользуютсяПодключаемыеКомандыБСП Тогда
		МодульПодключаемыеКоманды = ОбщегоНазначенияБПО.ОбщийМодуль("ПодключаемыеКоманды");
		МодульПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Элементы.Список);
	КонецЕсли;
	// Конец Вызов БСП
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	
	// Вызов БСП
	Если ИспользуютсяПодключаемыеКомандыБСП Тогда
		МодульПодключаемыеКомандыКлиентСервер = ОбщегоНазначенияБПОКлиент.ОбщийМодуль(
			"ПодключаемыеКомандыКлиентСервер");
		МодульПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
	КонецЕсли;
	// Конец Вызов БСП
	
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти
