
#Область ОбменСБанками

// Получает данные выписки банка в текстовом формате
//
// Параметры:
//  СообщениеОбмена - ДокументСсылка.СообщенияОбменСБанками - сообщение обмена с выпиской банка
//  СсылкаНаХранилище - Строка - адрес временного хранилища, куда будет помещена текстовая выписка банка
//  МассивСчетов - Массив - массив банковских счетов, находящихся в выписке
//  Организация - ОпределяемыйТип.Организация - организация, для которой получена выписка
//  НастройкаОбмена - СправочникСсылка.НастройкиОбменСБанками - действующая настройка обмена с банком.
//
Процедура ПолучитьДанныеВыпискиБанкаТекстовыйФормат(Знач СообщениеОбмена, СсылкаНаХранилище, МассивСчетов = Неопределено, Организация = Неопределено, НастройкаОбмена = Неопределено) Экспорт
	
	Перем ТекстВыписки;
	
	РеквизитыСообщения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СообщениеОбмена, "Организация, НастройкаОбмена, ВидЭД");
	
	Если НЕ РеквизитыСообщения.ВидЭД = Перечисления.ВидыЭДОбменСБанками.ВыпискаБанка Тогда
		Возврат
	КонецЕсли;
	
	Организация = РеквизитыСообщения.Организация;
	НастройкаОбмена = РеквизитыСообщения.НастройкаОбмена;
	
	ОбменСБанками.ПолучитьДанныеВыпискиБанкаТекстовыйФормат(СообщениеОбмена, СсылкаНаХранилище, МассивСчетов);
	
КонецПроцедуры

#КонецОбласти

#Область ЭПД

Функция ДанныеЗаполненияЭТрН(Основание) Экспорт
	ДанныеЗаполнения = Новый Структура;
	
	Если НЕ ЗначениеЗаполнено(Основание) 
		ИЛИ (ТипЗнч(Основание) <> Тип("ДокументСсылка.РасходнаяНакладная")
			И ТипЗнч(Основание) <> Тип("ДокументСсылка.ЗаказПокупателя")) Тогда
		
		Возврат ДанныеЗаполнения;
	КонецЕсли; 
	
	СписокРеквизитов = "Организация, Контрагент, Грузоотправитель, Грузополучатель, 
		|Перевозчик, Дата, Номер, АдресДоставки, АдресДоставкиЗначение, 
		|Организация, ЭтоУниверсальныйДокумент";
	
	РеквизитыОснования = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
		Основание, СписокРеквизитов);
		
	ДанныеЗаполнения.Вставить("ДокументыОснования", Новый Массив);
	ДанныеЗаполнения.ДокументыОснования.Добавить(Новый Структура("ДокументОснование", Основание));
		
	ДанныеЗаполнения.Вставить("Организация", РеквизитыОснования.Организация);
	
	
	ДанныеЗаполнения.Вставить("ТитулГрузоотправителяЗаказДата", РеквизитыОснования.Дата);
	
	ДанныеЗаполнения.Вставить("СсылкаТитулГрузоотправителяГрузоотправитель", ?(ЗначениеЗаполнено(РеквизитыОснования.Грузоотправитель), 
		РеквизитыОснования.Грузоотправитель, РеквизитыОснования.Организация));
	
	ДанныеЗаполнения.Вставить("СсылкаТитулГрузоотправителяГрузополучатель", ?(ЗначениеЗаполнено(РеквизитыОснования.Грузополучатель), 
		РеквизитыОснования.Грузополучатель, РеквизитыОснования.Контрагент));
		
	ДанныеЗаполнения.Вставить("СсылкаТитулГрузоотправителяПеревозчик", РеквизитыОснования.Перевозчик);
	
	ОбменСГИСЭПДКлиентСервер.ЗаполнитьРеквизитыУчастника(
		ДанныеЗаполнения.СсылкаТитулГрузоотправителяГрузоотправитель, "ТитулГрузоотправителяГрузоотправитель", ДанныеЗаполнения, Неопределено);
		
	ОбменСГИСЭПДКлиентСервер.ЗаполнитьРеквизитыУчастника(
		ДанныеЗаполнения.СсылкаТитулГрузоотправителяГрузополучатель, "ТитулГрузоотправителяГрузополучатель", ДанныеЗаполнения, Неопределено);
		
	ОбменСГИСЭПДКлиентСервер.ЗаполнитьРеквизитыУчастника(
		ДанныеЗаполнения.СсылкаТитулГрузоотправителяПеревозчик, "ТитулГрузоотправителяПеревозчик", ДанныеЗаполнения, Неопределено);
	
	ДанныеЗаполненияАдрес(ДанныеЗаполнения, РеквизитыОснования.АдресДоставкиЗначение, 
		РеквизитыОснования.АдресДоставки, "ТитулГрузоотправителяГрузополучательАдресДоставки");
		
	Возврат ДанныеЗаполнения;

КонецФункции

Функция ДанныеЗаполненияЭЗЗ(Основание) Экспорт
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.СчетНаОплату") Тогда
		Возврат ДанныеЗаполненияЭЗЗПоДаннымСчета(Основание);
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		Возврат ДанныеЗаполненияЭЗЗПоДаннымРеализации(Основание);
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.РасходнаяНакладная") Тогда
		Возврат ДанныеЗаполненияЭЗЗПоДаннымРеализации(Основание);
	КонецЕсли;
КонецФункции

Функция ДанныеЗаполненияЭПЭ(Основание) Экспорт
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.СчетНаОплату") Тогда
		Возврат ДанныеЗаполненияЭПЭПоДаннымСчета(Основание);
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		Возврат ДанныеЗаполненияЭПЭПоДаннымРеализации(Основание);
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.РасходнаяНакладная") Тогда
		Возврат ДанныеЗаполненияЭПЭПоДаннымРеализации(Основание);
	КонецЕсли;
КонецФункции

Функция ДанныеЗаполненияЭЗЗПоДаннымСчета(Основание) 
	
	ДанныеЗаполнения = Новый Структура;
	
	СписокРеквизитов = "Организация, Контрагент, Дата, Номер, Организация"; 
	
	РеквизитыОснования = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
		Основание, СписокРеквизитов);
		
	ДанныеЗаполнения.Вставить("ДокументыОснования", Новый Массив);
	ДанныеЗаполнения.ДокументыОснования.Добавить(Новый Структура("ДокументОснование", Основание));
		
	ДанныеЗаполнения.Вставить("Организация", РеквизитыОснования.Организация);
	
	ДанныеЗаполнения.Вставить("ТитулГрузоотправителяЗаказДата", РеквизитыОснования.Дата);
	
	ДанныеЗаполнения.Вставить("СсылкаТитулГрузоотправителяГрузоотправитель", РеквизитыОснования.Организация);
	
	ДанныеЗаполнения.Вставить("СсылкаТитулГрузоотправителяГрузополучатель", РеквизитыОснования.Контрагент);
		
	ОбменСГИСЭПДКлиентСервер.ЗаполнитьРеквизитыУчастника(
		ДанныеЗаполнения.СсылкаТитулГрузоотправителяГрузоотправитель, "ТитулГрузоотправителяГрузоотправитель", ДанныеЗаполнения, Неопределено);
		
	ОбменСГИСЭПДКлиентСервер.ЗаполнитьРеквизитыУчастника(
		ДанныеЗаполнения.СсылкаТитулГрузоотправителяГрузополучатель, "ТитулГрузоотправителяГрузополучатель", ДанныеЗаполнения, Неопределено);
		
	Возврат ДанныеЗаполнения;
	
КонецФункции

Функция ДанныеЗаполненияЭЗЗПоДаннымРеализации(Основание) 
	
	ДанныеЗаполнения = Новый Структура;
	
	СписокРеквизитов = "Организация, Контрагент, Грузоотправитель, Грузополучатель, 
		|Перевозчик, Дата, Номер, АдресДоставки, АдресДоставкиЗначение, 
		|Организация, ЭтоУниверсальныйДокумент";
	
	РеквизитыОснования = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
		Основание, СписокРеквизитов);
		
	ДанныеЗаполнения.Вставить("ДокументыОснования", Новый Массив);
	ДанныеЗаполнения.ДокументыОснования.Добавить(Новый Структура("ДокументОснование", Основание));
		
	ДанныеЗаполнения.Вставить("Организация", РеквизитыОснования.Организация);
	
	
	ДанныеЗаполнения.Вставить("ТитулГрузоотправителяЗаказДата", РеквизитыОснования.Дата);
	
	ДанныеЗаполнения.Вставить("СсылкаТитулГрузоотправителяГрузоотправитель", ?(ЗначениеЗаполнено(РеквизитыОснования.Грузоотправитель), 
		РеквизитыОснования.Грузоотправитель, РеквизитыОснования.Организация));
	
	ДанныеЗаполнения.Вставить("СсылкаТитулГрузоотправителяГрузополучатель", ?(ЗначениеЗаполнено(РеквизитыОснования.Грузополучатель), 
		РеквизитыОснования.Грузополучатель, РеквизитыОснования.Контрагент));
		
	ДанныеЗаполнения.Вставить("СсылкаТитулГрузоотправителяПеревозчик", РеквизитыОснования.Перевозчик);
	
	ОбменСГИСЭПДКлиентСервер.ЗаполнитьРеквизитыУчастника(
		ДанныеЗаполнения.СсылкаТитулГрузоотправителяГрузоотправитель, "ТитулГрузоотправителяГрузоотправитель", ДанныеЗаполнения, Неопределено);
		
	ОбменСГИСЭПДКлиентСервер.ЗаполнитьРеквизитыУчастника(
		ДанныеЗаполнения.СсылкаТитулГрузоотправителяГрузополучатель, "ТитулГрузоотправителяГрузополучатель", ДанныеЗаполнения, Неопределено);
		
	ОбменСГИСЭПДКлиентСервер.ЗаполнитьРеквизитыУчастника(
		ДанныеЗаполнения.СсылкаТитулГрузоотправителяПеревозчик, "ТитулГрузоотправителяПеревозчик", ДанныеЗаполнения, Неопределено);
	
	ДанныеЗаполненияАдрес(ДанныеЗаполнения, РеквизитыОснования.АдресДоставкиЗначение, 
		РеквизитыОснования.АдресДоставки, "ТитулГрузоотправителяГрузополучательАдресДоставки");
		
	Возврат ДанныеЗаполнения;
	
КонецФункции

Функция ДанныеЗаполненияЭПЭПоДаннымСчета(Основание)
	
	ДанныеЗаполнения = Новый Структура;
	
	СписокРеквизитов = "Организация, Контрагент, Дата, Номер, Организация"; 
	
	РеквизитыОснования = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
		Основание, СписокРеквизитов);
		
	ДанныеЗаполнения.Вставить("ДокументыОснования", Новый Массив);
	ДанныеЗаполнения.ДокументыОснования.Добавить(Новый Структура("ДокументОснование", Основание));
		
	ДанныеЗаполнения.Вставить("Организация", РеквизитыОснования.Организация);

	ДанныеЗаполнения.Вставить("ТитулЗаказчикаДата", РеквизитыОснования.Дата);

	ДанныеЗаполнения.Вставить("СсылкаТитулЗаказчикаЗаказчик", РеквизитыОснования.Организация);
	
	Параметры = Новый Структура;
	Параметры.Вставить("АдресВСвободнойФорме", Истина);

	ОбменСГИСЭПДКлиентСервер.ЗаполнитьРеквизитыУчастника(
		РеквизитыОснования.Организация,
		"ТитулЗаказчикаЗаказчик", ДанныеЗаполнения, Неопределено,,Параметры);

	Возврат ДанныеЗаполнения;
	
КонецФункции

Функция ДанныеЗаполненияЭПЭПоДаннымРеализации(Основание)
	
	ДанныеЗаполнения = Новый Структура;
	
	СписокРеквизитов = "Организация, Контрагент, Грузоотправитель, Грузополучатель, 
		|Перевозчик, Дата, Номер, АдресДоставки, АдресДоставкиЗначение, 
		|Организация, ЭтоУниверсальныйДокумент";
	
	РеквизитыОснования = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
		Основание, СписокРеквизитов);
		
	ДанныеЗаполнения.Вставить("ДокументыОснования", Новый Массив);
	ДанныеЗаполнения.ДокументыОснования.Добавить(Новый Структура("ДокументОснование", Основание));

	ДанныеЗаполнения.Вставить("Организация", РеквизитыОснования.Организация);

	ДанныеЗаполнения.Вставить("ТитулЗаказчикаДата", РеквизитыОснования.Дата);

	ДанныеЗаполнения.Вставить("СсылкаТитулЗаказчикаЗаказчик", РеквизитыОснования.Организация);
	
	Параметры = Новый Структура;
	Параметры.Вставить("АдресВСвободнойФорме", Истина);

	ОбменСГИСЭПДКлиентСервер.ЗаполнитьРеквизитыУчастника(
		РеквизитыОснования.Организация,
		"ТитулЗаказчикаЗаказчик", ДанныеЗаполнения, Неопределено,,Параметры);

	Возврат ДанныеЗаполнения;
КонецФункции

Функция ДанныеЗаполненияАдрес(ДанныеЗаполнения, Знач АдресЗначение, Знач АдресПредставление, Префикс)
	
	Если НЕ ЗначениеЗаполнено(АдресЗначение)
		ИЛИ НЕ УправлениеКонтактнойИнформациейКлиентСервер.ЭтоКонтактнаяИнформацияВJSON(АдресЗначение) Тогда
		
		Если ЗначениеЗаполнено(АдресПредставление) Тогда
			АдресЗначение = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияПоПредставлению(
				АдресПредставление, Справочники.ВидыКонтактнойИнформации.АдресДоставкиКонтрагента);
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(АдресЗначение) Тогда
			Возврат ДанныеЗаполнения;
		КонецЕсли;
	КонецЕсли; 

	СтруктураАдреса = РаботаСАдресами.СведенияОбАдресе(АдресЗначение);
	
	Если СтруктураАдреса.ТипАдреса = "ВСвободнойФорме" Тогда
		ДанныеЗаполнения.Вставить(Префикс + "Представление",   СтруктураАдреса.Представление);
		ДанныеЗаполнения.Вставить(Префикс + "КодСтраны",       СтруктураАдреса.КодСтраны);
	Иначе	
		ДанныеЗаполнения.Вставить(Префикс + "Индекс",          СтруктураАдреса.Индекс);
		ДанныеЗаполнения.Вставить(Префикс + "КодРегиона",      СтруктураАдреса.КодРегиона);
		ДанныеЗаполнения.Вставить(Префикс + "Город",           СтруктураАдреса.Город 
			+ ?(СтруктураАдреса.ГородТипКраткий = "", "", " ") + СтруктураАдреса.ГородТипКраткий); 
		ДанныеЗаполнения.Вставить(Префикс + "Район",           СтруктураАдреса.Район 
			+ ?(СтруктураАдреса.РайонТипКраткий = "", "", " ") + СтруктураАдреса.РайонТипКраткий);
		ДанныеЗаполнения.Вставить(Префикс + "НаселенныйПункт", СтруктураАдреса.НаселенныйПункт 
			+ ?(СтруктураАдреса.НаселенныйПунктТипКраткий = "", "", " ") + СтруктураАдреса.НаселенныйПунктТипКраткий);
		ДанныеЗаполнения.Вставить(Префикс + "Улица",           СтруктураАдреса.Улица 
			+ ?(СтруктураАдреса.УлицаТипКраткий = "", "", " ") + СтруктураАдреса.УлицаТипКраткий);
		ДанныеЗаполнения.Вставить(Префикс + "Дом",             СтруктураАдреса.Здание.Номер);
		Если СтруктураАдреса.Корпуса.Количество() > 0 Тогда
			ДанныеЗаполнения.Вставить(Префикс + "Корпус",      СтруктураАдреса.Корпуса[0].Номер);
		КонецЕсли;
	КонецЕсли;

	Возврат ДанныеЗаполнения;
КонецФункции

Функция СписокРеализацийПоЗаказам(Заказы) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РасходнаяНакладная.Заказ КАК Заказ,
	|	РасходнаяНакладная.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.РасходнаяНакладная КАК РасходнаяНакладная
	|ГДЕ
	|	РасходнаяНакладная.ДокументОснование В(&Заказы)
	|	И РасходнаяНакладная.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РасходнаяНакладная.ДокументОснование,
	|	РасходнаяНакладная.Ссылка
	|ИЗ
	|	Документ.РасходнаяНакладная КАК РасходнаяНакладная
	|ГДЕ
	|	РасходнаяНакладная.ДокументОснование В(&Заказы)
	|	И РасходнаяНакладная.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РасходнаяНакладнаяЗапасы.Заказ,
	|	РасходнаяНакладнаяЗапасы.Ссылка
	|ИЗ
	|	Документ.РасходнаяНакладная.Запасы КАК РасходнаяНакладнаяЗапасы
	|ГДЕ
	|	РасходнаяНакладнаяЗапасы.Заказ В(&Заказы)
	|	И РасходнаяНакладнаяЗапасы.Ссылка.Проведен";
	
	Запрос.УстановитьПараметр("Заказы", Заказы);
	
	// Считаем, что если у пользователя есть доступ к счетам и заказам покупателей, то к реализациям тоже должен быть.
	// Поэтому для оптимизации вкючаем привилегированный режим.
	УстановитьПривилегированныйРежим(Истина);
	ТаблицаЗаказов = Запрос.Выполнить().Выгрузить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ОбщегоНазначения.ВыгрузитьКолонку(
		ТаблицаЗаказов, "Заказ", Истина);
	
КонецФункции

Функция ЭлектронныеДокументыПоОснованию(ДокументСсылка, ТипСсылки = Неопределено) Экспорт 
	Возврат УправлениеНебольшойФирмойЭлектронныеДокументыСервер.ЭлектронныеДокументыПоОснованию(ДокументСсылка, ТипСсылки);
КонецФункции

// Проверяет, что для документа ещё нет ни Электронного заказа-заявки, 
// ни Электронной транспортной накладной.
// В этом случае разрешает выбор типа "Электронное поручение экспедитору".
//
// Возвращаемое значение:
//  Булево - Истина, если можно создать поручение экспедитору.
//
Функция МожноСоздатьПоручениеЭкспедитору(Объект) Экспорт 
	
	СписокОснований = УправлениеНебольшойФирмойЭлектронныеДокументыКлиентСервер.СписокСчетовИЗаказовПокупателей(Объект);
	СписокОснований.Добавить(Объект.Ссылка);
	
	СписокДокументов = УправлениеНебольшойФирмойЭлектронныеДокументыСервер.ЭлектронныеДокументыПоОснованию(Объект.Ссылка);
	
	ЭлектронныеДокументы = УправлениеНебольшойФирмойЭлектронныеДокументыСервер.РазложитьСписокПоТипамЗначенийОбъектов(СписокДокументов.ВыгрузитьЗначения());
	
	Возврат ЭлектронныеДокументы[Тип("ДокументСсылка.ЭлектронныйЗаказЗаявка")] = Неопределено 
		И ЭлектронныеДокументы[Тип("ДокументСсылка.ЭлектроннаяТранспортнаяНакладная")] = Неопределено;
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Находит ссылку на объект ИБ по типу, ИД и дополнительным реквизитам.
// 
// Параметры:
//  ТипОбъекта - Строка - идентификатор типа объекта, который необходимо найти.
//  ИДОбъекта - Строка - идентификатор объекта заданного типа.
//  ДополнительныеРеквизиты - Структура - набор дополнительных полей объекта для поиска.
//  ИДЭД - Строка - идентификатор электронного документа.
//
// Возвращаемое значение:
//  Ссылка - найденное значение.
//
Функция НайтиСсылкуНаОбъект(ТипОбъекта,
							ИдОбъекта = "",
							ДополнительныеРеквизиты = Неопределено,
							ИДЭД = Неопределено) Экспорт
							
	Результат = Неопределено;
							
	ЭлектронноеВзаимодействиеПереопределяемый.НайтиСсылкуНаОбъект(ТипОбъекта, Результат, ИдОбъекта, ДополнительныеРеквизиты, ИДЭД);
	
	Возврат Результат;
	
КонецФункции

Функция ДанныеВыбораУпаковки(Параметры) Экспорт
	
	ДанныеВыбора = Справочники.ЕдиницыИзмерения.ПолучитьДанныеВыбора(Параметры);
	
	Возврат ДанныеВыбора;
	
КонецФункции

Функция ЭтоЗаказНаряд(Ссылка)Экспорт

	ВидОперации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "ВидОперации"); 
	
	Возврат ВидОперации = Перечисления.ВидыОперацийЗаказПокупателя.ЗаказНаряд
		ИЛИ ВидОперации = Перечисления.ВидыОперацийЗаказПокупателя.ЗаявкаЗаказНаряд;

КонецФункции 

#КонецОбласти
