
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РабочееМесто = МенеджерОборудованияВызовСервера.РабочееМестоКлиента();
	ОбщегоНазначенияРМК.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	НастроитьДоступныеДействияНаФорме();
	ПараметрыИнтерфейса = Новый Структура("УвеличенныйВариантМасштаба", УвеличенныйВариантМасштаба);
	ИнтерфейсРМКСлужебный.ПрименитьНаФормеМасштабИзПараметров(ЭтотОбъект, ПараметрыИнтерфейса);
	
	УровниПрофилейРМК = ИнтерфейсРМКСлужебныйКлиентСервер.УровниПрофилейРМК();
	Если МаксимальныйПрофильТекущегоПользователя = УровниПрофилейРМК.ПолноправныйПользователь Или ЕстьНастройкаКСО Тогда
		ЗаполнитьПользователя();
		ПроверитьКассовыеСмены();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	РежимОсновногоОкна = КлиентскоеПриложение.ПолучитьРежимОсновногоОкна();
	Элементы.ГруппаКоманд.Видимость = (РежимОсновногоОкна = РежимОсновногоОкнаКлиентскогоПриложения.Киоск);
	ОтображатьЗаголовок = (Не РежимОсновногоОкна = РежимОсновногоОкнаКлиентскогоПриложения.Киоск);
	УстановитьДоступностьЗапускаКСО();
	УстановитьДоступностьВыбораКассира();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "РабочееМестоКассираУспешноНастроено" Тогда
		ОпределитьНаличиеНастройкиДляКСО();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПользовательПриИзменении(Элемент)
	ПользовательПриИзмененииКлиент();
КонецПроцедуры

&НаКлиенте
Процедура КассирДляЗапускаПриИзменении(Элемент)
	ОбработатьВыборКассира();
КонецПроцедуры

&НаКлиенте
Процедура КассирДляЗапускаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОбработкаОповещения = Новый ОписаниеОповещения("ВыборКассираЗавершение", ЭтотОбъект);
	ПараметрыОткрытияФормы = Новый Структура("НастроитьКассировДляВхода", НастроитьКассировДляВхода);
	ПараметрыОткрытияФормы.Вставить("РежимКассыСамообслуживания", Истина);
	ПараметрыОткрытияФормы.Вставить("ПользовательРМК", Пользователь);
	
	ОткрытьФорму("Обработка.РабочееМестоКассира.Форма.ФормаВыбораПерсонала", ПараметрыОткрытияФормы, ЭтотОбъект,,,,
		ОбработкаОповещения,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ТорговыйОбъектПриИзменении(Элемент)
	
	ПроверитьКассовыеСмены();
	УстановитьДоступностьЗапускаКСО();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗапуститьРежимКассыСамообслуживания(Команда)
	ПерезапуститьПриложение();
КонецПроцедуры

&НаКлиенте
Процедура УправлениеФискальнымУстройством(Команда)
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("УправлениеФискальнымУстройствомЗавершение", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.УправлениеФискальнымУстройством",, ЭтотОбъект,,,,
		ОповещениеОЗакрытии,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСмену(Команда)
	ОткрытьФормуУправленияКассовымиСменами();
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьСмену(Команда)
	ОткрытьФормуУправленияКассовымиСменами();
КонецПроцедуры

&НаКлиенте
Процедура СверкаИтогов(Команда)
	
	Если ТаблицаКассККМОрганизаций.Количество() > 0 И ТаблицаТерминалы.Количество() > 0 Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("СверкаИтоговЗавершение", ЭтотОбъект);
		ТекстВопроса = НСтр("ru='Уверены, что хотите выполнить сверку итогов?'");
		ЗаголовокВопроса = НСтр("ru='Сверка итогов'");
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , , ЗаголовокВопроса);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьРаботу(Команда)
	ЗавершитьРаботуСистемы();
КонецПроцедуры

&НаКлиенте
Процедура ОбучениеУстройствРаспознавания(Команда)
	ОткрытьФормуОбученияУстройствРаспознавания();
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПодключаемоеОборудование(Команда)
	МенеджерОборудованияРМККлиент.ОткрытьПодключаемоеОборудование(ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПользовательПриИзмененииКлиент()
	
	ТорговыйОбъектДо = ТорговыйОбъект;
	ПерезаполнитьРеквизитыПриСменеПользователя();
	Если Пользователь = ТекущийПользовательБД Тогда
		Пароль = "";
	КонецЕсли;
	Элементы.Пароль.ТолькоПросмотр = (Пользователь = ТекущийПользовательБД);
	Если Не ТорговыйОбъектДо = ТорговыйОбъект Тогда
		ПроверитьКассовыеСмены();
	КонецЕсли;
	УстановитьДоступностьЗапускаКСО();
	УстановитьДоступностьВыбораКассира();
	
КонецПроцедуры

&НаКлиенте
Функция СформироватьПараметрЗапуска()
	
	ТекстПараметра = "BRMK_KSO";
	
	Если ТипЗнч(Кассир) = Тип("Строка") Тогда
		ОтметкаНачала = "&CashierStart";
		ОтметкаОкончания = "&CashierEnd";
		ТекстПараметра = СтрШаблон("%1%2%3%4", ТекстПараметра, ОтметкаНачала, СокрЛП(ИмяКассира), ОтметкаОкончания);
	КонецЕсли;
	
	Возврат ТекстПараметра;
	
КонецФункции

&НаКлиенте
Процедура ПерезапуститьПриложение()
	
	ДанныеДляЗапуска = Новый Структура;
	ДанныеДляЗапуска.Вставить("РольКассаСамообслуживанияДоступна", Ложь);
	ДанныеДляЗапуска.Вставить("ПредставлениеПользователя", "");
	ДанныеДляЗапуска.Вставить("ТекстОшибки", "");
	
	ЗаполнитьДанныеДляЗапуска(ДанныеДляЗапуска);
	
	Если Не ЗначениеЗаполнено(ТорговыйОбъект) Тогда
		ТекстСообщения = НСтр("ru = 'Не определен ""Торговый Объект"".'");
		ПоказатьПредупреждение(, ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Кассир) Тогда
		ТекстСообщения = НСтр("ru = 'Не заполнен ""Кассир"".'");
		ПоказатьПредупреждение(, ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	Если Не ДанныеДляЗапуска.РольКассаСамообслуживанияДоступна Тогда
		ТекстСообщения = НСтр("ru = 'У выбранного пользователя не доступна роль ""Касса самообслуживания"".'");
		ПоказатьПредупреждение(, ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДанныеДляЗапуска.ПредставлениеПользователя) Тогда
		ТекстСообщения = НСтр("ru = 'Представление пользователя не задано.'");
		ПоказатьПредупреждение(, ТекстСообщения);
		Возврат;
	КонецЕсли;

#Если ВебКлиент Тогда
	ТекстСообщения = НСтр("ru = 'Работа в веб-клиенте не поддерживается.'");
	ПоказатьПредупреждение(, ТекстСообщения);
	Возврат;
#Иначе
	
	Если ТекущийПользовательБД = Пользователь Тогда
		
		ПередатьПользователяПриНеобходимости(Кассир);
		ОбщегоНазначенияРМККлиент.ЗапуститьРабочийСтолРМКНаГлавномОкне();
		
	Иначе
		
		Если ПарольПользователяВведенКорректно(Пользователь, Пароль) Тогда
			
			ТекстПараметраЗапуска = СформироватьПараметрЗапуска();
			
			КаталогПрограммы = КаталогПрограммы() + "1cv8.exe";
			ПараметрыСоединения = СтроковыеФункцииКлиентСервер.ПараметрыИзСтроки(СтрокаСоединенияИнформационнойБазы());
			СтрокаСоединения = СформироватьСтрокуСоединения(ПараметрыСоединения);
			
			ИмяПользователя = ДанныеДляЗапуска.ПредставлениеПользователя;
			СтрокаЗапуска = """" + КаталогПрограммы + """" + " ENTERPRISE " + СтрокаСоединения + " /N " + """" + ИмяПользователя
				+ """" + " /P " + """" + Пароль + """"
				+ " /DisableStartupDialogs /C""" + ТекстПараметраЗапуска + """";
				
			ЗавершитьРаботуСистемы(Ложь, Истина, СтрокаЗапуска);
			
		Иначе
			
			ТекстСообщения = НСтр("ru = 'Пароль введен некорректно.'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, , "Пароль");
			
		КонецЕсли;
		
	КонецЕсли;
		
#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Функция СформироватьСтрокуСоединения(ПараметрыСоединения)
	
	РезультатФункции = "";
	Если ПараметрыСоединения.Свойство("file") Тогда
		РезультатФункции = СтрШаблон("/F ""%1""", ПараметрыСоединения.file);
	ИначеЕсли ПараметрыСоединения.Свойство("srvr") Тогда
		РезультатФункции = СтрШаблон("/S ""%1\%2""", ПараметрыСоединения.srvr, ПараметрыСоединения.ref);
	Иначе
		ВызватьИсключение НСтр("ru = 'Не удалось вычислить строку соединения.'");;
	КонецЕсли;
	Возврат РезультатФункции;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ПередатьПользователяПриНеобходимости(Кассир)
	
	УстановитьПривилегированныйРежим(Истина);
	Если ТипЗнч(Кассир) = Тип("Строка") Тогда
		ДанныеКассира = Новый Структура("Данные,Источник", Кассир, "Кассир");
		ПараметрыСеанса.БуферОбмена = Новый ФиксированнаяСтруктура(ДанныеКассира);
	КонецЕсли;
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПарольПользователяВведенКорректно(Знач Пользователь, Знач Пароль)
	
	РезультатФункции = Ложь;
	УстановитьПривилегированныйРежим(Истина);
	ИдентификаторПользователяИБ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Пользователь,
		"ИдентификаторПользователяИБ");
	
	ПользовательБазы = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(ИдентификаторПользователяИБ);
	ХешСохраненногоПароля = ПользовательБазы.СохраняемоеЗначениеПароля;
	Если ХешСохраненногоПароля = "" И Пароль = "" Тогда
		РезультатФункции = Истина;
	Иначе
		ХешВведенногоПароля = ПолучитьХешПароля(Пароль);
		ПозицияРазделителя = СтрНайти(ХешСохраненногоПароля, ",");
		Если ПозицияРазделителя > 0 Тогда
			ХешСохраненногоПароляРегистроНезависимый = Лев(ХешСохраненногоПароля, ПозицияРазделителя - 1);
			Если ХешСохраненногоПароляРегистроНезависимый = ХешВведенногоПароля Тогда
				РезультатФункции = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьХешПароля(Пароль)

	Хеш = Новый ХешированиеДанных(ХешФункция.SHA1);
	Хеш.Добавить(Пароль);
	Возврат Base64Строка(Хеш.ХешСумма);

КонецФункции

&НаСервере
Процедура ЗаполнитьДанныеДляЗапуска(ДанныеДляЗапуска)

	УстановитьПривилегированныйРежим(Истина);
	ДанныеПользователя
		= ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Пользователь, "ИдентификаторПользователяИБ");
	ПрочитанныеСвойства = Пользователи.СвойстваПользователяИБ(ДанныеПользователя.ИдентификаторПользователяИБ);
	
	ДанныеДляЗапуска.РольКассаСамообслуживанияДоступна = Пользователи.РолиДоступны("КассаСамообслуживания", Пользователь);
	ДанныеДляЗапуска.ПредставлениеПользователя = ПрочитанныеСвойства.Имя;
	ПерезаписатьПользователяПриНеобходимости();
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаСервере
Процедура ПерезаписатьПользователяПриНеобходимости()
	
	СтрокиПользователя = ТаблицаПользователейКСО.НайтиСтроки(Новый Структура("ПользовательБД", Пользователь));
	Если СтрокиПользователя.Количество() = 1 Тогда
		СтрокаПользователя = СтрокиПользователя[0];
		Если Не (СтрокаПользователя.Кассир = Кассир И СтрокаПользователя.ТорговыйОбъект = ТорговыйОбъект) Тогда
			ПараметрыПользователяКСО = Новый Структура();
			ПараметрыПользователяКСО.Вставить("КассирПользователя", СтрокаПользователя.Кассир);
			ПараметрыПользователяКСО.Вставить("ТорговыйОбъектПользователя", СтрокаПользователя.ТорговыйОбъект);
			ПараметрыПользователяКСО.Вставить("Кассир", Кассир);
			ПараметрыПользователяКСО.Вставить("ТорговыйОбъект", ТорговыйОбъект);
			
			ДополнительныеПараметры = Новый Структура();
			ДополнительныеПараметры.Вставить("НастроитьКассировДляВхода", НастроитьКассировДляВхода);
			
			ОбщегоНазначенияРМКПереопределяемый.ОбновитьПараметрыПользователяКСО(Пользователь,
				ПараметрыПользователяКСО, ДополнительныеПараметры);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьКассовыеСмены()
	
	НужноОткрытьСмену = Ложь;
	НужноЗакрытьСмену = Ложь;
	ЕстьИстекшаяСмена = Ложь;
	ТекстОшибкиОпределенияКассККМ = НСтр("ru = 'Ошибка определения доступных касс ККМ.'");
	ТаблицаКассККМОрганизаций.Очистить();
	ТаблицаТерминалы.Очистить();
	Если ЗначениеЗаполнено(ТорговыйОбъект) Тогда
		Запрос = Новый Запрос;
		ПараметрыДляЗапроса = Новый Структура("РабочееМесто,ТорговыйОбъект,РежимКСО", РабочееМесто, ТорговыйОбъект, Истина);
		ОбщегоНазначенияРМКПереопределяемый.СформироватьЗапросДанныеКассыККМ(Запрос, , ПараметрыДляЗапроса);
		Элементы.ОписаниеКассовыхСмен.ЦветТекста = ЦветаПалитры.Красный;
		Если ЗначениеЗаполнено(Запрос.Текст) Тогда
			РезультатЗапроса = Запрос.Выполнить();
			ВыборкаКасс = РезультатЗапроса.Выбрать();
			Если ВыборкаКасс.Количество() > 1 Тогда
				НастроитьФормуПриПревышенииКоличестваКассККМ();
			ИначеЕсли ВыборкаКасс.Количество() = 1 Тогда
				ВыборкаКасс.Следующий();
				НастроитьФормуВСоответствииСДаннымиКассовойСмены(ВыборкаКасс, ТекстОшибкиОпределенияКассККМ);
				ЗаполнитьЭквайринговыеТерминалы();
			Иначе
				Элементы.ОписаниеКассовыхСмен.Заголовок = ТекстОшибкиОпределенияКассККМ;
			КонецЕсли;
		Иначе
			Элементы.ОписаниеКассовыхСмен.Заголовок = ТекстОшибкиОпределенияКассККМ;
		КонецЕсли;
	Иначе
		Элементы.ОписаниеКассовыхСмен.Заголовок = "";
	КонецЕсли;
	Элементы.СверкаИтогов.Доступность = (ТаблицаТерминалы.Количество() > 0);
	Элементы.ГруппаРаботаСоСменами.Доступность = ЗначениеЗаполнено(Кассир) И ТаблицаКассККМОрганизаций.Количество() > 0;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЭквайринговыеТерминалы()
	
	Если ИспользоватьОплатуПлатежнымиКартами Тогда
		
		ПараметрыДляЗапроса = Новый Структура();
		ПараметрыДляЗапроса.Вставить("Объект", Новый Структура("ТорговыйОбъект", ТорговыйОбъект));
		ПараметрыДляЗапроса.Вставить("ТаблицаКассККМОрганизаций", ТаблицаКассККМОрганизаций);
		Запрос = Новый Запрос;
		ОбщегоНазначенияРМКПереопределяемый.СформироватьЗапросДанныеЭквайринговыхТерминалов(Запрос, ПараметрыДляЗапроса);
		Если ЗначениеЗаполнено(Запрос.Текст) Тогда
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				ДобавитьСтрокуТерминалаПриВозможности(Выборка);
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьСтрокуТерминалаПриВозможности(Выборка)
	
	Если ЗначениеЗаполнено(Выборка.ПодключаемоеОборудование)
			И ПодключаемоеОборудованиеИспользуется(Выборка.ПодключаемоеОборудование) Тогда
			
		НовыйТерминал = ТаблицаТерминалы.Добавить();
		ЗаполнитьЗначенияСвойств(НовыйТерминал, Выборка);
			
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьФормуПриПревышенииКоличестваКассККМ()
	
	Элементы.ОписаниеКассовыхСмен.Заголовок = 
		НСтр("ru = 'Работа в режиме кассы самообслуживания поддерживается только для одной кассы.'");
	НужноОткрытьСмену = Истина;
	Элементы.ГруппаРаботаСоСменами.Доступность = Ложь;
	
КонецПроцедуры

&НаСервере
Функция ПодключаемоеОборудованиеИспользуется(ПроверяемоеПодключаемоеОборудование)
	РезультатФункции = Истина;
	ОбщегоНазначенияРМКПереопределяемый.ЗаполнитьПризнакИспользованияПодключаемогоОборудования(ПроверяемоеПодключаемоеОборудование, РезультатФункции);
	Возврат РезультатФункции;
КонецФункции

&НаСервере
Процедура НастроитьФормуВСоответствииСДаннымиКассовойСмены(Выборка, ТекстОшибкиОпределенияКассККМ)
	
	ТекстСообщения = "";
	Сутки = 86400;
	ШаблонДляОткрытойСмены = НСтр("ru = '- ""%1"" на ККТ ""%2"" истекает в %3.'");
	ШаблонДляЗакрытойСмены = НСтр("ru = '- ""%1"" на ККТ ""%2"" закрыта. Требуется открыть кассовую смену.'");
	ШаблонДляНовойСмены = НСтр("ru = '- На ККТ ""%1"" не было кассовых смен. Требуется открыть кассовую смену.'");
	
	Если Выборка.ИспользоватьБезПодключенияОборудования Тогда
		ОписаниеПоследнейКассовойСмены = КассовыеСмены.ОписаниеПоследнейКассовойСмены(Выборка.КассаККМ);
	Иначе
		Если (ЗначениеЗаполнено(Выборка.ПодключаемоеОборудование) 
					И ПодключаемоеОборудованиеИспользуется(Выборка.ПодключаемоеОборудование)) Тогда
			
			ОписаниеПоследнейКассовойСмены = КассовыеСмены.ОписаниеПоследнейКассовойСмены(Выборка.ПодключаемоеОборудование);
			
		Иначе
			
			Элементы.ОписаниеКассовыхСмен.Заголовок = ТекстОшибкиОпределенияКассККМ;
			
		КонецЕсли;
	КонецЕсли;
	
	Если Не ОписаниеПоследнейКассовойСмены = Неопределено Тогда
		
		СтрокаКассыККМ = ТаблицаКассККМОрганизаций.Добавить();
		СменаОткрыта = Истина;
		Если МенеджерОборудованияРМК.КассоваяСменаОткрыта(ОписаниеПоследнейКассовойСмены.Статус) Тогда
			СтрокаКассыККМ.НачалоКассовойСмены = ОписаниеПоследнейКассовойСмены.НачалоКассовойСмены;
		Иначе
			СтрокаКассыККМ.НачалоКассовойСмены = Неопределено;
			СменаОткрыта = Ложь;
		КонецЕсли;
		
		ККМПоддерживаетПроверкуКодовМаркировки = Ложь;
		ОбщегоНазначенияРМКПереопределяемый.ЗаполнитьНеобходимостьПроверкиМаркиНаККТ(ККМПоддерживаетПроверкуКодовМаркировки,
			Выборка.ПодключаемоеОборудование);
		
		СтрокаКассыККМ.Организация = Выборка.Организация;
		СтрокаКассыККМ.КассаККМ = Выборка.КассаККМ;
		СтрокаКассыККМ.ИдентификаторУстройства = Выборка.ПодключаемоеОборудование;
		СтрокаКассыККМ.КассоваяСмена = ОписаниеПоследнейКассовойСмены.КассоваяСмена;
		СтрокаКассыККМ.НачалоКассовойСмены = ОписаниеПоследнейКассовойСмены.НачалоКассовойСмены;
		СтрокаКассыККМ.ДатаИстеченияСрокаДействия = ОписаниеПоследнейКассовойСмены.ДатаИстеченияСрокаДействия;
		СтрокаКассыККМ.Открыта = СменаОткрыта;
		
		СтрокаКассыККМ.СверятьСДаннымиОФД = Выборка.СверятьДанныеССервисомОФД;
		СтрокаКассыККМ.ПоддерживаетПроверкуКодовМаркировки = ККМПоддерживаетПроверкуКодовМаркировки;
		СтрокаКассыККМ.ИспользоватьБезПодключенияОборудования = Выборка.ИспользоватьБезПодключенияОборудования;
		СтрокаКассыККМ.ОблачнаяККТ = Выборка.ОблачнаяККТ;
		
		Если СменаОткрыта Тогда
			
			ТекстСообщения = ТекстСообщения + СтрШаблон(ШаблонДляОткрытойСмены,
				СтрокаКассыККМ.КассоваяСмена,
				СтрокаКассыККМ.ИдентификаторУстройства,
				СтрокаКассыККМ.ДатаИстеченияСрокаДействия) + Символы.ПС;
				
			Дата = ТекущаяДатаСеанса();
			Если Дата - СтрокаКассыККМ.НачалоКассовойСмены >= Сутки Тогда
				НужноЗакрытьСмену = Истина;
			КонецЕсли;
			ВремяНачалаСменыВСекундах = ВремяНачалаСмены - Дата(1, 1, 1);
			МинимальноеДатаНачалаСмены = НачалоДня(Дата) + ВремяНачалаСменыВСекундах;
			Если Дата < МинимальноеДатаНачалаСмены Тогда
				МинимальноеДатаНачалаСмены = МинимальноеДатаНачалаСмены - Сутки;
			КонецЕсли;
			Если СтрокаКассыККМ.НачалоКассовойСмены < МинимальноеДатаНачалаСмены Тогда
				ЕстьИстекшаяСмена = Истина;
				СтрокаКассыККМ.Истекла = Истина;
			КонецЕсли;
			
		ИначеЕсли ЗначениеЗаполнено(СтрокаКассыККМ.КассоваяСмена) Тогда
			ТекстСообщения = ТекстСообщения + СтрШаблон(ШаблонДляЗакрытойСмены,
				СтрокаКассыККМ.КассоваяСмена,
				СтрокаКассыККМ.ИдентификаторУстройства) + Символы.ПС;
				
			НужноОткрытьСмену = Истина;
		Иначе
			ТекстСообщения = ТекстСообщения
				+ СтрШаблон(ШаблонДляНовойСмены, СтрокаКассыККМ.ИдентификаторУстройства) + Символы.ПС;
				
			НужноОткрытьСмену = Истина;
		КонецЕсли;
	
	КонецЕсли;
	
	Элементы.ОписаниеКассовыхСмен.Заголовок = ТекстСообщения;
	ТребуетсяАктуализацияСмены = (НужноЗакрытьСмену Или НужноОткрытьСмену Или ЕстьИстекшаяСмена);
	Если ТребуетсяАктуализацияСмены Или ТаблицаКассККМОрганизаций.Количество() = 0 Тогда
		Элементы.ОписаниеКассовыхСмен.ЦветТекста = ЦветаПалитры.Красный;
	Иначе
		Элементы.ОписаниеКассовыхСмен.ЦветТекста = ЦветаСтиля.ЦветТекстаПоложительногоЗначения;
	КонецЕсли;
	Элементы.ФормаОткрытьСмену.Видимость = НужноОткрытьСмену;
	Элементы.ЗакрытьСмену.Видимость = ТаблицаКассККМОрганизаций.Количество() > 0 И Не НужноОткрытьСмену;
	
КонецПроцедуры

&НаКлиенте
Процедура УправлениеФискальнымУстройствомЗавершение(Результат, ДополнительныеПараметры) Экспорт
	ПроверитьКассовыеСмены();
КонецПроцедуры

&НаСервере
Функция ПользовательУдовлетворяетУсловиямВходаВРежимКСО(ВыборкаПользователей)
	
	РезультатФункции = Ложь;
	
	Если Не Пользователи.ЭтоПолноправныйПользователь(ВыборкаПользователей.ПользовательБД, , Ложь)
			И (ПроверяемыйПрофильНижеТекущего(ВыборкаПользователей.СтаршийПрофиль)
				Или ТекущийПользовательБД = ВыборкаПользователей.ПользовательБД) Тогда
					
		РезультатФункции = Истина;
					
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьПользователя()
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТаблицаПользователей = Новый ТаблицаЗначений;
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("НастроитьКассировДляВхода", НастроитьКассировДляВхода);
	ОбщегоНазначенияРМКПереопределяемый.ЗаполнитьТаблицуПользователейКСО(ТаблицаПользователей, ДополнительныеПараметры);
	ПользовательНайден = Ложь;
	Для Каждого СтрокаПользователя Из ТаблицаПользователей Цикл
		Если ПользовательУдовлетворяетУсловиямВходаВРежимКСО(СтрокаПользователя) Тогда
			
			ДобавитьПользователяВСписокВыбора(СтрокаПользователя);
			Если Не ПользовательНайден Тогда
				Пользователь = СтрокаПользователя.ПользовательБД;
				Кассир = СтрокаПользователя.Кассир;
				ИмяКассира = СтрокаПользователя.ИмяКассира;
				ИННКассира = СтрокаПользователя.ИННКассира;
				СтаршийПрофильКассира = СтрокаПользователя.СтаршийПрофиль;
				Если ЗначениеЗаполнено(СтрокаПользователя.ТорговыйОбъект) Тогда
					ТорговыйОбъект = СтрокаПользователя.ТорговыйОбъект;
				КонецЕсли;
				ПользовательНайден = Истина;
				ЗаполнитьКассиромДляВходаПриНеобходимости();
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКассиромДляВходаПриНеобходимости()
	
	Если НастроитьКассировДляВхода Тогда
		
		КассирОбновлен = Ложь;
		КассирКСО = ОбщегоНазначенияРМК.ПолучитьКассираИзПараметраЗапуска();
		Если ЗначениеЗаполнено(КассирКСО) Тогда
			Кассир = КассирКСО;
			КассирОбновлен = Истина;
		ИначеЕсли Не ЗначениеЗаполнено(Кассир) Тогда
			ДоступныеКассиры = ОбщегоназначенияРМК.ПолучитьДоступныхКассировПользователя(Пользователь);
			Если ДоступныеКассиры.Количество() = 1 Тогда
				Кассир = ДоступныеКассиры[0];
				КассирОбновлен = Истина;
			КонецЕсли;
		КонецЕсли;
		Если КассирОбновлен Тогда
			РеквизитыКассира = ОбщегоНазначенияРМК.ПолучитьРеквизитыКассира(Кассир);
			ИмяКассира = РеквизитыКассира.Наименование;
			ИННКассира = РеквизитыКассира.ИНН;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПерезаполнитьРеквизитыПриСменеПользователя()
	
	ОчищатьКассира = Ложь;
	Если ЗначениеЗаполнено(Пользователь) Тогда
		
		СтрокиПользователя = ТаблицаПользователейКСО.НайтиСтроки(Новый Структура("ПользовательБД", Пользователь));
		Если СтрокиПользователя.Количество() = 1 Тогда
			Кассир = СтрокиПользователя[0].Кассир;
			ИмяКассира = СтрокиПользователя[0].ИмяКассира;
			ИННКассира = СтрокиПользователя[0].ИННКассира;
			СтаршийПрофильКассира = СтрокиПользователя[0].СтаршийПрофиль;
			Если ЗначениеЗаполнено(СтрокиПользователя[0].ТорговыйОбъект) Тогда
				ТорговыйОбъект = СтрокиПользователя[0].ТорговыйОбъект;
			КонецЕсли;
		Иначе
			ОчищатьКассира = Истина;
		КонецЕсли;
		
	Иначе
		ОчищатьКассира = Истина;
	КонецЕсли;
	
	Если ОчищатьКассира Тогда
		Кассир = Неопределено;
		ИмяКассира = "";
		ИННКассира = "";
		СтаршийПрофильКассира = Неопределено;
	КонецЕсли;
	Элементы.ГруппаРаботаСоСменами.Доступность = ЗначениеЗаполнено(Кассир) И ТаблицаКассККМОрганизаций.Количество() > 0;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьПользователяВСписокВыбора(ДанныеПользователя)
	Элементы.Пользователь.СписокВыбора.Добавить(ДанныеПользователя.ПользовательБД);
	НоваяСтрока = ТаблицаПользователейКСО.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, ДанныеПользователя);
КонецПроцедуры

&НаКлиенте
Функция ПодготовитьТаблицуКассККМДляПередачиВФормы()
	
	МассивКасс = Новый Массив;
	Для Каждого СтрокаТаблицыКасс Из ТаблицаКассККМОрганизаций Цикл
		
		ПараметрыКассы = Новый Структура();
		ПараметрыКассы.Вставить("Организация", СтрокаТаблицыКасс.Организация);
		ПараметрыКассы.Вставить("КассаККМ", СтрокаТаблицыКасс.КассаККМ);
		ПараметрыКассы.Вставить("ИдентификаторУстройства", СтрокаТаблицыКасс.ИдентификаторУстройства);
		ПараметрыКассы.Вставить("КассоваяСмена", СтрокаТаблицыКасс.КассоваяСмена);
		ПараметрыКассы.Вставить("НачалоКассовойСмены", СтрокаТаблицыКасс.НачалоКассовойСмены);
		ПараметрыКассы.Вставить("ДатаИстеченияСрокаДействия", СтрокаТаблицыКасс.ДатаИстеченияСрокаДействия);
		ПараметрыКассы.Вставить("Открыта", СтрокаТаблицыКасс.Открыта);
		ПараметрыКассы.Вставить("КоличествоОтложенныхИНепробитыхЧеков", 0);
		ПараметрыКассы.Вставить("ТребуетсяВыемкаПриЗакрытииСмены", Ложь);
		ПараметрыКассы.Вставить("ДенежныеСредстваВКассеККМ", 0);
		ПараметрыКассы.Вставить("МинимальныйОстатокНаличныхВКассе", 0);
		ПараметрыКассы.Вставить("СверятьСДаннымиОФД", СтрокаТаблицыКасс.СверятьСДаннымиОФД);
		ПараметрыКассы.Вставить("ПоддерживаетПроверкуКодовМаркировки",
			СтрокаТаблицыКасс.ПоддерживаетПроверкуКодовМаркировки);
		ПараметрыКассы.Вставить("ИспользоватьБезПодключенияОборудования",
			СтрокаТаблицыКасс.ИспользоватьБезПодключенияОборудования);
		МассивКасс.Добавить(ПараметрыКассы);
		
	КонецЦикла;
	Возврат МассивКасс;
	
КонецФункции

&НаКлиенте
Функция ПодготовитьТаблицуТерминаловДляУправленияКассовымиСменами()
	
	МассивТерминалов = Новый Массив;
	Для Каждого СтрокаТерминала Из ТаблицаТерминалы Цикл
		ПараметрыТерминала = Новый Структура();
		ПараметрыТерминала.Вставить("ЭквайринговыйТерминал", СтрокаТерминала.ЭквайринговыйТерминал);
		ПараметрыТерминала.Вставить("ИспользоватьБезПодключенияОборудования",
			СтрокаТерминала.ИспользоватьБезПодключенияОборудования);
		ПараметрыТерминала.Вставить("ПодключаемоеОборудование", СтрокаТерминала.ПодключаемоеОборудование);
		ПараметрыТерминала.Вставить("Организация", СтрокаТерминала.Организация);
		МассивТерминалов.Добавить(ПараметрыТерминала);
	КонецЦикла;
	Возврат МассивТерминалов;
	
КонецФункции

&НаКлиенте
Процедура ОткрытьФормуУправленияКассовымиСменами()
	
	ВозможныеКассовыеОперации = ИнтерфейсРМКСлужебныйКлиент.КассовыеОперации();
	
	ПараметрыДляОткрытия = Новый Структура();
	ПараметрыДляОткрытия.Вставить("РежимВыбора", Ложь);
	ПараметрыДляОткрытия.Вставить("ЗапускПриСтарте", Ложь);
	ПараметрыДляОткрытия.Вставить("ИспользоватьПодключаемоеОборудование", Истина);
	ПараметрыДляОткрытия.Вставить("РежимКассыСамообслуживания", Истина);
	ПараметрыДляОткрытия.Вставить("ИспользоватьЦифровуюКлавиатуру", Истина);
	ПараметрыДляОткрытия.Вставить("ИспользоватьДисплейПокупателя", Ложь);
	ПараметрыДляОткрытия.Вставить("ИспользоватьОплатуНаличными", Ложь);
	ПараметрыДляОткрытия.Вставить("ПравоПросмотраОстаткаНаличныхРМК", Истина);
	ПараметрыДляОткрытия.Вставить("ТаблицаКассККМ", ПодготовитьТаблицуКассККМДляПередачиВФормы());
	ПараметрыДляОткрытия.Вставить("ТаблицаТерминалов", ПодготовитьТаблицуТерминаловДляУправленияКассовымиСменами());
	ПараметрыДляОткрытия.Вставить("НастройкаРМК", НастройкаРМК);
	ПараметрыДляОткрытия.Вставить("РабочееМесто", РабочееМесто);
	ПараметрыДляОткрытия.Вставить("Пользователь", ТекущийПользовательБД);
	ПараметрыДляОткрытия.Вставить("Кассир", Кассир);
	ПараметрыДляОткрытия.Вставить("ТорговыйОбъект", ТорговыйОбъект);
	ПараметрыДляОткрытия.Вставить("СписокРолейПользователя", Новый СписокЗначений);
	ПараметрыДляОткрытия.Вставить("УвеличенныйВариантМасштаба", УвеличенныйВариантМасштаба);
	ПараметрыДляОткрытия.Вставить("ПодключенаОблачнаяККТ", ПодключенаОблачнаяККТ(ПараметрыДляОткрытия.ТаблицаКассККМ));
	ПараметрыДляОткрытия.Вставить("ОтключитьПодтверждениеОперацийАвтономнойККТ", ОтключитьПодтверждениеОперацийАвтономнойККТ);
	
	ДополнительныеПараметры = Новый Структура("КассоваяОперация", ВозможныеКассовыеОперации.УправлениеСменами);
	ОбработкаОповещения = Новый ОписаниеОповещения("РаботаСКассамиЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	УправлениеФормойПередано = Истина;
	
	ОкноДиалога = ЭтотОбъект.Окно;
	РежимБлокировкиОкна = РежимБлокировкиПриОткрытииОкнаФормы.БлокироватьВладельца;
	ТекущийРежимОкна = КлиентскоеПриложение.ПолучитьРежимОсновногоОкна();
	Если ТекущийРежимОкна = РежимОсновногоОкнаКлиентскогоПриложения.Киоск 
			Или ТекущийРежимОкна = РежимОсновногоОкнаКлиентскогоПриложения.РабочееМесто
			Или ТекущийРежимОкна = РежимОсновногоОкнаКлиентскогоПриложения.ПолноэкранноеРабочееМесто Тогда
		РежимБлокировкиОкна = РежимБлокировкиПриОткрытииОкнаФормы.НеБлокировать;
		ОкноДиалога = Неопределено;
	КонецЕсли;
	
	ОткрытьФорму("Обработка.РабочееМестоКассира.Форма.ФормаУправленияКассовымиСменами", ПараметрыДляОткрытия,
		ЭтотОбъект,,ОкноДиалога,,ОбработкаОповещения, РежимБлокировкиОкна);
	
КонецПроцедуры

&НаКлиенте
Процедура РаботаСКассамиЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		Если Результат.БылоОткрытиеСмены Или Результат.БылоЗакрытиеСмены Тогда
			ПроверитьКассовыеСмены();
			УстановитьДоступностьЗапускаКСО();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СверкаИтоговЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ВыполнитьСверкуИтогов();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьСверкуИтогов()
	
	Если ТаблицаКассККМОрганизаций.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	СтрокаКассы = ТаблицаКассККМОрганизаций[0];
	
	Для Каждого Терминал Из ТаблицаТерминалы Цикл
		
		Если НЕ Терминал.ИспользоватьБезПодключенияОборудования
			И ЗначениеЗаполнено(Терминал.ПодключаемоеОборудование) Тогда
			
			ПараметрыЗавершенияСверки = Новый Структура("ЗакрытиеСмены", Ложь);
			Оповещение = Новый ОписаниеОповещения("ВыполнитьСверкуИтоговЗавершение", ЭтотОбъект, ПараметрыЗавершенияСверки);
			
			ЭквайринговыйТерминал = Терминал.ПодключаемоеОборудование;
			ПечатающееУстройство = СтрокаКассы.ИдентификаторУстройства;
			ПараметрыОперации = МенеджерОборудованияРМККлиентСервер.ПараметрыВыполненияЭквайринговойОперации();
			Если СтрокаКассы.ОблачнаяККТ Тогда
				ПараметрыОперации.ИспользоватьПечатающееУстройство = Ложь;
				ПечатающееУстройство = Неопределено;
			КонецЕсли;
			
			Доступность = Ложь;
			МенеджерОборудованияРМККлиент.НачатьВыполнениеСверкиИтоговНаЭквайринговомТерминале(Оповещение,
				Неопределено, ЭквайринговыйТерминал, ПараметрыОперации, , ПечатающееУстройство);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьСверкуИтоговЗавершение(РезультатВыполнения, Параметры) Экспорт
	
	Доступность = Истина;
	
	Если ТипЗнч(РезультатВыполнения) = Тип("Структура") И РезультатВыполнения.Свойство("Результат") Тогда
		
		Если РезультатВыполнения.Результат Тогда 
			
			ТекстСообщения = НСтр("ru = 'Операция выполнена успешно.'");
			ПоказатьПредупреждение(Неопределено ,ТекстСообщения);
			
		Иначе
		
			ТекстЗаголовка = НСтр("ru = 'При выполнении операции произошла ошибка'");
			ТекстСообщения = НСтр("ru = '""%ОписаниеОшибки%"".
											|Операция сверки итогов не была проведена.'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%", РезультатВыполнения.ОписаниеОшибки);
			
			ПараметрыОткрытияОшибки = ИнтерфейсРМКСлужебныйКлиент.ПолучитьПараметрыОшибки(ТекстСообщения, ТекстЗаголовка);
			ИнтерфейсРМКСлужебныйКлиент.ОткрытьФормуСообщенияОбОшибке(ЭтотОбъект, ПараметрыОткрытияОшибки);
		
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборКассираЗавершение(РезультатВыполнения, Параметры) Экспорт
	
	Если РезультатВыполнения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Кассир = РезультатВыполнения;
	ОбработатьВыборКассира();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьРеквизитыКассира(Кассир)
	
	Возврат ОбщегоназначенияРМК.ПолучитьРеквизитыКассира(Кассир);
	
КонецФункции

&НаКлиенте
Процедура ОбработатьВыборКассира()
	
	УстановитьДоступностьЗапускаКСО();
	Если ЗначениеЗаполнено(Кассир) Тогда
		РеквизитыКассира = ПолучитьРеквизитыКассира(Кассир);
		ИмяКассира = РеквизитыКассира.Наименование;
		ИННКассира = РеквизитыКассира.ИНН;
	Иначе
		ИмяКассира = "";
		ИННКассира = "";
	КонецЕсли;
	Элементы.ГруппаРаботаСоСменами.Доступность = ЗначениеЗаполнено(Кассир) И ТаблицаКассККМОрганизаций.Количество() > 0;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьДоступныеДействияНаФорме()
	ОпределитьМаксимальныеПраваТекущегоПользователя();
	ОставитьДоступныеДействияТекущемуПользователю();
КонецПроцедуры

&НаСервере
Процедура ОпределитьМаксимальныеПраваТекущегоПользователя()
	
	ТекущийПользовательБД = Пользователи.ТекущийПользователь();
	МаксимальныйПрофильТекущегоПользователя
		= ОбщегоНазначенияРМК.МаксимальныйКассовыйПрофильПользователя(ТекущийПользовательБД);
	
КонецПроцедуры

&НаСервере
Процедура ОпределитьНаличиеНастройкиДляКСО()
	
	ЕстьНастройкаКСО = Ложь;
	НастройкаРМК = Неопределено;
	НастроитьКассировДляВхода = Ложь;
	ВремяНачалаСмены = Неопределено;
	
	ЗапросНастройкиРМК = Новый Запрос;
	ЗапросНастройкиРМК.Текст =
	"ВЫБРАТЬ
	|	СпрНастройкиРабочегоМестаКассира.Ссылка КАК НастройкаКСО,
	|	СпрНастройкиРабочегоМестаКассира.НастроитьКассировДляВхода КАК НастроитьКассировДляВхода,
	|	СпрНастройкиРабочегоМестаКассира.ВремяНачалаСмены КАК ВремяНачалаСмены,
	|	СпрНастройкиРабочегоМестаКассира.ИспользоватьОплатуПлатежнымиКартами КАК ИспользоватьОплатуПлатежнымиКартами,
	|	СпрНастройкиРабочегоМестаКассира.УвеличенныйВариантМасштаба КАК УвеличенныйВариантМасштаба,
	|	СпрНастройкиРабочегоМестаКассира.ОтключитьПодтверждениеОперацийАвтономнойККТ КАК ОтключитьПодтверждениеОперацийАвтономнойККТ
	|ИЗ
	|	Справочник.НастройкиРабочегоМестаКассира КАК СпрНастройкиРабочегоМестаКассира
	|ГДЕ
	|	НЕ СпрНастройкиРабочегоМестаКассира.ПометкаУдаления
	|	И СпрНастройкиРабочегоМестаКассира.СценарийИспользования = ЗНАЧЕНИЕ(Перечисление.СценарииИспользованияРМК.ТерминалСамообслуживания)
	|	И СпрНастройкиРабочегоМестаКассира.РабочееМесто = &РабочееМесто";
	ЗапросНастройкиРМК.УстановитьПараметр("РабочееМесто", РабочееМесто);
	РезультатЗапроса = ЗапросНастройкиРМК.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		ЕстьНастройкаКСО = Истина;
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		НастройкаРМК = Выборка.НастройкаКСО;
		НастроитьКассировДляВхода = Выборка.НастроитьКассировДляВхода;
		ВремяНачалаСмены = Выборка.ВремяНачалаСмены;
		ИспользоватьОплатуПлатежнымиКартами = Выборка.ИспользоватьОплатуПлатежнымиКартами;
		УвеличенныйВариантМасштаба = Выборка.УвеличенныйВариантМасштаба;
		ОтключитьПодтверждениеОперацийАвтономнойККТ = Выборка.ОтключитьПодтверждениеОперацийАвтономнойККТ;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОставитьДоступныеДействияТекущемуПользователю()

	РабочееМесто = МенеджерОборудованияРМК.РабочееМестоКлиента();
	УстройстваРаспознаванияРабочегоМеста
		= ОбщегоНазначенияРМК.ПолучитьПодключенноеОборудованиеПоТипу("УстройствоРаспознавания", РабочееМесто);
		
	// АПК:515-выкл. роль служит для определения права выполнения обучения
	ВключитьОбучениеУстройствРаспознавания = (УстройстваРаспознаванияРабочегоМеста.Количество() > 0
		И Пользователи.РолиДоступны("ОбучениеУстройствРаспознаванияРМК", ТекущийПользовательБД));
	// АПК:515-вкл.
	
	ОпределитьНаличиеНастройкиДляКСО();
	
	УровниПрофилейРМК = ИнтерфейсРМКСлужебныйКлиентСервер.УровниПрофилейРМК();
	ЭтоПолноправныйПользователь = (МаксимальныйПрофильТекущегоПользователя = УровниПрофилейРМК.ПолноправныйПользователь);
	Элементы.ОбщаяКомандаНастройкиРМК.Видимость = ЭтоПолноправныйПользователь;
	Элементы.СправочникПодключаемоеОборудованиеОткрытьПодключаемоеОборудование.Видимость = ЭтоПолноправныйПользователь;
	Элементы.СверкаИтогов.Видимость = (ЭтоПолноправныйПользователь 
		Или (МаксимальныйПрофильТекущегоПользователя = УровниПрофилейРМК.СтаршийКассир
			И ЕстьНастройкаКСО));
		
	Элементы.ОбучениеУстройствРаспознавания.Видимость = ВключитьОбучениеУстройствРаспознавания;
		
	Если Не (ЭтоПолноправныйПользователь Или ЕстьНастройкаКСО) Тогда
		Элементы.ГруппаРаботаСоСменами.Доступность = Ложь;
		Элементы.ЗапуститьРежимКассыСамообслуживания.Доступность = Ложь;
		Элементы.ОписаниеКассовыхСмен.Заголовок = 
			НСтр("ru = 'Рабочее место не настроено для работы в режиме кассы самообслуживания.
			|Обратитесь к администратору.'");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьВыбораКассира()
	
	УровниПрофилейРМК = ИнтерфейсРМКСлужебныйКлиентСервер.УровниПрофилейРМК();
	
	ТолькоПросмотрКассира = Ложь;
	Если Не НастроитьКассировДляВхода Тогда
		ТолькоПросмотрКассира = (МаксимальныйПрофильТекущегоПользователя = УровниПрофилейРМК.Кассир
			Или МаксимальныйПрофильТекущегоПользователя = УровниПрофилейРМК.КСО
			Или Не СтаршийПрофильКассира = УровниПрофилейРМК.КСО);
	КонецЕсли;
	Элементы.КассирДляЗапуска.ТолькоПросмотр = ТолькоПросмотрКассира;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьЗапускаКСО()
	
	Элементы.ЗапуститьРежимКассыСамообслуживания.Доступность = (ЗначениеЗаполнено(Пользователь) И ЗначениеЗаполнено(Кассир) 
		И ЗначениеЗаполнено(ТорговыйОбъект) И Не (НужноЗакрытьСмену Или НужноОткрытьСмену Или ЕстьИстекшаяСмена));
	
КонецПроцедуры

&НаСервере
Функция ПроверяемыйПрофильНижеТекущего(ПроверяемыйПрофиль)
	
	РезультатФункции = Ложь;
	УровниПрофилейРМК = ИнтерфейсРМКСлужебныйКлиентСервер.УровниПрофилейРМК();
	
	Если МаксимальныйПрофильТекущегоПользователя = УровниПрофилейРМК.ПолноправныйПользователь Тогда
		РезультатФункции = Истина;
	ИначеЕсли МаксимальныйПрофильТекущегоПользователя = УровниПрофилейРМК.СтаршийКассир Тогда
		Если Не ПроверяемыйПрофиль = УровниПрофилейРМК.СтаршийКассир Тогда
			РезультатФункции = Истина;
		КонецЕсли;
	ИначеЕсли МаксимальныйПрофильТекущегоПользователя = УровниПрофилейРМК.Кассир Тогда
		Если ПроверяемыйПрофиль = УровниПрофилейРМК.КСО Тогда
			РезультатФункции = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьТекущийТорговыйОбъект()
	Возврат ОбщегоНазначенияРМК.ТекущийТорговыйОбъект();
КонецФункции

&НаКлиенте
Процедура ОткрытьФормуОбученияУстройствРаспознавания()
	
	ПараметрыОткрытия = Новый Структура();
	ПараметрыОткрытия.Вставить("ТорговыйОбъект", ПолучитьТекущийТорговыйОбъект());
	
	ОткрытьФорму("Обработка.РабочееМестоКассира.Форма.ФормаОбученияУстройствРаспознавания", ПараметрыОткрытия,
		ЭтотОбъект, , , , , РежимОткрытияОкнаФормы.Независимый);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПодключенаОблачнаяККТ(Знач ТаблицаКассККМ)
	
	Результат = Ложь;
	
	Для Каждого СтрокаКасса Из ТаблицаКассККМ Цикл
		Результат = ОбщегоНазначенияРМК.ПодключаемоеОборудованиеОблачнаяККТ(СтрокаКасса.ИдентификаторУстройства);
		Если Результат Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти