#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	Для Каждого ЭлементСтратегии из СтратегияЗаполнения() Цикл
		Методы.Вставить(ЭлементСтратегии.Значение);
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыЗаполненияДокумента

// Процедура заполнения документа на основании без освобождения предоплаты
//
// Параметры:
//	ДокументСсылка - ДокументСсылка - Документ - основание
//	
Процедура ЗаполнитьБезОсвобожденияПредоплаты(ДокументСсылка) Экспорт

	ЗакрываемыеДокументы.Очистить();
	
	Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		
		ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументСсылка, "Организация,ВидОперации");
		Если РаботаСЗаявкамиКлиентСервер.ЭтоЗаявка(ЗначенияРеквизитов.ВидОперации) Тогда
			ВызватьИсключение РаботаСЗаявкамиКлиентСервер.СообщениеОНеобходимостиПереводаЗаявкиВЗаказ(ДокументСсылка);
		КонецЕсли;
		
		Организация = ЗначенияРеквизитов.Организация;
		
	Иначе
		Организация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументСсылка, "Организация");
	КонецЕсли;
	
	ДокументОснование = ДокументСсылка;
	СтрокаТЧ = ЗакрываемыеДокументы.Добавить();
	СтрокаТЧ.ДокументПлатежногоКалендаря = ДокументСсылка;
	
КонецПроцедуры

// Процедура заполнения документа на основании с освобождением предоплаты
//
// Параметры:
//	ДокументСсылка - ДокументСсылка - Документ - основание
//	
Процедура ЗаполнитьСОсвобождениемПредоплаты(ДокументСсылка) Экспорт

	ЗаполнитьБезОсвобожденияПредоплаты(ДокументСсылка);
	ЗакрываемыеДокументы[0].ОсвободитьПредоплату = Истина;
	
КонецПроцедуры

// Обработчик заполнения документа по структуре.
//
// Параметры:
//  ДанныеЗаполнения - Структура.
//
Процедура ЗаполнитьПоСтруктуре(ДанныеЗаполнения) Экспорт
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытий

// Процедура - обработчик события ОбработкаЗаполнения объекта.
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	СтратегияЗаполнения = СтратегияЗаполнения();	
	ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения, СтратегияЗаполнения);
	
КонецПроцедуры // ОбработкаЗаполнения()

// Процедура - обработчик события ОбработкаПроведения объекта.
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Инициализация дополнительных свойств для проведения документа
	ПроведениеДокументовУНФ.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Инициализация данных документа
	Документы.ЗакрытиеПланируемыхОплат.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей
	ПроведениеДокументовУНФ.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Отражение в разделах учета
	ТаблицыДляДвижений = ДополнительныеСвойства.ТаблицыДляДвижений;
	ПроведениеДокументовУНФ.ОтразитьДвижения("ПлатежныйКалендарь", ТаблицыДляДвижений, Движения, Отказ);
	
	// Запись наборов записей
	ПроведениеДокументовУНФ.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	ПроведениеДокументовУНФ.ЗакрытьМенеджерВременныхТаблиц(ЭтотОбъект);
	
КонецПроцедуры // ОбработкаПроведения()

// Процедура - обработчик события ОбработкаУдаленияПроведения объекта.
//
Процедура ОбработкаУдаленияПроведения(Отказ)
	
	// Инициализация дополнительных свойств для удаления проведения документа.
	ПроведениеДокументовУНФ.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей.
	ПроведениеДокументовУНФ.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Запись наборов записей.
	ПроведениеДокументовУНФ.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	ПроведениеДокументовУНФ.ЗакрытьМенеджерВременныхТаблиц(ЭтотОбъект);
	
КонецПроцедуры

// Процедура - обработчик события ПриЗаписи объекта.
//
Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СтратегияЗаполнения()
	Результат = Новый Соответствие;
	Результат[Тип("Структура")] = "ЗаполнитьПоСтруктуре";
	Результат[Тип("ДокументСсылка.ЗаказПокупателя")] = "ЗаполнитьСОсвобождениемПредоплаты";
	Результат[Тип("ДокументСсылка.ЗаказПоставщику")] = "ЗаполнитьБезОсвобожденияПредоплаты";
	Результат[Тип("ДокументСсылка.СчетНаОплату")] = "ЗаполнитьБезОсвобожденияПредоплаты";
	Результат[Тип("ДокументСсылка.СчетНаОплатуПоставщика")] = "ЗаполнитьБезОсвобожденияПредоплаты";
	Результат[Тип("ДокументСсылка.ПоступлениеДСПлан")] = "ЗаполнитьБезОсвобожденияПредоплаты";
	Результат[Тип("ДокументСсылка.РасходДСПлан")] = "ЗаполнитьБезОсвобожденияПредоплаты";
	Результат[Тип("ДокументСсылка.ПеремещениеДСПлан")] = "ЗаполнитьБезОсвобожденияПредоплаты";
	Возврат Результат;
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли