
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ИспользоватьМногофирменныйУчет = ПолучитьФункциональнуюОпцию("ИспользоватьНесколькоОрганизаций");
	Если Не ИспользоватьМногофирменныйУчет И ЗначениеЗаполнено(Объект.Организация) Тогда
		Элементы.ОрганизацияНеприменениеККТ.Вид = ВидПоляФормы.ПолеНадписи;
		Элементы.ОрганизацияНеприменениеККТ.Гиперссылка = Истина;
	КонецЕсли;
	
	ПричинаКоррекцииНеприменениеККТ = НСтр("ru = 'Неприменение ККТ'");
	СписокВсехСНО = ЗаполнитьСписокВсехСНО();
	
	Если ЗначениеЗаполнено(Объект.ДокументОснование)
		И ТипКассыККМОблачнаяККТ(Объект.КассаККМ) Тогда
		ДокументОснованиеПробитНаОблачнойККТ = Истина;
	КонецЕсли;
	
	УстановитьПараметрыЭлементовФормы();

	РаботаСФормойДокумента.ОпределитьЗафиксироватьСостояниеСвернутогоПодвала(ЭтотОбъект);
	
	АдаптацияТакси();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УправлениеВидимостьюИДоступностью();
	
	Если ТолькоПросмотр Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.КассаККМ) И Не ДокументОснованиеПробитНаОблачнойККТ Тогда
		ЗаполнитьПоддерживаемыеСНОКассойККМ();
	Иначе
		ПоддерживаемыеСНОКассойККМ = СписокВсехСНО;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.СистемаНалогообложения) Тогда
		ОбновитьСтавкиНДСПозицийЧека();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)

	Если ЗавершениеРаботы = Истина Тогда
		Возврат;
	КонецЕсли;
	
	РаботаСФормойДокументаКлиент.ПроверитьСохранитьСостояниеПодвала(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаКоррекцииНеприменениеККТПриИзменении(Элемент)
	
	ТекДата = ОбщегоНазначенияКлиент.ДатаСеанса();
	КонецТекущегоДня = КонецДня(ТекДата);
	
	Если Объект.ДатаКоррекции > КонецТекущегоДня Тогда
		Объект.ДатаКоррекции = ТекДата;
		ТекстСообщения = НСтр("ru = 'Дата корректируемого расчета не может превышать текущую дату.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
	ОбновитьСтавкиНДСПозицийЧека();
	
КонецПроцедуры

&НаКлиенте
Процедура КассаККМНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Объект.Организация) Тогда
		СтандартнаяОбработка = Ложь;
		ТекстОшибки = НСтр("ru = 'Не выбрана организация.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки, , , "Объект.Организация");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.СтруктурнаяЕдиница) Тогда
		СтандартнаяОбработка = Ложь;
		ТекстОшибки = НСтр("ru = 'Не выбрана розничная точка.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки, , , "Объект.СтруктурнаяЕдиница");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СистемаНалогообложенияПриИзменении(Элемент)
	
	ОбновитьСтавкиНДСПозицийЧека();
	
КонецПроцедуры

&НаКлиенте
Процедура СистемаНалогообложенияНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	Элементы.СистемаНалогообложения.РежимВыбораИзСписка = Истина;
	Элементы.СистемаНалогообложения.СписокВыбора.ЗагрузитьЗначения(ПоддерживаемыеСНОКассойККМ.ВыгрузитьЗначения());
	
КонецПроцедуры

&НаКлиенте
Процедура КомментарийПриИзменении(Элемент)
	
	СтатистикаИспользованияФормКлиент.ПриИнтерактивномДействии(ЭтотОбъект, Элемент, "ПриИзменении");
	
КонецПроцедуры

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(
		Элемент.ТекстРедактирования,
		ЭтотОбъект,
		"Объект.Комментарий");
	СтатистикаИспользованияФормКлиент.ПриИнтерактивномДействии(ЭтотОбъект, Элемент, "НачалоВыбора");
	
КонецПроцедуры

&НаКлиенте
Процедура ПокупательПриИзменении(Элемент)
	
	Если ТипЗнч(Объект.Покупатель) <> Тип("Строка") И ЗначениеЗаполнено(Объект.Покупатель) Тогда
		Объект.ПокупательИНН = ЗначениеРеквизитаОбъекта(Объект.Покупатель, "ИНН");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТипКоррекцииПриИзменении(Элемент)
	
	УстановитьВидимостьЭлементовПоТипуКоррекции();

КонецПроцедуры

&НаКлиенте
Процедура КассаККМПриИзменении(Элемент)
	
	Перем ТекстОшибки;
	
	ВыбранаОблачнаяККТ = ТипКассыККМОблачнаяККТ(Объект.КассаККМ);
	Если ВыбранаОблачнаяККТ Тогда
		Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
			ШаблонОшибки = НСтр("ru = 'Выбранная Касса ККМ ""%1"" недоступна для формирования чека коррекции.
										|Документ основание пробит на локальной кассе, чек коррекции на облачной кассе запрещен.
										|Выберите другую Кассу ККМ.'");
			ТекстОшибки = СтрШаблон(ШаблонОшибки, Строка(Объект.КассаККМ));
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки, , , "Объект.КассаККМ");
		Объект.КассаККМ = Неопределено;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.КассаККМ)
		И Не ВыбранаОблачнаяККТ Тогда
		ЗаполнитьПоддерживаемыеСНОКассойККМ();
	Иначе
		ПоддерживаемыеСНОКассойККМ = СписокВсехСНО;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СтруктурнаяЕдиницаПриИзменении(Элемент)
	
	Объект.АдресМагазина = "";
	Объект.АдресРасчетов = "";
	Объект.МестоРасчетов = "";
	
	Если ЗначениеЗаполнено(Объект.СтруктурнаяЕдиница) Тогда
		АдресМагазина        = ПолучитьАдресМагазина(Объект.СтруктурнаяЕдиница);
		Объект.АдресМагазина = АдресМагазина;
		Объект.АдресРасчетов = АдресМагазина;
		Объект.МестоРасчетов = Строка(Объект.СтруктурнаяЕдиница) + " " + АдресМагазина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтветственныйПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.Ответственный) Тогда
		
		РеквизитыКассира = РеквизитыОтветственного(Объект.Ответственный);
		
		Объект.Кассир    = РеквизитыКассира.ИмяКассира;
		Объект.КассирИНН = РеквизитыКассира.КассирИНН;
		
	Иначе
		
		Объект.Кассир    = "";
		Объект.КассирИНН = "";
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция РеквизитыОтветственного(Ответственный)
	
	РеквизитыКассира = РозничныеПродажиСервер.ПолучитьРеквизитыКассира(Ответственный);
	
	Возврат РеквизитыКассира;
	
КонецФункции

&НаКлиенте
Процедура РасчетВИнтернетеПриИзменении(Элемент)
	Элементы.АдресСайта.Доступность = Объект.РасчетВИнтернете;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПозицииЧека

&НаКлиенте
Процедура ПозицииЧекаНаименованиеПредметаРасчетаПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ПозицииЧека.ТекущиеДанные;
	Если ТекущаяСтрока <> Неопределено 
		И ТипЗнч(ТекущаяСтрока.НаименованиеПредметаРасчета) = Тип("СправочникСсылка.Номенклатура")
		И ЗначениеЗаполнено(ТекущаяСтрока.НаименованиеПредметаРасчета) Тогда
		
		ПараметрыНоменклатуры = РеквизитыПредметаРасчета(ТекущаяСтрока.НаименованиеПредметаРасчета, Объект.ДатаКоррекции);
		
		ТекущаяСтрока.МераКоличестваПредметаРасчета = ПараметрыНоменклатуры.ЕдиницаИзмерения;
		ТекущаяСтрока.СтавкаНДС                     = ПараметрыНоменклатуры.СтавкаНДС;
		
		ПересчитатьСуммуНДССтроки(ТекущаяСтрока);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПозицииЧекаКоличествоПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ПозицииЧека.ТекущиеДанные;
	Если ТекущаяСтрока <> Неопределено Тогда
		ПересчитатьСуммуСтроки(ТекущаяСтрока);
		ПересчитатьСуммуНДССтроки(ТекущаяСтрока);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПозицииЧекаЦенаСоСкидкамиПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ПозицииЧека.ТекущиеДанные;
	Если ТекущаяСтрока <> Неопределено Тогда
		ПересчитатьСуммуСтроки(ТекущаяСтрока);
		ПересчитатьСуммуНДССтроки(ТекущаяСтрока);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПозицииЧекаСуммаСоСкидкамиПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ПозицииЧека.ТекущиеДанные;
	Если ТекущаяСтрока <> Неопределено Тогда
		ТекущаяСтрока.ЦенаСоСкидками = ?(ТекущаяСтрока.Количество = 0, ТекущаяСтрока.СуммаСоСкидками, ТекущаяСтрока.СуммаСоСкидками / ТекущаяСтрока.Количество);
		ПересчитатьСуммуНДССтроки(ТекущаяСтрока);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПозицииЧекаСтавкаНДСПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ПозицииЧека.ТекущиеДанные;
	Если ТекущаяСтрока <> Неопределено Тогда
		ПересчитатьСуммуНДССтроки(ТекущаяСтрока);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПозицииЧекаПризнакАгентаПоПредметуРасчетаПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ПозицииЧека.ТекущиеДанные;
	
	Если ТекущаяСтрока <> Неопределено И НЕ ЗначениеЗаполнено(ТекущаяСтрока.ПризнакАгентаПоПредметуРасчета) Тогда
		ТекущаяСтрока.ПлатежныйАгентОперация 			= "";
		ТекущаяСтрока.ПлатежныйАгентТелефон 			= "";
		ТекущаяСтрока.ОператорПоПриемуПлатежейТелефон 	= "";
		ТекущаяСтрока.ОператорПереводаНаименование 		= "";
		ТекущаяСтрока.ОператорПереводаИНН 				= "";
		ТекущаяСтрока.ОператорПереводаАдрес 			= "";
		ТекущаяСтрока.ОператорПереводаТелефон 			= "";
		ТекущаяСтрока.ДанныеПоставщикаНаименование 		= "";
		ТекущаяСтрока.ДанныеПоставщикаИНН 				= "";
		ТекущаяСтрока.ДанныеПоставщикаТелефон 			= "";
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Асинх Процедура ПозицииЧекаКодСтраныПроисхожденияТовараНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ИдентификаторСтроки = Элементы.ПозицииЧека.ТекущиеДанные.ПолучитьИдентификатор();
	
	ВыбранноеЗначение = Ждать ВвестиЗначениеАсинх(Неопределено, "Выбор страны происхождения товара",
		Тип("СправочникСсылка.СтраныМира"));
	
	Если ВыбранноеЗначение <> Неопределено Тогда
		
		ТекущаяСтрока = Объект.ПозицииЧека.НайтиПоИдентификатору(ИдентификаторСтроки);
		
		Если ТекущаяСтрока <> Неопределено Тогда
			ТекущаяСтрока.КодСтраныПроисхожденияТовара = ЗначениеРеквизитаОбъекта(ВыбранноеЗначение, "Код");
			Элементы.ПозицииЧека.ЗакончитьРедактированиеСтроки(Ложь);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПробитьЧек(Команда)
	
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ТекстОшибки = "";
	Если Объект.ПометкаУдаления Тогда
		ТекстОшибки = НСтр("ru = 'Документ помечен на удаление'");
	ИначеЕсли Модифицированность Тогда
		ТекстОшибки = НСтр("ru = 'Измененный документ не сохранен'");
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(ТекстОшибки) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки);
		Возврат;
	КонецЕсли;
	
	Доступность = Ложь;
	
	ИдентификаторУстройства = ЗначениеРеквизитаОбъекта(Объект.КассаККМ, "ПодключаемоеОборудование");
	
	ОбщиеПараметры = ПодготовитьДанныеДляПробитияЧека(Объект.Ссылка, ИдентификаторУстройства);
	
	Если ОбщиеПараметры <> Неопределено Тогда
		
		ОбщиеПараметры.Вставить("СформироватьЧекКоррекцииСторно", Ложь);
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ОбщиеПараметры",          ОбщиеПараметры);
		ДополнительныеПараметры.Вставить("ИдентификаторУстройстваФР", ИдентификаторУстройства);
		
		Оповещение = Новый ОписаниеОповещения("ПробитьЧекЗавершение", ЭтотОбъект, ДополнительныеПараметры);
		ОборудованиеЧекопечатающиеУстройстваКлиент.НачатьФормированиеЧекаКоррекцииНаФискальномУстройстве(
			Оповещение,
			УникальныйИдентификатор,
			ИдентификаторУстройства,
			ОбщиеПараметры);
		
	Иначе // печать невозможна
		
		Доступность = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьКомментарий(Команда)
	
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(
		Объект.Комментарий,
		ЭтотОбъект,
		"Объект.Комментарий");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура АдаптацияТакси()
	
	ЭтоИнтерфейсТакси = Не ОбщегоНазначенияКлиентСервер.ЭтоВариантИнтерфейса85();
	
	Если ЭтоИнтерфейсТакси Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы, "Дата", "Заголовок", НСтр("ru ='от'"));        
		Элементы.ПодвалСвернут.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УправлениеВидимостьюИДоступностью()
	
	ТолькоПросмотр = Объект.ПробитЧек Или Объект.ЭтоСторно;
	Элементы.ФормаПробитьЧек.Доступность = Не Объект.ПробитЧек;
	
	КоррекцияНаОсновании = ЗначениеЗаполнено(Объект.ДокументОснование);
	
	Элементы.ОрганизацияНеприменениеККТ.ТолькоПросмотр   = КоррекцияНаОсновании;
	Элементы.ДатаКоррекцииНеприменениеККТ.ТолькоПросмотр = КоррекцияНаОсновании;
	Элементы.ТипРасчетаНеприменениеККТ.ТолькоПросмотр    = КоррекцияНаОсновании;
	
	Элементы.ОснованиеНеприменениеККТ.Видимость          = Объект.НеприменениеККТ;
	
	Элементы.НередактируемыеДанные.Видимость = Не Объект.НеприменениеККТ;
	Элементы.ДокументОснование.Видимость     = ЗначениеЗаполнено(Объект.ДокументОснование);
	Элементы.ДокументРасчетов.Видимость      = ЗначениеЗаполнено(Объект.ДокументРасчетов);
	
	Элементы.АдресСайта.Доступность          = Объект.РасчетВИнтернете;
	
	УстановитьВидимостьЭлементовПоТипуКоррекции();
	
	Если ДокументОснованиеПробитНаОблачнойККТ Тогда
		Элементы.СтруктурнаяЕдиница.ТолькоПросмотр = Истина;
		Элементы.КассаККМ.ТолькоПросмотр = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьЭлементовПоТипуКоррекции()
	
	Если Объект.ТипКоррекции = 1 Тогда
		Элементы.НомерПредписания.Видимость = Истина;
	Иначе
		Элементы.НомерПредписания.Видимость = Ложь;
		Объект.НомерПредписания = "";
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыЭлементовФормы()
	
	ДоступныеТипыСклада = Новый Массив;
	ДоступныеТипыСклада.Добавить(Перечисления.ТипыСтруктурныхЕдиниц.Склад);
	ДоступныеТипыСклада.Добавить(Перечисления.ТипыСтруктурныхЕдиниц.Розница);
	
	ПараметрыВыбораЭлемента = Новый Массив;
	ПараметрыВыбораЭлемента.Добавить(Новый ПараметрВыбора("Отбор.ТипСтруктурнойЕдиницы", ДоступныеТипыСклада));
	Элементы.СтруктурнаяЕдиница.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбораЭлемента);
	
	СвязьВладелец = Новый СвязьПараметраВыбора("Отбор.Владелец", "Объект.Организация",
		РежимИзмененияСвязанногоЗначения.Очищать);
	СвязьСтруктурнаяЕдиница = Новый СвязьПараметраВыбора("Отбор.СтруктурнаяЕдиница", "Объект.СтруктурнаяЕдиница",
		РежимИзмененияСвязанногоЗначения.Очищать);
	СвязиПараметровВыбораЭлемента = Новый Массив;
	СвязиПараметровВыбораЭлемента.Добавить(СвязьВладелец);
	СвязиПараметровВыбораЭлемента.Добавить(СвязьСтруктурнаяЕдиница);
	Элементы.КассаККМ.СвязиПараметровВыбора = Новый ФиксированныйМассив(СвязиПараметровВыбораЭлемента);
	
	ДоступныеТипыОборудования = Новый Массив;
	ДоступныеТипыОборудования.Добавить(Перечисления.ТипыПодключаемогоОборудования.ККТ);
	
	ПараметрыВыбораЭлемента = Новый Массив;
	ПараметрыВыбораЭлемента.Добавить(Новый ПараметрВыбора("Отбор.ТипКассы",
		Перечисления.ТипыКассККМ.ФискальныйРегистратор));
	ПараметрыВыбораЭлемента.Добавить(Новый ПараметрВыбора("Отбор.ТипОборудования", ДоступныеТипыОборудования));
	Элементы.КассаККМ.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбораЭлемента);
	
	ПараметрыВыбораЭлемента = Новый Массив;
	ПараметрыВыбораЭлемента.Добавить(Новый ПараметрВыбора("Отбор.Расчетная", Ложь));
	Элементы.ПозицииЧекаСтавкаНДС.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбораЭлемента);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗаполнитьСписокВсехСНО()
	
	ВсеСНО = Новый СписокЗначений;
	
	Для каждого ЭлементМетаданных Из Метаданные.Перечисления.ТипыСистемНалогообложенияККТ.ЗначенияПеречисления Цикл
		ВсеСНО.Добавить(Перечисления.ТипыСистемНалогообложенияККТ[ЭлементМетаданных.Имя]);
	КонецЦикла;
	
	Возврат ВсеСНО;
	
КонецФункции

&НаСервереБезКонтекста
Функция ЗначениеРеквизитаОбъекта(Знач Ссылка, Знач ИмяРеквизита)
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, ИмяРеквизита);
КонецФункции

&НаСервере
Процедура ОбновитьСтавкиНДСПозицийЧека()
	
	Элементы.ПозицииЧекаСтавкаНДС.РежимВыбораИзСписка = Ложь;
	Элементы.ПозицииЧекаСтавкаНДС.СписокВыбора.Очистить();
	
	Если ЗначениеЗаполнено(Объект.СистемаНалогообложения) Тогда
		
		СтавкиНДСПоСНО = Новый Соответствие;
		ОбщегоНазначенияРМКУНФ.ЗаполнитьСоответствиеСтавокНДСДляЧекаКоррекции(
			СтавкиНДСПоСНО,
			Объект.ДатаКоррекции);
		
		ДоступныеСтавкиНДС = СтавкиНДСПоСНО.Получить(Объект.СистемаНалогообложения);
		Если ТипЗнч(ДоступныеСтавкиНДС) = Тип("СписокЗначений") Тогда
			Элементы.ПозицииЧекаСтавкаНДС.РежимВыбораИзСписка = Истина;
			Элементы.ПозицииЧекаСтавкаНДС.СписокВыбора.ЗагрузитьЗначения(ДоступныеСтавкиНДС.ВыгрузитьЗначения());
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПодготовитьДанныеДляПробитияЧека(Знач ЧекКоррекции, Знач ИдентификаторУстройства)
	
	Возврат Документы.ЧекККМКоррекции.ПодготовитьДанныеДляПробитияЧека(ЧекКоррекции, ИдентификаторУстройства);
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьАдресМагазина(Знач СтруктурнаяЕдиница)
	
	Возврат ПечатьДокументовУНФ.КонтактнаяИнформация(
		СтруктурнаяЕдиница,
		ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.ФактАдресСтруктурнойЕдиницы"));
	
КонецФункции

&НаКлиенте
Процедура ПересчитатьСуммуСтроки(ТекущаяСтрока)
	ТекущаяСтрока.СуммаСоСкидками = ТекущаяСтрока.Количество * ТекущаяСтрока.ЦенаСоСкидками;
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСуммуНДССтроки(ТекущаяСтрока)
	
	ТекПроцентНДС = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеСтавкиНДС(ТекущаяСтрока.СтавкаНДС) / 100;
	ТекущаяСтрока.СуммаНДС = ТекущаяСтрока.СуммаСоСкидками * ТекПроцентНДС / (ТекПроцентНДС + 1);
	
КонецПроцедуры

&НаКлиенте
Процедура ОплатаПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
		
	СуммаПродажи = Объект.ПозицииЧека.Итог("СуммаСоСкидками");
	СуммаОплат   = Объект.Оплата.Итог("Сумма");
	
	ТекущаяСтрока = Элементы.Оплата.ТекущиеДанные;
	Если ТекущаяСтрока <> Неопределено Тогда
		ТекущаяСумма  = ТекущаяСтрока.Сумма;
		ОплатаБезТекущейСтроки = СуммаОплат - ТекущаяСумма;
		ОстатокОплаты = СуммаПродажи - ОплатаБезТекущейСтроки;
	КонецЕсли;
	
	Элементы.ОплатаСумма.СписокВыбора.Очистить();
	
	Если ОстатокОплаты > 0 Тогда
		
		Элементы.ОплатаСумма.СписокВыбора.Добавить(ОстатокОплаты, Формат(ОстатокОплаты, "ЧЦ=15; ЧДЦ=2; ЧРД=,; ЧРГ=' '; ЧН=; ЧГ=3,0"));
		
	КонецЕсли;
		
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаСервереБезКонтекста
Функция РеквизитыПредметаРасчета(Знач Номенклатура, Знач ДатаКоррекции)
	
	СтруктураРеквизитов = Новый Структура;
	СтруктураРеквизитов.Вставить("ЕдиницаИзмерения");
	СтруктураРеквизитов.Вставить("ВидСтавкиНДС");
	
	РеквизитыНоменклатуры = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Номенклатура, СтруктураРеквизитов);
	СтавкаНДС = Справочники.СтавкиНДС.СтавкаНДС(РеквизитыНоменклатуры.ВидСтавкиНДС, ДатаКоррекции);
	
	ПараметрыНоменклатуры = Новый Структура;
	ПараметрыНоменклатуры.Вставить("ЕдиницаИзмерения", РеквизитыНоменклатуры.ЕдиницаИзмерения);
	ПараметрыНоменклатуры.Вставить("СтавкаНДС", СтавкаНДС);
	
	Возврат ПараметрыНоменклатуры;
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьПоддерживаемыеСНОКассойККМ()
	
	Оповещение = Новый ОписаниеОповещения("ПолучитьДанныеККМЗавершение", ЭтотОбъект);
	ИдентификаторУстройства = ЗначениеРеквизитаОбъекта(Объект.КассаККМ, "ПодключаемоеОборудование");
	
	ОборудованиеЧекопечатающиеУстройстваКлиент.НачатьПолучениеПараметровФискальногоУстройства(
		Оповещение,
		УникальныйИдентификатор,
		ИдентификаторУстройства);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ТипКассыККМОблачнаяККТ(Знач КассаККМ)
	
	Результат = Ложь;
	
	Если ЗначениеЗаполнено(КассаККМ) Тогда
		ТипОборудования = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(КассаККМ, "ПодключаемоеОборудование.ТипОборудования");
		Если ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ОблачнаяККТ Тогда
			Результат = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ПробитьЧекЗавершение(РезультатВыполнения, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыполнения.Результат Тогда
		
		Если РезультатВыполнения.Свойство("СтатусВОблачнойКассе")
			И РезультатВыполнения.СтатусВОблачнойКассе = ОблачныеКассыКлиентСервер.СтатусОперацииВыполняется() Тогда
			
			Оповещение = Новый ОписаниеОповещения("ПробитьЧекЗавершение", ЭтотОбъект, ДополнительныеПараметры);
			ОборудованиеЧекопечатающиеОблачныеККТУНФКлиент.ПроверитьСтатусЧекаВОблаке(
				ЭтотОбъект,
				ДополнительныеПараметры.ОбщиеПараметры.ДокументОснование,
				Оповещение,
				ДополнительныеПараметры.ИдентификаторУстройстваФР,
				ДополнительныеПараметры.ОбщиеПараметры);
			
		Иначе
			
			Доступность = Истина;
			
			Объект.НомерСмены = РезультатВыполнения.НомерСменыККТ;
			Объект.НомерЧека =  РезультатВыполнения.НомерЧекаККТ;
			Объект.ПробитЧек = Истина;
			
			ПараметрыЗаписи = Новый Структура;
			ПараметрыЗаписи.Вставить("РежимЗаписи", РежимЗаписиДокумента.Запись);
			Записать(ПараметрыЗаписи);
			
			ТолькоПросмотр = Истина;
			Элементы.ФормаПробитьЧек.Доступность = Ложь;
			
		КонецЕсли;
		
	Иначе
		
		Доступность = Истина;
		
		ТекстСообщения = СтрШаблон(НСтр(
			"ru = 'При печати чека произошла ошибка.
			|Чек не напечатан на фискальном регистраторе.
			|Дополнительное описание:
			|%1'"), РезультатВыполнения.ОписаниеОшибки);
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьДанныеККМЗавершение(РезультатВыполнения, ДополнительныеПараметры) Экспорт
	
	ПоддерживаемыеСНОКассойККМ.Очистить();
	
	Если РезультатВыполнения.Результат Тогда
		
		СтрокаСНО      = РезультатВыполнения.ПараметрыККТ.КодыСистемыНалогообложения;
		МассивКодовСНО = СтрРазделить(СтрокаСНО, ",");
		
		Для Каждого КодСНО Из МассивКодовСНО Цикл
			
			СНО = МенеджерОборудованияРМККлиентСервер.СистемаНалогообложенияККТПоКоду(Число(КодСНО));
			ПоддерживаемыеСНОКассойККМ.Добавить(СНО);
			
		КонецЦикла;
		
		Если ЗначениеЗаполнено(Объект.СистемаНалогообложения)
			И ПоддерживаемыеСНОКассойККМ.НайтиПоЗначению(Объект.СистемаНалогообложения) = Неопределено Тогда
			
			ШаблонСообщения = НСтр("ru = 'Выбранная Касса ККМ не поддерживает систему налогообложения: %1'");
			ТекстСообщения = СтрШаблон(ШаблонСообщения, Строка(Объект.СистемаНалогообложения));
			
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
			
			Объект.СистемаНалогообложения = Неопределено;
			
		КонецЕсли;
		
	Иначе
		
		ШаблонСообщения = НСтр("ru = 'Не удалось получить список систем налогообложения поддерживаемых кассой ККМ: %1'");
		ТекстСообщения = СтрШаблон(ШаблонСообщения, РезультатВыполнения.ОписаниеОшибки);
		
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		
		Объект.СистемаНалогообложения = Неопределено;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
