#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ОбновлениеВерсииИБ

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	
	Методы.Вставить("НачальноеЗаполнениеСвойств1");
	Методы.Вставить("НачальноеЗаполнениеСвойств2");
	
КонецПроцедуры

// Начальное заполнение свойств 1
// Версия 3.0.13
//
Процедура НачальноеЗаполнениеСвойств1() Экспорт
	
	Если Не ВозможностиПриложения.ЭтоБизнесПриложение() Тогда
		
		ТекстСообщения = НСтр(
		"ru='Процедура НачальноеЗаполнениеСвойств1 успешно отработала - это не бизнес-приложение'",
		ОбщегоНазначения.КодОсновногоЯзыка());
		ЗаписьЖурналаРегистрации(
		ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
		УровеньЖурналаРегистрации.Информация,
		Метаданные.ПланыВидовХарактеристик.ДополнительныеРеквизитыБизнесПриложение, ,
		ТекстСообщения);
		
		Возврат;
		
	КонецЕсли;
	
	ПолноеИмяЗаказаПокупателя = Метаданные.Документы.ЗаказПокупателя.ПолноеИмя();
	ТипСтрока = Новый ОписаниеТипов("Строка");
	ТипДата = Новый ОписаниеТипов("Дата", , , Новый КвалификаторыДаты(ЧастиДаты.Дата));
	
	НачатьТранзакцию();
	
	Попытка
		
		НовоеСвойство = СоздатьЭлемент();
		НовоеСвойство.Имя = "НомерДоговора";
		НовоеСвойство.Наименование = НСтр("ru = '№ договора'");
		НовоеСвойство.ТипЗначения = ТипСтрока;
		НовоеСвойство.ИмяВладельца = ПолноеИмяЗаказаПокупателя;
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(НовоеСвойство);
		
		НовоеСвойство = СоздатьЭлемент();
		НовоеСвойство.Имя = "ДатаДоговора";
		НовоеСвойство.Наименование = НСтр("ru = 'Дата договора'");
		НовоеСвойство.ТипЗначения = ТипДата;
		НовоеСвойство.ИмяВладельца = ПолноеИмяЗаказаПокупателя;
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(НовоеСвойство);
		
		НовоеСвойство = СоздатьЭлемент();
		НовоеСвойство.Имя = "РеквизитБизнесПриложение1";
		НовоеСвойство.Наименование = НСтр("ru = 'Стройка'");
		НовоеСвойство.ТипЗначения = ТипСтрока;
		НовоеСвойство.ИмяВладельца = ПолноеИмяЗаказаПокупателя;
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(НовоеСвойство);
		
		НовоеСвойство = СоздатьЭлемент();
		НовоеСвойство.Имя = "РеквизитБизнесПриложение2";
		НовоеСвойство.Наименование = НСтр("ru = 'Объект строительства'");
		НовоеСвойство.ТипЗначения = ТипСтрока;
		НовоеСвойство.ИмяВладельца = ПолноеИмяЗаказаПокупателя;
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(НовоеСвойство);
		
		НовоеСвойство = СоздатьЭлемент();
		НовоеСвойство.Имя = "НомерПлатежноРасчетногоДокумента";
		НовоеСвойство.Наименование = НСтр("ru = '№ платежно-расчетного документа'");
		НовоеСвойство.ТипЗначения = ТипСтрока;
		НовоеСвойство.ИмяВладельца = ПолноеИмяЗаказаПокупателя;
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(НовоеСвойство);
		
		НовоеСвойство = СоздатьЭлемент();
		НовоеСвойство.Имя = "ДатаПлатежноРасчетногоДокумента";
		НовоеСвойство.Наименование = НСтр("ru = 'Дата платежно-расчетного документа'");
		НовоеСвойство.ТипЗначения = ТипДата;
		НовоеСвойство.ИмяВладельца = ПолноеИмяЗаказаПокупателя;
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(НовоеСвойство);
		
		НовоеСвойство = СоздатьЭлемент();
		НовоеСвойство.Имя = "НомерСчетаФактурыНаАванс";
		НовоеСвойство.Наименование = НСтр("ru = '№ авансовой счет-фактуры'");
		НовоеСвойство.ТипЗначения = ТипСтрока;
		НовоеСвойство.ИмяВладельца = ПолноеИмяЗаказаПокупателя;
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(НовоеСвойство);
		
		НовоеСвойство = СоздатьЭлемент();
		НовоеСвойство.Имя = "ДатаСчетаФактурыНаАванс";
		НовоеСвойство.Наименование = НСтр("ru = 'Дата авансовой счет-фактуры'");
		НовоеСвойство.ТипЗначения = ТипДата;
		НовоеСвойство.ИмяВладельца = ПолноеИмяЗаказаПокупателя;
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(НовоеСвойство);
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстСообщения = НСтр("ru='Процедура НачальноеЗаполнениеСвойств1 неуспешно отработала по причине:
		|%1'", ОбщегоНазначения.КодОсновногоЯзыка());
		ТекстСообщения = СтрШаблон(ТекстСообщения, ТекстОшибки);
		ЗаписьЖурналаРегистрации(
		ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
		УровеньЖурналаРегистрации.Ошибка,
		Метаданные.ПланыВидовХарактеристик.ДополнительныеРеквизитыБизнесПриложение, ,
		ТекстСообщения);
		
	КонецПопытки;
	
	ТекстСообщения = НСтр(
	"ru='Процедура НачальноеЗаполнениеСвойств1 успешно отработала'",
	ОбщегоНазначения.КодОсновногоЯзыка());
	ЗаписьЖурналаРегистрации(
	ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
	УровеньЖурналаРегистрации.Информация,
	Метаданные.ПланыВидовХарактеристик.ДополнительныеРеквизитыБизнесПриложение, ,
	ТекстСообщения);
	
КонецПроцедуры

// Начальное заполнение свойств 2
// Исправление ошибки в версии 3.0.14
// 
// Параметры:
//  Параметры - См. ОбновлениеИнформационнойБазыУНФ.ПриДобавленииОбработчиковОбновления
//
Процедура НачальноеЗаполнениеСвойств2(Параметры) Экспорт
	
	Если Не ВозможностиПриложения.ЭтоБизнесПриложение() Тогда
		
		ТекстСообщения = НСтр(
		"ru='Процедура НачальноеЗаполнениеСвойств2 успешно отработала - это не бизнес-приложение'",
		ОбщегоНазначения.КодОсновногоЯзыка());
		ЗаписьЖурналаРегистрации(
		ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
		УровеньЖурналаРегистрации.Информация,
		Метаданные.ПланыВидовХарактеристик.ДополнительныеРеквизитыБизнесПриложение, ,
		ТекстСообщения);
		
		Параметры.ОбработкаЗавершена = Истина;
		Возврат;
		
	КонецЕсли;
	
	Если НачальноеЗаполнениеВыполнено() Тогда
		
		ТекстСообщения = НСтр(
		"ru='Процедура НачальноеЗаполнениеСвойств2 успешно отработала - данные заполнены'",
		ОбщегоНазначения.КодОсновногоЯзыка());
		ЗаписьЖурналаРегистрации(
		ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
		УровеньЖурналаРегистрации.Информация,
		Метаданные.ПланыВидовХарактеристик.ДополнительныеРеквизитыБизнесПриложение, ,
		ТекстСообщения);
		
		Параметры.ОбработкаЗавершена = Истина;
		Возврат;
		
	КонецЕсли;
	
	ПолноеИмяЗаказаПокупателя = Метаданные.Документы.ЗаказПокупателя.ПолноеИмя();
	ТипСтрока = Новый ОписаниеТипов("Строка");
	ТипДата = Новый ОписаниеТипов("Дата", , , Новый КвалификаторыДаты(ЧастиДаты.Дата));
	
	НачатьТранзакцию();
	
	Попытка
		
		НовоеСвойство = СоздатьЭлемент();
		НовоеСвойство.Имя = "НомерДоговора";
		НовоеСвойство.Наименование = НСтр("ru = '№ договора'");
		НовоеСвойство.ТипЗначения = ТипСтрока;
		НовоеСвойство.ИмяВладельца = ПолноеИмяЗаказаПокупателя;
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(НовоеСвойство);
		
		НовоеСвойство = СоздатьЭлемент();
		НовоеСвойство.Имя = "ДатаДоговора";
		НовоеСвойство.Наименование = НСтр("ru = 'Дата договора'");
		НовоеСвойство.ТипЗначения = ТипДата;
		НовоеСвойство.ИмяВладельца = ПолноеИмяЗаказаПокупателя;
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(НовоеСвойство);
		
		НовоеСвойство = СоздатьЭлемент();
		НовоеСвойство.Имя = "РеквизитБизнесПриложение1";
		НовоеСвойство.Наименование = НСтр("ru = 'Стройка'");
		НовоеСвойство.ТипЗначения = ТипСтрока;
		НовоеСвойство.ИмяВладельца = ПолноеИмяЗаказаПокупателя;
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(НовоеСвойство);
		
		НовоеСвойство = СоздатьЭлемент();
		НовоеСвойство.Имя = "РеквизитБизнесПриложение2";
		НовоеСвойство.Наименование = НСтр("ru = 'Объект строительства'");
		НовоеСвойство.ТипЗначения = ТипСтрока;
		НовоеСвойство.ИмяВладельца = ПолноеИмяЗаказаПокупателя;
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(НовоеСвойство);
		
		НовоеСвойство = СоздатьЭлемент();
		НовоеСвойство.Имя = "НомерПлатежноРасчетногоДокумента";
		НовоеСвойство.Наименование = НСтр("ru = '№ платежно-расчетного документа'");
		НовоеСвойство.ТипЗначения = ТипСтрока;
		НовоеСвойство.ИмяВладельца = ПолноеИмяЗаказаПокупателя;
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(НовоеСвойство);
		
		НовоеСвойство = СоздатьЭлемент();
		НовоеСвойство.Имя = "ДатаПлатежноРасчетногоДокумента";
		НовоеСвойство.Наименование = НСтр("ru = 'Дата платежно-расчетного документа'");
		НовоеСвойство.ТипЗначения = ТипДата;
		НовоеСвойство.ИмяВладельца = ПолноеИмяЗаказаПокупателя;
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(НовоеСвойство);
		
		НовоеСвойство = СоздатьЭлемент();
		НовоеСвойство.Имя = "НомерСчетаФактурыНаАванс";
		НовоеСвойство.Наименование = НСтр("ru = '№ авансовой счет-фактуры'");
		НовоеСвойство.ТипЗначения = ТипСтрока;
		НовоеСвойство.ИмяВладельца = ПолноеИмяЗаказаПокупателя;
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(НовоеСвойство);
		
		НовоеСвойство = СоздатьЭлемент();
		НовоеСвойство.Имя = "ДатаСчетаФактурыНаАванс";
		НовоеСвойство.Наименование = НСтр("ru = 'Дата авансовой счет-фактуры'");
		НовоеСвойство.ТипЗначения = ТипДата;
		НовоеСвойство.ИмяВладельца = ПолноеИмяЗаказаПокупателя;
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(НовоеСвойство);
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстСообщения = НСтр("ru='Процедура НачальноеЗаполнениеСвойств2 неуспешно отработала по причине:
		|%1'", ОбщегоНазначения.КодОсновногоЯзыка());
		ТекстСообщения = СтрШаблон(ТекстСообщения, ТекстОшибки);
		ЗаписьЖурналаРегистрации(
		ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
		УровеньЖурналаРегистрации.Ошибка,
		Метаданные.ПланыВидовХарактеристик.ДополнительныеРеквизитыБизнесПриложение, ,
		ТекстСообщения);
		
		Параметры.ОбработкаЗавершена = Ложь;
		
	КонецПопытки;
	
	ТекстСообщения = НСтр(
	"ru='Процедура НачальноеЗаполнениеСвойств2 успешно отработала'",
	ОбщегоНазначения.КодОсновногоЯзыка());
	ЗаписьЖурналаРегистрации(
	ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
	УровеньЖурналаРегистрации.Информация,
	Метаданные.ПланыВидовХарактеристик.ДополнительныеРеквизитыБизнесПриложение, ,
	ТекстСообщения);
	
	Параметры.ОбработкаЗавершена = Истина;
	
КонецПроцедуры

#КонецОбласти

// Обработчик, выполняющий заполнение свойств при переходе на вид приложения "Бизнес-приложение".
//
Процедура ПослеУстановкиВидаПриложения() Экспорт
	
	Если Не ВозможностиПриложения.ЭтоБизнесПриложение() Тогда
		Возврат;
	КонецЕсли;
	
	Если НачальноеЗаполнениеВыполнено() Тогда
		Возврат;
	КонецЕсли;
	
	ПолноеИмяЗаказаПокупателя = Метаданные.Документы.ЗаказПокупателя.ПолноеИмя();
	ТипСтрока = Новый ОписаниеТипов("Строка");
	ТипДата = Новый ОписаниеТипов("Дата", , , Новый КвалификаторыДаты(ЧастиДаты.Дата));
	
	НачатьТранзакцию();
	
	Попытка
		
		НовоеСвойство = СоздатьЭлемент();
		НовоеСвойство.Имя = "НомерДоговора";
		НовоеСвойство.Наименование = НСтр("ru = '№ договора'");
		НовоеСвойство.ТипЗначения = ТипСтрока;
		НовоеСвойство.ИмяВладельца = ПолноеИмяЗаказаПокупателя;
		НовоеСвойство.Записать();
		
		НовоеСвойство = СоздатьЭлемент();
		НовоеСвойство.Имя = "ДатаДоговора";
		НовоеСвойство.Наименование = НСтр("ru = 'Дата договора'");
		НовоеСвойство.ТипЗначения = ТипДата;
		НовоеСвойство.ИмяВладельца = ПолноеИмяЗаказаПокупателя;
		НовоеСвойство.Записать();
		
		НовоеСвойство = СоздатьЭлемент();
		НовоеСвойство.Имя = "РеквизитБизнесПриложение1";
		НовоеСвойство.Наименование = НСтр("ru = 'Стройка'");
		НовоеСвойство.ТипЗначения = ТипСтрока;
		НовоеСвойство.ИмяВладельца = ПолноеИмяЗаказаПокупателя;
		НовоеСвойство.Записать();
		
		НовоеСвойство = СоздатьЭлемент();
		НовоеСвойство.Имя = "РеквизитБизнесПриложение2";
		НовоеСвойство.Наименование = НСтр("ru = 'Объект строительства'");
		НовоеСвойство.ТипЗначения = ТипСтрока;
		НовоеСвойство.ИмяВладельца = ПолноеИмяЗаказаПокупателя;
		НовоеСвойство.Записать();
		
		НовоеСвойство = СоздатьЭлемент();
		НовоеСвойство.Имя = "НомерПлатежноРасчетногоДокумента";
		НовоеСвойство.Наименование = НСтр("ru = '№ платежно-расчетного документа'");
		НовоеСвойство.ТипЗначения = ТипСтрока;
		НовоеСвойство.ИмяВладельца = ПолноеИмяЗаказаПокупателя;
		НовоеСвойство.Записать();
		
		НовоеСвойство = СоздатьЭлемент();
		НовоеСвойство.Имя = "ДатаПлатежноРасчетногоДокумента";
		НовоеСвойство.Наименование = НСтр("ru = 'Дата платежно-расчетного документа'");
		НовоеСвойство.ТипЗначения = ТипДата;
		НовоеСвойство.ИмяВладельца = ПолноеИмяЗаказаПокупателя;
		НовоеСвойство.Записать();
		
		НовоеСвойство = СоздатьЭлемент();
		НовоеСвойство.Имя = "НомерСчетаФактурыНаАванс";
		НовоеСвойство.Наименование = НСтр("ru = '№ авансовой счет-фактуры'");
		НовоеСвойство.ТипЗначения = ТипСтрока;
		НовоеСвойство.ИмяВладельца = ПолноеИмяЗаказаПокупателя;
		НовоеСвойство.Записать();
		
		НовоеСвойство = СоздатьЭлемент();
		НовоеСвойство.Имя = "ДатаСчетаФактурыНаАванс";
		НовоеСвойство.Наименование = НСтр("ru = 'Дата авансовой счет-фактуры'");
		НовоеСвойство.ТипЗначения = ТипДата;
		НовоеСвойство.ИмяВладельца = ПолноеИмяЗаказаПокупателя;
		НовоеСвойство.Записать();
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстСообщения = НСтр("ru='Процедура ПослеУстановкиВидаПриложения неуспешно отработала по причине:
		|%1'", ОбщегоНазначения.КодОсновногоЯзыка());
		ТекстСообщения = СтрШаблон(ТекстСообщения, ТекстОшибки);
		ЗаписьЖурналаРегистрации(
		ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
		УровеньЖурналаРегистрации.Ошибка,
		Метаданные.ПланыВидовХарактеристик.ДополнительныеРеквизитыБизнесПриложение, ,
		ТекстСообщения);
		
	КонецПопытки;
	
	ТекстСообщения = НСтр(
	"ru='Процедура ПослеУстановкиВидаПриложения успешно отработала'",
	ОбщегоНазначения.КодОсновногоЯзыка());
	ЗаписьЖурналаРегистрации(
	ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
	УровеньЖурналаРегистрации.Информация,
	Метаданные.ПланыВидовХарактеристик.ДополнительныеРеквизитыБизнесПриложение, ,
	ТекстСообщения);
	
КонецПроцедуры

// Функция - Список всех доступных реквизитов
// 
// Возвращаемое значение:
//  Массив из Строка - список реквизитов
//
Функция СписокВсехДоступныхРеквизитов() Экспорт
	
	Результат = Новый Массив;
	
	Результат.Добавить("НомерДоговора");
	Результат.Добавить("ДатаДоговора");
	Результат.Добавить("РеквизитБизнесПриложение1");
	Результат.Добавить("РеквизитБизнесПриложение2");
	Результат.Добавить("НомерПлатежноРасчетногоДокумента");
	Результат.Добавить("ДатаПлатежноРасчетногоДокумента");
	Результат.Добавить("НомерСчетаФактурыНаАванс");
	Результат.Добавить("ДатаСчетаФактурыНаАванс");
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ДоступныеСвойства(Реквизиты = "") Экспорт
	
	Если ТипЗнч(Реквизиты) = Тип("Массив") Тогда
		Если Реквизиты.Количество() = 0 Тогда
			Реквизиты = СписокВсехДоступныхРеквизитов();
		КонецЕсли;
	Иначе
		Если ПустаяСтрока(Реквизиты) Тогда
			Реквизиты = СписокВсехДоступныхРеквизитов();
		Иначе
			Реквизиты = СтрРазделить(Реквизиты, ",", Ложь);
		КонецЕсли;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДополнительныеРеквизитыБизнесПриложение.Имя КАК Имя,
		|	ДополнительныеРеквизитыБизнесПриложение.Ссылка КАК Ссылка
		|ИЗ
		|	ПланВидовХарактеристик.ДополнительныеРеквизитыБизнесПриложение КАК ДополнительныеРеквизитыБизнесПриложение
		|ГДЕ
		|	ДополнительныеРеквизитыБизнесПриложение.Имя В(&Реквизиты)";
	Запрос.УстановитьПараметр("Реквизиты", Реквизиты);
	
	ТаблицаСвойств = Запрос.Выполнить().Выгрузить();
	Результат = Новый Соответствие;
	Для Каждого Реквизит Из Реквизиты Цикл
		
		Свойство = ТаблицаСвойств.НайтиСтроки(Новый Структура("Имя", Реквизит));
		Если Не Свойство.Количество() Тогда
			Продолжить;
		КонецЕсли;
		
		Свойство = Свойство[0].Ссылка;
		Результат[Реквизит] = Свойство;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НачальноеЗаполнениеВыполнено()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ДополнительныеРеквизитыБизнесПриложение.Ссылка КАК Ссылка
		|ИЗ
		|	ПланВидовХарактеристик.ДополнительныеРеквизитыБизнесПриложение КАК ДополнительныеРеквизитыБизнесПриложение";
	
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции

#КонецОбласти

#КонецЕсли