#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет реквизиты и табличную часть документа на основании заказа покупателя.
//
// Параметры:
//   ДанныеЗаполнения - ДокументСсылка.ЗаказПокупателя - ссылка на документ-основание
Процедура ЗаполнитьПоЗаказуПокупателя(ДанныеЗаполнения) Экспорт
	
	Если Не ЗначениеЗаполнено(ДанныеЗаполнения) Тогда
		Возврат;
	КонецЕсли;
	
	// Заполнение шапки.
	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеЗаполнения, 
			Новый Структура("Организация, Контрагент, Договор, ВалютаДокумента, Курс, Кратность, ВидОперации"));
			
	ЗначенияРеквизитов.Вставить("ЗаказНарядВозврат");
	Документы.ЗаказПокупателя.ПроверитьВозможностьВводаНаОснованииЗаказаПокупателя(ДанныеЗаполнения, ЗначенияРеквизитов);
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ЗначенияРеквизитов,
		"Организация, Контрагент, Договор, ВалютаДокумента, Курс, Кратность");
	ДокументОснование = ДанныеЗаполнения;
	
	НеУчитыватьЗаказы = Договор.НеУчитыватьЗаказыПриПередачеНаКомиссию;
	
	Если НеУчитыватьЗаказы Тогда
		ВызватьИсключение НСтр(
			"ru = 'По договору не ведется учет заказов при передачу на комиссию. Ввод на основании не возможен'");
	КонецЕсли;
	
	Если Не ВалютаДокумента = Константы.НациональнаяВалюта.Получить() Тогда
		СтруктураПоВалюте = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(?(ЗначениеЗаполнено(Дата), Дата,
			ТекущаяДатаСеанса()), Новый Структура("Валюта", Договор.ВалютаРасчетов));
		Курс = СтруктураПоВалюте.Курс;
		Кратность = СтруктураПоВалюте.Кратность;
	КонецЕсли;
	
	// Заполнение табличной части.
	Запасы.Очистить();
	ЗаполнитьПоЗаказуПокупателяНаПродажу(ДанныеЗаполнения);
	
КонецПроцедуры // ЗаполнитьПоЗаказПокупателя()

// Заполняет реквизиты шапки и табличную часть документа на основании расходной накладной.
//
// Параметры:
//   ДанныеЗаполнения - ДокументСсылка.РасходнаяНакладная - документ-основание для заполнения
Процедура ЗаполнитьПоРасходнаяНакладная(ДанныеЗаполнения) Экспорт
	
	Если Не ЗначениеЗаполнено(ДанныеЗаполнения) Тогда
		Возврат;
	КонецЕсли;
	
	// Заполнение шапки.
	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеЗаполнения, 
			Новый Структура("Организация, Контрагент, Договор, ВалютаДокумента, Курс, Кратность, Заказ, ВидОперации"));
			
	Документы.ЗаказПокупателя.ПроверитьВозможностьВводаНаОснованииЗаказаПокупателя(ДанныеЗаполнения, ЗначенияРеквизитов);
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ЗначенияРеквизитов, "Организация, Контрагент, Договор, ВалютаДокумента, Курс, Кратность, Заказ");
	ДокументОснование = ДанныеЗаполнения;
	
	Если НЕ ВалютаДокумента = Константы.НациональнаяВалюта.Получить() Тогда
		СтруктураПоВалюте = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(?(ЗначениеЗаполнено(Дата), Дата, ТекущаяДатаСеанса()), Новый Структура("Валюта", Договор.ВалютаРасчетов));
		Курс = СтруктураПоВалюте.Курс;
		Кратность = СтруктураПоВалюте.Кратность;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Договор) Тогда
		ВидЦенКонтрагента = Договор.ВидЦенКонтрагента;
	КонецЕсли;
	
	ЗаказВШапке = ДанныеЗаполнения.ПоложениеЗаказаПокупателя;
	
	Если ПоложениеЗаказа = ЗаказВШапке Тогда
		 Заказ = ДанныеЗаполнения.Заказ;
	 КонецЕсли;
	
	// Заполнение табличной части.
	Запасы.Очистить();
	СерииНоменклатуры.Очистить();
	
	СерииНоменклатурыДокОснование = ДанныеЗаполнения.СерииНоменклатуры;
	
	ТаблицаОстатков = РаботаСКомиссионерамиКомитентамиСервер.ТаблицаОстатковТоваровУКомиссионера(ЭтотОбъект, ,,, Ложь);
	ПараметрыПоиска = Новый Структура("Номенклатура, Характеристика, Партия, ЗаказПокупателя");
	ПараметрыПоискаСерии = Новый Структура("КлючСвязи", 0);
	
	НеУчитыватьЗаказы = Договор.НеУчитыватьЗаказыПриПередачеНаКомиссию;
	
	Если НеУчитыватьЗаказы Тогда
		Заказ = Неопределено;
	КонецЕсли;
	
	Для Каждого СтрокаТабличнойЧасти Из ДанныеЗаполнения.Запасы Цикл
		
		ПараметрыПоиска.Номенклатура = СтрокаТабличнойЧасти.Номенклатура;
		ПараметрыПоиска.Характеристика = СтрокаТабличнойЧасти.Характеристика;
		ПараметрыПоиска.Партия = СтрокаТабличнойЧасти.Партия;
		
		Если НеУчитыватьЗаказы Тогда
			ПараметрыПоиска.ЗаказПокупателя = Документы.ЗаказПокупателя.ПустаяСсылка();
		Иначе
			Если СтрокаТабличнойЧасти.Заказ = Неопределено Тогда
				ПараметрыПоиска.ЗаказПокупателя = Документы.ЗаказПокупателя.ПустаяСсылка();
			Иначе
				ПараметрыПоиска.ЗаказПокупателя = СтрокаТабличнойЧасти.Заказ;
			КонецЕсли;
		КонецЕсли;
		
		НайденныеСтроки = ТаблицаОстатков.НайтиСтроки(ПараметрыПоиска);
		
		Если Не НайденныеСтроки.Количество() Тогда Продолжить КонецЕсли;
		
		НоваяСтрока = Запасы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТабличнойЧасти);
		
		ПараметрыПоискаСерии.КлючСвязи = СтрокаТабличнойЧасти.КлючСвязи;
		НайденныеСтрокиСерии = СерииНоменклатурыДокОснование.НайтиСтроки(ПараметрыПоискаСерии);
		
		Если НайденныеСтрокиСерии.Количество() Тогда 
			Для Каждого НайденнаяСерия Из НайденныеСтрокиСерии Цикл
				НоваяСтрокаСерии = СерииНоменклатуры.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрокаСерии, НайденнаяСерия);
			КонецЦикла;
		КонецЕсли;
		
		НоваяСтрока.Заказ = ?(НеУчитыватьЗаказы, Неопределено, СтрокаТабличнойЧасти.Заказ);
		
		Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			
			Если НайденнаяСтрока.Количество = 0 Тогда Продолжить КонецЕсли;
			
			Если НоваяСтрока.Количество >= НайденнаяСтрока.Количество Тогда
				НоваяСтрока.Количество = НайденнаяСтрока.Количество;
				НоваяСтрока.Цена = Окр(НайденнаяСтрока.СуммаРасчетов / НайденнаяСтрока.Количество, 2, РежимОкругления.Окр15как20);
				НоваяСтрока.Сумма = НайденнаяСтрока.СуммаРасчетов;
				ТаблицаОстатков.Удалить(НайденнаяСтрока);
			Иначе
				НоваяСтрока.Цена = Окр(НайденнаяСтрока.СуммаРасчетов / НайденнаяСтрока.Количество, 2, РежимОкругления.Окр15как20);
				НоваяСтрока.Сумма = Окр(НоваяСтрока.Цена * НоваяСтрока.Количество, 2, РежимОкругления.Окр15как20);
				НайденнаяСтрока.Количество = НайденнаяСтрока.Количество - НоваяСтрока.Количество;
				НайденнаяСтрока.СуммаРасчетов = НайденнаяСтрока.СуммаРасчетов - НоваяСтрока.Сумма;
				
				Если НайденнаяСтрока.СуммаРасчетов <= 0.01 Тогда 
					НоваяСтрока.Сумма = НоваяСтрока.Сумма + НайденнаяСтрока.СуммаРасчетов;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если НоваяСтрока.Количество = 0 Тогда Запасы.Удалить(НоваяСтрока) КонецЕсли;
		
	КонецЦикла;
	
	СерииНоменклатурыУНФ.УдалитьСерииНоменклатурыВТабличнойЧастиВЗависимостиОтПолитики(ЭтотОбъект);
	
КонецПроцедуры // ЗаполнитьПоЗаказПокупателя()

#Область ДляВызоваИзДругихПодсистем

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	Для Каждого ЭлементСтратегии из СтратегияЗаполнения() Цикл
		Методы.Вставить(ЭлементСтратегии.Значение);
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытий

// Процедура - обработчик события ПриКопировании объекта.
//
Процедура ПриКопировании(ОбъектКопирования)
	УправлениеНебольшойФирмойЭлектронныеДокументыСервер.ОчиститьДатуНомерВходящегоДокумента(ЭтотОбъект);
КонецПроцедуры // ПриКопировании()

// Процедура - обработчик события ОбработкаЗаполнения.
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	// Прослеживаемость
	СведенияПрослеживаемости.Очистить();
	// Конец Прослеживаемость
	
	СтратегияЗаполнения = СтратегияЗаполнения();
	ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения, СтратегияЗаполнения);
	
	ПрослеживаемостьУНФ.ОбновитьПризнакПрослеживаемости(Запасы, Дата);
	
КонецПроцедуры // ОбработкаЗаполнения()

// Процедура - обработчик события ПередЗаписью объекта.
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ОбменДаннымиСобытияУНФ.ПропуститьДозаполнениеДокумента(ЭтотОбъект, РежимЗаписи) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ВидОперации) Тогда
		ВидОперации = Перечисления.ВидыОперацийОтчетКомиссионераОСписании.СписаниеУКомиссионера;
	КонецЕсли;
	
	СуммаДокумента = Запасы.Итог("Сумма");
	СуммаКомпенсацииДекомпенсации = Запасы.Итог("СуммаКомпенсацииДекомпенсации");
	
	// Прослеживаемость
	// Для реализации не в страны ЕАЭС очистим колонку "Код ТН ВЭД"
	РеализацияВЕАЭС = Справочники.Контрагенты.КонтрагентРезидентТаможенногоСоюза(Контрагент);
	
	Если НЕ РеализацияВЕАЭС Тогда 
		Для каждого СтрокаТаблицы Из Запасы Цикл
			Если ЗначениеЗаполнено(СтрокаТаблицы.КодТНВЭД) Тогда
				СтрокаТаблицы.КодТНВЭД = Неопределено;
			КонецЕсли;
		КонецЦикла;
	Иначе
		Для каждого СтрокаТаблицы Из Запасы Цикл
			Если СтрокаТаблицы.ПрослеживаемыйТовар Тогда
				СтрокаТаблицы.НомерГТД = Неопределено;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	// Автоматический подбор РНПТ и очистка признака прослеживаемого товара.
	ПрослеживаемыйТовар = Запасы.НайтиСтроки(Новый Структура("ПрослеживаемыйТовар", Истина));
	ЕстьПрослеживаемыйТовар = ПрослеживаемыйТовар.Количество() <> 0;
	Если ЕстьПрослеживаемыйТовар Тогда
		Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
			ПрослеживаемостьУНФ.ПодобратьРНПТКомиссия(ЭтотОбъект, Отказ);
		КонецЕсли; 
	Иначе
		СведенияПрослеживаемости.Очистить();
		Для каждого СтрокаТабличнойЧасти Из Запасы Цикл
			СтрокаТабличнойЧасти.ПрослеживаемыйТовар = Ложь;
		КонецЦикла; 
	КонецЕсли;
	// Конец Прослеживаемость
	
КонецПроцедуры

// Процедура - обработчик события ОбработкаПроверкиЗаполнения объекта.
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	НоменклатураВДокументахСервер.ПроверитьЗаполнениеХарактеристик(ЭтотОбъект, Отказ, Истина);
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Объект", ЭтотОбъект);
	СерииНоменклатурыУНФ.ПроверитьЗаполнениеСерийНоменклатуры(Отказ, Запасы, СерииНоменклатуры, 
		ДополнительныеПараметры);
	
	// Прослеживаемость
	РеализацияВЕАЭС = Справочники.Контрагенты.КонтрагентРезидентТаможенногоСоюза(Контрагент);
	// Исключаем из проверки те реквизиты табличных частей, обязательность которых
	//  зависит от значений других реквизитов в строках табличных частей:
	ИсключаемыеРеквизиты = Новый Массив;
	ИсключаемыеРеквизиты.Добавить("Запасы.КодТНВЭД");
	
	// Проверяем табличную часть "Товары":
	Если Запасы.Количество() > 0 Тогда
		ИмяСписка = НСтр("ru = 'Запасы'");
		
		СтруктураПоиска = Новый Структура("ИдентификаторСтроки");
		Для каждого СтрокаЗапасы Из Запасы Цикл
			
			Если Не СтрокаЗапасы.ПрослеживаемыйТовар Тогда
				Продолжить;
			КонецЕсли;
			
			// Для прослеживаемого товара обязательно указывается страна происхождения.
			Если СтрокаЗапасы.ПрослеживаемыйТовар
				И НЕ ЗначениеЗаполнено(СтрокаЗапасы.СтранаПроисхождения) Тогда
				ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Колонка",, НСтр("ru = 'Страна происхождения'"),
				СтрокаЗапасы.НомерСтроки, ИмяСписка);
				
				Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Запасы", СтрокаЗапасы.НомерСтроки, "СтранаПроисхождения");
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
			КонецЕсли;
			
			Если СтрокаЗапасы.ПрослеживаемыйКомплект Тогда
				
				СтруктураПоиска.ИдентификаторСтроки = СтрокаЗапасы.ИдентификаторСтроки;
				НайденныеСтроки = СведенияПрослеживаемости.НайтиСтроки(СтруктураПоиска);
				
				Если Не НайденныеСтроки.Количество() Тогда
					ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Колонка", , НСтр(
					"ru = 'Номер РНПТ'"), СтрокаЗапасы.НомерСтроки, ИмяСписка);
					
					Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Запасы", СтрокаЗапасы.НомерСтроки,
					"ЗапасыРНПТ");
					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	// Конец Прослеживаемость
	
	Если ВидОперации = Перечисления.ВидыОперацийОтчетКомиссионераОСписании.ОприходованиеУКомиссионера Тогда
		
		Для Каждого СтрокаЗапасы Из Запасы Цикл
			
			Если ЗначениеЗаполнено(СтрокаЗапасы.ДокументРеализации) Тогда
				Продолжить;
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(СтрокаЗапасы.Себестоимость) Тогда
				
				ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Колонка",, НСтр("ru = 'Себестоимость'"), СтрокаЗапасы.НомерСтроки, "Запасы");
				Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Запасы", СтрокаЗапасы.НомерСтроки, "ЗапасыСебестоимость");
				
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если Не ПроверятьЗаполнениеКорреспонденцииКомпенсации() Тогда
		ИсключаемыеРеквизиты.Добавить("КорреспонденцияКомпенсация");
	КонецЕсли;
	
	//С версии 3.0.14, т.к. разрешили передачу на комиссию по нулевой цене, проверку заполнения цены передачи убираем
	ИсключаемыеРеквизиты.Добавить("Запасы.Цена");
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, ИсключаемыеРеквизиты);
	
	Если ВидОперации = Перечисления.ВидыОперацийОтчетКомиссионераОСписании.ОприходованиеУКомиссионера Тогда
		ПроверитьНаличиеНоменклатурыВДокументеСторнирования(Отказ);
		ПроверитьВозможностьСторнироватьПоДокументам(Отказ);
	КонецЕсли;
	
КонецПроцедуры // ОбработкаПроверкиЗаполнения()

// Процедура - обработчик события ОбработкаПроведения объекта.
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Инициализация дополнительных свойств для проведения документа.
	ПроведениеДокументовУНФ.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	ДополнительныеСвойства.Вставить("ЭтоОприходование", ВидОперации = Перечисления.ВидыОперацийОтчетКомиссионераОСписании.ОприходованиеУКомиссионера);
	
	// Инициализация данных документа.
	Документы.ОтчетКомиссионераОСписании.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей.
	ПроведениеДокументовУНФ.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Отражение в разделах учета.
	ТаблицыДляДвижений = ДополнительныеСвойства.ТаблицыДляДвижений;
	ПроведениеДокументовУНФ.ОтразитьДвижения("ЗапасыПереданные", ТаблицыДляДвижений, Движения, Отказ);
	ПроведениеДокументовУНФ.ОтразитьДвижения("Запасы", ТаблицыДляДвижений, Движения, Отказ);
	
	ПроведениеДокументовУНФ.ОтразитьДвижения("ЗапасыВРазрезеГТД", ТаблицыДляДвижений, Движения, Отказ);
	ПроведениеДокументовУНФ.ОтразитьДвижения("ЗапасыПереданныеВРазрезеГТД", ТаблицыДляДвижений, Движения, Отказ);
	ПроведениеДокументовУНФ.ОтразитьДвижения("ДоходыИРасходы", ТаблицыДляДвижений, Движения, Отказ);
	ПроведениеДокументовУНФ.ОтразитьДвижения("ОплатаДокументов", ТаблицыДляДвижений, Движения, Отказ);
	ПроведениеДокументовУНФ.ОтразитьДвижения("РасчетыСПокупателями", ТаблицыДляДвижений, Движения, Отказ);
	ПроведениеДокументовУНФ.ОтразитьУправленческий(ДополнительныеСвойства, Движения, Отказ);
	
	ПроведениеДокументовУНФ.ОтразитьДвижения("ДвиженияСерииНоменклатуры", ТаблицыДляДвижений, Движения, Отказ);
	
	// Прослеживаемость
	ПроведениеДокументовУНФ.ОтразитьДвижения("ПрослеживаемыеТовары", ТаблицыДляДвижений, Движения, Отказ);
	ПроведениеДокументовУНФ.ОтразитьДвижения("ОперацииСПрослеживаемымиТоварами", ТаблицыДляДвижений, Движения, Отказ);
	
	// Запись наборов записей.
	ПроведениеДокументовУНФ.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	// Контроль возникновения отрицательного остатка.
	Документы.ОтчетКомиссионераОСписании.ВыполнитьКонтроль(Ссылка, ДополнительныеСвойства, Отказ);
	
	ПроведениеДокументовУНФ.ЗакрытьМенеджерВременныхТаблиц(ЭтотОбъект);
	
КонецПроцедуры // ОбработкаПроведения()

// Процедура - обработчик события ОбработкаУдаленияПроведения объекта.
//
Процедура ОбработкаУдаленияПроведения(Отказ)
	
	// Инициализация дополнительных свойств для проведения документа
	ПроведениеДокументовУНФ.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей
	ПроведениеДокументовУНФ.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Запись наборов записей
	ПроведениеДокументовУНФ.ЗаписатьНаборыЗаписей(ЭтотОбъект);

	// Контроль
	Документы.ОтчетКомиссионераОСписании.ВыполнитьКонтроль(Ссылка, ДополнительныеСвойства, Отказ, Истина);
	
КонецПроцедуры // ОбработкаУдаленияПроведения()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СтратегияЗаполнения()
	Результат = Новый Соответствие;
	Результат[Тип("ДокументСсылка.ЗаказПокупателя")] = "ЗаполнитьПоЗаказуПокупателя";
	Результат[Тип("ДокументСсылка.РасходнаяНакладная")] = "ЗаполнитьПоРасходнаяНакладная";
	Возврат Результат;
КонецФункции

Процедура ПроверитьНаличиеНоменклатурыВДокументеСторнирования(Отказ)
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("МассивДокументов", Запасы.ВыгрузитьКолонку("ДокументРеализации"));
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОтчетКомиссионераОСписанииЗапасы.Номенклатура КАК Номенклатура,
	|	ОтчетКомиссионераОСписанииЗапасы.Характеристика КАК Характеристика,
	|	ОтчетКомиссионераОСписанииЗапасы.Партия КАК Партия,
	|	ВЫБОР
	|		КОГДА ОтчетКомиссионераОСписанииЗапасы.Ссылка.ПоложениеЗаказа = ЗНАЧЕНИЕ(Перечисление.ПоложениеРеквизитаНаФорме.ВТабличнойЧасти)
	|			ТОГДА ОтчетКомиссионераОСписанииЗапасы.Заказ
	|		ИНАЧЕ ОтчетКомиссионераОСписанииЗапасы.Ссылка.Заказ
	|	КОНЕЦ КАК Заказ,
	|	ОтчетКомиссионераОСписанииЗапасы.Ссылка КАК ДокументРеализации
	|ИЗ
	|	Документ.ОтчетКомиссионераОСписании.Запасы КАК ОтчетКомиссионераОСписанииЗапасы
	|ГДЕ
	|	ОтчетКомиссионераОСписанииЗапасы.Ссылка В(&МассивДокументов)";
	
	НоменклатураПоДокументам = Запрос.Выполнить().Выгрузить();
	
	ПараметрыПоиска = Новый Структура;
	
	ПараметрыПоиска.Вставить("Номенклатура");
	ПараметрыПоиска.Вставить("Характеристика");
	ПараметрыПоиска.Вставить("Партия");
	ПараметрыПоиска.Вставить("Заказ");
	ПараметрыПоиска.Вставить("ДокументРеализации");
	
	ЗаказВШапке = ПоложениеЗаказа = Перечисления.ПоложениеРеквизитаНаФорме.ВШапке;
	
	Для Каждого СтрокаЗапасов Из Запасы Цикл
		
		Если Не ЗначениеЗаполнено(СтрокаЗапасов.ДокументРеализации) Тогда
			Продолжить
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(ПараметрыПоиска, СтрокаЗапасов);
		
		ЗаказПокупателя = ?(ЗаказВШапке, Заказ, СтрокаЗапасов.Заказ);
		ПараметрыПоиска.Заказ = ЗаказПокупателя;
		
		НоменклатураНайдена = НоменклатураПоДокументам.НайтиСтроки(ПараметрыПоиска).Количество();
		
		Если НоменклатураНайдена Тогда
			Продолжить
		КонецЕсли;
		
		ДанныеПоЗаказу = "";
		Если ЗначениеЗаполнено(ЗаказПокупателя) Тогда
			ДанныеПоЗаказу = СтрШаблон(НСтр("ru = 'по %1'"), ЗаказПокупателя);
		КонецЕсли;
		
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Для данных по номенклатуре из строки %1 %2, не найдено соответствие в документе %3'")
										, СтрокаЗапасов.НомерСтроки, ДанныеПоЗаказу, СтрокаЗапасов.ДокументРеализации);
		
		КонтекстноеПоле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Запасы", СтрокаЗапасов.НомерСтроки, "ДокументРеализации");
		
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, КонтекстноеПоле, , Отказ);
		
	КонецЦикла;
	
КонецПроцедуры


Процедура ПроверитьВозможностьСторнироватьПоДокументам(Отказ)
	
	Если ПроведениеДокументовУНФ.КонтрольОстатковВыключен() Или Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОтчетКомиссионераОСписанииЗапасы.Номенклатура КАК Номенклатура,
	|	ОтчетКомиссионераОСписанииЗапасы.Характеристика КАК Характеристика,
	|	ОтчетКомиссионераОСписанииЗапасы.Партия КАК Партия,
	|	ВЫБОР
	|		КОГДА ОтчетКомиссионераОСписанииЗапасы.Заказ = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ОтчетКомиссионераОСписанииЗапасы.Заказ
	|	КОНЕЦ КАК Заказ,
	|	ОтчетКомиссионераОСписанииЗапасы.ДокументРеализации КАК ДокументРеализации
	|ПОМЕСТИТЬ ВТ_ДокументыСписания
	|ИЗ
	|	Документ.ОтчетКомиссионераОСписании.Запасы КАК ОтчетКомиссионераОСписанииЗапасы
	|ГДЕ
	|	ОтчетКомиссионераОСписанииЗапасы.Ссылка = &Ссылка
	|	И НЕ ОтчетКомиссионераОСписанииЗапасы.ДокументРеализации = ЗНАЧЕНИЕ(Документ.ОтчетКомиссионераОСписании.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗапасыПереданные.Номенклатура КАК Номенклатура,
	|	ЗапасыПереданные.Характеристика КАК Характеристика,
	|	ЗапасыПереданные.Партия КАК Партия,
	|	ВЫБОР
	|		КОГДА ЗапасыПереданные.Заказ = НЕОПРЕДЕЛЕНО
	|			ТОГДА ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПУстаяСсылка)
	|		ИНАЧЕ ЗапасыПереданные.Заказ
	|	КОНЕЦ КАК Заказ,
	|	СУММА(ВЫБОР
	|			КОГДА ЗапасыПереданные.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ТОГДА -ЗапасыПереданные.Количество
	|			ИНАЧЕ ЗапасыПереданные.Количество
	|		КОНЕЦ) КАК Количество,
	|	ЗапасыПереданные.Регистратор КАК ДокументСписания,
	|	ЗапасыПереданные.ВидДвижения КАК ВидДвижения
	|ПОМЕСТИТЬ ВТ_РасходПоДокументамСписания
	|ИЗ
	|	РегистрНакопления.ЗапасыПереданные КАК ЗапасыПереданные
	|ГДЕ
	|	(ЗапасыПереданные.Регистратор, ЗапасыПереданные.Заказ, ЗапасыПереданные.Номенклатура, ЗапасыПереданные.Характеристика, ЗапасыПереданные.Партия) В
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				ВТ_ДокументыСписания.ДокументРеализации КАК ДокументРеализации,
	|				ВТ_ДокументыСписания.Заказ КАК Заказ,
	|				ВТ_ДокументыСписания.Номенклатура КАК Номенклатура,
	|				ВТ_ДокументыСписания.Характеристика КАК Характеристика,
	|				ВТ_ДокументыСписания.Партия КАК Партия
	|			ИЗ
	|				ВТ_ДокументыСписания КАК ВТ_ДокументыСписания)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗапасыПереданные.Номенклатура,
	|	ЗапасыПереданные.Партия,
	|	ЗапасыПереданные.Характеристика,
	|	ЗапасыПереданные.Регистратор,
	|	ВЫБОР
	|		КОГДА ЗапасыПереданные.Заказ = НЕОПРЕДЕЛЕНО
	|			ТОГДА ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПУстаяСсылка)
	|		ИНАЧЕ ЗапасыПереданные.Заказ
	|	КОНЕЦ,
	|	ЗапасыПереданные.ВидДвижения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗапасыПереданные.Регистратор КАК ДокументОприходования,
	|	ЗапасыПереданные.Номенклатура КАК Номенклатура,
	|	ЗапасыПереданные.Характеристика КАК Характеристика,
	|	ЗапасыПереданные.Партия КАК Партия,
	|	ВЫБОР
	|		КОГДА ЗапасыПереданные.Заказ = НЕОПРЕДЕЛЕНО
	|			ТОГДА ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|		ИНАЧЕ ЗапасыПереданные.Заказ
	|	КОНЕЦ КАК Заказ,
	|	СУММА(-ЗапасыПереданные.Количество) КАК Количество
	|ПОМЕСТИТЬ ВТ_ОприходованияПоДокументамСписания
	|ИЗ
	|	РегистрНакопления.ЗапасыПереданные КАК ЗапасыПереданные
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(ЗапасыПереданные.Регистратор) = ТИП(Документ.ОтчетКомиссионераОСписании)
	|	И ЗапасыПереданные.Количество < 0
	|	И НЕ ЗапасыПереданные.Регистратор = &Ссылка
	|	И (ЗапасыПереданные.Номенклатура, ЗапасыПереданные.Характеристика, ЗапасыПереданные.Партия, ЗапасыПереданные.Заказ) В
	|			(ВЫБРАТЬ
	|				ВТ_ДокументыСписания.Номенклатура КАК Номенклатура,
	|				ВТ_ДокументыСписания.Характеристика КАК Характеристика,
	|				ВТ_ДокументыСписания.Партия КАК Партия,
	|				ВТ_ДокументыСписания.Заказ КАК Заказ
	|			ИЗ
	|				ВТ_ДокументыСписания КАК ВТ_ДокументыСписания)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗапасыПереданные.Партия,
	|	ЗапасыПереданные.Номенклатура,
	|	ЗапасыПереданные.Характеристика,
	|	ЗапасыПереданные.Регистратор,
	|	ВЫБОР
	|		КОГДА ЗапасыПереданные.Заказ = НЕОПРЕДЕЛЕНО
	|			ТОГДА ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|		ИНАЧЕ ЗапасыПереданные.Заказ
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОтчетКомиссионераОСписанииЗапасы.Номенклатура КАК Номенклатура,
	|	ОтчетКомиссионераОСписанииЗапасы.Характеристика КАК Характеристика,
	|	ОтчетКомиссионераОСписанииЗапасы.Партия КАК Партия,
	|	ОтчетКомиссионераОСписанииЗапасы.ДокументРеализации КАК ДокументСписания,
	|	СУММА(ОтчетКомиссионераОСписанииЗапасы.Количество) КАК Количество,
	|	ОтчетКомиссионераОСписанииЗапасы.Заказ КАК Заказ
	|ПОМЕСТИТЬ ВТ_ОприходованияПоДокументамРасхода
	|ИЗ
	|	ВТ_ОприходованияПоДокументамСписания КАК ВТ_ДокументыОприходования
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтчетКомиссионераОСписании.Запасы КАК ОтчетКомиссионераОСписанииЗапасы
	|		ПО ВТ_ДокументыОприходования.ДокументОприходования = ОтчетКомиссионераОСписанииЗапасы.Ссылка
	|			И ВТ_ДокументыОприходования.Номенклатура = ОтчетКомиссионераОСписанииЗапасы.Номенклатура
	|			И ВТ_ДокументыОприходования.Характеристика = ОтчетКомиссионераОСписанииЗапасы.Характеристика
	|			И ВТ_ДокументыОприходования.Партия = ОтчетКомиссионераОСписанииЗапасы.Партия
	|			И ВТ_ДокументыОприходования.Заказ = ОтчетКомиссионераОСписанииЗапасы.Заказ
	|ГДЕ
	|	ОтчетКомиссионераОСписанииЗапасы.ДокументРеализации В
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				ВТ_ДокументыСписания.ДокументРеализации КАК ДокументРеализации
	|			ИЗ
	|				ВТ_ДокументыСписания КАК ВТ_ДокументыСписания)
	|
	|СГРУППИРОВАТЬ ПО
	|	ОтчетКомиссионераОСписанииЗапасы.Характеристика,
	|	ОтчетКомиссионераОСписанииЗапасы.Номенклатура,
	|	ОтчетКомиссионераОСписанииЗапасы.Партия,
	|	ОтчетКомиссионераОСписанииЗапасы.ДокументРеализации,
	|	ОтчетКомиссионераОСписанииЗапасы.Заказ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_РасходПоДокументамСписания.Номенклатура КАК Номенклатура,
	|	ВТ_РасходПоДокументамСписания.Характеристика КАК Характеристика,
	|	ВТ_РасходПоДокументамСписания.Партия КАК Партия,
	|	ВТ_РасходПоДокументамСписания.Заказ КАК Заказ,
	|	ВТ_РасходПоДокументамСписания.ДокументСписания КАК ДокументСписания,
	|	СУММА(ВТ_РасходПоДокументамСписания.Количество - ЕСТЬNULL(ВТ_ОприходованияПоДокументамРасхода.Количество, 0)) КАК КоличествоОстаток
	|ИЗ
	|	ВТ_РасходПоДокументамСписания КАК ВТ_РасходПоДокументамСписания
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОприходованияПоДокументамРасхода КАК ВТ_ОприходованияПоДокументамРасхода
	|		ПО ВТ_РасходПоДокументамСписания.Номенклатура = ВТ_ОприходованияПоДокументамРасхода.Номенклатура
	|			И ВТ_РасходПоДокументамСписания.Характеристика = ВТ_ОприходованияПоДокументамРасхода.Характеристика
	|			И ВТ_РасходПоДокументамСписания.Партия = ВТ_ОприходованияПоДокументамРасхода.Партия
	|			И ВТ_РасходПоДокументамСписания.ДокументСписания = ВТ_ОприходованияПоДокументамРасхода.ДокументСписания
	|			И ВТ_РасходПоДокументамСписания.Заказ = ВТ_ОприходованияПоДокументамРасхода.Заказ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_РасходПоДокументамСписания.Партия,
	|	ВТ_РасходПоДокументамСписания.Номенклатура,
	|	ВТ_РасходПоДокументамСписания.ДокументСписания,
	|	ВТ_РасходПоДокументамСписания.Характеристика,
	|	ВТ_РасходПоДокументамСписания.Заказ";
	
	ТаблицаОстатковПоДокументамСписания = Запрос.Выполнить().Выгрузить();
	
	ПараметрыПоиска = Новый Структура;
	ПараметрыПоиска.Вставить("Номенклатура");
	ПараметрыПоиска.Вставить("Характеристика");
	ПараметрыПоиска.Вставить("Партия");
	ПараметрыПоиска.Вставить("Заказ");
	
	Для Каждого СтрокаЗапасов Из Запасы Цикл
		
		Если Не ЗначениеЗаполнено(СтрокаЗапасов.ДокументРеализации) Тогда
			Продолжить
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(ПараметрыПоиска, СтрокаЗапасов);
		
		СтрокиОстатков = ТаблицаОстатковПоДокументамСписания.НайтиСтроки(ПараметрыПоиска);
		
		Если Не СтрокиОстатков.Количество() Тогда
			Продолжить
		КонецЕсли;
		
		Если СтрокаЗапасов.Количество <= СтрокиОстатков[0].КоличествоОстаток Тогда
			СтрокиОстатков[0].КоличествоОстаток = СтрокиОстатков[0].КоличествоОстаток - СтрокаЗапасов.Количество;
		Иначе
			
			КоличествоНехватает = СтрокаЗапасов.Количество - СтрокиОстатков[0].КоличествоОстаток;
			
			ТекстСообщения = СтрШаблон(НСтр("ru = 'В строке %1 для документа %2 нехватает списанного товара в количестве %3 %4.'")
										, СтрокаЗапасов.НомерСтроки, СтрокиОстатков[0].ДокументСписания, КоличествоНехватает, СтрокаЗапасов.ЕдиницаИзмерения);
										
			КонтекстноеПоле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Запасы", СтрокаЗапасов.НомерСтроки, "Количество");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, КонтекстноеПоле, , Отказ);
			
			
		КонецЕсли;
		
				
	КонецЦикла;
	
КонецПроцедуры

Функция ПроверятьЗаполнениеКорреспонденцииКомпенсации()

	Для Каждого СтрокаЗапасы Из Запасы Цикл
		
		Если ЗначениеЗаполнено(СтрокаЗапасы.СуммаКомпенсацииДекомпенсации) Тогда
			Возврат Истина
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

// Процедура заполнения документа на основании заказа покупателя.
//
// Параметры:
//	ДанныеЗаполнения - Структура - Данные заполнения документа
//	
Процедура ЗаполнитьПоЗаказуПокупателяНаПродажу(ДанныеЗаполнения)
	
	ПараметрыОтбора = Новый Структура("НомерВариантаКП", ДанныеЗаполнения.ОсновнойВариантКП);
	СтрокиДляДобавления = ДанныеЗаполнения.Запасы.НайтиСтроки(ПараметрыОтбора);
	
	ЗаказВТабличнойЧасти = ?(ПоложениеЗаказа = Перечисления.ПоложениеРеквизитаНаФорме.ВТабличнойЧасти, Истина, Ложь);
	
	ДополнительныеПараметры = Новый Структура("Заказ", ДанныеЗаполнения);
	ТаблицаОстатков = РаботаСКомиссионерамиКомитентамиСервер.ТаблицаОстатковТоваровУКомиссионера(ЭтотОбъект, ДополнительныеПараметры,,, Ложь);
	
	ПараметрыПоиска = Новый Структура("Номенклатура, Характеристика, Партия");
	
	Для Каждого СтрокаЗаказа Из СтрокиДляДобавления Цикл
		
		ПараметрыПоиска.Номенклатура = СтрокаЗаказа.Номенклатура;
		ПараметрыПоиска.Характеристика = СтрокаЗаказа.Характеристика;
		ПараметрыПоиска.Партия = СтрокаЗаказа.Партия;

		НайденныеСтроки = ТаблицаОстатков.НайтиСтроки(ПараметрыПоиска);
		
		Если Не НайденныеСтроки.Количество() Тогда Продолжить КонецЕсли;
		
		НоваяСтрока = Запасы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаЗаказа);

		Если ЗаказВТабличнойЧасти Тогда
			НоваяСтрока.Заказ = ДанныеЗаполнения;
		КонецЕсли;
		
		Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			
			Если НайденнаяСтрока.Количество = 0 Тогда Продолжить КонецЕсли;
			
			Если НоваяСтрока.Количество >= НайденнаяСтрока.Количество Тогда
				НоваяСтрока.Количество = НайденнаяСтрока.Количество;
				НоваяСтрока.Цена = Окр(НайденнаяСтрока.СуммаРасчетов / НайденнаяСтрока.Количество, 2, РежимОкругления.Окр15как20);
				НоваяСтрока.Сумма = НайденнаяСтрока.СуммаРасчетов;
				ТаблицаОстатков.Удалить(НайденнаяСтрока);
			Иначе
				НоваяСтрока.Цена = Окр(НайденнаяСтрока.СуммаРасчетов / НайденнаяСтрока.Количество, 2, РежимОкругления.Окр15как20);
				НоваяСтрока.Сумма = Окр(НоваяСтрока.Цена * НоваяСтрока.Количество, 2, РежимОкругления.Окр15как20);
				НайденнаяСтрока.Количество = НайденнаяСтрока.Количество - НоваяСтрока.Количество;
				НайденнаяСтрока.СуммаРасчетов = НайденнаяСтрока.СуммаРасчетов - НоваяСтрока.Сумма;
				
				Если НайденнаяСтрока.СуммаРасчетов <= 0.01 Тогда 
					НоваяСтрока.Сумма = НоваяСтрока.Сумма + НайденнаяСтрока.СуммаРасчетов;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если НоваяСтрока.Количество = 0 Тогда Запасы.Удалить(НоваяСтрока) КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьПоЗаказПокупателяНаПродажу()

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли