
#Область ПрограммныйИнтерфейс

#Область ПараметрыРегистрации

// Функция возвращает поддерживает ли фискальное устройство.
// 
// Параметры:
//  ИдентификаторУстройства - СправочникСсылка.ПодключаемоеОборудование - Идентификатор устройства
// 
// Возвращаемое значение:
//  Булево - Фискальное устройство поддерживает проверку кодов маркировки
Функция ФискальноеУстройствоПоддерживаетПроверкуКодовМаркировки(ИдентификаторУстройства) Экспорт
	
	Возврат ОборудованиеЧекопечатающиеУстройства.ФискальноеУстройствоПоддерживаетПроверкуКодовМаркировки(ИдентификаторУстройства);
	
КонецФункции

// Функция возвращает для фискального устройства версию ФФД.
// 
// Параметры:
//  ИдентификаторУстройства - СправочникСсылка.ПодключаемоеОборудование - Идентификатор устройства.
// 
// Возвращаемое значение:
//  Неопределено - Фискальное устройство поддерживает версию ФФД
Функция ФискальноеУстройствоПоддерживаетВерсиюФФД(ИдентификаторУстройства) Экспорт
	
	Возврат ОборудованиеЧекопечатающиеУстройства.ФискальноеУстройствоПоддерживаетВерсиюФФД(ИдентификаторУстройства);
	
КонецФункции

// ++ Локализация

// Функция возвращает поддерживает ли фискальное устройство ТС ПИоТ.
// 
// Параметры:
//  ИдентификаторУстройства - СправочникСсылка.ПодключаемоеОборудование - Идентификатор устройства.
// 
// Возвращаемое значение:
//  Булево - Фискальное устройство поддерживает ТС ПИоТ
Функция ФискальноеУстройствоПоддерживаетТСПИоТ(ИдентификаторУстройства) Экспорт
	
	Возврат ОборудованиеЧекопечатающиеУстройства.ФискальноеУстройствоПоддерживаетТСПИоТ(ИдентификаторУстройства);
	
КонецФункции

// -- Локализация

#КонецОбласти

#Область ФормированиеДанныхККТ

// Получить таблицу параметров смены из ККТ.
//
// Параметры:
//  ДанныеXML - Строка - строка XML
//  РевизияИнтерфейса - Число - ревизия интерфейса
//  НомерСменыККТ - Число - номер смены
//  НомерЧекаККТ - Число - номер чека
//
// Возвращаемое значение:
//  Структура.
//
Функция ПолучитьПараметрыСменыИзXMLПакета(ДанныеXML, РевизияИнтерфейса = 0, НомерСменыККТ = 0, НомерЧекаККТ = 0) Экспорт
	
	Возврат ОборудованиеЧекопечатающиеУстройстваКлиентСервер.
		ПолучитьПараметрыСменыИзXMLПакета(ДанныеXML, РевизияИнтерфейса, НомерСменыККТ, НомерЧекаККТ);
	
КонецФункции

// Возвращает XML текст инфо-квитанции
// Параметры:
//  Данные - Структура
//  ШиринаСтроки - Число
//  Ревизия - Строка
//
// Возвращаемое значение:
//  Строка - Строка XML
//
Функция XMLПакетИнфоКвитанции(Данные,  ШиринаСтроки, Ревизия) Экспорт
	
	Шаблон = ШаблоныФискальныхДокументов.ШаблонИнфоКвитанция(ШиринаСтроки, Данные);
	НефискальныйДокумент = ШаблоныФискальныхДокументов.ВывестиКакТекст(Шаблон);
	Возврат ОборудованиеЧекопечатающиеУстройства.ПолучитьXMLПакетДляТекста(НефискальныйДокумент, Ревизия);
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ПередОткрытиемКассовойСмены(ПараметрыПодключения, ДанныеОперации) Экспорт
	
	Возврат ОборудованиеЧекопечатающиеУстройства.ПередОткрытиемКассовойСмены(ПараметрыПодключения, ДанныеОперации);
	
КонецФункции

Функция ПередЗакрытиемКассовойСмены(ПараметрыПодключения, ДанныеОперации) Экспорт
	
	Возврат ОборудованиеЧекопечатающиеУстройства.ПередЗакрытиемКассовойСмены(ПараметрыПодключения, ДанныеОперации);
	
КонецФункции

Функция ПослеОткрытияКассовойСмены(ПараметрыПодключения, РезультатВыполнения) Экспорт
	
	Возврат ОборудованиеЧекопечатающиеУстройства.ПослеОткрытияКассовойСмены(ПараметрыПодключения, РезультатВыполнения);
	
КонецФункции

Функция ПослеЗакрытияКассовойСмены(ПараметрыПодключения, РезультатВыполнения) Экспорт
	
	Возврат ОборудованиеЧекопечатающиеУстройства.ПослеЗакрытияКассовойСмены(ПараметрыПодключения, РезультатВыполнения);
	
КонецФункции

Процедура ЗаписатьОперациюЕГАИСВЖурнал(ЗаписьОперацииЕГАИС, ИдентификаторФискальнойОперации, ШтрихкодыПродукции) Экспорт
		
	МодульМенеджерОборудованияМаркировка = ОбщегоНазначенияБПО.ОбщийМодуль("МенеджерОборудованияМаркировка");
	ПараметрыЗаписи = МодульМенеджерОборудованияМаркировка.ПараметрыЗаписиРезультатаПроверкиЕГАИС();;
	ПараметрыЗаписи.ИдентификаторФискальнойОперации = ИдентификаторФискальнойОперации;
	ПараметрыЗаписи.Выполнено = ЗаписьОперацииЕГАИС.Выполнено;
	ПараметрыЗаписи.ШтрихкодыПродукции = ШтрихкодыПродукции;
	ПараметрыЗаписи.ИдентификаторЗапроса = ЗаписьОперацииЕГАИС.АдресЧека;
	ПараметрыЗаписи.ПодписьЧека = ЗаписьОперацииЕГАИС.ПодписьЧека;
	ПараметрыЗаписи.ВходящееСообщение = ЗаписьОперацииЕГАИС.ВходящееСообщение;
	ПараметрыЗаписи.ИсходящееСообщение = ЗаписьОперацииЕГАИС.ИсходящееСообщение;
	ПараметрыЗаписи.СообщениеПередано = ЗаписьОперацииЕГАИС.СообщениеПередано;
	ПараметрыЗаписи.ТекстОшибки = ЗаписьОперацииЕГАИС.ОписаниеОшибки;
	МодульМенеджерОборудованияМаркировка.ДобавитьРезультатыОтправкиЕГАИС(ПараметрыЗаписи);
		
КонецПроцедуры


#Область ФормированиеДанныхККТ

// Получить XMLПакет для операции.
// 
// Параметры:
//  ОбщиеПараметры - Структура, Булево - Общие параметры
//  РевизияИнтерфейса - Число - Ревизия интерфейса
// 
// Возвращаемое значение:
//  Строка - Получить XMLПакет для операции
Функция ПолучитьXMLПакетДляОперации(ОбщиеПараметры, РевизияИнтерфейса = 0) Экспорт
	
	Возврат ОборудованиеЧекопечатающиеУстройстваКлиентСервер.
		ПолучитьXMLПакетДляОперации(ОбщиеПараметры, РевизияИнтерфейса);
	
КонецФункции

// Получить XMLПакет для текста.
// 
// Параметры:
//  СтрокаТекста - Строка, Структура - Строка текста
//  РевизияИнтерфейса - Число - Ревизия интерфейса
// 
// Возвращаемое значение:
//  Массив из ЗаписьXML - Получить XMLПакет для текста.
//
Функция ПолучитьXMLПакетДляТекста(СтрокаТекста, РевизияИнтерфейса = 0) Экспорт
	
	Возврат ОборудованиеЧекопечатающиеУстройстваКлиентСервер.
		ПолучитьXMLПакетДляТекста(СтрокаТекста, РевизияИнтерфейса);
	
КонецФункции  

Процедура ЗаполнитьXMLПакетыДляТекстовогоДокумента(ТестовыеЧеки, НефискальныеДокументы, ПараметрыПодключения, ШиринаСтроки = 32) Экспорт
	
	ОборудованиеЧекопечатающиеУстройстваКлиентСервер.
		ЗаполнитьXMLПакетыДляТекстовогоДокумента(ТестовыеЧеки, НефискальныеДокументы, ПараметрыПодключения, ШиринаСтроки);

КонецПроцедуры

// Получить параметры состояния из XML пакета.
//
// Параметры:
//  ДанныеXML - Строка, XML текст
// 
// Возвращаемое значение:
//  Структура.
//
Функция ПолучитьПараметрыСостоянияИзXMLПакета(Данные, НомерСмены = Неопределено) Экспорт
	
	Возврат ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПолучитьПараметрыСостоянияИзXMLПакета(Данные, НомерСмены);
	
КонецФункции         

// ++ Локализация

// Получить cтатус cостояния из XML пакета.
//             
// Параметры:
//  ДанныеXML - Строка, XML текст
// 
// Возвращаемое значение:
//  Структура.
//
Функция ПолучитьСтатусСостоянияИзXMLПакета(ДанныеXML) Экспорт
	
	Возврат ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПолучитьСтатусСостоянияИзXMLПакета(ДанныеXML);
	
КонецФункции             

// Получить служебную информацию из XML пакета.
//             
// Параметры:
//  ДанныеXML - Строка, XML текст
// 
// Возвращаемое значение:
//  Структура.
//
Функция ПолучитьСлужебнуюИнформациюИзXMLПакета(ДанныеXML) Экспорт
	
	Возврат ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПолучитьСлужебнуюИнформациюИзXMLПакета(ДанныеXML);
	
КонецФункции  

// Получить параметры результата из XML пакета.
//             
// Параметры:
//  ДанныеXML - Строка, XML текст
// 
// Возвращаемое значение:
//  Структура.
//
Функция ПолучитьПараметрыРезультатаИзXMLПакета(ДанныеXML) Экспорт
	
	Возврат ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПолучитьПараметрыРезультатаИзXMLПакета(ДанныеXML);

КонецФункции

// -- Локализация

#КонецОбласти

#КонецОбласти