
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("АдресХранилищаДляОбменаДанными", АдресХранилищаДляОбменаДанными);
	
	Элементы.НадписьОжидание.Заголовок = Параметры.НадписьОжидание;
	
	Элементы.ПерезапуститьПриложение.Видимость = Ложь;
	Элементы.Закрыть.Видимость = Ложь;
	Элементы.ПовторитьПодключение.Видимость = Ложь;
	Элементы.ТекстОшибки.Видимость = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПодключитьОбработчикОжидания("ОбработатьДействиеСФормой", 1);
	ОбработатьДействиеСФормой();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	Оповестить(ПлюсСервисСлужебныйКлиент.СобытиеЗакрытияОкнаСостояния(), Истина, ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПерезапуститьПриложение(Команда)
	
	Если ЭтоУстановкаМаг1С Тогда
		ЗавершитьРаботуСистемы(Ложь, Истина, "/C RunMag1cWizard");
	Иначе
		ЗавершитьРаботуСистемы(Истина, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПовторитьПодключение(Команда)
	
	ВладелецФормы.ПовторноеПодключение();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбработатьДействиеСФормой()
	
	ОчиститьСообщения();
	Попытка                            
		Данные = ПолучитьИзВременногоХранилища(АдресХранилищаДляОбменаДанными);
	Исключение
		ОтключитьОбработчикОжидания("ОбработатьДействиеСФормой");
		Возврат;
	КонецПопытки;
	
	Если Данные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПоместитьВоВременноеХранилище(Неопределено, АдресХранилищаДляОбменаДанными);
	ОтключитьОбработчикОжидания("ОбработатьДействиеСФормой");
	
	ОтобразитьИнформацию(Данные);
	
	Если Данные.ЗакрытьФорму Тогда
		Возврат;
	КонецЕсли;
	
	ПодключитьОбработчикОжидания("ОбработатьДействиеСФормой", 1);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтобразитьИнформацию(Данные)
	
	Элементы.КартинкаОжидание.Картинка = Данные.Картинка;
	Элементы.НадписьОжидание.Заголовок = Данные.Текст;
	Элементы.ПерезапуститьПриложение.Видимость = Данные.ПоказатьКнопкиВопроса;
	Элементы.Закрыть.Видимость = Данные.ПоказатьКнопкиВопроса;
	Элементы.ПовторитьПодключение.Видимость = Данные.ПоказатьКнопкуПовторногоПодключения; 
	Если Данные.ПоказатьКнопкуПовторногоПодключения Тогда
		Элементы.ПовторитьПодключение.Важность = ВажностьКнопки.Главная;
	Иначе
		Элементы.ПерезапуститьПриложение.Важность = ВажностьКнопки.Главная;
	КонецЕсли;
	
	ТекстОшибки = Данные.ТекстОшибки;
	Элементы.ТекстОшибки.Видимость = Не ПустаяСтрока(ТекстОшибки);
	
	ЭтоУстановкаМаг1С = Данные.ЭтоУстановкаМаг1С;
	
	Если Данные.ЗакрытьФорму Тогда
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти