#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ТекущийПользователь = Пользователи.ТекущийПользователь();

	Доступно = ?(Объект.ТолькоДляАвтора, 0, 1);
	ЭтоНовый = Не ЗначениеЗаполнено(Объект.Ссылка);

	БизнесПриложениеВыставлениеСчетов.ПриСозданииНаСервереШаблоныПечатиОфисныхДокументов(ЭтотОбъект);
	
	УправлениеФормой(ЭтотОбъект);
	ЗаполнитьРеквизиты();
	УстановитьДоступностьКнопок();

	ФильтрФайлов = ШаблоныПечатиОфисныхДокументов.ФильтрВыбираемыхФайловИзКаталога();

КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)

	Объект.ТолькоДляАвтора = ?(Доступно = 1, Ложь, Истина);

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	ДобавитьИзмененныеФорматыВОбъект(ТекущийОбъект);

КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	РаботаСФайлами.ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи, Параметры);

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	ОбновитьПовторноИспользуемыеЗначения();
	УправлениеФормой(ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)

	Если ЭтоНовый Тогда
		Оповестить("Запись_ШаблоныПечатиОфисныхДокументов", Новый Структура("ЭтоНовый,Назначение", Истина,
			Объект.Назначение));
		ЭтоНовый = Не ЗначениеЗаполнено(Объект.Ссылка);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	ОбработатьОповещениеКлиентскаяЗаписьФайла(ИмяСобытия, Параметр, Источник);

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимостьРежимаСоздания();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.РаботаСФайлами
	РаботаСФайламиКлиент.ПоказатьПодтверждениеЗакрытияФормыСФайлами(ЭтотОбъект, Отказ, ЗавершениеРаботы, Объект.Ссылка);
	// Конец СтандартныеПодсистемы.РаботаСФайлами
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НазначениеПриИзменении(Элемент)

	ЗаполнитьРеквизиты();
	УстановитьВидимостьРежимаСоздания();

КонецПроцедуры

&НаКлиенте
Процедура ФайлШаблонПриИзменении(Элемент)
	УправлениеФормой(ЭтотОбъект);
	ЗаполнитьРеквизиты();
КонецПроцедуры

&НаКлиенте
Процедура ФайлШаблонОткрытие(Элемент, СтандартнаяОбработка)
	РаботаСФайламиКлиент.ОткрытьФормуФайла(Объект.ФайлШаблон, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ФайлШаблонНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	ЗначениеОтбора = Новый Структура("Расширение", Новый ФиксированныйМассив(ПодходящиеРасширения()));

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ПараметрыФормы.Вставить("ВладелецФайла", Объект.Ссылка);
	ПараметрыФормы.Вставить("Отбор", ЗначениеОтбора);

	ОткрытьФорму("Обработка.РаботаСФайлами.Форма.ПрисоединенныеФайлы", ПараметрыФормы, Элемент);

КонецПроцедуры

&НаКлиенте
Процедура ДоступВсемПользователямПриИзменении(Элемент)
	Доступно = 1;
КонецПроцедуры

&НаКлиенте
Процедура ДоступТолькоАвторуПриИзменении(Элемент)
	Доступно = 0;
КонецПроцедуры

&НаКлиенте
Процедура АвторПриИзменении(Элемент)
	Если Не ЗначениеЗаполнено(Объект.Автор) Тогда
		Объект.Автор = ПользователиКлиент.АвторизованныйПользователь();
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРеквизиты

&НаКлиенте
Процедура РеквизитыПриАктивизацииСтроки(Элемент)

	Элементы.РеквизитыФормат.СписокВыбора.Очистить();

	ДанныеСтроки = Элементы.Реквизиты.ТекущиеДанные;

	Если ДанныеСтроки = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ДанныеСтроки.ДопустимыеФорматы, Элементы.РеквизитыФормат.СписокВыбора);

	Элементы.РеквизитыФормат.КнопкаВыпадающегоСписка = ДанныеСтроки.ДопустимыеФорматы.Количество() <> 0;
	Элементы.РеквизитыФормат.КнопкаВыбора = ДанныеСтроки.ОписаниеТипов.Типы().Количество() <> 0;

КонецПроцедуры

&НаКлиенте
Процедура РеквизитыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	ДанныеСтроки = Реквизиты.НайтиПоИдентификатору(ВыбраннаяСтрока);

	Если ДанныеСтроки = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если Не ДанныеСтроки.ЕстьВозможностьВыбораФормата Тогда
		Возврат;
	КонецЕсли;

	Если ДанныеСтроки.ДопустимыеФорматы.Количество() <> 0 Тогда
		Возврат;
	КонецЕсли;

	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("КлючПараметра", ДанныеСтроки.Имя);
	ДополнительныеПараметры.Вставить("ИдентификаторСтроки", ВыбраннаяСтрока);
	ДополнительныеПараметры.Вставить("СтарыйФормат", ДанныеСтроки.Формат);

	ОписаниеОповещения = Новый ОписаниеОповещения("ВыбратьНовыйФорматПараметра", ЭтотОбъект, ДополнительныеПараметры);

	Конструктор = Новый КонструкторФорматнойСтроки(ДанныеСтроки.Формат);
	Конструктор.ДоступныеТипы = ДанныеСтроки.ОписаниеТипов;
	Конструктор.Показать(ОписаниеОповещения);

КонецПроцедуры

&НаКлиенте
Процедура СвойстваПараметровШаблонаФорматНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;

	ДанныеСтроки = Элементы.Реквизиты.ТекущиеДанные;

	Если ДанныеСтроки = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если ДанныеСтроки.ОписаниеТипов.Типы().Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("КлючПараметра", ДанныеСтроки.Имя);
	ДополнительныеПараметры.Вставить("ИдентификаторСтроки", Элементы.Реквизиты.ТекущаяСтрока);
	ДополнительныеПараметры.Вставить("СтарыйФормат", ДанныеСтроки.Формат);
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыбратьНовыйФорматПараметра", ЭтотОбъект, ДополнительныеПараметры);

	Конструктор = Новый КонструкторФорматнойСтроки(ДанныеСтроки.Формат);
	Конструктор.ДоступныеТипы = ДанныеСтроки.ОписаниеТипов;
	Конструктор.Показать(ОписаниеОповещения);

КонецПроцедуры

&НаКлиенте
Процедура РеквизитыФорматОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;

	ДанныеСтроки = Элементы.Реквизиты.ТекущиеДанные;

	Если ДанныеСтроки = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("КлючПараметра", ДанныеСтроки.Имя);
	ДополнительныеПараметры.Вставить("ИдентификаторСтроки", Элементы.Реквизиты.ТекущаяСтрока);
	ДополнительныеПараметры.Вставить("СтарыйФормат", ДанныеСтроки.Формат);

	ВыбратьНовыйФорматПараметра(ВыбранноеЗначение, ДополнительныеПараметры);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДобавитьПараметрыВФайл(Команда)

	Если Не ЗначениеЗаполнено(Объект.ФайлШаблон) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru = 'Для добавления параметров требуется указание файла шаблона.'"), , "Реквизиты");
		Возврат;
	КонецЕсли;
	
	ОчиститьСообщения();
	Результат = ДобавитьПараметрыВФайлСервер();

	Если Результат = Истина Тогда
		ПоказатьОповещениеПользователя( , , НСтр("ru='Выбранные параметры успешно добавлены в файл.'"));
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПросмотретьФайл(Команда)

	ДанныеФайла = ДанныеФайла(Объект.ФайлШаблон, УникальныйИдентификатор);
	РаботаСФайламиКлиент.ОткрытьФайл(ДанныеФайла, ФайлРедактируетсяТекущимПользователем());

КонецПроцедуры

&НаКлиенте
Процедура РедактироватьФайл(Команда)

	ДанныеФайла = ДанныеФайла(Объект.ФайлШаблон, УникальныйИдентификатор);
	РаботаСФайламиКлиент.ОткрытьФайл(ДанныеФайла, Истина);
	УстановитьДоступностьКнопок(ДанныеФайла.Редактирует);

	ОповеститьОбИзменении(Объект.ФайлШаблон);
	Оповестить("Запись_Файл", Новый Структура, Объект.ФайлШаблон);

КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьРедактированиеФайла(Команда)
	
	Если Не ФайлРедактируетсяТекущимПользователем() Тогда
		Возврат;
	КонецЕсли;
	
	ПослеПомещенияФайла = Новый ОписаниеОповещения("ЗакончитьРедактированиеВыполненоПомещение", ЭтотОбъект);
	ПараметрыОбновленияФайла = РаботаСФайламиСлужебныйКлиент.ПараметрыОбновленияФайла(
	ПослеПомещенияФайла, Объект.ФайлШаблон, УникальныйИдентификатор);
	ПараметрыОбновленияФайла.Вставить("СоздатьНовуюВерсию", Ложь);
	РаботаСФайламиСлужебныйКлиент.ЗакончитьРедактированиеСОповещением(ПараметрыОбновленияФайла);
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ЗагрузитьФайлШаблона(Команда)

	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;

	ТекстСообщения = НСтр("ru = 'Для загрузки файла необходимо установить расширение для веб-клиента 1С:Предприятие.'");
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗагрузитьФайлШаблонаПродолжение", ЭтотОбъект);
	ФайловаяСистемаКлиент.ПодключитьРасширениеДляРаботы1СПредприятия(ОписаниеОповещения, ТекстСообщения);
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ВыбратьФайлСтандартногоШаблона(Команда)
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;	

	ОтветНаВопрос = Ждать ВопросАсинх(ТекстВопросаЗаписи(), РежимДиалогаВопрос.ОКОтмена);
	Если ОтветНаВопрос = КодВозвратаДиалога.Отмена Тогда 
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыбратьФайлСтандартногоШаблонаЗавершение", ЭтотОбъект);	
	ШаблоныПечатиОфисныхДокументовКлиент.ВыбратьСтандартныйШаблон(ОписаниеОповещения, Объект.Назначение,
		ИспользуетсяИнтерфейсВыставлениеСчетов);
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура СоздатьНовыйФайлШаблона(Команда)

	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;

	ОтветНаВопрос = Ждать ВопросАсинх(ТекстВопросаЗаписи(), РежимДиалогаВопрос.ОКОтмена);
	Если ОтветНаВопрос = КодВозвратаДиалога.Отмена Тогда 
		Возврат;
	КонецЕсли;
	
	РасширениеФайлаНовогоШаблона = Ждать ВыбратьРасширениеФорматФайла();
	Если РасширениеФайлаНовогоШаблона = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если РасширениеФайлаНовогоШаблона = "docx" Тогда
		ОписаниеШаблона = ШаблоныПечатиОфисныхДокументовКлиентСервер.НовыйОписаниеПустогоФайлаDocx(Объект.Назначение);
	Иначе
		ОписаниеШаблона = ШаблоныПечатиОфисныхДокументовКлиентСервер.НовыйОписаниеПустогоФайлаOdt(Объект.Назначение);
	КонецЕсли;
	
	Если Модифицированность И Не Записать() Тогда
		Возврат;
	КонецЕсли;
	
	ПрисоединенныйФайл = ДобавитьФайлШаблонаПоОписанию(ОписаниеШаблона, Объект.Ссылка);
	Если ПрисоединенныйФайл = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект.ФайлШаблон    = ПрисоединенныйФайл;
	Объект.РежимСоздания = ШаблоныПечатиОфисныхДокументовКлиентСервер.РежимСозданияШаблонаНовыйПустой();
	
	Записать();
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьВидимостьРежимаСоздания() Экспорт
	
	Если Элементы.ПодготовкаШаблона.Видимость Тогда
		Назначение = ?(ЗначениеЗаполнено(Объект.Назначение), Объект.Назначение, Неопределено);
		КоличествоСтандартныхШаблонов = ШаблоныПечатиОфисныхДокументовКлиент.КоличествоСтандартныхШаблонов(Назначение);
		Элементы.ГруппаВыборСтандартногоШаблона.Видимость = КоличествоСтандартныхШаблонов > 0;
	КонецЕсли;
		
КонецПроцедуры

// Создает новый стандартный шаблон печати офисного документа на основе выбранного файла
//
// Параметры:
//   ОписаниеСтандартногоШаблона 	- см. ШаблоныПечатиОфисныхДокументовКлиентСервер.НовыйОписаниеСтандартногоШаблона
//    								- Неопределено
//   ДополнительныеПараметры - Структура
&НаКлиенте
Процедура ВыбратьФайлСтандартногоШаблонаЗавершение(ОписаниеСтандартногоШаблона, ДополнительныеПараметры) Экспорт 
	
	Если ОписаниеСтандартногоШаблона = Неопределено Или
		Не ПроверитьНаличиеМакета(ОписаниеСтандартногоШаблона) Тогда
		Возврат;
	КонецЕсли;

	Если Модифицированность И Не Записать() Тогда
		Возврат;
	КонецЕсли;
	
	ПрисоединенныйФайл = ДобавитьФайлШаблонаПоОписанию(ОписаниеСтандартногоШаблона, Объект.Ссылка);
	Если ПрисоединенныйФайл = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект.ФайлШаблон            = ПрисоединенныйФайл;
	Объект.РежимСоздания         = ШаблоныПечатиОфисныхДокументовКлиентСервер.РежимСозданияШаблонаНовыйСтандартный(); 
	Объект.ИмяСтандартногоМакета = ОписаниеСтандартногоШаблона.Макет;
	
	Если Объект.Назначение <> ОписаниеСтандартногоШаблона.Назначение Тогда
		Объект.Назначение = ОписаниеСтандартногоШаблона.Назначение;
	КонецЕсли;
	Записать();
	ЗаполнитьРеквизиты();
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПроверитьНаличиеМакета(ОписаниеСтандартногоШаблона)

	МакетШаблона = ОписаниеСтандартногоШаблона.Макет;
	МетаданныеОбъекта = ОбщегоНазначения.ОбъектМетаданныхПоПолномуИмени(ОписаниеСтандартногоШаблона.Объект);
	
	ШаблонСообщения = НСтр("ru = 'Не найден макет шаблона %1: %2. Обратитесь в техническую поддержку.'");
	ИмяСобытия = ШаблоныПечатиОфисныхДокументовКлиентСервер.ИмяСобытияЖурналаРегистрации();
	
	МакетНайден = МетаданныеОбъекта.Макеты.Найти(МакетШаблона) <> Неопределено;
	Если Не МакетНайден Тогда
		ТекстСообщения = СтрШаблон(ШаблонСообщения, ОписаниеСтандартногоШаблона.Наименование, МакетШаблона);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, , ,
			ТекстСОобщения);
	КонецЕсли;

	Возврат МакетНайден;
	
КонецФункции

&НаСервереБезКонтекста
Функция ДобавитьФайлКШаблону(Шаблон, ИмяБезРасширения, Расширение, АдресДвоичныхДанных)
	
	ПрисоединенныйФайл = ШаблоныПечатиОфисныхДокументов.ПрисоединитьФайлКШаблону(Шаблон, ИмяБезРасширения, Расширение,
		АдресДвоичныхДанных);
		 
	Возврат ПрисоединенныйФайл; 
	
КонецФункции

&НаСервереБезКонтекста
Функция ДобавитьФайлШаблонаПоОписанию(ОписаниеСтандартногоШаблона, Шаблон, ИмяФайла = "")
	Возврат ШаблоныПечатиОфисныхДокументов.ДобавитьФайлШаблонаПоОписанию(ОписаниеСтандартногоШаблона, Шаблон, ИмяФайла);
КонецФункции

&НаКлиенте
Асинх Функция ВыбратьРасширениеФорматФайла()

	ФорматыФайлов = Новый СписокЗначений;
	ФорматыФайлов.Добавить("docx", НСтр("ru = 'Microsoft Word (.docx)'"), , 
		БиблиотекаКартинок.ФорматWord2007);
	ФорматыФайлов.Добавить("odt", НСтр("ru = 'Текстовый документ ODF (.odt)'"), ,
		БиблиотекаКартинок.ФорматOpenOfficeWriter);
	
	ФорматыФайлов = Ждать ФорматыФайлов.ВыбратьЭлементАсинх(НСтр("ru = 'Выберите формат файла'"), 
		ФорматыФайлов[0]);
		
	Результат = Неопределено;
	Если ТипЗнч(ФорматыФайлов) = Тип("ЭлементСпискаЗначений") Тогда
		Результат = ФорматыФайлов.Значение; 
	КонецЕсли;
	
	Возврат Результат; 
		
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ТекстВопросаЗаписи()
	
	ТекстВопроса = НСтр("ru = 'Данные будут записаны. Продолжить?'");
	Возврат ТекстВопроса;
	
КонецФункции

&НаКлиенте
Процедура ВыбратьНовыйФорматПараметра(НовыйФормат, ДополнительныеПараметры) Экспорт

	Если НовыйФормат = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ДанныеСтроки = Реквизиты.НайтиПоИдентификатору(ДополнительныеПараметры.ИдентификаторСтроки);

	Если ДанныеСтроки = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ФорматИзменен = ДополнительныеПараметры.СтарыйФормат <> НовыйФормат;

	Если Не ФорматИзменен Тогда
		Возврат;
	КонецЕсли;

	ЗаблокироватьДанныеФормыДляРедактирования();
	Модифицированность = ФорматИзменен;

	ДанныеСтроки.ФорматИзменен = ФорматИзменен;
	ДанныеСтроки.Формат = НовыйФормат;

	НоваяСтрока = ИзмененныеФорматы.Добавить();
	НоваяСтрока.Ключ = ДанныеСтроки.Имя;
	НоваяСтрока.Формат = НовыйФормат;

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)

	Элементы = Форма.Элементы;
	ФайлШаблон = Форма.Объект.ФайлШаблон;
	ПоказатьПолеВводаФайл = ЗначениеЗаполнено(ФайлШаблон) Или ЕстьПрисоединенныеФайлыШаблона(Форма.Объект.Ссылка);
	Элементы.ПодготовкаШаблона.Видимость = Не ПоказатьПолеВводаФайл;
	Элементы.ГруппаФайлШаблон.Видимость = ПоказатьПолеВводаФайл;

	Форма.РасширениеВыбранногоФайла = РасширениеПрисоединенногоФайла(ФайлШаблон);
	Элементы.ДекорацияФайлODT.Видимость = Форма.РасширениеВыбранногоФайла = "odt";
	Элементы.ДекорацияФайлDOCX.Видимость = Форма.РасширениеВыбранногоФайла = "docx";
	Элементы.НеВыделятьПоляДокументаЦветом.Видимость = Форма.РасширениеВыбранногоФайла = "docx";

	Элементы.РедактированиеФайла.Доступность = ЗначениеЗаполнено(ФайлШаблон);
	
	Форма.ЭтоНовый = Не ЗначениеЗаполнено(Форма.Объект.Ссылка);
	
	ШаблоныПечатиОфисныхДокументовКлиентСервер.УстановитьЗаголовокФормыЭлемента(Форма.Заголовок, Форма.Объект.Ссылка,
		Форма.ИспользуетсяИнтерфейсВыставлениеСчетов);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРеквизиты()

	ДеревоРеквизитов = ДанныеФормыВЗначение(Реквизиты, Тип("ДеревоЗначений"));
	ДеревоРеквизитов.Строки.Очистить();

	Если Не ЗначениеЗаполнено(Объект.Назначение) Тогда
		ЗначениеВДанныеФормы(ДеревоРеквизитов, Реквизиты);
		Возврат;
	КонецЕсли;

	ОписаниеПараметров = ШаблоныПечатиОфисныхДокументов.ОписаниеПараметровШаблонаПоНазначению(Объект.Назначение,
		Объект.Ссылка);
	СобратьДеревоИзПараметровРекурсивно(ДеревоРеквизитов.Строки, ОписаниеПараметров);
	ЗначениеВДанныеФормы(ДеревоРеквизитов, Реквизиты);

	ОписаниеПараметровСсылка = ПоместитьВоВременноеХранилище(ОписаниеПараметров, УникальныйИдентификатор);

КонецПроцедуры

&НаСервере
Процедура СобратьДеревоИзПараметровРекурсивно(СтрокиДерева, ОписаниеПараметров)

	Для Каждого ОписаниеПараметра Из ОписаниеПараметров Цикл

		Если ОписаниеПараметра.Элементы <> Неопределено Тогда

			НоваяСтрока = СтрокиДерева.Добавить();
			НоваяСтрока.Представление = ОписаниеПараметра.Представление;
			СобратьДеревоИзПараметровРекурсивно(НоваяСтрока.Строки, ОписаниеПараметра.Элементы);

		Иначе

			Если ОписаниеПараметра.Вид = ШаблоныПечатиОфисныхДокументов.ВидПараметраИзображение()
				И Не ДобавлятьИзображения() Тогда
				Продолжить;
			КонецЕсли;

			НоваяСтрока = СтрокиДерева.Добавить();
			НоваяСтрока.ЭтоПараметр   = Истина;
			НоваяСтрока.ЭтоПараметрТЧ = ОписаниеПараметра.ТаблицаВладелец <> Неопределено;
			НоваяСтрока.Имя           = ОписаниеПараметра.Ключ;
			НоваяСтрока.Представление = ОписаниеПараметра.Представление;
			НоваяСтрока.Формат        = ОписаниеПараметра.Формат;
			НоваяСтрока.Вид           = ОписаниеПараметра.Вид;
			НоваяСтрока.ОписаниеТипов = ОписаниеПараметра.ОписаниеТипов;

			Если ОписаниеПараметра.ДопустимыеФорматы <> Неопределено Тогда
				НоваяСтрока.ДопустимыеФорматы = ОписаниеПараметра.ДопустимыеФорматы;
			КонецЕсли;

			НоваяСтрока.ЕстьВозможностьВыбораФормата = НоваяСтрока.ДопустимыеФорматы.Количество() <> 0
				Или НоваяСтрока.ОписаниеТипов.Типы().Количество() <> 0;

		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗначениеРеквизита(Ссылка, ИмяРеквизита)

	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, ИмяРеквизита);

КонецФункции

&НаКлиенте
Функция ФайлПодходящегоФормата(ДанныеФайла)

	РасширениеФайла = "";

	Если ДанныеФайла.ТипФайла = Тип("СправочникСсылка.ШаблоныПечатиОфисныхДокументовПрисоединенныеФайлы") Тогда
		РасширениеФайла = РасширениеПрисоединенногоФайла(ДанныеФайла.СсылкаНаФайл);
	Иначе
		РасширениеФайла = ДанныеФайла.Расширение;
	КонецЕсли;

	Если СтрНачинаетсяС(РасширениеФайла, ".") Тогда
		РасширениеФайла =  ОбщегоНазначенияКлиентСервер.РасширениеБезТочки(РасширениеФайла);
	КонецЕсли;

	ФайлПодходящегоФормата = ПодходящиеРасширения().Найти(РасширениеФайла) <> Неопределено;

	Возврат ФайлПодходящегоФормата;

КонецФункции

&НаКлиенте
Функция ДанныеФайлаШаблона(Файл)

	ТипФайла = ТипЗнч(Файл);

	СсылкаНаФайл = Неопределено;
	РасширениеФайла = Неопределено;

	Если ТипФайла = Тип("СправочникСсылка.ШаблоныПечатиОфисныхДокументовПрисоединенныеФайлы") Тогда
		СсылкаНаФайл = Файл;
	Иначе
		РасширениеФайла = Файл.Расширение;
	КонецЕсли;

	ДанныеФайлаШаблона = Новый Структура;
	ДанныеФайлаШаблона.Вставить("ТипФайла", ТипФайла);
	ДанныеФайлаШаблона.Вставить("Расширение", РасширениеФайла);
	ДанныеФайлаШаблона.Вставить("СсылкаНаФайл", СсылкаНаФайл);

	Возврат ДанныеФайлаШаблона;

КонецФункции

&НаСервере
Процедура НайтиДобавляемыеПараметры(ДобавляемыеПараметрыДокумента, ДобавляемыеПараметрыТаблицыДокумента,
	ДобавляемыеКартинкиДокумента, СписокПараметров = Неопределено)

	Если СписокПараметров = Неопределено Тогда
		СписокПараметров = Реквизиты.ПолучитьЭлементы();
	КонецЕсли;

	Для Каждого Параметр Из СписокПараметров Цикл

		Если Параметр.Добавить И Параметр.ЭтоПараметр Тогда

			Если Параметр.ЭтоПараметрТЧ Тогда
				ДобавляемыеПараметрыТаблицыДокумента.Добавить(Параметр.Имя, Параметр.Представление);
			Иначе
				ДобавляемыеПараметрыДокумента.Добавить(Параметр.Имя, Параметр.Представление);
			КонецЕсли;

			Если Параметр.Вид = ШаблоныПечатиОфисныхДокументов.ВидПараметраИзображение() Тогда
				ДобавляемыеКартинкиДокумента.Добавить(Параметр.Имя, Параметр.Представление);
			КонецЕсли;

		КонецЕсли;

		НайтиДобавляемыеПараметры(ДобавляемыеПараметрыДокумента, ДобавляемыеПараметрыТаблицыДокумента,
			ДобавляемыеКартинкиДокумента, Параметр.ПолучитьЭлементы());

		Параметр.Добавить = Ложь;

	КонецЦикла;

КонецПроцедуры

&НаСервере
Функция ДобавитьПараметрыВФайлСервер()

	ДанныеФайла = ДанныеФайла(Объект.ФайлШаблон, УникальныйИдентификатор, Ложь);

	Если ДанныеФайла.ФайлРедактируетТекущийПользователь Тогда
		ОбщегоНазначения.СообщитьПользователю(
			НСтр("ru='Для добавления параметров необходимо завершить редактирование этого файла.'"));
		Возврат Ложь;
	ИначеЕсли ЗначениеЗаполнено(ДанныеФайла.Редактирует) Тогда
		ДатаЗаема = ?(ЗначениеЗаполнено(ДанныеФайла.ДатаЗаема), " " + НСтр("ru='с'") + " " + Формат(
			ДанныеФайла.ДатаЗаема, "ДЛФ=ДВ"), "");

		ОбщегоНазначения.СообщитьПользователю(
			СтрШаблон(
				НСтр("ru = 'Файл ""%1""
					 |уже занят для редактирования пользователем
					 |""%2""%3.'"), Строка(ДанныеФайла.Ссылка), Строка(ДанныеФайла.Редактирует), ДатаЗаема));
		Возврат Ложь;
	КонецЕсли;

	СписокДобавляемыхПараметровДокумента = Новый СписокЗначений;
	СписокДобавляемыхПараметровТаблицыДокумента = Новый СписокЗначений;
	СписокДобавляемыхКартинокДокумента = Новый СписокЗначений;
	НайтиДобавляемыеПараметры(СписокДобавляемыхПараметровДокумента, СписокДобавляемыхПараметровТаблицыДокумента,
		СписокДобавляемыхКартинокДокумента);

	Если СписокДобавляемыхПараметровДокумента.Количество() = 0
		И СписокДобавляемыхПараметровТаблицыДокумента.Количество() = 0
		И СписокДобавляемыхКартинокДокумента.Количество() = 0 Тогда

		ОбщегоНазначения.СообщитьПользователю(
			НСтр("ru='Не выбрано ни одного параметра для добавления.'"));
		Возврат Ложь;
	КонецЕсли;

	ОписаниеПараметров = ПолучитьИзВременногоХранилища(ОписаниеПараметровСсылка);
	ДобавляемыеПараметры = Новый Структура;
	ДобавляемыеПараметры.Вставить("ПараметрыДокумента", СписокДобавляемыхПараметровДокумента);
	ДобавляемыеПараметры.Вставить("ПараметрыТаблицы", СписокДобавляемыхПараметровТаблицыДокумента);
	ДобавляемыеПараметры.Вставить("ПараметрыКартинки", СписокДобавляемыхКартинокДокумента);

	ШаблоныПечатиОфисныхДокументов.ДобавитьПараметрыВШаблон(Объект.ФайлШаблон, ОписаниеПараметров,
		ДобавляемыеПараметры, УникальныйИдентификатор);

	Возврат Истина;

КонецФункции

&НаКлиенте
Процедура ЗакончитьРедактированиеВыполненоПомещение(ИнформацияОФайле, ДополнительныеПараметры) Экспорт

	ОповеститьОбИзменении(Объект.ФайлШаблон);
	Оповестить("Запись_Файл", Новый Структура, Объект.ФайлШаблон);

	УстановитьДоступностьКнопок();

КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьКнопок(РедактируетФайл = Неопределено)

	Если РедактируетФайл = Неопределено Тогда
		РедактируетФайл = ЗначениеРеквизита(Объект.ФайлШаблон, "Редактирует");
	КонецЕсли;

	Элементы.РедактироватьФайл.Доступность = Не (ЗначениеЗаполнено(РедактируетФайл) И РедактируетФайл
		<> ТекущийПользователь);
	Элементы.ЗавершитьРедактированиеФайла.Доступность = ЗначениеЗаполнено(РедактируетФайл) И РедактируетФайл
		= ТекущийПользователь;

КонецПроцедуры

&НаСервере
Процедура ДобавитьИзмененныеФорматыВОбъект(ТекущийОбъект)

	Для Каждого ИзмененныйФормат Из ИзмененныеФорматы Цикл

		Строка = ТекущийОбъект.СвойстваПараметровШаблона.Найти(ИзмененныйФормат.Ключ, "Параметр");

		Если Строка = Неопределено Тогда
			Строка = ТекущийОбъект.СвойстваПараметровШаблона.Добавить();
			Строка.Параметр = ИзмененныйФормат.Ключ;
		КонецЕсли;

		Строка.Формат = ИзмененныйФормат.Формат;

	КонецЦикла;

КонецПроцедуры

&НаСервере
Функция ДобавлятьИзображения()

	Возврат РасширениеВыбранногоФайла = "docx";

КонецФункции

&НаКлиенте
Асинх Процедура ЗагрузитьФайлШаблонаПродолжение(РасширениеРаботыСФайламиПодключено, ДополнительныеПараметры) Экспорт
	
	Если Не РасширениеРаботыСФайламиПодключено Тогда
		Возврат;
	КонецЕсли;  

	
	ОтветНаВопрос = Ждать ВопросАсинх(ТекстВопросаЗаписи(), РежимДиалогаВопрос.ОКОтмена);
	Если ОтветНаВопрос = КодВозвратаДиалога.Отмена Тогда 
		Возврат;
	КонецЕсли;

	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбораФайла.МножественныйВыбор = Ложь;
	ДиалогВыбораФайла.Фильтр             = ФильтрФайлов;
	
	ВыбранныеФайлы = Ждать ДиалогВыбораФайла.ВыбратьАсинх();
	Если ВыбранныеФайлы = Неопределено Тогда
		Возврат;
	КонецЕсли; 

	ВыбранныйФайл = ВыбранныеФайлы[0];
	
	ПроверяемыйФайл = Новый Файл(ВыбранныйФайл);
	РазмерФайла = Ждать ПроверяемыйФайл.РазмерАсинх();
	
	Если РазмерФайла = 0 Тогда
		ИмяСобытия = ШаблоныПечатиОфисныхДокументовКлиентСервер.ИмяСобытияЖурналаРегистрации();
		ТекстСообщения =
			НСтр("ru = 'Выбран пустой файл. Чтобы продолжить, добавьте в файл содержимое и выберите его снова.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		ЖурналРегистрацииКлиент.ДобавитьСообщениеДляЖурналаРегистрации(ИмяСобытия, "Ошибка", ТекстСообщения, ,);
		Возврат;
	КонецЕсли;
	 
	Если Модифицированность И Не Записать() Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура("Файл", ВыбранныйФайл);
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗагрузитьФайлШаблонаЗавершение",
		ЭтотОбъект, ДополнительныеПараметры);
	НачатьСозданиеДвоичныхДанныхИзФайла(ОписаниеОповещения, ВыбранныйФайл);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьФайлШаблонаЗавершение(ДвоичныеДанные, ДополнительныеПараметры) Экспорт
	
	АдресДвоичныхДанных = ПоместитьВоВременноеХранилище(ДвоичныеДанные, УникальныйИдентификатор);
	
	ДанныеФайла = ОбщегоНазначенияКлиентСервер.РазложитьПолноеИмяФайла(ДополнительныеПараметры.Файл);	
	РасширениеБезТочки = ОбщегоНазначенияКлиентСервер.РасширениеБезТочки(ДанныеФайла.Расширение);
	
	Объект.ФайлШаблон = ДобавитьФайлКШаблону(Объект.Ссылка, ДанныеФайла.ИмяБезРасширения, РасширениеБезТочки,
		АдресДвоичныхДанных);
	
	Объект.РежимСоздания = ШаблоныПечатиОфисныхДокументовКлиентСервер.РежимСозданияШаблонаНовыйСФайлом();
	
	Записать();
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

#Область РаботаСФайлами

&НаСервере
Функция ФайлРедактируетсяТекущимПользователем()

	РедактируетФайл = ЗначениеРеквизита(Объект.ФайлШаблон, "Редактирует");
	Возврат ЗначениеЗаполнено(РедактируетФайл) И РедактируетФайл = ТекущийПользователь;

КонецФункции

&НаСервереБезКонтекста
Функция РасширениеПрисоединенногоФайла(Знач ПрисоединенныйФайл)

	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПрисоединенныйФайл, "Расширение");

КонецФункции

&НаСервереБезКонтекста
Функция ДанныеФайла(ПрисоединенныйФайл, УникальныйИдентификатор, ПолучатьСсылкуНаДвоичныеДанные = Истина)

	ДополнительныеПараметры = РаботаСФайламиКлиентСервер.ПараметрыДанныхФайла();
	ДополнительныеПараметры.ИдентификаторФормы = УникальныйИдентификатор;
	ДополнительныеПараметры.ПолучатьСсылкуНаДвоичныеДанные = ПолучатьСсылкуНаДвоичныеДанные;

	Возврат РаботаСФайлами.ДанныеФайла(ПрисоединенныйФайл, ДополнительныеПараметры);

КонецФункции

&НаСервереБезКонтекста
Функция ЕстьПрисоединенныеФайлыШаблона(Ссылка)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ШаблоныПечатиОфисныхДокументовПрисоединенныеФайлы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ШаблоныПечатиОфисныхДокументовПрисоединенныеФайлы КАК ШаблоныПечатиОфисныхДокументовПрисоединенныеФайлы
	|ГДЕ
	|	ШаблоныПечатиОфисныхДокументовПрисоединенныеФайлы.ВладелецФайла = &ВладелецФайла
	|	И ШаблоныПечатиОфисныхДокументовПрисоединенныеФайлы.Расширение В(&ПодходящиеРасширения)";

	Запрос.УстановитьПараметр("ВладелецФайла", Ссылка);
	Запрос.УстановитьПараметр("ПодходящиеРасширения", ПодходящиеРасширения());

	Результат = Запрос.Выполнить();
	Возврат Не Результат.Пустой();

КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПодходящиеРасширения()

	ПодходящиеРасширения = Новый Массив;
	ПодходящиеРасширения.Добавить("docx");
	ПодходящиеРасширения.Добавить("odt");
	Возврат ПодходящиеРасширения;

КонецФункции

&НаКлиенте
Процедура ОбработатьОповещениеКлиентскаяЗаписьФайла(ИмяСобытия, Параметр, Источник)

	Если ИмяСобытия <> "Запись_Файл" Тогда
		Возврат;
	КонецЕсли;

	Если Параметр.Свойство("ЭтоНовый") И Параметр.ЭтоНовый И Параметр.Свойство("ВладелецФайла")
		И Параметр.ВладелецФайла = Объект.Ссылка Тогда

		Если ТипЗнч(Источник) = Тип("СправочникСсылка.ШаблоныПечатиОфисныхДокументовПрисоединенныеФайлы") Тогда
			ФайлШаблон = Источник;
		ИначеЕсли ТипЗнч(Источник) = Тип("Массив") И Источник.Количество() <> 0 Тогда
			ФайлШаблон = Источник[0];
		КонецЕсли;

		ДанныеФайлаШаблона = ДанныеФайлаШаблона(ФайлШаблон);

		ЭтоФайлПодходящегоФормата =  ФайлПодходящегоФормата(ДанныеФайлаШаблона);
		Если ЭтоФайлПодходящегоФормата Тогда
			Объект.ФайлШаблон = ФайлШаблон;
			Модифицированность = Истина;
			УправлениеФормой(ЭтотОбъект);
			ЗаполнитьРеквизиты();
		КонецЕсли;

	КонецЕсли;

	Если (ТипЗнч(Источник) = Тип("Массив") И Источник.Найти(Объект.ФайлШаблон) <> Неопределено Или Источник
		= Объект.ФайлШаблон) Тогда
		УстановитьДоступностьКнопок();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецОбласти