
#Область ПрограммныйИнтерфейс

#Область СтандартныеШаблоны

// Создает пустую структуру описания стандартного шаблона печати офисных документов.
//
// Возвращаемое значение:
//   Структура:
//     * Наименование - Строка - Наименование шаблона
//     * Назначение - ПеречислениеСсылка.НазначенияШаблоновПечатиОфисныхДокументов - Назначение использования
//     * Макет - Строка - Имя макета шаблона (соответствующего объекта метаданных)
//     * Объект - Строка - Полное имя метаданных объекта, где находится макет
//     * Изображение - Строка - Имя макета с демонстрационным изображениекмшаблона, используется для предпросмотра
//     		(двоичные данные файла в формате PDF).
//     		
Функция НовыйОписаниеСтандартногоШаблона() Экспорт

	ОписаниеШаблона = Новый Структура;
	ОписаниеШаблона.Вставить("Наименование", "");
	ОписаниеШаблона.Вставить("Макет",        "");
	ОписаниеШаблона.Вставить("Объект",       "");
	ОписаниеШаблона.Вставить("Изображение",  "");
	ОписаниеШаблона.Вставить("Назначение",
		ПредопределенноеЗначение("Перечисление.НазначенияШаблоновПечатиОфисныхДокументов.ПустаяСсылка"));

	Возврат ОписаниеШаблона;

КонецФункции

#КонецОбласти

// Возвращает ключ настроек для сохранения последнего выбранного шаблона печати офисных документов.
//
// Возвращаемое значение:
//   Строка
Функция КлючНастроекПоследнегоВыбранногоШаблона() Экспорт
	
	КлючНастроек = "ПоследнийВыбранныйШаблонПечатиОфисныхДокументовУНФ";
	Возврат КлючНастроек;
	
КонецФункции

// Формирует заголовок формы элемента на основе переданного представления и ссылки в том случае, если указан
// параметр.
//
// Параметры:
//   ЗаголовокФормы - Строка - возвращаемый заголовок формы
//   Ссылка - ДокументСсылка, СправочникСсылка - Ссылка на объект
//   ИзменятьЗаголовок - Булево - признак необходимости изменения заголовка формы.
//
Процедура УстановитьЗаголовокФормыЭлемента(ЗаголовокФормы, Ссылка, ИзменятьЗаголовок = Ложь) Экспорт

	Если Не ИзменятьЗаголовок Тогда
		Возврат;
	КонецЕсли;
	
	ПредставлениеОбъекта = НСтр("ru = 'Шаблон печати'");
	
	Если Не ЗначениеЗаполнено(Ссылка) Тогда
		ЗаголовокФормы = СтрШаблон ("%1 (%2)", ПредставлениеОбъекта, НСтр("ru = 'создание'"));
	Иначе
		ЗаголовокФормы = СтрШаблон("%1 (%2)", Строка(Ссылка), ПредставлениеОбъекта);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает расширение файла формата DOCX.
//
// Возвращаемое значение:
//   Строка
Функция РасширениеФайлаDocx() Экспорт
	Возврат "docx";
КонецФункции

// Возвращает расширение файла формата ODT.
//
// Возвращаемое значение:
//   Строка
Функция РасширениеФайлаOdt() Экспорт
	Возврат "odt";
КонецФункции

// Описание пустого файла шаблона в формате odt.
// 
// Параметры:
//  Назначение - ПеречислениеСсылка.НазначенияШаблоновПечатиОфисныхДокументов
// 
// Возвращаемое значение:
//  см. НовыйОписаниеСтандартногоШаблона
Функция НовыйОписаниеПустогоФайлаDocx(Назначение) Экспорт

	ОписаниеШаблона = НовыйОписаниеСтандартногоШаблона();
	ОписаниеШаблона.Наименование = "Файл шаблона печати";
	ОписаниеШаблона.Макет        = "ПустойФайл_docx";
	ОписаниеШаблона.Объект       = "Справочник.ШаблоныПечатиОфисныхДокументов";
	ОписаниеШаблона.Назначение   =  Назначение;

	Возврат ОписаниеШаблона;

КонецФункции

// Описание пустого файла шаблона в формате odt.
// 
// Параметры:
//  Назначение - ПеречислениеСсылка.НазначенияШаблоновПечатиОфисныхДокументов
// 
// Возвращаемое значение:
//  см. НовыйОписаниеСтандартногоШаблона
Функция НовыйОписаниеПустогоФайлаOdt(Назначение) Экспорт

	ОписаниеШаблона = НовыйОписаниеСтандартногоШаблона();
	ОписаниеШаблона.Наименование = "Файл шаблона печати";
	ОписаниеШаблона.Макет        = "ПустойФайл_odt";
	ОписаниеШаблона.Объект       = "Справочник.ШаблоныПечатиОфисныхДокументов";
	ОписаниеШаблона.Назначение   =  Назначение;

	Возврат ОписаниеШаблона;

КонецФункции

// Заменяет окончание имени макета на соответствующее новому расширению в случае, когда это не .docx.
//
// Параметры:
//  ИмяМакета	 - Строка - Имя макета
//  Расширение	 - Строка - Новое расширеие
//
Процедура ПривестиИмяМакетаКРасширению(ИмяМакета, Расширение) Экспорт

	Если Расширение <> "docx" Тогда
		ПозицияРасширения = СтрНайти(ИмяМакета, "_docx", НаправлениеПоиска.СКонца);
		ИмяМакета = СтрШаблон("%1%2", Лев(ИмяМакета, ПозицияРасширения), Расширение);
	КонецЕсли;
	
КонецПроцедуры
 
// Возвращает идентификатор режима создания шаблона на основе загрузки файла
//
// Возвращаемое значение:
//   Строка
Функция РежимСозданияШаблонаНовыйСФайлом() Экспорт
	
	Возврат "ЗагрузкаФайла";
	
КонецФункции

// Возвращает идентификатор режима создания шаблона на основе стандартного.
//
// Возвращаемое значение:
//   Строка
Функция РежимСозданияШаблонаНовыйСтандартный() Экспорт
	
	Возврат "НаОсновеСтандартного";
	
КонецФункции

// Возвращает идентификатор режима создания шаблона с пустым файлом
//
// Возвращаемое значение:
//   Строка
Функция РежимСозданияШаблонаНовыйПустой() Экспорт
	
	Возврат "НовыйПустойФайл";
	
КонецФункции

Функция ИмяСобытияЖурналаРегистрации() Экспорт
	
	Возврат "Шаблоны печати офисных документов";
	
КонецФункции

// Возвращает имя события записи шаблонов печати офисных документов.
// Используется для оповещения форм о созданных объектах
//
// Возвращаемое значение:
//   Строка - Имя события записи
Функция ИмяСобытияЗаписиЭлемента() Экспорт
	ИмяСобытия = "Запись_ШаблоныПечатиОфисныхДокументов";
	Возврат ИмяСобытия;
КонецФункции

// Путь к макету, содержащему двоичные данные пустого файла pdf.
// 
// Возвращаемое значение:
//  см. НовыйОписаниеСтандартногоШаблона
Функция ОписаниеШаблонаПустогоФайла() Экспорт
	
	ОписаниеШаблона = НовыйОписаниеСтандартногоШаблона();
	ОписаниеШаблона.Наименование = НСтр("ru = 'Пустой файл'");
	ОписаниеШаблона.Макет = "ПустойФайл_docx";
	ОписаниеШаблона.Объект = "Справочник.ШаблоныПечатиОфисныхДокументов";
	ОписаниеШаблона.Изображение = "ПустойФайл_pdf";
	
	Возврат ОписаниеШаблона;
	
КонецФункции

#КонецОбласти
