
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	
	Если Параметры.Свойство("ВладелецЛида") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список,
		"Владелец",Параметры.ВладелецЛида);
		ОткрыватьКонтакт = Истина;
	КонецЕсли;
	
	Если Параметры.Свойство("ТекущийКонтакт") Тогда
		ОткрыватьКонтакт = Истина;
		Элементы.Список.ТекущаяСтрока = Параметры.ТекущийКонтакт;
	КонецЕсли;
	
	Если Параметры.Свойство("ТекущийКонтакт") Тогда
		ОткрыватьКонтакт = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	Если ОткрыватьКонтакт = Истина Тогда
		СтандартнаяОбработка = Ложь;
		ПараметрыОткрытия = Новый Структура("Ключ", ВыбраннаяСтрока);
		ОткрытьФорму("Справочник.КонтактыЛидов.Форма.ФормаЭлемента", ПараметрыОткрытия
				,ЭтотОбъект,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти