#Область СлужебныйПрограммныйИнтерфейс

Функция ПараметрыИнициализации() Экспорт
	
	ПереданныеПараметры = Новый Структура;
	
	// обязательные параметры
	ПереданныеПараметры.Вставить("СуммаОперации",        0);
	ПереданныеПараметры.Вставить("НомерДокумента",       "");
	ПереданныеПараметры.Вставить("ИдентификаторПС",      "");
	ПереданныеПараметры.Вставить("Товары",               Новый Массив);
	ПереданныеПараметры.Вставить("СсылочныйНомер",       "");
	ПереданныеПараметры.Вставить("ВидОперацииПродажа",   Истина);
	ПереданныеПараметры.Вставить("ДанныеКассовойСсылки", Неопределено);
	ПереданныеПараметры.Вставить("ДокументОплаты");
	ПереданныеПараметры.Вставить("Интеграция");
	ПереданныеПараметры.Вставить("ВидОплатыПлатежнойСистемы");
	ПереданныеПараметры.Вставить("Магазин");
	
	// параметры оплаты через чек ККМ
	ПереданныеПараметры.Вставить("Организация");
	ПереданныеПараметры.Вставить("КассаККМ");
	
	// параметры возврата
	ПереданныеПараметры.Вставить("ИдентификаторОплаты", "");
	ПереданныеПараметры.Вставить("ВидОплатыВозврата");
	ПереданныеПараметры.Вставить("ДокументВозврата");
	
	// интерфейс
	ПереданныеПараметры.Вставить("НадписьЗаголовок", "");
	
	// служебные
	ПереданныеПараметры.Вставить("ОпределитьСтатусВозвратаПозже", Ложь);
	ПереданныеПараметры.Вставить("ОпределитьСтатусОплатыПозже",   Ложь);
	ПереданныеПараметры.Вставить("НастройкиФормыИнтеграции",      Новый Структура());
	ПереданныеПараметры.Вставить("НастройкиИнтеграции",           НовыйНастройкиИнтеграцииПлатежнойСистемы());
	ПереданныеПараметры.Вставить("ТипПлатежнойСистемы");
	ПереданныеПараметры.Вставить("ИдентификаторQRКода");
	ПереданныеПараметры.Вставить("КартинкаQRКода");
	ПереданныеПараметры.Вставить("ДанныеQRКода");
	ПереданныеПараметры.Вставить("ИдентификаторЗаданияВозврата");
	ПереданныеПараметры.Вставить("ИдентификаторЗаданияПроверкиСтатуса");
	ПереданныеПараметры.Вставить("ИдентификаторЗаданияФормированияQRКода");
	ПереданныеПараметры.Вставить("ИдентификаторЗаданияОтменаЗаказа");
	ПереданныеПараметры.Вставить("БылоПодтверждениеКодомАдминистратора", Ложь);
	ПереданныеПараметры.Вставить("БылоПодтверждениеПлатежнойСистемы", Ложь);
	ПереданныеПараметры.Вставить("ПодключаемоеОборудование");
	
	Возврат ПереданныеПараметры;
	
КонецФункции

Функция НовыйНастройкиИнтеграцииПлатежнойСистемы() Экспорт
	
	Операции = Новый Структура;
	Операции.Вставить("ОтменаОплаты",                      Ложь);
	Операции.Вставить("СрокЖизниQRКода",                   Ложь);
	Операции.Вставить("ПлатежнаяСсылка",                   Ложь);
	Операции.Вставить("ДоступенВыборУчастникаВозвратаСБП", Ложь);
	Операции.Вставить("УчастникиВозвратаСБП",              Неопределено);
	Операции.Вставить("Идентификатор",                     Ложь);
	Операции.Вставить("СинонимСистемы",                    Ложь);
	Операции.Вставить("РазрешенВозврат",                   Истина);
	Операции.Вставить("ЗаписыватьДокументПередОплатой",    Ложь);
	Операции.Вставить("НастройкиКассовойСсылки",           Неопределено);
	Операции.Вставить("ТипПлатежнойСистемы",               Неопределено);
	
	Возврат Операции;
	
КонецФункции

Функция СтрокаТоваров() Экспорт
	
	ТоварыУслуги = Новый Структура;
	ТоварыУслуги.Вставить("ИдентификаторСтроки");
	ТоварыУслуги.Вставить("Артикул");
	ТоварыУслуги.Вставить("Наименование");
	ТоварыУслуги.Вставить("ЕдиницаИзмерения");
	ТоварыУслуги.Вставить("Количество");
	ТоварыУслуги.Вставить("Цена");
	ТоварыУслуги.Вставить("Сумма");
	ТоварыУслуги.Вставить("СуммаСкидки");
	
	Возврат ТоварыУслуги;
	
КонецФункции

Функция ТекущаяСтраница(Страница, ТекущийСлой = "") Экспорт
	
	РезультатФункции = Ложь;
	Если ТекущийСлой = "" Тогда
		РезультатФункции = (Страница.Родитель.ТекущаяСтраница = Страница);
	Иначе
		РезультатФункции = (Страница = ТекущийСлой);
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

Процедура УстановитьТекущуюСтраницу(Страница) Экспорт
	
	Страница.Родитель.ТекущаяСтраница             = Страница;
	Страница.Родитель.ТекущаяСтраница.Доступность = Истина;
	
КонецПроцедуры

Процедура НастроитьФормуПоИнтеграции(Форма, Знач ОписаниеОшибки = "", Знач ТекстДлительнойОперации = "") Экспорт
	
	Элементы = Форма.Элементы;
	
	УстановитьВидимостьЭлементаФормы(Элементы.ФормаИнструкция,         Ложь);
	УстановитьВидимостьЭлементаФормы(Элементы.ФормаПречек,             Ложь);
	
	УстановитьВидимостьЭлементаФормы(Элементы.ФормаСоздатьQRКод,       Ложь);
	УстановитьВидимостьЭлементаФормы(Элементы.ФормаВозвратПлатежа,     Ложь);
	УстановитьВидимостьЭлементаФормы(Элементы.ФормаПодтвердитьВозврат, Ложь);
	УстановитьВидимостьЭлементаФормы(Элементы.ФормаПовторить,          Ложь);
	УстановитьВидимостьЭлементаФормы(Элементы.ФормаПодтвердитьОплату,  Ложь);
	УстановитьВидимостьЭлементаФормы(Элементы.ФормаОтменитьОплату,     Ложь);
	УстановитьВидимостьЭлементаФормы(Элементы.ФормаОтложить,           Ложь);
	УстановитьВидимостьЭлементаФормы(Элементы.ФормаЗакрытьОплату,      Ложь);
	
	Форма.ТекущийЭлемент = Элементы.ДекорацияПустаяСлужебная;
	
	ТекущийСлойГруппы = ИнтерфейсРМКСлужебныйКлиентСервер.ПолучитьТекущийСлойГруппы(
		Элементы.ГруппаСлоевПанелиДействийПлатежнойСистемы);
	
	ПраваАдминистратора        = Форма.РазрешитьОплатуВозвратБезПодтвержденияОтПлатежнойСистемы;
	ИспользоватьКассовуюСсылку = Форма.ИспользоватьКассовуюСсылку;
	Оплачивается               = Форма.Оплачивается;
	ЭтоПродажа                 = Форма.ВидОперацииПродажа;
	РежимКСО                   = Форма.РежимКСО;
	ИстеклоВремяОжидания       = Форма.ИстеклоВремяОжидания;
	ЗапретитьОткладывание      = Форма.ЗапретитьОткладывание;
	ПечатьQRКодаДоступна       = Форма.ПечатьQRКодаДоступна;
	ЗапретитьЗакрытие          = Не ЭтоПродажа И РежимКСО;
	Форма.ОтображатьКнопкуЗакрытия = Не ЗапретитьЗакрытие;
	ОткрытоБлокирующееОкно = Элементы.ГруппаВопросПредупреждение.Видимость
		Или Элементы.ГруппаВопросОтложитьЧек.Видимость
		Или Элементы.ГруппаПодтверждениеОплатыВозврата.Видимость;
	
	Если ТекущаяСтраница(Элементы.ГруппаОсновнаяСтраница, ТекущийСлойГруппы) Тогда
		
		УстановитьВидимостьЭлементаФормы(Элементы.ГруппаПродажа, ЭтоПродажа);
		УстановитьВидимостьЭлементаФормы(Элементы.ГруппаВозврат, НЕ ЭтоПродажа);
		УстановитьВидимостьЭлементаФормы(Элементы.ФормаЗакрытьОплату, Не ЗапретитьЗакрытие);
		
		Если ЭтоПродажа Тогда
			УстановитьВидимостьЭлементаФормы(Элементы.ФормаСоздатьQRКод, Истина);
			Элементы.ФормаСоздатьQRКод.Важность = ВажностьКнопки.Главная;
		Иначе
			УстановитьВидимостьЭлементаФормы(Элементы.ФормаВозвратПлатежа, Истина);
			Элементы.ФормаВозвратПлатежа.Важность = ВажностьКнопки.Главная;
			Элементы.ФормаВозвратПлатежа.Доступность = ЗначениеЗаполнено(Форма.ПлатежнаяСистема_НоваяЗаявка.ИдентификаторОплаты);
		КонецЕсли;
		
	ИначеЕсли ТекущаяСтраница(Элементы.ГруппаДлительнаяОперация, ТекущийСлойГруппы) Тогда
		
		Если ЗначениеЗаполнено(ТекстДлительнойОперации) Тогда
			Элементы.ДекорацияНадписьДлительнаяОперация.Заголовок = ТекстДлительнойОперации;
		КонецЕсли;
		
	ИначеЕсли ТекущаяСтраница(Элементы.ГруппаQRКод, ТекущийСлойГруппы)
		И Не ОткрытоБлокирующееОкно Тогда
		
		УстановитьВидимостьЭлементаФормы(Элементы.ФормаИнструкция, Истина);
		УстановитьВидимостьЭлементаФормы(Элементы.ФормаПречек,     Не РежимКСО И ПечатьQRКодаДоступна);
		
		УстановитьВидимостьЭлементаФормы(Элементы.ФормаОтменитьОплату, Истина);
		
		Если ИстеклоВремяОжидания Тогда
			Если ПраваАдминистратора Тогда
				УстановитьВидимостьЭлементаФормы(Элементы.ФормаПодтвердитьОплату, Истина);
				Элементы.ФормаПодтвердитьОплату.Важность = ВажностьКнопки.Главная;
			КонецЕсли;
			УстановитьВидимостьЭлементаФормы(Элементы.ФормаОтложить, Не ЗапретитьОткладывание);
		КонецЕсли;
		
	ИначеЕсли ТекущаяСтраница(Элементы.ГруппаИнструкция, ТекущийСлойГруппы) Тогда
		
		УстановитьВидимостьЭлементаФормы(Элементы.ФормаИнструкция, Истина);
		
	ИначеЕсли ТекущаяСтраница(Элементы.ГруппаПодтверждениеВозврата, ТекущийСлойГруппы) Тогда
		
		УстановитьВидимостьЭлементаФормы(Элементы.ФормаЗакрытьОплату, Истина);
		Элементы.ФормаЗакрытьОплату.Важность = ВажностьКнопки.Главная;
		
		Если ПраваАдминистратора Тогда
			УстановитьВидимостьЭлементаФормы(Элементы.ФормаПодтвердитьВозврат, Истина);
			Элементы.ФормаПодтвердитьВозврат.Важность = ВажностьКнопки.Главная;
		КонецЕсли;
		
	ИначеЕсли ТекущаяСтраница(Элементы.ГруппаИстеклоВремяОжидания, ТекущийСлойГруппы) Тогда
		
		УстановитьВидимостьЭлементаФормы(Элементы.ФормаПовторить, Истина);
		Элементы.ФормаПовторить.Важность = ВажностьКнопки.Главная;
		УстановитьВидимостьЭлементаФормы(Элементы.ФормаПодтвердитьОплату, ПраваАдминистратора);
		УстановитьВидимостьЭлементаФормы(Элементы.ФормаОтменитьОплату, Истина);
		УстановитьВидимостьЭлементаФормы(Элементы.ФормаОтложить, Не ЗапретитьОткладывание);
		
		Элементы.ДекорацияНадписьВыполняется.Заголовок = ?(ЭтоПродажа,
			НСтр("ru = 'Платежная система не подтвердила оплату.'"),
			НСтр("ru = 'Платежная система не подтвердила возврат.'"));
		
	ИначеЕсли ТекущаяСтраница(Элементы.ГруппаОшибка, ТекущийСлойГруппы) Тогда
		
		УстановитьВидимостьЭлементаФормы(Элементы.ФормаЗакрытьОплату, Истина);
		Элементы.ФормаЗакрытьОплату.Важность = ВажностьКнопки.Главная;
		
		Элементы.ДекорацияОписаниеОшибки.Заголовок = ?(ЗначениеЗаполнено(ОписаниеОшибки),
			ОписаниеОшибки, НСтр("ru = 'Неизвестная ошибка'"));
		
		Если Оплачивается И ИспользоватьКассовуюСсылку И ПраваАдминистратора Тогда
			Элементы.ДекорацияОписаниеОшибки.Заголовок = Элементы.ДекорацияОписаниеОшибки.Заголовок
				+ НСтр("ru = '
							|
							|Настроена кассовая ссылка. Доступно подтверждение оплаты вручную.'");
			УстановитьВидимостьЭлементаФормы(Элементы.ФормаПодтвердитьОплату, Истина);
			Элементы.ФормаПодтвердитьОплату.Важность = ВажностьКнопки.Главная;
		КонецЕсли;
		
	ИначеЕсли ТекущаяСтраница(Элементы.ГруппаОшибкаПолученияСтатуса, ТекущийСлойГруппы) Тогда
		
		УстановитьВидимостьЭлементаФормы(Элементы.ФормаПовторить,      Истина);
		УстановитьВидимостьЭлементаФормы(Элементы.ФормаОтменитьОплату, Истина);
		Элементы.ФормаПовторить.Важность = ВажностьКнопки.Главная;
		
		УстановитьВидимостьЭлементаФормы(Элементы.ФормаПодтвердитьОплату, ПраваАдминистратора);
		УстановитьВидимостьЭлементаФормы(Элементы.ФормаОтложить, Не ЗапретитьОткладывание);
		
		Элементы.ДекорацияОписаниеОшибкиПолученияСтатуса.Заголовок = ?(ЗначениеЗаполнено(ОписаниеОшибки),
			ОписаниеОшибки, НСтр("ru = 'Неизвестная ошибка'"));
		
	КонецЕсли;
	
	Если ТекущийСлойГруппы <> Неопределено
		И Не ТекущаяСтраница(Элементы.ГруппаИнструкция, ТекущийСлойГруппы) Тогда
		Форма.ТекущийСлойГруппы = ТекущийСлойГруппы.Имя;
	КонецЕсли;
	
КонецПроцедуры

#Область ВидыПлатежнойКарты

Функция ВидПлатежнойКартыСБП() Экспорт
	
	Возврат НСтр("ru = 'Система быстрых платежей'");
	
КонецФункции

Функция ВидПлатежнойКартыЮКасса() Экспорт
	
	Возврат НСтр("ru = 'ЮKassa'");
	
КонецФункции

Функция ВидПлатежнойКартыОзонПэй() Экспорт
	
	Возврат НСтр("ru = 'Озон Пэй'");
	
КонецФункции

Функция ВидПлатежнойКартыЯндексПэй() Экспорт
	
	Возврат НСтр("ru = 'Яндекс Пэй'");
	
КонецФункции

#КонецОбласти

#Область ПлатежныеСистемы

Функция ПлатежнаяСистемаСБП() Экспорт
	
	Возврат "СБП";
	
КонецФункции

Функция ПлатежнаяСистемаЮКасса() Экспорт
	
	Возврат "ЮКасса";
	
КонецФункции

Функция ПлатежнаяСистемаОзонПэй() Экспорт
	
	Возврат "ОзонПэй";
	
КонецФункции

Функция ПлатежнаяСистемаЯндексПэй() Экспорт
	
	Возврат "ЯндексПэй";
	
КонецФункции

#КонецОбласти

#Область ЗавершениеОперации

Функция ДействиеЗавершитьОплату() Экспорт
	
	Возврат "ЗавершитьОплату";
	
КонецФункции

Функция ДействиеОтменитьОплату() Экспорт
	
	Возврат "ОтменитьОплату";
	
КонецФункции

Функция ДействиеОтложитьОплату() Экспорт
	
	Возврат "ОтложитьОплату";
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УстановитьВидимостьЭлементаФормы(Элемент, Видимость) Экспорт
	
	Элемент.Видимость = Видимость;
	
КонецПроцедуры

#КонецОбласти