#Область ПрограммныйИнтерфейс

// Процедура рассчитывает срок уплаты для строк удержанного налога.
//
// Параметры:
//		КоллекцияСтрокДвижений - РегистрНакопленияНаборЗаписей, ТаблицаЗначений - набор записей регистра
//							РасчетыНалогоплательщиковСБюджетомПоНДФЛУНФ или его аналога, 
//							либо иная коллекция строк регистра, либо таблица значений с соответствующими колонками
//		Организация - СправочникСсылка.Организации - должно быть заполнено, если ПереноситьНаРабочийДень = Истина.
//      ПереноситьНаРабочийДень - Булево
//
Процедура ПроставитьКрайнийСрокУплаты(КоллекцияСтрокДвижений, Организация = Неопределено, Знач ПереноситьНаРабочийДень = Истина) Экспорт
	
	ПоследниеРабочиеДниРазныхЛет = Новый Соответствие;
	Для Каждого СтрокаНабора Из КоллекцияСтрокДвижений Цикл
		Если СтрокаНабора.ВариантУдержания = Перечисления.ВариантыУдержанияНДФЛ.Удержано
			И Не ЗначениеЗаполнено(СтрокаНабора.КрайнийСрокУплаты) Тогда
			ДатаУдержанияНалога = СтрокаНабора.Период;
			ДвадцатьВосьмоеЧислоМесяцаУдержанияНалога = НачалоМесяца(ДатаУдержанияНалога) + 27 * 86400;
			ДвадцатьВосьмоеЧислоСледующегоМесяца = ДобавитьМесяц(ДвадцатьВосьмоеЧислоМесяцаУдержанияНалога, 1);
			
			Если День(ДатаУдержанияНалога) < 23 Тогда
				СрокУплаты = ДвадцатьВосьмоеЧислоМесяцаУдержанияНалога;
			ИначеЕсли Месяц(ДатаУдержанияНалога) = 12 Тогда // в конце декабря - последний рабочий день года
				ПоследнийДеньГода = НачалоДня(КонецГода(ДатаУдержанияНалога));
				ПоследнийРабочийДень = ПоследниеРабочиеДниРазныхЛет[ПоследнийДеньГода];
				Если ПоследнийРабочийДень = Неопределено Тогда
					 ПоследнийРабочийДень = ПоследнийРабочийДеньГода(ПоследнийДеньГода);
					 ПоследниеРабочиеДниРазныхЛет.Вставить(ПоследнийДеньГода, ПоследнийРабочийДень);
				КонецЕсли;
				СрокУплаты = ПоследнийРабочийДень;
			Иначе	
				СрокУплаты = ДвадцатьВосьмоеЧислоСледующегоМесяца;
			КонецЕсли;
			
			СтрокаНабора.КрайнийСрокУплаты = СрокУплаты;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Возвращает дату начала действия Федерального закона от 14.07.2022 № 263-ФЗ
//
// Параметры
//  нет
//
// Возвращаемое значение:
//   дата
//
Функция ДатаЗакона263ФЗ() Экспорт 

	Возврат '20230101';

КонецФункции 

// Формирует таблицу с движениями для оплаты ведомости для целей учета НДФЛ.
//
// Параметры:
//   ДокументСсылка - ДокументСсылка - Ссылка на документ-основание для формирования движений
//   СтруктураДополнительныеСвойства - Структура - Контейнер для передачи дополнительных данных
//
Процедура СформироватьТаблицаРасчетыНалогоплательщиковСБюджетомПоНДФЛУНФ(ДокументСсылка,
	СтруктураДополнительныеСвойства) Экспорт
	
	// Получим данные из текущего документа.
	// Получим данные из ведомостей.
	// Получим данные о других оплатах тех же ведомостей.
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ДенежныйДокумент.Ссылка КАК Ссылка,
	|	ДенежныйДокумент.Дата КАК Дата,
	|	НЕОПРЕДЕЛЕНО КАК Сотрудник
	|ПОМЕСТИТЬ ВТШапкаДокумента
	|ИЗ
	|	Документ.РасходИзКассы КАК ДенежныйДокумент
	|ГДЕ
	|	ДенежныйДокумент.Ссылка = &ДокументСсылка
	|	И ДенежныйДокумент.Дата >= &ДатаНачалаОбязательногоПримененияЕНП
	|	И ДенежныйДокумент.ВидОперации = &ВидОперацииЗарплатаПоВедомости
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДенежныйДокумент.Ссылка,
	|	ДенежныйДокумент.Дата,
	|	ДенежныйДокумент.Подотчетник
	|ИЗ
	|	Документ.РасходИзКассы КАК ДенежныйДокумент
	|ГДЕ
	|	ДенежныйДокумент.Ссылка = &ДокументСсылка
	|	И ДенежныйДокумент.Дата >= &ДатаНачалаОбязательногоПримененияЕНП
	|	И ДенежныйДокумент.ВидОперации = &ВидОперацииЗарплатаСотруднику
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТШапкаДокумента.Дата КАК Период,
	|	ВТШапкаДокумента.Сотрудник КАК Сотрудник,
	|	ВТШапкаДокумента.Ссылка КАК Ссылка,
	|	РасходИзКассыВыплатаЗаработнойПлаты.Ведомость КАК Ведомость,
	|	СУММА(РасходИзКассыВыплатаЗаработнойПлаты.СуммаПлатежа) КАК СуммаПлатежа
	|ПОМЕСТИТЬ ВТ_СуммыОплатыЭтотДокумент
	|ИЗ
	|	ВТШапкаДокумента КАК ВТШапкаДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РасходИзКассы.ВыплатаЗаработнойПлаты КАК РасходИзКассыВыплатаЗаработнойПлаты
	|		ПО ВТШапкаДокумента.Ссылка = РасходИзКассыВыплатаЗаработнойПлаты.Ссылка
	|СГРУППИРОВАТЬ ПО
	|	ВТШапкаДокумента.Дата,
	|	ВТШапкаДокумента.Сотрудник,
	|	ВТШапкаДокумента.Ссылка,
	|	РасходИзКассыВыплатаЗаработнойПлаты.Ведомость
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПлатежнаяВедомость.Ссылка КАК Ссылка,
	|	ПлатежнаяВедомость.СуммаДокумента КАК СуммаДокумента
	|ПОМЕСТИТЬ ВТ_СуммыВедомостей
	|ИЗ
	|	ВТ_СуммыОплатыЭтотДокумент КАК ВТ_СуммыОплатыЭтотДокумент
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПлатежнаяВедомость КАК ПлатежнаяВедомость
	|		ПО ВТ_СуммыОплатыЭтотДокумент.Ведомость = ПлатежнаяВедомость.Ссылка
	|		И ВТ_СуммыОплатыЭтотДокумент.Сотрудник = НЕОПРЕДЕЛЕНО
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПлатежнаяВедомостьСотрудники.Ссылка,
	|	ПлатежнаяВедомостьСотрудники.СуммаПлатежа
	|ИЗ
	|	ВТ_СуммыОплатыЭтотДокумент КАК ВТ_СуммыОплатыЭтотДокумент
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПлатежнаяВедомость.Сотрудники КАК ПлатежнаяВедомостьСотрудники
	|		ПО ВТ_СуммыОплатыЭтотДокумент.Ведомость = ПлатежнаяВедомостьСотрудники.Ссылка
	|		И ВТ_СуммыОплатыЭтотДокумент.Сотрудник = ПлатежнаяВедомостьСотрудники.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_СуммыВедомостей.Ссылка КАК Ведомость,
	|	ВТ_СуммыОплатыЭтотДокумент.Период КАК Период,
	|	ВТ_СуммыОплатыЭтотДокумент.Сотрудник КАК Сотрудник
	|ИЗ
	|	ВТ_СуммыОплатыЭтотДокумент КАК ВТ_СуммыОплатыЭтотДокумент
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СуммыВедомостей КАК ВТ_СуммыВедомостей
	|		ПО ВТ_СуммыОплатыЭтотДокумент.СуммаПлатежа >= ВТ_СуммыВедомостей.СуммаДокумента";
	
	Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.РасходСоСчета") Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.РасходИзКассы", "Документ.РасходСоСчета");
		Запрос.УстановитьПараметр("ВидОперацииЗарплатаСотруднику", Перечисления.ВидыОперацийРасходСоСчета.ЗарплатаСотруднику);
		Запрос.УстановитьПараметр("ВидОперацииЗарплатаПоВедомости", Перечисления.ВидыОперацийРасходСоСчета.Зарплата);
	Иначе
		Запрос.УстановитьПараметр("ВидОперацииЗарплатаСотруднику", Перечисления.ВидыОперацийРасходИзКассы.ЗарплатаСотруднику);
		Запрос.УстановитьПараметр("ВидОперацииЗарплатаПоВедомости", Перечисления.ВидыОперацийРасходИзКассы.Зарплата);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ДокументСсылка", ДокументСсылка);
	Запрос.УстановитьПараметр("ДатаНачалаОбязательногоПримененияЕНП",
		РегламентированнаяОтчетностьУСН.ДатаОбязательногоПримененияЕНП());
	
	Ведомости = Новый Массив;
	Сотрудники = Новый Массив;
	Выборка = Запрос.Выполнить().Выбрать();
	ДатаПлатежа = '00010101';
	Пока Выборка.Следующий() Цикл
		Ведомости.Добавить(Выборка.Ведомость);
		Если ЗначениеЗаполнено(Выборка.Сотрудник) Тогда
			Сотрудники.Добавить(Выборка.Сотрудник);
		КонецЕсли;
		ДатаПлатежа = Выборка.Период;
	КонецЦикла;

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПлатежнаяВедомостьНалогиНаДоходы.Ссылка.Организация КАК Организация,
	|	ПлатежнаяВедомостьНалогиНаДоходы.Ссылка.Организация.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	|	ПлатежнаяВедомостьНалогиНаДоходы.Сотрудник.Физлицо КАК ФизическоеЛицо,
	|	ПлатежнаяВедомостьНалогиНаДоходы.Сумма КАК Сумма,
	|	ПлатежнаяВедомостьНалогиНаДоходы.СуммаСПревышения КАК СуммаСПревышения,
	|	ПлатежнаяВедомостьНалогиНаДоходы.СуммаСПревышенияПоСтавке18 КАК СуммаСПревышенияПоСтавке18,
	|	ПлатежнаяВедомостьНалогиНаДоходы.СуммаСПревышенияПоСтавке20 КАК СуммаСПревышенияПоСтавке20,
	|	ПлатежнаяВедомостьНалогиНаДоходы.СуммаСПревышенияПоСтавке22 КАК СуммаСПревышенияПоСтавке22,
	|	ПлатежнаяВедомостьНалогиНаДоходы.Ссылка.СтруктурнаяЕдиница КАК Подразделение,
	|	&ДатаПлатежа КАК Период,
	|	&ДатаПлатежа КАК МесяцНалоговогоПериода,
	|	КодДохода2000.СтавкаНДФЛ КАК СтавкаНалогообложенияРезидента,
	|	&КодНДФЛ2000 КАК КодДохода,
	|	ЗНАЧЕНИЕ(Перечисление.ВариантыУдержанияНДФЛ.Удержано) КАК ВариантУдержания,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК КрайнийСрокУплаты
	|ИЗ
	|	Документ.ПлатежнаяВедомость.НалогиНаДоходы КАК ПлатежнаяВедомостьНалогиНаДоходы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КодыДоходовНДФЛ КАК КодДохода2000
	|		ПО КодДохода2000.Ссылка = &КодНДФЛ2000
	|ГДЕ
	|	ПлатежнаяВедомостьНалогиНаДоходы.Ссылка В (&Ведомости)
	|	И ПлатежнаяВедомостьНалогиНаДоходы.ВидНачисленияУдержания = ЗНАЧЕНИЕ(Справочник.ВидыНачисленийИУдержаний.НалогНаДоходы)
	|	И &УсловиеСотрудник";
	
	Запрос.УстановитьПараметр("КодНДФЛ2000", Справочники.КодыДоходовНДФЛ.Код2000);
	Запрос.УстановитьПараметр("ДатаПлатежа", ДатаПлатежа);
	Запрос.УстановитьПараметр("Ведомости", Ведомости);
	Если Сотрудники.Количество() > 0 Тогда
		ТекстУсловие = "ПлатежнаяВедомостьНалогиНаДоходы.Сотрудник В (&Сотрудники)";
		Запрос.УстановитьПараметр("Сотрудники", Сотрудники);
	Иначе
		ТекстУсловие = "ИСТИНА";
	КонецЕсли;
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеСотрудник", ТекстУсловие);
	
	ТаблицаРасчетыНалогоплательщиковСБюджетомПоНДФЛУНФ = Запрос.Выполнить().Выгрузить();
	
	ПроставитьКрайнийСрокУплаты(ТаблицаРасчетыНалогоплательщиковСБюджетомПоНДФЛУНФ);
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыНалогоплательщиковСБюджетомПоНДФЛУНФ",
		ТаблицаРасчетыНалогоплательщиковСБюджетомПоНДФЛУНФ);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПоследнийРабочийДеньГода(ПоследнийДеньГода)
	
	ПроизводственныйКалендарь = КалендарныеГрафики.ОсновнойПроизводственныйКалендарь();
	ПараметрыПолучения = КалендарныеГрафики.ПараметрыПолученияБлижайшихРабочихДат(ПроизводственныйКалендарь);
	ПараметрыПолучения.УчитыватьНерабочиеПериоды = Ложь;
	ПараметрыПолучения.ВызыватьИсключение = Ложь;
	ПараметрыПолучения.ПолучатьПредшествующие = Истина;
	
	РабочиеДни = КалендарныеГрафики.БлижайшиеРабочиеДаты(ПроизводственныйКалендарь,
		ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ПоследнийДеньГода), ПараметрыПолучения);
	Если ЗначениеЗаполнено(РабочиеДни) Тогда 
		Возврат РабочиеДни[ПоследнийДеньГода];
	КонецЕсли;
	Возврат ПоследнийДеньГода;
	
КонецФункции

#КонецОбласти