///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2026, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

///////////////////////////////////////////////////////////////////////////////////////////////////////
// Подсистема "ИнтернетПоддержкаПользователей.ПлатежныеСистемы.ЯндексПэй".
// ОбщийМодуль.ЯндексПэй.
//
// Серверные процедуры работы с платежной системой Яндекс Пэй:
//  - получение списка доступных кассовых ссылок;
//  - получение актуальной корзины.
//
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Выполняет запрос к сервису на получение списка доступных кассовых ссылок для указанной настройки.
// 
// Параметры:
//  НастройкаПодключения - СправочникСсылка.НастройкиПодключенияКПлатежнымСистемам - настройка подключения.
// 
// Возвращаемое значение:
//  Структура - Результат операции:
//    * КодОшибки - Строка - строковый код возникшей ошибки, который может быть обработан вызывающим методом.
//    * СообщениеОбОшибке - Строка, ФорматированнаяСтрока - сообщение об ошибке для пользователя.
//    * ИнформацияОбОшибке - Строка, ФорматированнаяСтрока - сообщение об ошибке для администратора.
//    * КассовыеСсылки - Массив Из Структура - список активных кассовых ссылок:
//      ** КлючСсылки - Строка - идентификатор кассовой ссылки.
//      ** Представление - Строка - уникальное название кассовой ссылки для отображения пользователю.
//
Функция КассовыеСсылкиНастройки(НастройкаПодключения) Экспорт
	
	ОбщегоНазначенияКлиентСервер.ПроверитьПараметр(
		"ЯндексПэй.КассовыеСсылкиНастройки",
		"НастройкаПодключения",
		НастройкаПодключения,
		Тип("СправочникСсылка.НастройкиПодключенияКПлатежнымСистемам"));
		
	Если Не ЗначениеЗаполнено(НастройкаПодключения) Тогда
		ВызватьИсключение НСтр("ru = 'Не указана настройка подключения.'");
	КонецЕсли;
	
	ПлатежныеСистемыСлужебный.ПроверитьПраваНаВыполнениеОперации();
	
	ПлатежнаяСистема = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НастройкаПодключения, "ПлатежнаяСистема");
	Если ПлатежнаяСистема <> Перечисления.ПлатежныеСервисы.ЯндексПэй Тогда
		ВызватьИсключение НСтр("ru = 'Указанная настройка не относится к платежной системе Яндекс Пэй'");
	КонецЕсли;
	
	Возврат ЯндексПэйСервис.КассовыеСсылки(НастройкаПодключения);
	
КонецФункции

// Получает состав актуальной корзины (с учетом всех возвратов) по указанному документу оплаты.
// Если корзина пуста, значит была возвращена вся сумма оплаты.
// Важно. Данные о корзине не зависят от текущего статуса операции, то есть,
// корзина может быть заполнена если статус операции Выполняется, Отмена, Ошибка.
// Если статус операции важен, то его необходимо дополнительно обработать.
//
// Параметры:
//  НастройкаПодключения - СправочникСсылка.НастройкиПодключенияКПлатежнымСистемам - настройка подключения к сервису.
//  ДокументОплаты - ОпределяемыйТип.ДокументОперацииПлатежнойСистемы - документ,
//                     который отражает оплату в информационной базе.
//                 - Строка - идентификатор операции в ЯндексПэй.
//  
// Возвращаемое значение:
//  Структура - результат операции:
//    * КодОшибки - Строка - строковый код возникшей ошибки, который может быть обработан вызывающим методом.
//    * СообщениеОбОшибке - Строка, ФорматированнаяСтрока - сообщение об ошибке для пользователя.
//    * ИнформацияОбОшибке - Строка, ФорматированнаяСтрока - сообщение об ошибке для администратора.
//    * СтатусОперации - Строка - текущее состояние операции в платежной системе.
//        Возможные значения определяются методами общего модуля НастройкиПлатежныхСистемКлиентСервер/
//    * Корзина - см. НовыйАктуальнаяКорзина.
//
Функция АктуальнаяКорзина(
		НастройкаПодключения,
		ДокументОплаты) Экспорт
	
	// Проверка входных параметров
	ИмяФункции = "ЯндексПэй.АктуальнаяКорзина";
	
	ОбщегоНазначенияКлиентСервер.ПроверитьПараметр(
		ИмяФункции,
		"НастройкаПодключения",
		НастройкаПодключения,
		Тип("СправочникСсылка.НастройкиПодключенияКПлатежнымСистемам"));
	
	ОжидаемыеТипы = Метаданные.ОпределяемыеТипы.ДокументОперацииПлатежнойСистемы.Тип.Типы();
	ОжидаемыеТипы.Добавить(Тип("Строка"));
	
	ОбщегоНазначенияКлиентСервер.ПроверитьПараметр(
		ИмяФункции,
		"ДокументОплаты",
		ДокументОплаты,
		ОжидаемыеТипы);
		
	ПлатежныеСистемыСлужебный.ПроверитьПраваНаВыполнениеОперации();
		
	Возврат ЯндексПэйСлужебный.АктуальнаяКорзина(
		НастройкаПодключения,
		ДокументОплаты);
	
КонецФункции

// Функция-конструктор пустой корзины
//
// Возвращаемое значение:
//  ТаблицаЗначений:
//    * ИдентификаторНоменклатуры - Строка - идентификатор номенклатуры, указанный при
//         создании заказа на оплату. Максимальная длина 2048 символов.
//    * ПредставлениеНоменклатуры - Строка - представление номенклатуры.
//         Максимальная длина 2048 символов.
//    * Описание - Строка - произвольное описание номенклатуры.
//         Максимальная длина 2048 символов.
//    * Количество - Число - количество товара.
//    * Сумма - Число - сумма позиции.
//
Функция НовыйАктуальнаяКорзина() Экспорт

	Результат = Новый ТаблицаЗначений;
	
	ТипСтрока = ОбщегоНазначения.ОписаниеТипаСтрока(2048);
	
	Результат.Колонки.Добавить("ИдентификаторНоменклатуры", ТипСтрока);
	Результат.Колонки.Добавить("ПредставлениеНоменклатуры", ТипСтрока);
	Результат.Колонки.Добавить("Описание", ТипСтрока);
	Результат.Колонки.Добавить("Количество", ОбщегоНазначения.ОписаниеТипаЧисло(10, 3));
	Результат.Колонки.Добавить("Сумма", ОбщегоНазначения.ОписаниеТипаЧисло(10, 2));
	
	Возврат Результат;

КонецФункции

#КонецОбласти
