#Область ПрограммныйИнтерфейс

// Проверяет, есть ли в базе экземпляры оборудования с включенным флагом
// автоматической фискализации.
// Если передать в параметре организацию, то проверка будет проведена только
// по оборудованию этой организации.
// 
// Параметры:
//  Организация - СправочникСсылка.Организации - организация, оборудование
//    которой подлежит проверке
//  ЗаписатьВЖурнал - Булево - надо ли создавать запись журнала регистрации
//    в случае, если оборудование не найдено
// 
// Возвращаемое значение:
//  Булево - Истина, если оборудование с флагом найдено
// 
Функция ЕстьККТСАвтоматическойФискализацией(Организация = Неопределено, ЗаписатьВЖурнал = Истина) Экспорт
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ПодключаемоеОборудование.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ПодключаемоеОборудование КАК ПодключаемоеОборудование
	|ГДЕ
	|	ПодключаемоеОборудование.ТипОборудования = ЗНАЧЕНИЕ(Перечисление.ТипыПодключаемогоОборудования.ККТ)
	|	И &УсловиеПоОрганизации
	|	И ПодключаемоеОборудование.АвтоматическаяФискализация";
	
	Если Организация = Неопределено Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеПоОрганизации", "Истина");
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеПоОрганизации", "ПодключаемоеОборудование.Организация = &Организация");
	КонецЕсли;
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Результат = Не Запрос.Выполнить().Пустой();
	
	Если Не Результат И ЗаписатьВЖурнал Тогда
		ЗаписатьВЖурналРезультатПроверки(Организация);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Создает запись в регистре ОчередьЧековККТ для фискализации документа
// 
// Параметры:
//  Ссылка - ДокументСсылка - Документ, который необходимо фискализировать
//  ТекстОшибки - Строка - сюда будет записано сообщение, при возникновении ошибки
// 
Процедура ДобавитьВОчередьФискализации(Ссылка, ТекстОшибки = "") Экспорт
	
	МетаданныеДокумента = Ссылка.Метаданные();
	
	Если Не ДоступнаРаспределеннаяФискализация(МетаданныеДокумента) Тогда
		ТекстОшибки = НСтр("ru = 'Для данного вида документов распределенная фискализация не доступна'");
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Распределенная фискализация'"),
			УровеньЖурналаРегистрации.Ошибка,
			,
			Ссылка,
			ТекстОшибки);
		Возврат;
	КонецЕсли;
	
	ИмяДокумента = МетаданныеДокумента.Имя;
	ИмяДокумента = ?(ИмяДокумента = "ЧекККМВозврат", "ЧекККМ" ,ИмяДокумента);

	ДанныеДокумента = Документы[ИмяДокумента].ПолучитьДанныеДляФискализации(Ссылка);
	РаспределеннаяФискализация.ДобавитьЧекВОчередьЧековККТ(ДанныеДокумента);
	
КонецПроцедуры

// Проверяет, есть ли в базе кассы ккм для оборудования с типом облачная касса
// 
// Параметры:
//  Организация - СправочникСсылка.Организации - организация, оборудование
//    которой подлежит проверке;
//  ОблачнаяКасса - СправочникСсылка.ПодключаемоеОборудование - общее оборудование подключения к облачной кассе.
// 
// Возвращаемое значение:
//  Булево - Истина, если оборудование с флагом найдено
// 
Функция ЕстьОблачнаяКассаАвтоматическойФискализации(Организация, ОблачнаяКасса = Неопределено) Экспорт
	
	Результат = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОблачныеККТ.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ПодключаемоеОборудование КАК ОблачныеККТ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КассыККМ КАК КассыККМ
	|		ПО КассыККМ.ПодключаемоеОборудование = ОблачныеККТ.Ссылка
	|ГДЕ
	|	ОблачныеККТ.ТипОборудования = ЗНАЧЕНИЕ(Перечисление.ТипыПодключаемогоОборудования.ОблачнаяККТ)
	|	И НЕ ОблачныеККТ.ПометкаУдаления
	|	И ОблачныеККТ.УстройствоИспользуется
	|	И НЕ КассыККМ.ПометкаУдаления
	|	И КассыККМ.Владелец = &Организация";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		ОблачнаяКасса = Выборка.Ссылка;
		Результат     = Истина;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Создает запись в регистре ОчередьЧековККТ для фискализации документа
// 
// Параметры:
//  Ссылка - ДокументСсылка - Документ, который необходимо фискализировать
//  ИдентификаторУстройстваФР - Справочник.ПодключаемоеОборудование - общее оборудование подключения к облачной кассе
//  ИдентификаторЧекаВОчереди - Стркоа - реквизит документа, уникальный идентификатор для идентификации чека в очереди
//  ЗапуститьОчередьЧеков - Булево - признак необходимости запуска фискализации чеков
// 
Процедура ДобавитьВОчередьФискализацииДляОблачнойКассы(Ссылка, ИдентификаторУстройстваФР, ИдентификаторЧекаВОчереди, ЗапуститьОчередьЧеков = Истина, ПараметрыФискализации = Неопределено) Экспорт

	Перем ТекстСообщения;
	
	Если ЗначениеЗаполнено(ПараметрыФискализации) Тогда
		ДокументФормированияДанных = Ссылка;
		ИдентификаторУстройстваФР  = Неопределено;
		ЭтоОплатаЗаказа = Истина;
	Иначе
		ДокументФормированияДанных = Ссылка;
		ЭтоОплатаЗаказа = Ложь;
	КонецЕсли;
	
	ДанныеДляФискализации 		= РозничныеПродажиСервер.ПолучитьДанныеДляФискализации(
		ДокументФормированияДанных, 
		ИдентификаторУстройстваФР,
		ТекстСообщения,
		ЭтоОплатаЗаказа);
	
	Если ДанныеДляФискализации <> Неопределено Тогда
		
		ДанныеДляФискализации.ИдентификаторФискальнойЗаписи = ИдентификаторЧекаВОчереди;
		ДанныеДляФискализации.ОблачнаяККТ 					= Истина;
		ДанныеДляФискализации.ДокументОснование 			= Ссылка;
		
		Если ЗначениеЗаполнено(ПараметрыФискализации) Тогда

			ДанныеДляФискализации.ПокупательEmail = Ссылка.АдресЭП;
			ДанныеДляФискализации.ПокупательНомер = Ссылка.Телефон;
			ДанныеДляФискализации.МестоРасчетов   = ДанныеДляФискализации.АдресРасчетов;
			ЗапуститьОчередьЧеков = Ложь;
			
		КонецЕсли;
		
		РаспределеннаяФискализация.ДобавитьЧекВОчередьЧековККТ(ДанныеДляФискализации, , ЗапуститьОчередьЧеков);
		
	ИначеЕсли ЗначениеЗаполнено(ТекстСообщения) Тогда
		
		ЗаписьЖурналаРегистрации(
		НСтр("ru = 'Ошибка фискализации документа в облачной кассе.'", ОбщегоНазначения.КодОсновногоЯзыка()),
		УровеньЖурналаРегистрации.Ошибка,
		,
		Ссылка,
		ТекстСообщения);
			
	КонецЕсли;
	
КонецПроцедуры

//См. МенеджерОборудованияВызовСервераПереопределяемый.ЭкземплярОборудованияПриСозданииНаСервере()
//
Процедура ЭкземплярОборудованияПриСозданииНаСервере(Форма, Параметры) Экспорт
	
	МассивРеквизитов = Новый Массив;
	МассивРеквизитов.Добавить(Новый РеквизитФормы("ОповещениеПослеНастройки", Новый ОписаниеТипов(Неопределено)));
	Форма.ИзменитьРеквизиты(МассивРеквизитов);
	Если Параметры.Свойство("ОповещениеПослеНастройки") Тогда
		Форма.ОповещениеПослеНастройки = Параметры.ОповещениеПослеНастройки;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДоступнаРаспределеннаяФискализация(МетаданныеДокумента)
	
	Результат = Ложь;
	
	Если МетаданныеДокумента.Имя = "ОперацияПоПлатежнымКартам"
		Или МетаданныеДокумента.Имя = "ЧекККМ"
		Или МетаданныеДокумента.Имя = "ЧекККМВозврат" Тогда
		
		Результат = Истина;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаписатьВЖурналРезультатПроверки(Организация)
	
	Если Организация = Неопределено Тогда
		Комментарий = НСтр("ru = 'ККТ с автоматической фискализацией не найдены'");
	Иначе
		Комментарий = СтрШаблон(НСтр("ru = 'ККТ с автоматической фискализацией по организации %1 не найдены'"), Организация);
	КонецЕсли;
	
	ЗаписьЖурналаРегистрации(
		НСтр("ru = 'Распределенная фискализация'"),
		УровеньЖурналаРегистрации.Информация,
		,
		,
		Комментарий);
	
КонецПроцедуры

#КонецОбласти