
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Параметры.ОбъектыПечати) Тогда
		ВызватьИсключение НСтр("ru ='Непосредственное открытие этой формы не предусмотрено.'");
	КонецЕсли;
	
	Заголовок = НСтр("ru = 'Печать переоценки товаров'");
	
	Организация = ПерсональныеНастройкиРУНФ.Прочитать("ОсновнаяОрганизация");
	
	Если Параметры.Свойство("ВыбранныеВидыЦен") Тогда
		
		Для Каждого ЭлементКоллекции Из Параметры.ВыбранныеВидыЦен Цикл
			
			Если Элементы.ВидЦенСписок.СписокВыбора.НайтиПоЗначению(ЭлементКоллекции.Ключ) = Неопределено Тогда
				
				Элементы.ВидЦенСписок.СписокВыбора.Добавить(ЭлементКоллекции.Ключ, ЭлементКоллекции.Ключ.Наименование);
				
			КонецЕсли;
			
		КонецЦикла;
				
	КонецЕсли;
	
	Если Параметры.Свойство("ВидЦен") Тогда
		ВидЦены = Параметры.ВидЦены;
	КонецЕсли;
	
	ПервыйДокумент = Параметры.ОбъектыПечати[0];
			
	АдресОбъектовПечати = ПоместитьВоВременноеХранилище(Параметры.ОбъектыПечати, УникальныйИдентификатор);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидЦеныНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыВыбора = Неопределено;
	Если Элементы.ВидЦенСписок.СписокВыбора.Количество() > 0 Тогда
		
		СтруктураОтбор = Новый Структура;
		СтруктураОтбор.Вставить("Ссылка", Элементы.ВидЦенСписок.СписокВыбора.ВыгрузитьЗначения());
		
		ПараметрыВыбора = Новый Структура;
		ПараметрыВыбора.Вставить("Отбор", СтруктураОтбор);
		
	КонецЕсли;
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ПослеЗакытияФормыВыбораВидаЦен", ЭтотОбъект);
	Если ПараметрыВыбора <> Неопределено Тогда
		ОткрытьФорму("Справочник.ВидыЦен.ФормаВыбора", ПараметрыВыбора, ЭтотОбъект, , , , ОповещениеОЗакрытии);
	Иначе
		ОткрытьФорму("Справочник.ВидыЦен.ФормаВыбора", , ЭтотОбъект, , , , ОповещениеОЗакрытии);
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура Ок(Команда)
	
	ОбъектыПечати = ОбъектыПечатиИзВременногоХранилища();
	Если Не ЗначениеЗаполнено(ОбъектыПечати) Тогда
		Возврат ;
	КонецЕсли;
	
	ПараметрыПечати = Новый Структура;
	ПараметрыПечати.Вставить("Организация", Организация);
	ПараметрыПечати.Вставить("ВидЦены", ВидЦены);
	ПараметрыПечати.Вставить("Склад", Склад);
		
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.УстановкаЦенНоменклатуры", "ПереоценкаТоваров", 
		ОбъектыПечати, , ПараметрыПечати);
		
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ОбъектыПечатиИзВременногоХранилища()
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ПолучитьИзВременногоХранилища(АдресОбъектовПечати);
	
КонецФункции

&НаКлиенте
Процедура ПослеЗакытияФормыВыбораВидаЦен(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("СправочникСсылка.ВидыЦен") Тогда
		
		ВидЦены = Результат;
		
	ИначеЕсли ТипЗнч(Результат) = Тип("Массив")
		И ТипЗнч(Результат[0]) = Тип("СправочникСсылка.ВидыЦен") Тогда
		
		ВидЦены = Результат[0];
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти