
#Область ПрограммныйИнтерфейс

// По фискальному устройству определяет статус смены и проверяет ее активность. Под активностью понимается соблюдение следующих условий:
// - кассовая смена не закрыта с момента открытия кассовой смены прошло не более 24 часов.
//
// Параметры:
//  ФискальноеУстройство - СправочникСсылка.ПодключаемоеОборудование - фискальное устройство, для которого требуется определить активность смены
//
// Возвращаемое значение:
//  Структура:
//    *Открыта - Булево - Истина - смена открыта, Ложь - смена закрыта.
//    *Активна - Булево - Истина - смена открыта, Ложь - смена закрыта, прошло более 24 часов с момента открытия или никогда не была открыта.
//    *ТекущийНомерЧека - Число - текущий номер чека ККТ.
// 
Функция СтатусПоследнейСмены(ФискальноеУстройство) Экспорт
	
	Возврат КассовыеСмены.СтатусПоследнейСмены(ФискальноеУстройство);
	
КонецФункции

#КонецОбласти