
#Область КомандыЭДО

Процедура КомандыЭДО_ПриОткрытии(Форма) Экспорт

	ПараметрыПриОткрытии = ОбменСКонтрагентамиКлиент.ПараметрыПриОткрытии();
	ПараметрыПриОткрытии.Форма = Форма;
	ПараметрыПриОткрытии.МестоРазмещенияКоманд = Форма.Элементы.ГруппаКомандыЭДО;
	ПараметрыПриОткрытии.ЕстьОбработчикОбновитьКомандыЭДО = Истина;
	ОбменСКонтрагентамиКлиент.ПриОткрытии(ПараметрыПриОткрытии);

КонецПроцедуры

Процедура КомандыЭДО_ФормаСпискаОбработкаОповещения(Форма, ИмяСобытия, Параметр, Источник) Экспорт

	ПараметрыОповещенияЭДО = ОбменСКонтрагентамиКлиент.ПараметрыОповещенияЭДО_ФормаСписка();
	ПараметрыОповещенияЭДО.Форма = Форма;
	ПараметрыОповещенияЭДО.МестоРазмещенияКоманд = Форма.Элементы.ГруппаКомандыЭДО;
	ПараметрыОповещенияЭДО.ЕстьОбработчикОбновитьКомандыЭДО = Истина;
	ПараметрыОповещенияЭДО.ИмяДинамическогоСписка = "Список";
	ОбменСКонтрагентамиКлиент.ОбработкаОповещения_ФормаСписка(ИмяСобытия, Параметр, Источник, ПараметрыОповещенияЭДО);

КонецПроцедуры

Процедура КомандыЭДО_ФормаЭлементаОбработкаОповещения(Форма, ИмяСобытия, Параметр, Источник) Экспорт

	Элементы = Форма.Элементы;
	ПараметрыОповещенияЭДО = ОбменСКонтрагентамиКлиент.ПараметрыОповещенияЭДО_ФормаСправочника();
	ПараметрыОповещенияЭДО.Форма                            = Форма;
	ПараметрыОповещенияЭДО.МестоРазмещенияКоманд            = Элементы.ГруппаКомандыЭДО;
	ПараметрыОповещенияЭДО.ЕстьОбработчикОбновитьКомандыЭДО = Истина;
	ОбменСКонтрагентамиКлиент.ОбработкаОповещения_ФормаСправочника(ИмяСобытия, Параметр, Источник, ПараметрыОповещенияЭДО);

КонецПроцедуры

Процедура ПриАктивизацииСтроки_ФормаСписка(Форма) Экспорт
	
	ИнтерфейсДокументовЭДОКлиент.ПриАктивизацииСтроки_ФормаСписка(Форма);

КонецПроцедуры

#КонецОбласти

#Область ЭПД

Процедура ОформитьЭПД(Форма, ЭлементФормы) Экспорт
	Объект = Форма.Объект;
	СписокОснований = УправлениеНебольшойФирмойЭлектронныеДокументыКлиентСервер.СписокСчетовИЗаказовПокупателей(Объект);
	СписокОснований.Добавить(Объект.Ссылка);
	
	СписокЗаявок = УправлениеНебольшойФирмойЭлектронныеДокументыВызовСервера.ЭлектронныеДокументыПоОснованию(СписокОснований, Тип("ДокументСсылка.ЭлектронныйЗаказЗаявка"));
	
	ЗаказЗаявкаСсылка = Неопределено;
	Для каждого КлючИЗначение Из СписокЗаявок Цикл
		Если ЗначениеЗаполнено(ЗаказЗаявкаСсылка) И КлючИЗначение.Пометка Тогда
			ЗаказЗаявкаСсылка = Неопределено;
			Прервать;
		ИначеЕсли КлючИЗначение.Пометка Тогда
			ЗаказЗаявкаСсылка = КлючИЗначение.Значение;
		КонецЕсли;
	КонецЦикла;
	
	// Если есть заявка, лишних вопросов не задаем, сразу формируем
	Если ЗначениеЗаполнено(ЗаказЗаявкаСсылка) Тогда 
		
		ДанныеЗаполнения = Новый Структура;    
		ДанныеЗаполнения.Вставить("Основание", ЗаказЗаявкаСсылка); 
		
		ДанныеЗаполнения.Вставить("ДокументыОснования", Новый Массив);
		МассивОснований = ДанныеЗаполнения.ДокументыОснования;
		МассивОснований.Добавить(Новый Структура("ДокументОснование", Объект.Ссылка));
				

		ОткрытьФорму("Документ.ЭлектроннаяТранспортнаяНакладная.ФормаОбъекта", Новый Структура("ЗначенияЗаполнения", ДанныеЗаполнения));  
		
		Возврат;
	КонецЕсли;
	
	ВыбратьТипДокумента(Форма, ЭлементФормы);
КонецПроцедуры

Асинх Процедура ВыбратьТипДокумента(Форма, ЭлементФормы)
	Объект = Форма.Объект;
	
	ТипыДокументов = Новый СписокЗначений;
	ТипыДокументов.Добавить("ЭлектроннаяТранспортнаяНакладная", НСтр("ru = 'Электронная транспортная накладная'"));
	ТипыДокументов.Добавить("ЭлектроннаяЗаказЗаявка", 			НСтр("ru = 'Электронная заказ (заявка)'"));
	
	Если УправлениеНебольшойФирмойЭлектронныеДокументыВызовСервера.МожноСоздатьПоручениеЭкспедитору(Объект) Тогда
		ТипыДокументов.Добавить("ЭлектронноеПоручениеЭкспедитору",
			НСтр("ru = 'Электронное поручение экспедитору'"));
	КонецЕсли;
	
	РезультатВыбора = Ждать Форма.ВыбратьИзСпискаАсинх(ТипыДокументов, ЭлементФормы);
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Форма.Объект.Ссылка.Пустая() ИЛИ Форма.Модифицированность Тогда
		Результат = Ждать ЗаписатьДокумент(РезультатВыбора, Форма);
		Если НЕ Результат Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если РезультатВыбора.Значение = "ЭлектроннаяЗаказЗаявка" Тогда
		СоздатьЭлектроннуюЗаказЗаявку(Форма);
	ИначеЕсли РезультатВыбора.Значение = "ЭлектронноеПоручениеЭкспедитору" Тогда
		СоздатьЭлектронноеПоручениеЭкспедитору(Форма);
	Иначе
		СоздатьЭлектроннуюТранспортнуюНакладную(Форма);
	КонецЕсли;
КонецПроцедуры

Асинх Функция ЗаписатьДокумент(РезультатВыбора, Форма)
	ТекстВопроса = НСтр("ru = 'Документ еще не записан. Записать?'");
	Результат = Ждать ВопросАсинх(ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Форма.Записать();
	
	Возврат Истина;
КонецФункции

Процедура СоздатьЭлектроннуюЗаказЗаявку(Форма) Экспорт
	ДокументОснование = Форма.Объект.Ссылка;
	ПараметрыОткрытия = Новый Структура("ЗначенияЗаполнения", 
		УправлениеНебольшойФирмойЭлектронныеДокументыВызовСервера.ДанныеЗаполненияЭЗЗ(ДокументОснование));
	
	ОповешениеОЗакрытии = Новый ОписаниеОповещения("СоздатьЭПДЗавершение", ЭтотОбъект, Форма);
	ОткрытьФорму("Документ.ЭлектронныйЗаказЗаявка.ФормаОбъекта", ПараметрыОткрытия,,,,,ОповешениеОЗакрытии);
КонецПроцедуры

Процедура СоздатьЭлектронноеПоручениеЭкспедитору(Форма) Экспорт
	ДокументОснование = Форма.Объект.Ссылка;

	ПараметрыОткрытия = Новый Структура("ЗначенияЗаполнения",
		УправлениеНебольшойФирмойЭлектронныеДокументыВызовСервера.ДанныеЗаполненияЭПЭ(ДокументОснование));
	ОповешениеОЗакрытии = Новый ОписаниеОповещения("СоздатьЭПДЗавершение", ЭтотОбъект, Форма);
	ОткрытьФорму("Документ.ЭлектронноеПоручениеЭкспедитору.ФормаОбъекта", ПараметрыОткрытия, , , , ОповешениеОЗакрытии);
КонецПроцедуры

Процедура СоздатьЭлектроннуюТранспортнуюНакладную(Форма) Экспорт 
	ДокументОснование = Форма.Объект.Ссылка;
	
	ПараметрыОткрытия = Новый Структура("ЗначенияЗаполнения", 
		УправлениеНебольшойФирмойЭлектронныеДокументыВызовСервера.ДанныеЗаполненияЭТрН(ДокументОснование));
	ОповешениеОЗакрытии = Новый ОписаниеОповещения("СоздатьЭПДЗавершение", ЭтотОбъект, Форма);
	ОткрытьФорму("Документ.ЭлектроннаяТранспортнаяНакладная.ФормаОбъекта", ПараметрыОткрытия,,,,,ОповешениеОЗакрытии);
КонецПроцедуры

Процедура СоздатьЭПДЗавершение(Результат, Форма) Экспорт
	УправлениеНебольшойФирмойЭлектронныеДокументыКлиентСервер.ОбновитьТекстЭПД(Форма);
КонецПроцедуры

Процедура ОткрытьСписокЭПД(Форма) Экспорт
	Если НЕ ЗначениеЗаполнено(Форма.ЭПДСсылка) Тогда
		СписокОснований = УправлениеНебольшойФирмойЭлектронныеДокументыКлиентСервер.СписокСчетовИЗаказовПокупателей(Форма.Объект);
		СписокОснований.Добавить(Форма.Объект.Ссылка);
		
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("КлючНазначенияФормы",    Строка(Новый УникальныйИдентификатор));
		ПараметрыОтбора.Вставить("ОтборДокументОснование", СписокОснований);
		
		ОткрытьФорму("Обработка.ЭлектронныеПеревозочныеДокументы.Форма.ФормаСпискаЭПД", ПараметрыОтбора);
	Иначе
		ПоказатьЗначение(,Форма.ЭПДСсылка);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

