#Область СлужебныйПрограммныйИнтерфейс

#Область НастройкиРазбораКодаМаркировки

Функция НастройкиРазбораКодаМаркировки(ВидыПродукции = Неопределено, ТолькоУчитываемыеВидыПродукции = Истина) Экспорт
	Возврат РазборКодаМаркировкиИССлужебный.ОбщиеНастройкиРазбораКодаМаркировки(Ложь, ВидыПродукции, ТолькоУчитываемыеВидыПродукции);
КонецФункции

// Рассчитывает хеш видов продукции
//
// Параметры:
//   Значения - Неопределено, СправочникСсылка.ВидыПродукцииИС, Массив из СправочникСсылка.ВидыПродукцииИС - виды продукции
// Возвращаемое значение:
//    Строка - Хеш элементов
//
Функция ХешВидовПродукции(Значения) Экспорт
	
	ТипДанных = ТипЗнч(Значения);
	
	Список = Неопределено;
	
	Если ТипДанных = Тип("СправочникСсылка.ВидыПродукцииИС") Тогда
		Если Не Значения.Пустая() Тогда
			Возврат Строка(Значения.УникальныйИдентификатор());
		КонецЕсли;
	ИначеЕсли ТипДанных = Тип("Массив") Тогда
		Для Каждого Значение Из Значения Цикл
			Если ТипЗнч(Значение) = Тип("СправочникСсылка.ВидыПродукцииИС") И Не Значение.Пустая() Тогда
				Если Список = Неопределено Тогда
					Если Значения.Количество() = 1 Тогда
						Возврат Строка(Значение.УникальныйИдентификатор());
					КонецЕсли;
					Список = Новый СписокЗначений;
				КонецЕсли;
				Список.Добавить(Значение);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если Список = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	Если Список.Количество() > 0 Тогда
		Список.СортироватьПоЗначению();
		Возврат ОбщегоНазначенияИС.ХэшСуммаСтроки(ЗначениеВСтрокуВнутр(Список.ВыгрузитьЗначения()));
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецОбласти