///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2026, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

///////////////////////////////////////////////////////////////////////////////////////////////////////
// Подсистема "ИнтернетПоддержкаПользователей.ПлатежныеСистемы.ЯндексПэй".
// ОбщийМодуль.ЯндексПэйПереопределяемый.
//
// Серверные переопределяемые процедуры работы с платежной системой Яндекс Пэй:
//  - формирование заказа на оплату и на возврат.
//
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Определяет данные для формирования запроса на оплату в платежную систему Яндекс Пэй.
// Все поля входного параметра ЗаказНаОплату по умолчанию обязательны для заполнения,
// если в описании поля не написано обратное.
//
// Параметры:
//  ДокументОперации - ОпределяемыйТип.ДокументОперацииПлатежнойСистемы - документ, который отражает оплату в
//    информационной базе.
//  ЗаказНаОплату - Структура - содержит описание заказа на оплату для платежной системы Яндекс Пэй:
//    * ДатаОперации - Дата - дата операции оплаты.
//    * Комментарий - Строка - Комментарий операции. Первоначально заполняется на основе шаблона назначения,
//       заданного для документа.
//    * ВремяДействияСсылки - Число - время действия ссылки на оплату в секундах. Значение по умолчанию - 600.
//       Максимальное значение = 1200. При указании значения больше, оно будет сокращено до максимального.
//       Значение меньше 1 игнорируется (будет использовано значение по умолчанию).
//    * ОтложенноеПолучениеСтатуса - Булево - признак загрузки статуса оплаты регламентным заданием.
//    * ПараметрыОплаты - Структура - содержит описание параметров оплат:
//      ** НазначениеПлатежа - Строка - назначение платежа для платежной системы Яндекс Пэй.
//      ** ШаблоныНазначения - ТаблицаЗначений - настройки заполнения шаблонов платежей:
//        ** ОбъектМетаданных - Строка - имя объекта метаданных операции.
//        ** Идентификатор - Строка - идентификатор шаблона.
//        ** Наименование - Строка - наименование шаблона для пользователя.
//        ** Параметры - Структура - параметры заполнения шаблона:
//          *** Наименование - Строка - наименование параметра для пользователя.
//          *** Идентификатор - Строка - идентификатор параметра для заполнения.
//    * Корзина - ТаблицаЗначений - оплачиваемый список товаров, работ и услуг. Все суммовые значения заполняются в
//        рублях (RUB):
//        ** ИдентификаторНоменклатуры - Строка - идентификатор номенклатуры. Максимальная длина 2048.
//           При указании строк длиннее максимального значения вызвано исключение.
//           Важно: в рамках одной корзины не должно быть строк с одинаковым идентификатором.
//           Допускается использование пробела и служебных символов _`~!@#$%^&*()_+{}[]\|/№;:?<>'"
//        ** ПредставлениеНоменклатуры - Строка - представление номенклатуры. Максимальная длина 2048.
//           Строки длиннее максимального значения обрезаются.
//        ** Количество - Число - количество товара в заказе, с точностью до тысячных. Максимальное значение 1000000.
//           При указании большего значения будет вызвано исключение.
//        ** Цена - Число - цена за единицу товара. Максимальное значение 1000000.
//           При указании большего значения будет вызвано исключение.
//        ** Сумма - Число - сумма позиции. Максимальное значение 1000000.
//           При указании большего значения будет вызвано исключение.
//        ** Описание - Строка - Произвольное описание товара. Максимальная длина 2048.
//           Строки длиннее максимального значения обрезаются.
//    * Сумма - Число - общая сумма товаров в заказе. Максимальное значение 1000000.
//  НастройкаПодключения - СправочникСсылка.НастройкиПодключенияКПлатежнымСистемам - настройка подключения к сервису.
//  ДополнительныеПараметры - Структура, Неопределено - дополнительные настройки формирования заказа на оплату
//    переданные в методе см. ПлатежныеСистемы.АктивироватьКассовуюСсылку или ПлатежныеСистемы.ДинамическаяСсылка.
//  
Процедура ПриФормированииЗаказаНаОплату(
	ДокументОперации,
	ЗаказНаОплату,
	НастройкаПодключения,
	ДополнительныеПараметры) Экспорт
	
	ИнтеграцияСПлатежнымиСистемамиУНФ.ПриФормированииЗаказаНаОплатуЯндексПэй(
		ДокументОперации,
		ЗаказНаОплату,
		НастройкаПодключения,
		ДополнительныеПараметры);
	
КонецПроцедуры

// Определяет данные для формирования запроса на возврат оплаты для платежной системы Яндекс Пэй.
// Все поля входного параметра ЗаказНаВозврат по умолчанию обязательны для заполнения, если в описании поля не написано
// обратное.
//
// Параметры:
//  ДокументОперации - ОпределяемыйТип.ДокументОперацииПлатежнойСистемы - документ, который отражает возврат оплаты в
//    информационной базе.
//  ДокументОплаты - ОпределяемыйТип.ДокументОперацииПлатежнойСистемы - документ, который отражает оплату в
//                     информационной базе.
//                 - Строка - строковый идентификатор документа оплаты. Может использоваться, если заказ
//                     на оплату был сформирован в другой базе.
//                 Необходимо использовать для получения актуальной корзины.
//  ЗаказНаВозврат - Структура - содержит описание заказа на возврат оплаты в платежную систему Яндекс Пэй:
//    * ДатаОперации - Дата - дата операции возврата.
//    * СуммаВозврата - Число - сумма к возврату.
//    * Корзина - ТаблицаЗначений - (необязательный) список товаров, который должен остаться ПОСЛЕ выполнения возврата.
//        Все суммовые значения заполняются в рублях (RUB).
//        Если необходимо вернуть всю покупку, то корзина не заполняется.
//        Обязательны для заполнения только ИдентификаторНоменклатуры и Количество:
//        ** ИдентификаторНоменклатуры - Строка - идентификатор номенклатуры. Максимальная длина 2048.
//           При указании строк длиннее максимального значения вызывается исключение.
//           Обязательно для заполнения.
//           Важно: в рамках одной корзины не должно быть строк с одинаковым идентификатором.
//           Важно: указанный идентификатор должен присутствовать в актуальной корзине. При указании идентификатора,
//           которого нет в текущей корзине будет вызвано исключение.
//           Допускается использование пробела и служебных символов _`~!@#$%^&*()_+{}[]\|/№;:?<>'"
//        ** ПредставлениеНоменклатуры - Строка - представление номенклатуры. Максимальная длина 2048.
//           Строки длиннее максимального значения обрезаются.
//        ** Количество - Число - количество товара в заказе, с точностью до тысячных. Максимальное значение 1000000.
//           При указании большего значения будет вызвано исключение.
//           Обязательно для заполнения.
//        ** Цена - Число - цена за единицу товара. Максимальное значение 1000000.
//           При указании большего значения будет вызвано исключение.
//        ** Сумма - Число - сумма позиции. Максимальное значение 1000000.
//           При указании большего значения будет вызвано исключение.
//        ** Описание - Строка - Произвольное описание товара. Максимальная длина 2048.
//           Строки длиннее максимального значения обрезаются.
//  НастройкаПодключения - СправочникСсылка.НастройкиПодключенияКПлатежнымСистемам - настройка подключения к сервису.
//  ДополнительныеПараметры - Структура, Неопределено - дополнительные настройки формирования заказа на оплату
//    переданные в методе ПлатежныеСистемы.ВозвратОплаты.
//
Процедура ПриФормированииЗаказаНаВозврат(
	ДокументОперации,
	ДокументОплаты,
	ЗаказНаВозврат,
	НастройкаПодключения,
	ДополнительныеПараметры) Экспорт
	
	ИнтеграцияСПлатежнымиСистемамиУНФ.ПриФормированииЗаказаНаВозвратЯндексПэй(
		ДокументОперации,
		ДокументОплаты,
		ЗаказНаВозврат,
		НастройкаПодключения,
		ДополнительныеПараметры);
	
КонецПроцедуры

#КонецОбласти

