///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2026, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// Подсистема "Маг1С"
// ОбщийМодуль.Маг1ССервер
//
// Все серверные процедуры и функции для работы с mag1c
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// См. ОбщегоНазначенияПереопределяемый.ПередЗапускомПрограммы
//
Процедура ПередЗапускомПрограммы() Экспорт
	
	ПроверитьУстановкуРасширенияИВзвестиКонстанту();
	
КонецПроцедуры

// Добавляет комады в параметр Команды, а так же озвращает массив добавленный подключенных команд
//
// Параметры:
//  См. ПодключаемыеКомандыПереопределяемый.ПриОпределенииКомандПодключенныхКОбъекту
//
// Возвращаемое значение:
//  - Массив из СтрокаТаблицыЗначений - добавленные в параметр Команды строки
//
Функция ПриОпределенииКомандПодключенныхКОбъекту(НастройкиФормы, Источники, ПодключенныеОтчетыИОбработки, Команды) Экспорт
	
	Результат = Новый Массив;
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Проверяет, что расширение для работы с mag1c уже установлено и включает (выключает), если
// это нужно константу ПоказыватьКомандуУстановитьРасширениеМаг1с.
//
// Возвращаемое значение:
//  Булево - расширение уже установлено
//
Функция ПроверитьУстановкуРасширенияИВзвестиКонстанту() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ТекущийРежимЗапуска() = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	УжеУстановлено = РасширениеУстановлено();
	
	ИмяФО = Маг1СКлиентСерверПереопределяемый.ИмяПроверямойФункциональнойОпции();
	Если Не УжеУстановлено И Не ПустаяСтрока(ИмяФО) Тогда
		ФОВключена = ПолучитьФункциональнуюОпцию(ИмяФО);
	Иначе
		ФОВключена = Истина;
	КонецЕсли;
	
	Если Не ФОВключена Тогда
		Если Константы.ПоказыватьКомандуУстановитьРасширениеМаг1с.Получить() Тогда
			Константы.ПоказыватьКомандуУстановитьРасширениеМаг1с.Установить(Ложь);
		КонецЕсли;
		
		Возврат УжеУстановлено;
	КонецЕсли;
	
	РазделениеВключено = ОбщегоНазначения.РазделениеВключено();
	Если (РазделениеВключено И ОбщегоНазначения.ДоступноИспользованиеРазделенныхДанных()) Или Не РазделениеВключено Тогда 
		Если УжеУстановлено = Константы.ПоказыватьКомандуУстановитьРасширениеМаг1с.Получить() Тогда
			Константы.ПоказыватьКомандуУстановитьРасширениеМаг1с.Установить(Не УжеУстановлено);
		КонецЕсли;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат УжеУстановлено;
	
КонецФункции

// Выполняет аутентификацию пользователя менеджера витрин по профилю ИТС 
//
Функция ВыполнитьАвторизациюВСервисеМаг1С(ПараметрыБазы) Экспорт
	
	ДанныеАутентификации = СведенияАутентификацииКлиента();
	РезультатАвторизации = ВыполнитьАутентификациюВМенеджереВитрин(ДанныеАутентификации, ПараметрыБазы);
	Если РезультатАвторизации.КодВозврата <> 200 Тогда
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Маг1С: Установка расширения'"), УровеньЖурналаРегистрации.Ошибка,,, РезультатАвторизации.СообщениеОбОшибке);
	КонецЕсли;
	Возврат РезультатАвторизации
	
КонецФункции

// Проверяет, что доступны модули расширения в текущем сеансе
// 
// Возвращаемое значение:
//   Булево - возвращает Истина, когда расширение установлено
//
Функция РасширениеУстановлено() Экспорт
	
	Возврат Метаданные.ОбщиеМодули.Найти("Маг1СИнтеграцияСлужебныйКлиент") <> Неопределено;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция АдресСервисаМенеджераВитрин()
	
	УстановитьПривилегированныйРежим(Истина);
	СистемныеНастройки = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища("Маг1С_.СистемныеНастройки");
	УстановитьПривилегированныйРежим(Ложь);
	
	Если СистемныеНастройки = Неопределено
		Или Не ТипЗнч(СистемныеНастройки) = Тип("Структура")
		Или Не СистемныеНастройки.Свойство("АдресСервисаМенеджераВитрин")
		Или Не ЗначениеЗаполнено(СистемныеНастройки.АдресСервисаМенеджераВитрин) Тогда
		Возврат "https://service.mag1c.ru/applications/manager";
	Иначе
		Возврат СистемныеНастройки.АдресСервисаМенеджераВитрин;
	КонецЕсли;
	
КонецФункции

Функция СведенияАутентификацииКлиента()
	
	ДанныеСтр = Новый Структура("token,login,password", "", "", "");
	
	ТикетАутентификации = ИнтернетПоддержкаПользователей.ТикетАутентификацииНаПорталеПоддержки(ИдентификаторСервисаМенеджераВитрин());
	Если ПустаяСтрока(ТикетАутентификации.КодОшибки) Тогда
		ДанныеСтр.token = ТикетАутентификации.Тикет;
	ИначеЕсли ОбщегоНазначения.РазделениеВключено() Тогда
		ВызватьИсключение ТикетАутентификации.ИнформацияОбОшибке;
	Иначе
		ДанныеАутентификации = ИнтернетПоддержкаПользователей.ДанныеАутентификацииПользователяИнтернетПоддержки();
		
		ДанныеСтр.login    = ДанныеАутентификации.Логин;
		ДанныеСтр.password = ДанныеАутентификации.Пароль;
	КонецЕсли;
	
	Возврат ДанныеСтр;
	
КонецФункции

Функция ВыполнитьАутентификациюВМенеджереВитрин(ДанныеАутентификации, ПараметрыБазы)
	
	Результат = Новый Структура();
	Результат.Вставить("Идентификатор", "");
	Результат.Вставить("СекретныйКлюч", "");
	Результат.Вставить("СрокДействия",  Неопределено);
	Результат.Вставить("КодВозврата",  200);
	Результат.Вставить("СообщениеОбОшибке",  "");
	
	СтруктураURI = ОбщегоНазначенияКлиентСервер.СтруктураURI(АдресСервисаМенеджераВитрин());
	
	Соединение = НовоеHTTPСоединение(СтруктураURI);
	АдресРесурса = "/api/v1/auth";
	
	Запрос = НовыйHTTPЗапрос(СтруктураURI, АдресРесурса, ПараметрыБазы, Неопределено);
	Запрос.Заголовки.Вставить("Content-Type", "application/json");
	Запрос.УстановитьТелоИзСтроки(СтруктураВСтрокуJSON(ДанныеАутентификации));
	
	Ответ = Соединение.ОтправитьДляОбработки(Запрос);
	
	Если Ответ.КодСостояния = 200 Тогда
		СтруктураОтвета = СтрокаJSONВСоответствие(Ответ.ПолучитьТелоКакСтроку());
		
		Результат.Идентификатор = СтруктураОтвета.Получить("client_id");
		Результат.СекретныйКлюч = СтруктураОтвета.Получить("client_secret");
		Результат.СрокДействия  = ТекущаяУниверсальнаяДата() + 24 * 60 * 60;
	Иначе
		Результат.КодВозврата      = Ответ.КодСостояния;
		Результат.СообщениеОбОшибке = ОписаниеОшибкиСервиса(
			СтруктураURI.ИмяСервера,
			"POST",
			АдресРесурса,
			Ответ.КодСостояния,
			Ответ.ПолучитьТелоКакСтроку());
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция НовоеHTTPСоединение(СтруктураURI, Таймаут = 20, ИмяПользователя = "", Пароль = "")
	
	Сервер   = СтруктураURI.Хост;
	Порт     = СтруктураURI.Порт;
	Протокол = СтруктураURI.Схема;
	
	ЗащищенноеСоединение = Неопределено;
	Если ВРег(Протокол) = "HTTPS" Тогда
		ЗащищенноеСоединение = ОбщегоНазначенияКлиентСервер.НовоеЗащищенноеСоединение(,Новый СертификатыУдостоверяющихЦентровОС);
	КонецЕсли;
	
	Возврат Новый HTTPСоединение(
		Сервер,
		Порт,
		ИмяПользователя,
		Пароль,
		ПолучениеФайловИзИнтернета.ПолучитьПрокси(Протокол),
		Таймаут,
		ЗащищенноеСоединение);
	
КонецФункции

Функция НовыйHTTPЗапрос(СтруктураURI, АдресРесурса, ПараметрыБазы, ТокенАвторизации)
	
	Если Не ПустаяСтрока(СтруктураURI.ПутьНаСервере) Тогда
		АдресРесурса = "/" + СтруктураURI.ПутьНаСервере + АдресРесурса;
	КонецЕсли;
	
	Запрос = Новый HTTPЗапрос(АдресРесурса);
	
	Если ТокенАвторизации <> Неопределено Тогда
		Запрос.Заголовки.Вставить("Authorization", ТокенАвторизации.ТипТокена + " " + ТокенАвторизации.ИдентификаторТокена);
	КонецЕсли;
	
	Если ПараметрыБазы <> Неопределено Тогда
		ИмяКонфигурации = СтрЗаменить(СтрЗаменить(Base64Строка(ПолучитьДвоичныеДанныеИзСтроки(ПараметрыБазы.ИмяКонфигурации)), Символы.ПС,""), Символы.ВК, "");
		
		Запрос.Заголовки.Вставить("X-User-Agent-Configuration-Name",    ИмяКонфигурации);
		Запрос.Заголовки.Вставить("X-User-Agent-Configuration-Version", ПараметрыБазы.ВерсияКонфигурации);
		Запрос.Заголовки.Вставить("X-User-Agent-Wizard-Version",        ПараметрыБазы.ВерсияРасширения);
		Запрос.Заголовки.Вставить("X-User-Agent-Infobase-Id",           ПараметрыБазы.ИдентификаторИБ);
		Запрос.Заголовки.Вставить("X-User-Agent-Timezone",              ПараметрыБазы.ЧасовойПоясСеанса);
		Запрос.Заголовки.Вставить("X-User-Agent-Data-Separation-Value", ПараметрыБазы.ЗначениеРазделителяСеанса);
		Запрос.Заголовки.Вставить("X-User-Agent-Platform-Version",      ПараметрыБазы.ВерсияПлатформы);
		
	КонецЕсли;
	
	Возврат Запрос;
	
КонецФункции

Функция ОписаниеОшибкиСервиса(ИмяСервера, Метод, Ресурс, КодОтвета, Знач СообщениеОбОшибке = "")
	
	Если ПустаяСтрока(СообщениеОбОшибке) Тогда
		СообщениеОбОшибке = НСтр("ru = 'Неизвестная ошибка сервиса.'");
	КонецЕсли;
	
	Возврат СтрШаблон(
		"Сервер: %1
		|%2 %3 HTTP/1.1
		|HTTP/1.1 %4
		|
		|%5",
		ИмяСервера, Метод, Ресурс, XMLСтрока(КодОтвета), СообщениеОбОшибке);
	
КонецФункции

Функция СтруктураВСтрокуJSON(Источник, ИмяФайла = "")
	
	Запись = Новый ЗаписьJSON;
	Если ПустаяСтрока(ИмяФайла) Тогда
		Запись.УстановитьСтроку();
	Иначе
		Запись.ОткрытьФайл(ИмяФайла, "UTF-8");
	КонецЕсли;
	
	ЗаписатьJSON(Запись, Источник);
	
	Возврат Запись.Закрыть();
	
КонецФункции

Функция СтрокаJSONВСоответствие(Источник)
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(Источник);
	
	Результат = ПрочитатьJSON(ЧтениеJSON, Истина);
	
	ЧтениеJSON.Закрыть();
	
	Возврат Результат;
	
КонецФункции

Функция ИдентификаторСервисаМенеджераВитрин()
	
	Возврат "1C-YOS";
	
КонецФункции

#КонецОбласти
