///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2026, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// Подсистема "Маг1С"
// ОбщийМодуль.Маг1СВызовСервера
//
// Все серверные процедуры и функции для работы с mag1c
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает структуру с параметрами текущей базы.
//
// Возвращаемое значение:
//  Cтруктура:
//        * РазделениеВключено – Булево
//        * ЛогинИПП - Строка - Логин ИТС, если авторизация не во фреш
//        * АутентификацияИППВыполнена - Булево - признак авторизации ИТС
//        * УжеУстановлено - Булево - признак установленного расширения mag1c
//        * ЭтоБазоваяВерсияКонфигурации - Булево - признак базовой версии конфигурации
//        * ИмяКонфигурации - Строка - имя конфигурации, как оно задано в метаданных
//        * ВерсияКонфигурации - Строка - версия конфигурации, как оно указано в метаданных
//        * ИдентификаторИБ - Строка - уникальный идентификатор информационной базы
//        * ЧасовойПоясСеанса - Строка -  идентификатор часового пояса текущего сеанса
//        * ЗначениеРазделителяСеанса - Строка - значение разделителя текущей области данных
//        * ВерсияПлатформы - Строка
//        * ВерсияРасширения - Строка
//        * СинонимЗаказа - Строка
// 
Функция ПараметрыБазы() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("РазделениеВключено", ОбщегоНазначения.РазделениеВключено());
	
	Результат.Вставить("ЛогинИПП", "");
	
	Если Результат.РазделениеВключено Тогда
		АутентификацияИППВыполнена = Истина;
	Иначе
		УстановитьПривилегированныйРежим(Истина);
		АутентификацияИППВыполнена = ИнтернетПоддержкаПользователей.ЗаполненыДанныеАутентификацииПользователяИнтернетПоддержки();
		
		Если АутентификацияИППВыполнена Тогда 
			ДанныеАутентификации = ИнтернетПоддержкаПользователей.ДанныеАутентификацииПользователяИнтернетПоддержки();
			Результат.ЛогинИПП   = ДанныеАутентификации.Логин;
		КонецЕсли;
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
	УжеУстановлено = Маг1ССервер.РасширениеУстановлено();
	
	Результат.Вставить("АутентификацияИППВыполнена", АутентификацияИППВыполнена);
	Результат.Вставить("УжеУстановлено", УжеУстановлено);
	Результат.Вставить("ЭтоБазоваяВерсияКонфигурации", СтандартныеПодсистемыСервер.ЭтоБазоваяВерсияКонфигурации());
	Результат.Вставить("ИмяКонфигурации", Метаданные.Имя);
	Результат.Вставить("ВерсияКонфигурации", Метаданные.Версия);
	Результат.Вставить("ИдентификаторИБ", СтандартныеПодсистемыСервер.ИдентификаторИнформационнойБазы());
	Результат.Вставить("ЧасовойПоясСеанса", ЧасовойПоясСеанса());
	Результат.Вставить("СервисПлюсДоступен", ПлюсСервис.Используется());
	Результат.Вставить("ЗначениеРазделителяСеанса", 0);
	Если ОбщегоНазначения.РазделениеВключено() Тогда
		МодульРаботаВМоделиСервиса = ОбщегоНазначения.ОбщийМодуль("РаботаВМоделиСервиса");
		Результат.ЗначениеРазделителяСеанса = Формат(МодульРаботаВМоделиСервиса.ЗначениеРазделителяСеанса(),"ЧГ=0");
	КонецЕсли;
	
	СистемнаяИнформация = Новый СистемнаяИнформация;
	Результат.Вставить("ВерсияПлатформы", СистемнаяИнформация.ВерсияПриложения);
	Результат.Вставить("ВерсияРасширения", "");
	
	Возврат Результат;
	
КонецФункции

// Выполняет аутентификацию пользователя менеджера витрин по профилю ИТС 
//
Функция ВыполнитьАвторизациюВСервисеМаг1С(ПараметрыБазы) Экспорт
	
	Возврат Маг1ССервер.ВыполнитьАвторизациюВСервисеМаг1С(ПараметрыБазы)
	
КонецФункции

#КонецОбласти