///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2026, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// Подсистема "ИнтернетПоддержкаПользователей.ОнлайнЗаказы".
// ОбщийМодуль.ОнлайнЗаказы.
//
// Серверные процедуры подготовки и отправки данных в сервис онлайн-заказов:
//  - определение доступности настроек подключения, а также получения настроек;
//  - определение доступности создания новых заказов и получения статусов созданных заказов;
//  - получение описания новой колонки таблицы товаров заказа.
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Определяет доступность использования функциональности создания/обновления онлайн-заказа
// на основании прав доступа пользователя.
//
// Возвращаемое значение:
//  Булево - если Истина, создание/обновление заказа доступно.
//
Функция ОнлайнЗаказыДоступны() Экспорт
	
	Возврат ОнлайнЗаказыСлужебный.ОнлайнЗаказыДоступны();
	
КонецФункции

// Определяет доступность использования функциональности настройки
// онлайн-заказов на основании прав доступа пользователя.
//
// Возвращаемое значение:
//  Булево - если Истина, настройка онлайн-заказов доступна.
//
Функция НастройкаОнлайнЗаказовДоступна() Экспорт
	
	Возврат ОнлайнЗаказыСлужебный.НастройкаОнлайнЗаказовДоступна();
	
КонецФункции

// Создает новый онлайн-заказ или возвращает ссылку на существующий.
//
// Параметры:
//  ДокументЗаказа - ОпределяемыйТип.ДокументОнлайнЗаказаБИП - документ в информационной базе,
//    являющийся основанием для заказа.
//  НастройкаПодключения - СправочникСсылка.НастройкиПодключенияКОнлайнЗаказам, Неопределено - 
//    настройка выполнения операции.
//  СоздатьНастройку - Булево - признак создания новой настройки в фоне,
//    в случае когда НастройкаПодключения = Неопределено.
//
// Возвращаемое значение:
//  Структура - результат получения ссылки онлайн-заказа:
//    * URLЗаказа - Строка - URL онлайн-заказа;
//    * КодОшибки - Строка - строковый код возникшей ошибки, который
//      может быть обработан вызывающим методом:
//        - <Пустая строка> - получение URL заказа выполнено успешно;
//        - "НеверныйФорматЗапроса" - передан некорректный запрос или настройка подключения;
//        - "НеверныйЛогинИлиПароль" - некорректный логин/пароль ИПП;
//        - "СервисВременноНеДоступен" - временная недоступность сервиса;
//        - "ПревышеноКоличествоПопыток" - превышено количество попыток
//          обращения к сервису с некорректным логином и паролем;
//        - "ОшибкаПодключения" - ошибка при подключении к сервису;
//        - "ОшибкаСервиса" - внутренняя ошибка сервиса;
//    * СообщениеОбОшибке  - Строка, ФорматированнаяСтрока - сообщение об ошибке для пользователя;
//    * ИнформацияОбОшибке - Строка, ФорматированнаяСтрока - сообщение об ошибке для администратора.
//
Функция URLЗаказа(
		ДокументЗаказа,
		НастройкаПодключения,
		СоздатьНастройку = Ложь) Экспорт
	
	ИмяФункции = "ОнлайнЗаказы.URLЗаказа";
	
	ОбщегоНазначенияКлиентСервер.ПроверитьПараметр(
		ИмяФункции,
		"ДокументЗаказа",
		ДокументЗаказа,
		Метаданные.ОпределяемыеТипы.ДокументОнлайнЗаказаБИП.Тип);
	
	ОжидаемыеТипы = Новый Массив;
	ОжидаемыеТипы.Добавить(Тип("СправочникСсылка.НастройкиПодключенияКОнлайнЗаказам"));
	ОжидаемыеТипы.Добавить(Тип("Неопределено"));
	
	ОбщегоНазначенияКлиентСервер.ПроверитьПараметр(
		ИмяФункции,
		"НастройкаПодключения",
		НастройкаПодключения,
		ОжидаемыеТипы);
	
	Возврат ОнлайнЗаказыСлужебный.URLЗаказа(
		ДокументЗаказа,
		НастройкаПодключения,
		СоздатьНастройку);
	
КонецФункции

// Выполняет загрузку статусов онлайн-заказов, по которым было
// отложено получение результата.
//
// Возвращаемое значение:
//  Массив из ОпределяемыйТип.ДокументОнлайнЗаказаБИП - перечень обработанных документов.
//
Функция СтатусыЗаказов() Экспорт
	
	Возврат ОнлайнЗаказыСлужебный.АктуализироватьСтатусыЗаказов();
	
КонецФункции

// Получает данные онлайн-заказов для переданных документов оснований.
//
// Параметры:
//  ДокументыЗаказов - Массив Из ОпределяемыйТип.ДокументОнлайнЗаказаБИП - документы в информационной базе,
//   являющиеся основанием для заказа.
//
// Возвращаемое значение:
//  Соответствие - данные онлайн-заказов:
//    * Ключ - ОпределяемыйТип.ДокументОнлайнЗаказаБИП - документ основание онлайн-заказа.
//    * Значение - Структура, Неопределено - Данные онлайн-заказа, Неопределено в случае, если онлайн-заказ не был создан:
//      ** СтатусЗаказа - Строка - Статус онлайн-заказа, может принимать следующие значения:
//        - "Выполняется" - подтверждение оплаты не получено;
//        - "Отменен" - онлайн-заказ отменен;
//        - "Выполнен" - онлайн-заказ оплачен;
//        - "Ошибка" - не удалось выполнить проверку оплаты из-за ошибки;
//      ** ПараметрыЗаказа - Структура - дополнительные данные по заказу:
//        *** URLЗаказа - Строка - URL онлайн-заказа;
//        *** СпособОплаты - Строка - Идентификатор способа оплаты, пустая если СтатусЗаказа <> "Выполнен".
//            Может принимать следующие значения: "СБПc2b", "СБПb2b", "Наличные", "ПоРеквизитам", "ИнтернетЭквайринг",
//            "Эквайринг", "ОзонПэй", "ЯндексПэй", "Прочее".
//        *** СуммаОплаты - Число - Сумма оплаты онлайн-заказа, пустая если СтатусЗаказа <> "Выполнен".
//
Функция ДанныеЗаказов(ДокументыЗаказов) Экспорт
	
	ИмяФункции = "ОнлайнЗаказы.ДанныеЗаказов";
	
	ОбщегоНазначенияКлиентСервер.ПроверитьПараметр(
		ИмяФункции,
		"ДокументыЗаказов",
		ДокументыЗаказов,
		Тип("Массив"));
	
	Возврат ОнлайнЗаказыСлужебный.ДанныеЗаказов(ДокументыЗаказов);
	
КонецФункции

// Возвращает публичные данные онлайн-заказа по переданному URL.
//
// Параметры:
//  URLЗаказа - Строка - ссылка на онлайн-заказ.
//
// Возвращаемое значение:
//  Структура - результат получения данных онлайн-заказа:
//    * ПараметрыShare - Структура - Параметры онлайн-заказа в сервисе Share:
//      ** URL - Строка - URL документа онлайн-заказа в сервисе Share, пустая строка в случае если документ не создан;
//      ** ИнформацияОбОшибке - Устарело. Следует использовать ИнформацияОбОшибке верхнего уровня.
//    * ПараметрыОплат - Структура - Содержит описание видов оплат с их параметрами:
//      ** ПоРеквизитам - Структура, Неопределено - Содержит описание реквизитов для оплаты.
//         Неопределено в случае если данные оплат по реквизитам не переданы или отключены в настройке оплат:
//        *** ДанныеQR - Строка - Содержит реквизиты оплаты в формате УФЭБС.
//        *** Представление - Строка - Представление реквизитов оплат в текстовом виде.
//    * ИнформацияОбОшибке - Строка, ФорматированнаяСтрока - сообщение об ошибке для администратора.
//
Функция ПубличныеДанныеЗаказа(URLЗаказа) Экспорт
	
	Возврат ОнлайнЗаказыСлужебный.ПубличныеДанныеЗаказа(URLЗаказа);
	
КонецФункции

// Выполняет установку статуса у существующего онлайн-заказа.
//
// Параметры:
//  ДокументЗаказа - ОпределяемыйТип.ДокументОнлайнЗаказаБИП - документ в информационной базе,
//   являющийся основанием для заказа.
//  Статус - Строка - Статус который должен быть установлен у онлайн-заказа. Может принимать значения:
//   "Оплачен", "Отменен"
//  ПараметрыОплаты - Структура - содержит параметры оплаты обязательна для заполнения когда Статус принимает значение "Оплачен"
//    * СпособОплаты - Строка - Идентификатор способа оплаты.
//      Может принимать значения: "Наличные", "Эквайринг", "ПоРеквизитам", "Прочее"
//  ПривилегированныйРежим - Булево - признак выполнения операции установки статуса привилегированном режиме,
//  Ложь по умолчанию
//
// Возвращаемое значение:
//  Структура - результат установки статуса онлайн-заказа:
//    * КодОшибки - Строка - строковый код возникшей ошибки, который
//      может быть обработан вызывающим методом:
//        - <Пустая строка> - установка статуса выполнена успешно;
//        - "ИдентификаторНеНайден" - у преданного документа отсутствует онлайн-заказ;
//        - "УжеОплачен" - онлайн-заказ уже оплачен;
//        - "НеверныйФорматЗапроса" - передан некорректный запрос или настройка подключения;
//        - "НеверныйЛогинИлиПароль" - некорректный логин/пароль ИПП;
//        - "СервисВременноНеДоступен" - временная недоступность сервиса;
//        - "ПревышеноКоличествоПопыток" - превышено количество попыток
//          обращения к сервису с некорректным логином и паролем;
//        - "ОшибкаПодключения" - ошибка при подключении к сервису;
//        - "ОшибкаСервиса" - внутренняя ошибка сервиса;
//    * СообщениеОбОшибке  - Строка, ФорматированнаяСтрока - сообщение об ошибке для пользователя;
//    * ИнформацияОбОшибке - Строка, ФорматированнаяСтрока - сообщение об ошибке для администратора.
//
Функция УстановитьСтатусЗаказа(
	ДокументЗаказа,
	Статус,
	ПараметрыОплаты,
	ПривилегированныйРежим = Ложь) Экспорт
	
	Результат = ОнлайнЗаказыСлужебный.НовыйРезультатОперации();
	
	ИмяФункции = "ОнлайнЗаказы.УстановитьСтатусЗаказа";
	
	ОбщегоНазначенияКлиентСервер.ПроверитьПараметр(
		ИмяФункции,
		"ДокументЗаказа",
		ДокументЗаказа,
		Метаданные.ОпределяемыеТипы.ДокументОнлайнЗаказаБИП.Тип);
	
	ОбщегоНазначенияКлиентСервер.ПроверитьПараметр(
		ИмяФункции,
		"Статус",
		Статус,
		Тип("Строка"),
		,
		"Оплачен,Отменен");
		
	Если Статус = "Оплачен" Тогда
		
		ОбщегоНазначенияКлиентСервер.ПроверитьПараметр(
			ИмяФункции,
			"ПараметрыОплаты",
			ПараметрыОплаты,
			Тип("Структура"),
			Новый Структура(
				"СпособОплаты",
				Тип("Строка")));
		
		ОбщегоНазначенияКлиентСервер.ПроверитьПараметр(
			ИмяФункции,
			"ПараметрыОплаты.СпособОплаты",
			ПараметрыОплаты.СпособОплаты,
			Тип("Строка"),
			,
			"Наличные,Эквайринг,ПоРеквизитам,Прочее");
		
	КонецЕсли;
	
	Если ПривилегированныйРежим Тогда
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	Если Статус = "Отменен" Тогда
		РезультатОперации = ОнлайнЗаказыСлужебный.ДеактивироватьЗаказ(ДокументЗаказа);
	ИначеЕсли Статус = "Оплачен" Тогда
		РезультатОперации = ОнлайнЗаказыСлужебный.УстановитьСтатусОплачен(ДокументЗаказа, ПараметрыОплаты);
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(Результат, РезультатОперации);
	
	Возврат Результат;
	
КонецФункции

// Определяет параметры функциональности настройки онлайн-заказов
// на основании прав доступа пользователя и введенных данных.
//
// Параметры:
//  Организация - ОпределяемыйТип.Организация - Организация для которой планируется создание настройки онлайн-заказов.
//
// Возвращаемое значение:
//  Структура - содержит параметры настройки онлайн-заказов:
//    * НастройкиПодключения - Массив из Справочник.НастройкиПодключенияКОнлайнЗаказам -
//      перечень настроек подключения по заданной организации.
//
Функция НастройкиПодключения(Организация) Экспорт
	
	ИмяФункции = "ОнлайнЗаказы.НастройкиПодключения";
	
	ОбщегоНазначенияКлиентСервер.ПроверитьПараметр(
		ИмяФункции,
		"Организация",
		Организация,
		Метаданные.ОпределяемыеТипы.Организация.Тип);
	
	Если Не ОнлайнЗаказыДоступны()
		И Не НастройкаОнлайнЗаказовДоступна() Тогда
		ВызватьИсключение НСтр("ru = 'Нарушение прав доступа. Пользователю запрещено чтение настроек подключения Онлайн-заказов.
			|Обратитесь к администратору.'");
	КонецЕсли;
	
	НастройкиОрганизации = Справочники.НастройкиПодключенияКОнлайнЗаказам.НастройкиОрганизации(
		Организация);
	
	Результат = Новый Структура;
	Результат.Вставить(
		"НастройкиПодключения",
		НастройкиОрганизации.ИспользуемыеНастройки);
	
	Возврат Результат;
	
КонецФункции

// Формирует новое описание колонки товаров онлайн-заказа.
//
// Возвращаемое значение:
//  Структура - содержит описание онлайн-заказа:
//    * Идентификатор - Строка - уникальный идентификатор колонки.
//    * Представление - Строка - представление колонки пользователю (шапка табличной части).
//    * ПорядокОтображения - Число - Порядок отображения колонок пользователю, упорядочивание по возрастанию.
//    * Видимость - Булево - признак видимости колонки пользователю.
//
Функция НоваяКолонкаТовары() Экспорт
	
	Возврат ОнлайнЗаказыСлужебный.НоваяКолонкаТовары();
	
КонецФункции

// Возвращает список команд печати для переданного объекта метаданных.
//
// Параметры:
//  ОснованиеЗаказа - ОбъектМетаданных - объект метаданных документа в информационной базе,
//    являющегося основанием для заказа, для которого необходимо получить перечень команд печати.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - перечень команд печати:
//   * Идентификатор - Строка - идентификатор команды печати, по которому менеджер печати определяет печатную форму,
//     которую необходимо сформировать. Например, "СчетЗаказ".
//   * Представление - Строка - представление команды в меню Печать. Например, "Счет на оплату".
//   * МенеджерПечати - Строка - имя объекта, в модуле менеджера которого располагается
//     процедура Печать, формирующая табличные документы для этой команды.
//   * ТипыОбъектовПечати - Массив - список типов объектов, для которых предназначена команда
//     печати.
//   * Обработчик - Строка - клиентский обработчик команды, в который необходимо передать
//     управление вместо стандартного обработчика команды Печать.
//   * Порядок - Число - Значение от 1 до 100, указывающее порядок размещения команды
//     по отношению к другим командам.
//   * Картинка - Картинка - Картинка, которая отображается возле команды в меню Печать.
//     Например, БиблиотекаКартинок.ФорматPDF.
//   * СписокФорм - Строка - Имена форм через запятую, в которых отображается
//     команда.
//   * МестоРазмещения - Строка - Имя группы формы, в которой размещается
//     команда печати.
//   * ЗаголовокФормы - Строка - Произвольная строка, переопределяющая стандартный заголовок
//     формы "Печать документов". Например, "Настраиваемый комплект".
//   * ФункциональныеОпции - Строка - Имена функциональных опций через запятую, от которых зависит
//     доступность команды печати.
//   * УсловияВидимости - Массив -  Коллекция условий видимости команды в зависимости от
//     контекста.
//   * ПроверкаПроведенияПередПечатью - Булево - Признак необходимости проверки проведенности
//     документов перед печатью.
//   * СразуНаПринтер - Булево - Признак необходимости печати документов без предварительного
//     просмотра, сразу на принтер.
//   * ФорматСохранения - Строка - Применяется для быстрого сохранения печатной
//     формы (без дополнительных действий) в различные форматы, отличные от mxl.
//   * ПереопределитьПользовательскиеНастройкиКоличества - Булево - (необязательный) Признак необходимости отключения в
//     форме ПечатьДокументов механизма сохранения/восстановления выбранного
//     пользователем количества экземпляров на печать.
//   * ДополнитьКомплектВнешнимиПечатнымиФормами - Булево - (необязательный) Признак необходимости дополнить комплект
//     документов всеми подключенными к объекту внешними печатными формами
//     (подсистема ДополнительныеОтчетыИОбработки).
//   * ФиксированныйКомплект - Булево -  Признак необходимости блокировки от изменения пользователем
//     состава комплекта документов.
//   * ДополнительныеПараметры - Структура - произвольные параметры для передачи в менеджер печати.
//   * НеВыполнятьЗаписьВФорме - Булево  - Признак необходимости отключения механизма записи объекта
//     перед выполнением команды печати.
//   * ТребуетсяРасширениеРаботыСФайлами - Булево - Признак необходимости подключения расширения для работы 
//     с 1С:Предприятием перед выполнением команды.
//
Функция КомандыПечатиОбъектаДоступныеДляВложений(ОснованиеЗаказа) Экспорт
	
	ИмяФункции = "ОнлайнЗаказы.КомандыПечатиОбъектаДоступныеДляВложений";
	
	ОбщегоНазначенияКлиентСервер.ПроверитьПараметр(
		ИмяФункции,
		"ОснованиеЗаказа",
		ОснованиеЗаказа,
		Тип("ОбъектМетаданных"));
	
	Возврат УправлениеПечатью.КомандыПечатиОбъектаДоступныеДляВложений(ОснованиеЗаказа);
	
КонецФункции

// Создает описание настроек описания полей настройки онлайн-заказов.
//
// Параметры:
//  НастройкаПодключения - СправочникСсылка.НастройкиПодключенияКОнлайнЗаказам, Неопределено - ссылка на элемент справочника,
//    параметры которого нужно получить. Неопределено, если нужно записать новый элемент.
//
// Возвращаемое значение:
//  Структура - описание настроек:
//    * ОбщиеПараметры - Массив из Структура - содержит описание общих реквизитов справочника
//        "НастройкиПодключенияКОнлайнЗаказам".
//      ** Организация - ОпределяемыйТип.Организация - организация,
//           для которой создается/обновляется настройка подключения.
//      ** ПредставлениеОрганизации - Строка - представление организации на странице онлайн-заказов.
//      ** Используется - Булево - признак использования настройки.
//    * ПриемОплатОтФизическихЛиц - Массив Из Структура - описание способов приема оплат от физических лиц:
//      ** Идентификатор - Строка - имя поля,отвечающего за прием оплат от физических лиц.
//           Может принимать значения: "СБП", "ИнтернетЭквайринг", "ОзонПэй", "ОблачнаяКасса", "ПоРеквизитам", в зависимости
//           от внедренных подсистем.
//      ** Синоним - Строка - представление поля для пользователя.
//      ** Тип - ОписаниеТипов - тип значения поля, отвечающего за прием оплат от физических лиц.
//      ** Порядок - Число - рекомендуемый порядок размещения способов оплат в группе, поля с меньшими значениями выводятся раньше.
//      ** НастройкаПодключения - Ссылка, Неопределено - ссылка на настройку подключения, Неопределено в случае если Идентификатор = "ПоРеквизитам".
//      ** Используется - Булево - признак использования способа приема оплат.
//      ** ПараметрыВыбора - ФиксированныйМассив Из ПараметрВыбора - содержит параметры выбора настройки подключения
//    * ПриемОплатОтЮридическихЛиц - Массив Из Структура - описание способов приема оплат от юридических лиц:
//      ** Идентификатор - Строка - имя поля,отвечающего за прием оплат от юридических лиц.
//           Может принимать значения: "СБП", "ПоРеквизитам", в зависимости от внедренных подсистем.
//      ** Синоним - Строка - представление поля для пользователя.
//      ** Тип - ОписаниеТипов - тип значения поля, отвечающего за прием оплат от юридических лиц.
//      ** Порядок - Число - рекомендуемый порядок размещения способов оплат в группе, поля с меньшими значениями выводятся раньше.
//      ** НастройкаПодключения - Ссылка, Неопределено - ссылка на настройку подключения, Неопределено в случае если Идентификатор = "ПоРеквизитам"
//      ** Используется - Булево - признак использования способа приема оплат.
//      ** ПараметрыВыбора - ФиксированныйМассив Из ПараметрВыбора - содержит параметры выбора настройки подключения
//
Функция ПараметрыНастройкиПодключения(НастройкаПодключения) Экспорт
	
	Возврат ОнлайнЗаказыСлужебный.ПараметрыНастройкиПодключения(НастройкаПодключения);
	
КонецФункции

// Создает описание параметров для записи настройки онлайн-заказов.
//
// Возвращаемое значение:
//  Структура - результат создания описания параметров:
//    * ОбщиеПараметры - Массив из Структура - содержит описание общих реквизитов справочника
//        "НастройкиПодключенияКОнлайнЗаказам".
//      ** Организация - ОпределяемыйТип.Организация - организация,
//           для которой создается/обновляется настройка подключения.
//      ** ПредставлениеОрганизации - Строка - представление организации на странице онлайн-заказов.
//      ** Используется - Булево - признак использования настройки.
//    * ПриемОплатОтФизическихЛиц - Массив Из Структура - описание способов приема оплат от физических лиц.
//      ** Идентификатор - Строка - имя поля,отвечающего за прием оплат.
//           Может принимать значения: "СБП", "ИнтернетЭквайринг", "ОзонПэй", "ОблачнаяКасса", "ПоРеквизитам";,
//      ** НастройкаПодключения - Ссылка, Неопределено - ссылка на настройку подключения, 
//           Неопределено в случае если Идентификатор = "ПоРеквизитам"
//       ** Используется - Булево - признак использования способа приема оплат.
//    * ПриемОплатОтЮридическихЛиц - Массив Из Структура - описание способов приема оплат от юридических лиц.
//      ** Идентификатор - Строка - имя поля,отвечающего за прием оплат.
//           Может принимать значения: "СБП", "ПоРеквизитам";
//      ** НастройкаПодключения - Ссылка, Неопределено - ссылка на настройку подключения, 
//           Неопределено в случае если Идентификатор = "ПоРеквизитам"
//      ** Используется - Булево - признак использования способа приема оплат.
//
Функция НовыйПараметрыНастройкиПодключения() Экспорт
	
	Возврат ОнлайнЗаказыСлужебный.НовыйПараметрыНастройкиПодключения();
	
КонецФункции

// Создает/обновляет элемент справочника НастройкиПодключенияКОнлайнЗаказам,
//   возвращается структура с результатом выполнения операции.
//
// Параметры:
//  НастройкаПодключения - СправочникСсылка.НастройкиПодключенияКОнлайнЗаказам, Неопределено - ссылка на элемент справочника,
//    данные которого нужно записать. Неопределено, если нужно записать новый элемент.
//  ПараметрыНастройки - Структура - см.НовыйПараметрыНастройкиПодключения.
//
// Возвращаемое значение:
//  Структура - результат добавления:
//    * НастройкаПодключения - СправочникСсылка.НастройкиПодключенияКОнлайнЗаказам - 
//        ссылка на созданную/обновленную настройку.
//    * Ошибка - Булево - Истина, если задание завершено с ошибкой.
//    * СообщениеОбОшибке  - Строка, ФорматированнаяСтрока - сообщение об ошибке для пользователя.
//    * ИнформацияОбОшибке - Строка, ФорматированнаяСтрока - сообщение об ошибке для администратора.
//
Функция ЗаписатьНастройкуПодключения(НастройкаПодключения, ПараметрыНастройки) Экспорт
	
	Если Не НастройкаОнлайнЗаказовДоступна() Тогда
		ВызватьИсключение НСтр("ru = 'Нарушение прав доступа. Пользователю запрещено изменение настроек подключения Онлайн-заказов.
			|Обратитесь к администратору.'");
	КонецЕсли;
	
	ИмяФункции = "ОнлайнЗаказы.ИдентификаторыНастройки";
	
	ОжидаемыеТипы = Новый Массив;
	ОжидаемыеТипы.Добавить(Тип("СправочникСсылка.НастройкиПодключенияКОнлайнЗаказам"));
	ОжидаемыеТипы.Добавить(Тип("Неопределено"));
	
	ОбщегоНазначенияКлиентСервер.ПроверитьПараметр(
		ИмяФункции,
		"НастройкаПодключения",
		НастройкаПодключения,
		ОжидаемыеТипы);
		
	Возврат ОнлайнЗаказыСлужебный.ЗаписатьНастройкуПодключения(
		НастройкаПодключения,
		ПараметрыНастройки);
	
КонецФункции

// Возвращает идентификаторы по переданной настройке подключения.
// Перед вызовом вызывающий код должен устанавливать привилегированный режим.
//
// Параметры:
//  НастройкаПодключения - СправочникСсылка.НастройкиПодключенияКОнлайнЗаказам - ссылка на настройку
//    подключения к онлайн-заказам.
//
// Возвращаемое значение:
//  Структура - данные идентификаторов:
//    * Идентификатор - Строка - уникальный идентификатор настройки в сервисе
//    * ХешНастроек - Строка - хеш настройки, рассчитанный сервисом
//    * ТокенАутентификации - Строка - токен аутентификации пользователя в сервисе
//
Функция ИдентификаторыНастройки(НастройкаПодключения) Экспорт
	
	Если Не ПривилегированныйРежим() Тогда
		ВызватьИсключение НСтр("ru = 'Получение идентификаторов недоступно.'");
	КонецЕсли;
	
	ИмяФункции = "ОнлайнЗаказы.ИдентификаторыНастройки";
	
	ОбщегоНазначенияКлиентСервер.ПроверитьПараметр(
		ИмяФункции,
		"НастройкаПодключения",
		НастройкаПодключения,
		Тип("СправочникСсылка.НастройкиПодключенияКОнлайнЗаказам"));
	
	Если Не ОнлайнЗаказыДоступны()
		И Не НастройкаОнлайнЗаказовДоступна() Тогда
		ВызватьИсключение НСтр("ru = 'Нарушение прав доступа. Пользователю запрещено чтение настроек подключения Онлайн-заказов.
			|Обратитесь к администратору.'");
	КонецЕсли;
	
	Возврат ОнлайнЗаказыСлужебный.ИдентификаторыНастройки(НастройкаПодключения);
	
КонецФункции

// Записывает данные новых онлайн-заказов, созданных в виджете оплат.
//
// Параметры:
//  ДанныеЗаказов - Соответствие - содержит в себе данные новых онлайн-заказов
//    * Ключ - СправочникСсылка.НастройкиПодключенияКОнлайнЗаказам -настройка подключения,
//        по которой были созданы онлайн-заказы.
//    * Значение - Соответствие - содержит в себе данные новых онлайн-заказов
//      ** Ключ - ОпределяемыйТип.ДокументОнлайнЗаказаБИП - документ в информационной базе,
//         являющийся основанием для онлайн-заказа.
//      ** Значение - Строка - идентификатор онлайн-заказа
//
// Возвращаемое значение:
//  Структура - результат записи:
//    * Ошибка - Булево - Истина, если задание завершено с ошибкой.
//    * СообщениеОбОшибке - Строка, Форматированная строка - сообщение об ошибке для пользователя.
//    * ИнформацияОбОшибке - Строка, Форматированная строка - сообщение об ошибке для администратора.
//
Функция ДобавитьОплаченныеЗаказы(ДанныеЗаказов) Экспорт
	
	ИмяФункции = "ОнлайнЗаказы.ДобавитьОплаченныеЗаказы";
	
	ОбщегоНазначенияКлиентСервер.ПроверитьПараметр(
		ИмяФункции,
		"ДанныеЗаказов",
		ДанныеЗаказов,
		Новый ОписаниеТипов("Соответствие"));
	
	Если Не ОнлайнЗаказыДоступны() Тогда
		ВызватьИсключение НСтр("ru = 'Нарушение прав доступа. Пользователю запрещена работа с онлайн-заказами.'");
	КонецЕсли;
	
	Возврат ОнлайнЗаказыСлужебный.ДобавитьЗаказы(ДанныеЗаказов);
	
КонецФункции

#КонецОбласти