#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	
	Методы.Вставить("СоздатьДокументыПланирования", Истина);
	Методы.Вставить("СоздатьДокументыОплаты", Истина);
	
КонецПроцедуры

// Создает документы планирования расхода денежных средств на основании выплат сотрудникам.
//
// Параметры:
//   РеквизитыДокумента - Структура - реквизиты для заполняемых документов
//   ВыплатыСотрудникам - Массив из Структура - информация о выплате
//
// Возвращаемое значение:
//    Соответствие из КлючИЗначение:
//		* Ключ - СправочникСсылка.Сотрудники
//		* Значение - Структура
Функция СоздатьДокументыПланирования(РеквизитыДокумента, ВыплатыСотрудникам) Экспорт

	СозданныеДокументы = Новый Соответствие;
	ЭтоВыплатаВКассу = (РеквизитыДокумента.СпособВыплаты = Перечисления.ТипыДенежныхСредств.Наличные);
		
	Для Каждого СтрокаСотрудник Из ВыплатыСотрудникам Цикл
		СтруктураРезультат = Новый Структура;
		СтруктураРезультат.Вставить("Документ", Неопределено);
		СтруктураРезультат.Вставить("Статус", -1);
		СтруктураРезультат.Вставить("Ошибки", Новый Массив);
		СозданныеДокументы.Вставить(СтрокаСотрудник.Сотрудник, СтруктураРезультат);
		
		Если ЗначениеЗаполнено(СтрокаСотрудник.ДокументПланирования) Тогда
			СтруктураРезультат.Ошибки.Добавить(НСтр("ru = 'Заявка на расход денег уже создана'"));
			Продолжить;
		КонецЕсли;
		
		ДокументПланирования = СоздатьДокументОплаты("РасходДСПлан", СтрокаСотрудник.Сотрудник,
			РеквизитыДокумента.ПлатежнаяВедомость, СтруктураРезультат.Ошибки);
		Если ДокументПланирования = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ДокументПланирования.Дата = РеквизитыДокумента.Дата;
		ДокументПланирования.Организация = РеквизитыДокумента.Организация;
		ДокументПланирования.Ведомость = РеквизитыДокумента.ПлатежнаяВедомость;
		ДокументПланирования.ТипДенежныхСредств = РеквизитыДокумента.СпособВыплаты;
		Если ЭтоВыплатаВКассу Тогда
			ДокументПланирования.Касса = РеквизитыДокумента.Касса;
		Иначе
			ДокументПланирования.БанковскийСчет = РеквизитыДокумента.БанковскийСчет;
			ДокументПланирования.СчетКонтрагента = СтрокаСотрудник.БанковскийСчет;
		КонецЕсли;
		ДокументПланирования.ПериодРегистрации = РеквизитыДокумента.ПериодРегистрации;
		ДокументПланирования.ВидОперации = Перечисления.ВидыОперацийРасходДСПлан.ЗарплатаСотруднику;
		ДокументПланирования.СуммаДокумента = СтрокаСотрудник.СуммаВыплаты;
		ДокументПланирования.СтатьяДвиженияДенежныхСредств = РеквизитыДокумента.Статья;
		
		Попытка
			ДокументПланирования.Записать(РежимЗаписиДокумента.Запись);
			СтруктураРезультат.Документ = ДокументПланирования.Ссылка;
			СтруктураРезультат.Статус = СтатусДенежногоДокументаДляОтображения(ДокументПланирования.Ссылка,
				Ложь, Ложь);
		Исключение
			СтруктураРезультат.Документ = Неопределено;
			ЗарегистрироватьОшибку(СтрокаСотрудник.Сотрудник, СтруктураРезультат.Ошибки, ИнформацияОбОшибке());
		КонецПопытки;
		СтруктураРезультат.Статус = СтатусДенежногоДокументаДляОтображения(ДокументПланирования.Ссылка,
			Ложь, Ложь);
	КонецЦикла;
	
	ПровестиДокументы(СозданныеДокументы);
	
	Возврат СозданныеДокументы;
	
КонецФункции

// Создает документы планирования расхода денежных средств на основании выплат сотрудникам.
//
// Параметры:
//   РеквизитыДокумента - Структура - реквизиты для заполняемых документов
//   ВыплатыСотрудникам - Массив из Структура - информация о выплате
//
// Возвращаемое значение:
//    Соответствие из КлючИЗначение:
//		* Ключ - СправочникСсылка.Сотрудники
//		* Значение - Структура:
//			** Документ - ДокументСсылка
//			** Ошибки - Массив из Строка
Функция СоздатьДокументыОплаты(РеквизитыДокумента, ВыплатыСотрудникам) Экспорт

	СозданныеДокументы = Новый Соответствие;
	
	НазначениеПлатежа = НСтр("ru = 'Для зачисления на счет сотрудника %1
	|Заработная плата за %2 г.
	|Сумма %3
	|Без налога (НДС)'");
	ПредставлениеПериода = ЗарплатаИПерсоналКлиентСервер.ПредставлениеПериодаРегистрации(
		РеквизитыДокумента.ПериодРегистрации);
	ЭтоВыплатаВКассу = (РеквизитыДокумента.СпособВыплаты = Перечисления.ТипыДенежныхСредств.Наличные);
	РеквизитыОрганизации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(РеквизитыДокумента.Организация,
		"ИНН, КПП, ЮридическоеФизическоеЛицо");
	
	ЗаполнятьВедомости = Справочники.Организации.НужноПоказыватьЭлементыБЗКБДляОрганизации(
		РеквизитыДокумента.Организация);
	ИспользоватьДокументПланирования = ПолучитьФункциональнуюОпцию("ПлатежныйКалендарь");
	
	Для Каждого СтрокаСотрудник Из ВыплатыСотрудникам Цикл
		
		СтруктураРезультат = Новый Структура;
		СтруктураРезультат.Вставить("Документ", Неопределено);
		СтруктураРезультат.Вставить("Статус", -1);
		СтруктураРезультат.Вставить("Ошибки", Новый Массив);
		СозданныеДокументы.Вставить(СтрокаСотрудник.Сотрудник, СтруктураРезультат);
		
		Если ЗначениеЗаполнено(СтрокаСотрудник.ДокументВыплаты) Тогда
			СтруктураРезультат.Ошибки.Добавить(НСтр("ru = 'Документ выплаты уже создан'"));
			Продолжить;
		КонецЕсли;
		
		Если НЕ ЭтоВыплатаВКассу И НЕ ЗначениеЗаполнено(СтрокаСотрудник.БанковскийСчет) Тогда
			СтруктураРезультат.Ошибки.Добавить(НСтр("ru = 'Не указан банковский счет'"));
			Продолжить;
		КонецЕсли;
		
		Если ИспользоватьДокументПланирования И ЗначениеЗаполнено(СтрокаСотрудник.ДокументПланирования) Тогда
			ОснованиеВыплаты = СтрокаСотрудник.ДокументПланирования;
		Иначе
			ОснованиеВыплаты = РеквизитыДокумента.ПлатежнаяВедомость;
		КонецЕсли;
		
		СтрокаВедомостьРегл = Неопределено;
		Если ЭтоВыплатаВКассу Тогда
			ДокументОплаты = СоздатьДокументОплаты("РасходИзКассы", СтрокаСотрудник.Сотрудник, ОснованиеВыплаты,
				СтруктураРезультат.Ошибки);
			Если ДокументОплаты = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			ДокументОплаты.Касса = РеквизитыДокумента.Касса;
			ДокументОплаты.ВидОперации = Перечисления.ВидыОперацийРасходИзКассы.ЗарплатаСотруднику;

			Если ЗначениеЗаполнено(РеквизитыДокумента.ВедомостьВКассу) Тогда
				СтрокаВедомостьРегл = ДокументОплаты.ВыплатаРегламентированнойЗаработнойПлаты.Добавить();
				СтрокаВедомостьРегл.Ведомость = РеквизитыДокумента.ВедомостьВКассу;
			КонецЕсли;

		Иначе
			
			ДокументОплаты = СоздатьДокументОплаты("ПлатежноеПоручение", СтрокаСотрудник.Сотрудник, ОснованиеВыплаты,
				СтруктураРезультат.Ошибки);
			Если ДокументОплаты = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			ДокументОплаты.БанковскийСчет = РеквизитыДокумента.БанковскийСчет;
			ДокументОплаты.СчетКонтрагента = СтрокаСотрудник.БанковскийСчет;
			ДокументОплаты.ВидОперации = Перечисления.ВидыОперацийПлатежноеПоручение.ЗарплатаСотруднику;
			ДокументОплаты.ОчередностьПлатежа = 3;
			ДокументОплаты.ИННПлательщика = РеквизитыОрганизации.ИНН;
			Если РеквизитыОрганизации.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо Тогда
				ДокументОплаты.КПППлательщика = РеквизитыОрганизации.КПП;
			КонецЕсли;
			Если ЗначениеЗаполнено(РеквизитыДокумента.ВедомостьВБанк) Тогда
				СтрокаВедомостьРегл = ДокументОплаты.ВыплатаРегламентированнойЗаработнойПлаты.Добавить();
				СтрокаВедомостьРегл.Ведомость = РеквизитыДокумента.ВедомостьВБанк;
			КонецЕсли;
			ПредставлениеСуммы = Формат(СтрокаСотрудник.СуммаВыплаты, "ЧЦ=15; ЧДЦ=2; ЧРД=-; ЧН=0-00; ЧГ=");
			ДокументОплаты.НазначениеПлатежа = СтрШаблон(НазначениеПлатежа, СтрокаСотрудник.Сотрудник,
				ПредставлениеПериода, ПредставлениеСуммы);
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(ДокументОплаты, РеквизитыДокумента);
		ДокументОплаты.СуммаДокумента = СтрокаСотрудник.СуммаВыплаты;
		
		Если ЗаполнятьВедомости Тогда
			Если ДокументОплаты.ВыплатаЗаработнойПлаты.Количество() = 0 Тогда
				СтрокаВедомостьУпр = ДокументОплаты.ВыплатаЗаработнойПлаты.Добавить();
				СтрокаВедомостьУпр.Ведомость = РеквизитыДокумента.ПлатежнаяВедомость;
			Иначе
				СтрокаВедомостьУпр = ДокументОплаты.ВыплатаЗаработнойПлаты[0];
			КонецЕсли;
			СтрокаВедомостьУпр.СуммаПлатежа = СтрокаСотрудник.СуммаВыплаты;
			СтрокаВедомостьУпр.ДокументПланирования = СтрокаСотрудник.ДокументПланирования;
			
			Если СтрокаВедомостьРегл <> Неопределено Тогда
				СтрокаВедомостьРегл.СуммаПлатежа = СтрокаСотрудник.СуммаВыплаты;
			КонецЕсли;
		КонецЕсли;
		
		Попытка
			ДокументОплаты.Записать(РежимЗаписиДокумента.Запись);
			СтруктураРезультат.Документ = ДокументОплаты.Ссылка;
			СтруктураРезультат.Статус = СтатусДенежногоДокументаДляОтображения(ДокументОплаты.Ссылка, Ложь, Ложь);
		Исключение
			СтруктураРезультат.Документ = Неопределено;
			ЗарегистрироватьОшибку(СтрокаСотрудник.Сотрудник, СтруктураРезультат.Ошибки, ИнформацияОбОшибке());
		КонецПопытки;
	КонецЦикла;
	
	// ПлатежноеПоручение не проводится
	Если ЭтоВыплатаВКассу Тогда
		ПровестиДокументы(СозданныеДокументы);
	КонецЕсли;
	
	Возврат СозданныеДокументы;

КонецФункции

// Возвращает числовой статус денежного документа для использования при отображении.
//
// Параметры:
//   ДокументСсылка - ДокументСсылка - ссылка на денежный документ
//   Проведен - Булево
//   ПомеченНаУдаление - Булево
//
// Возвращаемое значение:
//   Число - числовой статус документа для отображения
Функция СтатусДенежногоДокументаДляОтображения(ДокументСсылка, Проведен, ПомеченНаУдаление) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ДокументСсылка) Тогда
		Возврат -1;
	КонецЕсли;
	
	Если ПомеченНаУдаление Тогда
		Возврат 3;
	КонецЕсли;
	
	Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ПлатежноеПоручение") Тогда
		Возврат 2;
	КонецЕсли;
	
	Если Проведен Тогда
		Возврат 1;
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СоздатьДокументОплаты(ТипДокумента, Сотрудник, ОснованиеВыплатыУпр, Ошибки)

	Попытка
		ДокументОбъект = Документы[ТипДокумента].СоздатьДокумент();
		ДокументОбъект.Заполнить(ОснованиеВыплатыУпр);
		ДокументОбъект.Подотчетник = Сотрудник;
	Исключение
		ДокументОбъект = Неопределено;
		ЗарегистрироватьОшибку(Сотрудник, Ошибки, ИнформацияОбОшибке());
	КонецПопытки;
	
	Возврат ДокументОбъект;

КонецФункции

Процедура ПровестиДокументы(ДокументыПоСотрудникам)
	
	Для Каждого Элемент Из ДокументыПоСотрудникам Цикл
		Если НЕ ЗначениеЗаполнено(Элемент.Значение.Документ) Тогда
			Продолжить;
		КонецЕсли;
		
		ДокументОбъект = Элемент.Значение.Документ.ПолучитьОбъект();
		Попытка
			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
			Элемент.Значение.Статус = СтатусДенежногоДокументаДляОтображения(ДокументОбъект.Ссылка, Истина, Ложь);
		Исключение
			ЗарегистрироватьОшибку(Элемент.Ключ, Элемент.Значение.Ошибки, ИнформацияОбОшибке());
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗарегистрироватьОшибку(Сотрудник, Ошибки, ИнформацияОбОшибке)
	
	КраткоеПредставление = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке);
	Ошибки.Добавить(КраткоеПредставление);
	
	ПодробноеПредставление = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке); 
	ТекстОшибки = НСтр("ru = 'Ошибка при создании документа для сотрудника %1: %2'");
	ПодробноеОписание = СтрШаблон(ТекстОшибки, Сотрудник, ПодробноеПредставление); 
	ЗаписьЖурналаРегистрации("Зарплата и персонал.Создание выплат зарплаты",
		УровеньЖурналаРегистрации.Ошибка, , , ПодробноеОписание);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли