///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2026, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////


////////////////////////////////////////////////////////////////////////////////
// Подсистема "Маг1С"
// ОбщийМодуль.Маг1СКлиентСерверПереопределяемый
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Возвращает индетификатор расширения mag1c в Каталоге расширений 
//
// Возвращаемое значение:
//  Строка
//
Функция ИдентификаторРасширения() Экспорт
	Возврат "mag1cДляУНФ";
КонецФункции

// Возвращает имя фукнциональной опции, от которой должна зависеть видимость команд установки 
// расширения mag1c
//
// Возвращаемое значение:
//  Строка
//
Функция ИмяПроверямойФункциональнойОпции() Экспорт
	Возврат "";
КонецФункции

#КонецОбласти
