#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЧтениеОбъектаРазрешено(Ссылка)";
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ТипыЗаявокДляВыбора() Экспорт

	ТипЗаявкиМенеджер = Перечисления.ТипыЗаявокКабинетСотрудника;
	
	ТипыЗаявок = Новый Массив;
	ТипыЗаявок.Добавить(ТипЗаявкиМенеджер.Отпуск);
	ТипыЗаявок.Добавить(ТипЗаявкиМенеджер.ОтпускБезОплаты);
	ТипыЗаявок.Добавить(ТипЗаявкиМенеджер.ЗаявлениеНаНалоговыеВычеты);
	Если ИнтеграцияБЗКБУНФ.ДоступнаСправка2НДФЛ_БЗКБ() Тогда
		ТипыЗаявок.Добавить(ТипЗаявкиМенеджер.СправкаНДФЛ);
	КонецЕсли;
	Если ИнтеграцияБЗКБУНФ.ДоступныДокументыСЭДО() Тогда
		ТипыЗаявок.Добавить(ТипЗаявкиМенеджер.Болезнь);
		ТипыЗаявок.Добавить(ТипЗаявкиМенеджер.ОтпускПоБеременностиИРодам);
	КонецЕсли;
	ТипыЗаявок.Добавить(ТипЗаявкиМенеджер.ИзменениеЛичныхДанных);
	ТипыЗаявок.Добавить(ТипЗаявкиМенеджер.ОбращениеСотрудника);
	Если ИнтеграцияБЗКБУНФ.ДоступныДокументыСЭДО() Тогда
		ТипыЗаявок.Добавить(ТипЗаявкиМенеджер.ПособиеПриРожденииРебенка);
		ТипыЗаявок.Добавить(ТипЗаявкиМенеджер.ЕжемесячноеПособиеПоУходуЗаРебенком);
		ТипыЗаявок.Добавить(ТипЗаявкиМенеджер.ВозвратИзОтпускаПоУходуЗаРебенком);
	КонецЕсли;
	ТипыЗаявок.Добавить(ТипЗаявкиМенеджер.ЗаявлениеВПроизвольнойФорме);
	ТипыЗаявок.Добавить(ТипЗаявкиМенеджер.ЗаявлениеОСпособеВыплатыЗарплаты);
	
	Возврат ТипыЗаявок;

КонецФункции

#КонецОбласти

#КонецЕсли
