#Область ПрограммныйИнтерфейс

// Форма списка, в которой устанавливается отбор.
//
// Параметры:
//  ЭтотОбъект - Форма - Справочник.ОчередьЭлектронныхЧековКОтправке.ФормаСписка
//  Список - ДинамическийСписок
//
Процедура ПриОткрытииСпискаОчереди(ЭтотОбъект, Список) Экспорт
	
	ОбщегоНазначенияБПОКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список, 
		"ПроизошлаОшибкаПередачи", 
		ЭтотОбъект.ОтборПоОшибкам,
		ВидСравненияКомпоновкиДанных.Равно,
		, 
		ЭтотОбъект.ОтборПоОшибкам);
	
	РассылкаЭлектронныхЧековКлиентПереопределяемый.ПриОткрытииСпискаОчереди(ЭтотОбъект, Список);
	
КонецПроцедуры

#КонецОбласти

