#Область СлужебныйПрограммныйИнтерфейс

// Формирование строки подключения к сервису.
// 
// Параметры:
//  ВидЭТП - ПеречислениеСсылка.ВидыЭлектронныхТорговыхПлощадок - Вид ЭТП
//  РазделУчета - строка - "Поставщики" или "Покупатели"
// 
// Возвращаемое значение:
//  Строка - Строка подключения к сервису этп
Функция СтрокаПодключенияКСервису(ВидЭТП, РазделУчета) Экспорт
	
	Параметры = Новый Структура;
	Параметры.Вставить("ВидЭТП", ВидЭТП);
	Параметры.Вставить("РазделУчета", РазделУчета);
	
	ДанныеДляПодключения = ИнтеграцияСЭлектроннымиТорговымиПлощадками.ПараметрыРаботыССервисомАвторизации(Параметры);
	
	СтрокаПодключения = ДанныеДляПодключения.Протокол + "://" + ДанныеДляПодключения.Сервер;
	Если ДанныеДляПодключения.Порт <> "" Тогда
	 	СтрокаПодключения = СтрокаПодключения + ":"+ДанныеДляПодключения.Порт;
	КонецЕсли;

	Возврат СтрокаПодключения;
КонецФункции

// Проверить связь с ЭТП Бидзаар в фоне.
// 
// Параметры:
//  ПараметрыОперации - Структура - Параметры операции
// 
// Возвращаемое значение:
//  Неопределено, Структура - см. ДлительныеОперации.ВыполнитьВФоне
//
Функция ПроверитьСвязьСЭТПБидзаарВФоне(ПараметрыОперации) Экспорт

	ВидЭТП = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыОперации, "ВидЭТП");

	Если ВидЭТП = Перечисления.ВидыЭлектронныхТорговыхПлощадок.БидзаарПокупатели Тогда
		УстановитьПривилегированныйРежим(Истина);
		Если Не Константы.ИспользоватьИнтеграциюСЭТПБидзаарДляПокупателей.Получить() Тогда
			Возврат Неопределено;
		КонецЕсли;
		УчетнаяЗапись = Справочники.УчетныеЗаписиЭлектронныхТорговыхПлощадок.УчетнаяЗаписьОрганизации(ВидЭТП,
			ПараметрыОперации.Организация);
		УстановитьПривилегированныйРежим(Ложь);
		Если УчетнаяЗапись = Справочники.УчетныеЗаписиЭлектронныхТорговыхПлощадок.ПустаяСсылка() Тогда
			Возврат Неопределено;
		Иначе
			ПараметрыОперации.Вставить("УчетнаяЗапись", УчетнаяЗапись);
		КонецЕсли;
	ИначеЕсли ВидЭТП = Перечисления.ВидыЭлектронныхТорговыхПлощадок.БидзаарПоставщики Тогда
		УстановитьПривилегированныйРежим(Истина);
		Если Не Константы.ИспользоватьИнтеграциюСЭТПБидзаарДляПоставщиков.Получить() Тогда
			Возврат Неопределено;
		КонецЕсли;
		УстановитьПривилегированныйРежим(Ложь);
	Иначе
		Возврат Неопределено;
	КонецЕсли;

	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Проверка связи с ЭТП Бидзаар'");
	ПараметрыВыполнения.ОжидатьЗавершение = 0;
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;
	
	Если ВидЭТП = Перечисления.ВидыЭлектронныхТорговыхПлощадок.БидзаарПокупатели Тогда
		ДлительныеОперации.ВыполнитьВФоне(
			"ИнтеграцияСЭлектроннымиТорговымиПлощадками.ПроверитьСвязьСЭТПБидзаарДляПокупателей",
			ПараметрыОперации, ПараметрыВыполнения);
	ИначеЕсли ВидЭТП = Перечисления.ВидыЭлектронныхТорговыхПлощадок.БидзаарПоставщики Тогда
		ДлительныеОперации.ВыполнитьВФоне(
			"ИнтеграцияСЭлектроннымиТорговымиПлощадками.ПроверитьСвязьСЭТПБидзаарДляПоставщиков",
			ПараметрыОперации, ПараметрыВыполнения);
	Иначе
		Возврат Неопределено;
	КонецЕсли;

КонецФункции

// Формирует фоновое задание, позволяющее опубликовать запрос коммерческих предложений
// 
// Параметры:
//  ЗапросКоммерческихПредложений - ДокументСсылка.ЗапросКоммерческихПредложенийПоставщиков - публикуемый документ
// 
// Возвращаемое значение:
//  Структура - см. описание ДлительныеОперации.ВыполнитьВФоне
//
Функция ПубликацияЗапросаКоммерческихПредложенийБидзаарВФоне(Знач ЗапросКоммерческихПредложений, ПубликоватьПрисоединенныеФайлы) Экспорт
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Публикация запроса коммерческих предложений.'");
	ПараметрыВыполнения.КлючФоновогоЗадания = XMLСтрока(ЗапросКоммерческихПредложений);
	ПараметрыВыполнения.ОжидатьЗавершение = 0;
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;

	ПараметрыОперации = Новый Структура;
	ПараметрыОперации.Вставить("ЗапросКоммерческихПредложений", ЗапросКоммерческихПредложений);
	ПараметрыОперации.Вставить("ПубликоватьПрисоединенныеФайлы", ПубликоватьПрисоединенныеФайлы);

	Возврат ДлительныеОперации.ВыполнитьВФоне(
		"ИнтеграцияСЭлектроннымиТорговымиПлощадками.ПубликацияЗапросаКоммерческихПредложенийБидзаар",
		ПараметрыОперации, ПараметрыВыполнения);
	
КонецФункции

// Запрос текущих состояний опубликованных документов бидзаар в фоне.
// 
// Параметры:
//  ОпубликованныеДокументы - Массив из ДокументСсылка.ЗапросКоммерческихПредложенийПоставщиков - опубликованные документы
// 
// Возвращаемое значение:
//  Структура - см. описание ДлительныеОперации.ВыполнитьВФоне
// 
Функция ЗапросТекущихСостоянийОпубликованныхДокументовБидзаарВФоне(ОпубликованныеДокументы) Экспорт
	
	ИдентификаторФормы = Новый УникальныйИдентификатор;
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(ИдентификаторФормы);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Запрос текущих состояний опубликованных документов.'");
	ПараметрыВыполнения.КлючФоновогоЗадания = Строка(ИдентификаторФормы);
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;
		
	ПараметрыОперации = Новый Структура;
	ПараметрыОперации.Вставить("ОпубликованныеДокументы", ОпубликованныеДокументы);
	ПараметрыОперации.Вставить("ТолькоПобедители", Истина);
	
	Возврат ДлительныеОперации.ВыполнитьВФоне(
		"ИнтеграцияСЭлектроннымиТорговымиПлощадками.ЗапросТекущихСостоянийОпубликованныхДокументовБидзаар",
		ПараметрыОперации,
		ПараметрыВыполнения);
	
КонецФункции

// Запускает в фоновом задании получение данных коммерческих предложений по запросу Бидзаар.
//
// Параметры:
//   ЗапросКоммерческихПредложений - ДокументСсылка.ЗапросКоммерческихПредложенийПоставщиков - запрос коммерческих предложений
//
// Возвращаемое значение:
//   Структура - см. описание ДлительныеОперации.ВыполнитьВФоне
//
Функция ПолучениеДанныхКоммерческихПредложенийПоЗапросуБидзаарВФоне(Знач ЗапросКоммерческихПредложений) Экспорт
	
	ИдентификаторФормы = Новый УникальныйИдентификатор;
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(ИдентификаторФормы);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Получение данных коммерческих предложений по запросу Бидзаар.'");
	ПараметрыВыполнения.КлючФоновогоЗадания = XMLСтрока(ЗапросКоммерческихПредложений);
	ПараметрыВыполнения.ОжидатьЗавершение = 0;
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;

	ПараметрыОперации = Новый Структура("ЗапросКоммерческихПредложений", ЗапросКоммерческихПредложений);

	Возврат ДлительныеОперации.ВыполнитьВФоне(
		"ИнтеграцияСЭлектроннымиТорговымиПлощадками.ПолучениеДанныхКоммерческихПредложенийПоЗапросуБидзаар",
		ПараметрыОперации,
		ПараметрыВыполнения);
		
КонецФункции

// Получение данных участников по запросу бидзаар в фоне.
// 
// Параметры:
//  ЗапросКоммерческихПредложений - ДокументСсылка.ЗапросКоммерческихПредложенийПоставщиков
//  ТолькоПобедители - Булево - Только победители
// 
// Возвращаемое значение:
//  Структура - см. ДлительныеОперации.ВыполнитьВФоне
//
Функция ПолучениеДанныхУчастниковПоЗапросуБидзаарВФоне(Знач ЗапросКоммерческихПредложений, ТолькоПобедители) Экспорт

	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Получение данных участников по запросу Бидзаар.'");
	ПараметрыВыполнения.КлючФоновогоЗадания = XMLСтрока(ЗапросКоммерческихПредложений);
	ПараметрыВыполнения.ОжидатьЗавершение = 0;
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;

	ПараметрыОперации = Новый Структура("ЗапросКоммерческихПредложений, ТолькоПобедители",
		ЗапросКоммерческихПредложений, ТолькоПобедители);

	Возврат ДлительныеОперации.ВыполнитьВФоне(
		"ИнтеграцияСЭлектроннымиТорговымиПлощадками.ПолучениеДанныхУчастниковПоЗапросуБидзаар",
		ПараметрыОперации,
		ПараметрыВыполнения);

КонецФункции

// Получить вид ЭТП по разделу учета или раздел учета по виду ЭТП.
// 
// Параметры:
//  Параметр - ПеречислениеСсылка.ВидыЭлектронныхТорговыхПлощадок, Строка - Соответствующий возвращаемому значению
//  ПолучитьВидЭТП - Булево - Истина (вид ЭТП), Ложь (раздел учета)
// 
// Возвращаемое значение:
//  ПеречислениеСсылка.ВидыЭлектронныхТорговыхПлощадок, Строка - Вид ЭТП или раздел учета
Функция ПолучитьВидЭТПИлиРазделУчета(Параметр, ПолучитьВидЭТП = Истина) Экспорт
	Возврат ИнтеграцияСЭлектроннымиТорговымиПлощадками.ПолучитьВидЭТПИлиРазделУчета(Параметр, ПолучитьВидЭТП = Истина);
КонецФункции

// Доступно право настройки авторизации бидзаар.
// 
// Возвращаемое значение:
//  Булево - Доступно право настройки авторизации бидзаар
Функция ДоступноПравоНастройкиАвторизацииБидзаар() Экспорт
	Возврат ИнтеграцияСЭлектроннымиТорговымиПлощадками.ДоступноПравоНастройкиАвторизацииБидзаар();
КонецФункции

#КонецОбласти