////////////////////////////////////////////////////////////////////////////////
// ПечатьРеквизитовОрганизации: процедуры и функции для печати карточки организации и настройки ее вывода
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает табличный документ - карточки реквизитов организации.
// Карточки формируются по сохраненным настройкам и сведениям.
//
// Параметры:
//  МассивОбъектов - Массив из СправочникСсылка.Организации
//  ОбъектыПечати - см. УправлениеПечатьюПереопределяемый.ПриПечати.ОбъектыПечати
// 
// Возвращаемое значение:
//  ТабличныйДокумент - карточка реквизитов организации
//
Функция Печать(МассивОбъектов, ОбъектыПечати) Экспорт
	
	НаборНастроекИСведений = Новый Массив;
	
	Для Каждого Организация Из МассивОбъектов Цикл
		
		Настройки = НастройкиПечати(Организация);
		//@skip-check query-in-loop  --- Получение сведений выполняется запросом в цикле по организациям
		Сведения = СведенияДляПечати(Организация, Настройки.РасчетныеСчета);
		ЭлементНабора = НовыйЭлементНабораНастроекИСведений(Организация, Настройки, Сведения);
		НаборНастроекИСведений.Добавить(ЭлементНабора);
		
	КонецЦикла;
	
	ТабличныйДокумент = РеквизитыОрганизации(НаборНастроекИСведений, ОбъектыПечати);
	
	Возврат ТабличныйДокумент;
	
КонецФункции

// Возвращает табличный документ - карточку реквизитов организации, построенную по переданным настройкам и сведениям.
// Используется для формирования карточки по уже полученным ранее настройкам и сведениям.
//
// Параметры:
//  Организация - СправочникСсылка.Организации
//  НастройкиРеквизитов - ДеревоЗначений: см. НовоеДеревоНастроекПечати
//  Сведения - Структура: см. НовыйСведенияОбОрганизации
//  ОбъектыПечати - см. УправлениеПечатьюПереопределяемый.ПриПечати.ОбъектыПечати
// 
// Возвращаемое значение:
//  ТабличныйДокумент - карточка реквизитов организации
//
Функция ПечатьПоНастройкамИСведениям(Организация, НастройкиРеквизитов, Сведения, ОбъектыПечати) Экспорт
	
	НаборНастроекИСведений = Новый Массив;
	
	ЭлементНабора = НовыйЭлементНабораНастроекИСведений(Организация, НастройкиРеквизитов, Сведения);
	НаборНастроекИСведений.Добавить(ЭлементНабора);
		
	ТабличныйДокумент = РеквизитыОрганизации(НаборНастроекИСведений, ОбъектыПечати);
	
	Возврат ТабличныйДокумент;
	
КонецФункции

// Возвращает структуру настроек для вывода печатной формы реквизитов организации,
// заполненное согласно настройкам текущего пользователя или по-умолчанию.
// Если у текущего пользователя нет своих настроек, вернутся настройки по-умолчанию.
//
// Параметры:
//  Организация - СправочникСсылка.Организации
//  ПоУмолчанию - Булево - заполнить настройками по-умолчанию
//  ИдентификаторДругойОрганизации - Строка - Идентификатор организации, чью настройку хотим скопировать
//
// Возвращаемое значение:
//  Структура: см. СтандартныеНастройкиПечати
//
Функция НастройкиПечати(Организация, ПоУмолчанию = Ложь, ИдентификаторДругойОрганизации = "") Экспорт
	
	СтандартныеНастройки = СтандартныеНастройкиПечати(Организация);
	
	Если ПоУмолчанию Тогда
		Возврат СтандартныеНастройки;
	КонецЕсли;
	
	Настройки = ОбщегоНазначения.СкопироватьРекурсивно(СтандартныеНастройки);
	
	НастройкиЗаполнены = Ложь;
	
	ЗаполнениеПоДругойОрганизации = Ложь;
	Если ЗначениеЗаполнено(ИдентификаторДругойОрганизации) Тогда
		ИдентификаторОрганизации = ИдентификаторДругойОрганизации;
		ЗаполнениеПоДругойОрганизации = Истина;
	Иначе
		ИдентификаторОрганизации = Строка(Организация.УникальныйИдентификатор());
	КонецЕсли;
	
	ЗаполнитьНастройкиПечатиИзПользовательскихНастроекПоКлючу(
		Настройки, ИдентификаторОрганизации, СтандартныеНастройки, НастройкиЗаполнены, ЗаполнениеПоДругойОрганизации);
	
	Возврат Настройки;
	
КонецФункции

// Записывает дерево настроек для вывода печатной формы реквизитов организации.
//
// Параметры:
//  Настройки - Структура: см. СтандартныеНастройкиПечати
//  Организация - СправочникСсылка.Организации
//
Процедура ЗаписатьНастройкиПечати(Настройки, Организация) Экспорт
	
	ИдентификаторОрганизации = Строка(Организация.УникальныйИдентификатор());
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(КлючОбъектаНастроек(),
		ИдентификаторОрганизации,
		Настройки);
	
КонецПроцедуры

// Данные для заполнения печатной формы реквизитов организации
//
// Параметры:
//  Организация - СправочникСсылка.Организации
//  РасчетныеСчета - Массив из СправочникСсылка.БанковскиеСчета
//
// Возвращаемое значение:
//  Структура: см. НовыйСведенияОбОрганизации
//
Функция СведенияДляПечати(Организация, РасчетныеСчета) Экспорт
	
	СведенияОбОрганизации = НовыйСведенияОбОрганизации();
	
	ТекущаяДата = ОбщегоНазначения.ТекущаяДатаПользователя();
	СведенияОбОрганизации.Дата = ТекущаяДата;
	
	РеквизитыОрганизации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
		Организация, 
		"БанковскийСчетПоУмолчанию, ФайлЛоготип, ФайлФаксимильнаяПечать, 
		|ПодписьРуководителя, ПодписьРуководителя.Факсимиле, ПодписьРуководителя.ФизическоеЛицо,
		|ПодписьРуководителя.Должность, ПодписьРуководителя.РасшифровкаПодписи,
		|ПодписьГлавногоБухгалтера, ПодписьГлавногоБухгалтера.Факсимиле, ПодписьГлавногоБухгалтера.ФизическоеЛицо,
		|ПодписьГлавногоБухгалтера.Должность, ПодписьГлавногоБухгалтера.РасшифровкаПодписи,
		|НаименованиеСокращенное");
	
	БанковскийСчет = Неопределено;
	Если Не ЗначениеЗаполнено(РасчетныеСчета) Тогда
		БанковскийСчетПоУмолчанию = РеквизитыОрганизации.БанковскийСчетПоУмолчанию;
		Если Не ЗначениеЗаполнено(БанковскийСчетПоУмолчанию) Тогда
			ВалютаРеглУчета = УправлениеНебольшойФирмойПовтИсп.ПолучитьВалютуУчета();
			БанковскиеСчетаОрганизации = Справочники.БанковскиеСчета.БанковскиеСчетаОрганизации(Организация, ВалютаРеглУчета);
			Если БанковскиеСчетаОрганизации.Количество() = 1 Тогда
				БанковскийСчет = БанковскиеСчетаОрганизации[0].Ссылка;
				РасчетныеСчета.Добавить(БанковскийСчет);
			КонецЕсли;
		Иначе
			РасчетныеСчета.Добавить(БанковскийСчетПоУмолчанию);
		КонецЕсли;
	КонецЕсли;
		
	СведенияОЮрФизЛице = ПечатьДокументовУНФ.СведенияОЮрФизЛице(Организация, ТекущаяДата, , БанковскийСчет);
		
	ЗаполнитьЗначенияСвойств(СведенияОбОрганизации, СведенияОЮрФизЛице);
	ЗаполнитьСведенияОРасчетныхСчетах(СведенияОбОрганизации.СведенияОРасчетныхСчетах, РасчетныеСчета);	
	
	Если Не ЗначениеЗаполнено(СведенияОбОрганизации.СокращенноеНаименование) Тогда
		СведенияОбОрганизации.СокращенноеНаименование = РеквизитыОрганизации.НаименованиеСокращенное;
	КонецЕсли;
	
	СведенияОбОрганизации.Email = СведенияОЮрФизЛице.ЭлектроннаяПочта;
			
	Если ЗначениеЗаполнено(РеквизитыОрганизации.ФайлЛоготип) Тогда
		ФайлЛоготип = РаботаСФайлами.ДвоичныеДанныеФайла(РеквизитыОрганизации.ФайлЛоготип);
		СведенияОбОрганизации.Логотип = ФайлЛоготип;
	КонецЕсли;
	Если ЗначениеЗаполнено(РеквизитыОрганизации.ФайлФаксимильнаяПечать) Тогда
		ФайлПечать  = РаботаСФайлами.ДвоичныеДанныеФайла(РеквизитыОрганизации.ФайлФаксимильнаяПечать);
		СведенияОбОрганизации.Печать = ФайлПечать;
	КонецЕсли;
	Если ЗначениеЗаполнено(РеквизитыОрганизации.ПодписьРуководителяФаксимиле) Тогда
		ФайлПодпись = РаботаСФайлами.ДвоичныеДанныеФайла(РеквизитыОрганизации.ПодписьРуководителяФаксимиле);	
		СведенияОбОрганизации.Подпись = ФайлПодпись;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(РеквизитыОрганизации.ПодписьРуководителя) Тогда
		Должность = РеквизитыОрганизации.ПодписьРуководителяДолжность;
		Если Не ЗначениеЗаполнено(Должность) Тогда
			Должность = НСтр("ru = 'Руководитель'");
		КонецЕсли;
		
		СведенияОбОрганизации.РуководительФамилияИО = РеквизитыОрганизации.ПодписьРуководителяРасшифровкаПодписи;
			
		РуководительДанные = РеквизитСтруктурой(Должность, РеквизитыОрганизации.ПодписьРуководителяФизическоеЛицо);
		СведенияОбОрганизации.РуководительДанные = РуководительДанные;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(РеквизитыОрганизации.ПодписьГлавногоБухгалтера) Тогда
		Должность = РеквизитыОрганизации.ПодписьГлавногоБухгалтераДолжность;
		Если Не ЗначениеЗаполнено(Должность) Тогда
			Должность = НСтр("ru = 'Главный бухгалтер'");
		КонецЕсли;
			
		ГлавныйБухгалтерДанные = РеквизитСтруктурой(Должность, РеквизитыОрганизации.ПодписьГлавногоБухгалтераФизическоеЛицо);
		СведенияОбОрганизации.ГлавныйБухгалтерДанные = ГлавныйБухгалтерДанные;
	КонецЕсли;
		
	ПоляСведений = СтрРазделить("ОКТМО, ОКПО, ОКВЭД2, НаимГоловнОрг, СистемыНалогообложения", ", ", Ложь);
	Сведения = РегламентированнаяОтчетностьВызовСервера.ПолучитьСведенияОбОрганизации(Организация, ТекущаяДата, ПоляСведений);
	
	СведенияОбОрганизации.ОКТМО = Сведения.ОКТМО;
	СведенияОбОрганизации.ОКПО = Сведения.ОКПО;
	СведенияОбОрганизации.ОКВЭД = Сведения.ОКВЭД2;
	СведенияОбОрганизации.ГоловнаяОрганизация = Сведения.НаимГоловнОрг;
	
	ТекущаяСистемаНалогообложения = УчетнаяПолитика.СистемаНалогообложения(Организация, ТекущаяДата);
	Если ЗначениеЗаполнено(ТекущаяСистемаНалогообложения.СистемаНалогообложения) Тогда
		ПредставлениеНалогообложения = Строка(ТекущаяСистемаНалогообложения.СистемаНалогообложения);
	Иначе 
		ПредставлениеНалогообложения = "";
	КонецЕсли;
	Если УчетнаяПолитика.ПрименяетсяУСНЗаПериод(Организация, ТекущаяДата, ТекущаяДата) Тогда
		НДС = НСтр("ru = ', Без НДС'");
		Если УчетнаяПолитика.ПлательщикНДСПрименяющийУСН(Организация, ТекущаяДата) Тогда
			СтавкаНДС = УчетНДСВызовСервера.СтавкаНДСПоОрганизации(Организация, ТекущаяДата);
			НДС = СтрШаблон(НСтр("ru = ', НДС %1'"), СтавкаНДС);
		КонецЕсли;
		ПредставлениеНалогообложения = ПредставлениеНалогообложения + НДС;
	КонецЕсли;
	Если УчетнаяПолитика.ПлательщикНДС(Организация, ТекущаяДата)
		И УчетнаяПолитика.ПрименяетсяОсвобождениеОтУплатыНДС(Организация, ТекущаяДата) Тогда
		ПредставлениеНалогообложения = СтрШаблон(НСтр("ru = '%1 (освобождение от НДС по ст. 145 НК РФ)'"),
			ПредставлениеНалогообложения);
	КонецЕсли;
	СведенияОбОрганизации.Налогообложение = ПредставлениеНалогообложения;
	
	ДопРеквизитыИСведения = Новый Соответствие;
	ДанныеЗначенийДопСвойств = УправлениеСвойствами.ЗначенияСвойств(Организация);
	Для Каждого ЗначениеДопСвойства Из ДанныеЗначенийДопСвойств Цикл
		ДопРеквизитыИСведения.Вставить(ЗначениеДопСвойства.ИмяСвойства, ЗначениеДопСвойства.Представление);
	КонецЦикла;
	СведенияОбОрганизации.ДопРеквизитыИСведения = ДопРеквизитыИСведения;
	
	СведенияОбОрганизации.ДатаРегистрации = Формат(СведенияОбОрганизации.ДатаРегистрации, "ДЛФ=D");
	
	ИдентификаторыЭДО = Новый Соответствие;
	ДанныеУчетныхЗаписейЭДО = ОбменСКонтрагентами.ДанныеУчетныхЗаписейЭДООрганизации(Организация);
	Для Каждого ДанныеЭДО Из ДанныеУчетныхЗаписейЭДО Цикл
		ЗаписьДанныхЭДО = РеквизитСтруктурой(ДанныеЭДО.ПредставлениеОператора, ДанныеЭДО.ИдентификаторЭДО);
		ИдентификаторыЭДО.Вставить(ДанныеЭДО.ИдентификаторЭДО, ЗаписьДанныхЭДО);
	КонецЦикла;
	СведенияОбОрганизации.Вставить("ИдентификаторыЭДО", ИдентификаторыЭДО);
	
	Возврат СведенияОбОрганизации;
	
КонецФункции

// Конструктор формирования дерева настроек печати реквизитов организации
//
// Возвращаемое значение:
//   ДеревоЗначений:
//      * Группа - Строка - имя группы реквизитов, определяет область макета
//      * Представление - Строка - определяет представление группы или реквизита в настройках и печатной форме
//      * Реквизит - Строка - имя реквизита
//      * ИмяНабораСведений - Строка - имя поля в СведенияОбОрганизации, в котором хранятся динамические данные
//          , такие как дополнительные реквизиты и сведения подсистемы Свойства
//      * Печатать - Булево - выводить реквизит на печать
//
Функция НовоеДеревоНастроекПечати() Экспорт
	
	Результат = Новый ДеревоЗначений;
	ТипСтрока100 = ОбщегоНазначения.ОписаниеТипаСтрока(100);
	ТипСтрока30 = ОбщегоНазначения.ОписаниеТипаСтрока(30);
	ТипБулево = Новый ОписаниеТипов("Булево");
	
	Результат.Колонки.Добавить("Группа", ТипСтрока30); 
	Результат.Колонки.Добавить("Представление", ТипСтрока100);
	Результат.Колонки.Добавить("Реквизит", ТипСтрока100);
	Результат.Колонки.Добавить("ИмяНабораСведений", ТипСтрока100);
	Результат.Колонки.Добавить("Печатать", ТипБулево);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция РеквизитыОрганизации(НаборНастроекИСведений, ОбъектыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Справочник.Организации.ПФ_MXL_Реквизиты");
	
	ПервыйДокумент = Истина;
	
	Для Каждого ЭлементНабора Из НаборНастроекИСведений Цикл
	
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		РеквизитыОрганизации = РеквизитыОрганизацииПоНастройкамИСведениям(
			ЭлементНабора.Настройки,
			ЭлементНабора.Сведения,
			Макет);
		
		ТабличныйДокумент.Вывести(РеквизитыОрганизации);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент,
			НомерСтрокиНачало,
			ОбъектыПечати,
			ЭлементНабора.Организация);
		
	КонецЦикла;
	
	ТабличныйДокумент.ПолеСверху = 20;
	ТабличныйДокумент.ПолеСнизу = 20;
	ТабличныйДокумент.ПолеСлева = 20;
	ТабличныйДокумент.ПолеСправа = 20;
	
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_Организация_КарточкаОрганизации";
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция РеквизитыОрганизацииПоНастройкамИСведениям(Настройки, Сведения, Макет)
	
	РеквизитыОрганизации = Новый ТабличныйДокумент;
	
	НастройкиРеквизитов = Настройки.НастройкиРеквизитов;
	
	Если Не ЗначениеЗаполнено(НастройкиРеквизитов) Или Не ЗначениеЗаполнено(Сведения) Тогда
		Возврат РеквизитыОрганизации;
	КонецЕсли;
	
	Для Каждого СтрокаГруппы Из НастройкиРеквизитов.Строки Цикл
		
		Если Не СтрокаГруппы.Печатать Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтрокаГруппы.Группа = "Заголовок" Тогда
			Заголовок = СформироватьЗаголовок(СтрокаГруппы, Макет, Сведения);
			РеквизитыОрганизации.Вывести(Заголовок);
		КонецЕсли;
		
		НаименованиеГруппы = Новый ТабличныйДокумент;
		Если ВыводитьНаименованиеГруппы(СтрокаГруппы) Тогда
			НаименованиеГруппы = СформироватьНаименованиеГруппы(СтрокаГруппы, Макет);
		КонецЕсли;
		
		Если ЭтоГруппаРеквизитов(СтрокаГруппы) Тогда
			
			Если СтрокаГруппы.Группа = "РасчетныйСчет" Тогда
				
				Компактно = Настройки.КомпактноеОтображениеСчетов;
				
				РасчетныеСчетаОбщий = Новый ТабличныйДокумент;
				Если Компактно Тогда
					// в табличный документ строку будем присоединять области, пока они помещаются на страницу,
					// потом выведем ее в общий табличный документ и создадим новую строку
					РасчетныеСчетаСтрока = Новый ТабличныйДокумент;
				КонецЕсли;
				
				Для Каждого Счет Из Настройки.РасчетныеСчета Цикл
					СведенияОСчете = Сведения.СведенияОРасчетныхСчетах.Получить(Счет);
					Если СведенияОСчете <> Неопределено Тогда
						Реквизиты = СформироватьРеквизиты(СтрокаГруппы, Макет, СведенияОСчете, Компактно);	
						Если Реквизиты.ВысотаТаблицы > 0 Тогда
							
							Если Компактно Тогда
								ПрисоединяемыеОбласти = Новый Массив;
								ПрисоединяемыеОбласти.Добавить(Реквизиты);
								
								Если РасчетныеСчетаСтрока.ПроверитьПрисоединение(ПрисоединяемыеОбласти) Тогда
									РасчетныеСчетаСтрока.Присоединить(Реквизиты);
								Иначе
									РасчетныеСчетаСтрока.Область().СоздатьФорматСтрок();
									РасчетныеСчетаОбщий.Вывести(РасчетныеСчетаСтрока);
									
									РасчетныеСчетаСтрока = Новый ТабличныйДокумент;
									РасчетныеСчетаСтрока.Присоединить(Реквизиты);
								КонецЕсли;
							Иначе
								РасчетныеСчетаОбщий.Вывести(НаименованиеГруппы);
								РасчетныеСчетаОбщий.Вывести(Реквизиты);
							КонецЕсли;
							
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
				
				Если Компактно Тогда
					РасчетныеСчетаСтрока.Область().СоздатьФорматСтрок();
					РасчетныеСчетаОбщий.Вывести(РасчетныеСчетаСтрока);
				КонецЕсли;
				
				Если РасчетныеСчетаОбщий.ВысотаТаблицы > 0 Тогда
					Если Компактно Тогда
						РасчетныеСчетаОбщий.Область().СоздатьФорматСтрок();
					
						// при компактном выводе заголовок группы один на все счета
						РеквизитыОрганизации.Вывести(НаименованиеГруппы);
					КонецЕсли;
	
					РеквизитыОрганизации.Вывести(РасчетныеСчетаОбщий);
				КонецЕсли;
				
			Иначе
				
				Реквизиты = СформироватьРеквизиты(СтрокаГруппы, Макет, Сведения);
				Если Реквизиты.ВысотаТаблицы > 0 Тогда
					РеквизитыОрганизации.Вывести(НаименованиеГруппы);
					РеквизитыОрганизации.Вывести(Реквизиты);
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если СтрокаГруппы.Группа = "ПечатьИПодпись" Тогда
			ПечатьИПодпись = СформироватьПечатьИПодпись(СтрокаГруппы, Макет, Сведения);
			РеквизитыОрганизации.Вывести(ПечатьИПодпись);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат РеквизитыОрганизации;
	
КонецФункции

Функция ВыводитьНаименованиеГруппы(СтрокаГруппы)
	
	ИменаГрупп = Новый Массив;
	ИменаГрупп.Добавить("ЮридическиеДанные");
	ИменаГрупп.Добавить("РасчетныйСчет");
	ИменаГрупп.Добавить("АдресаИКонтакты");
	ИменаГрупп.Добавить("Дополнительно");
	ИменаГрупп.Добавить("ИдентификаторыЭДО");
	
	Возврат ИменаГрупп.Найти(СтрокаГруппы.Группа) <> Неопределено;
	
КонецФункции

Функция ЭтоГруппаРеквизитов(СтрокаГруппы)
	
	ИменаГрупп = Новый Массив;
	ИменаГрупп.Добавить("Главное");
	ИменаГрупп.Добавить("ЮридическиеДанные");
	ИменаГрупп.Добавить("РасчетныйСчет");
	ИменаГрупп.Добавить("АдресаИКонтакты");
	ИменаГрупп.Добавить("Дополнительно");
	ИменаГрупп.Добавить("ИдентификаторыЭДО");
	
	Возврат ИменаГрупп.Найти(СтрокаГруппы.Группа) <> Неопределено;
	
КонецФункции

// Формирует настройки печати реквизитов организации в зависимости от её вида.
//
// Параметры:
//   Организация - СправочникСсылка.Организации - организация, для которой формируются настройки
//
// Возвращаемое значение:
//   Структура:
//     * РасчетныеСчета - Массив из СправочникСсылка.БанковскиеСчета - массив расчетных счетов организации
//     * НастройкиРеквизитов - ДеревоЗначений - дерево настроек для печати реквизитов организации
//     * КомпактноеОтображениеСчетов - Булево - признак компактного отображения счетов
//
Функция СтандартныеНастройкиПечати(Организация)
	
	Результат = Новый Структура;
	Результат.Вставить("РасчетныеСчета", Новый Массив);
	Результат.Вставить("НастройкиРеквизитов");	
	Результат.Вставить("КомпактноеОтображениеСчетов", Ложь);
	
	НастройкиРеквизитов = НовоеДеревоНастроекПечати();
	
	ВидОрганизации = ВидОрганизации(Организация);
	
	ВидОрганизацииСамозанятый = ВидОрганизацииСамозанятый();
	ВидОрганизацииИП = ВидОрганизацииИндивидуальныйПредприниматель();
	ВидОрганизацииЮрЛицо = ВидОрганизацииЮридическоеЛицо();
	ВидОрганизацииОбособленноеПодразделение = ВидОрганизацииОбособленноеПодразделение();
	
	ГруппаЗаголовок = ДобавитьГруппуНастроек(НастройкиРеквизитов, "Заголовок", НСтр("ru = 'Заголовок'"), Истина);
	ДобавитьСтрокуНастроек(ГруппаЗаголовок, НСтр("ru = 'Дата'"), "Дата", , Истина);
	ДобавитьСтрокуНастроек(ГруппаЗаголовок, НСтр("ru = 'Логотип'"), "Логотип", , Истина);
	ДобавитьСтрокуНастроек(ГруппаЗаголовок, НСтр("ru = 'Наименование'"), "ПолноеНаименование", , Истина);
	
	// Главное
	ГруппаГлавное = ДобавитьГруппуНастроек(НастройкиРеквизитов, "Главное", НСтр("ru = 'Главное'"), Истина);
	Если ВидОрганизации = ВидОрганизацииСамозанятый Тогда
		ДобавитьСтрокуНастроек(ГруппаГлавное, НСтр("ru = 'ФИО'"), "ПолноеНаименование", , Истина);
	Иначе
		ДобавитьСтрокуНастроек(ГруппаГлавное, НСтр("ru = 'Сокращенное наименование'"), "СокращенноеНаименование", , Истина);
		ДобавитьСтрокуНастроек(ГруппаГлавное, НСтр("ru = 'Полное наименование'"), "ПолноеНаименование", , Истина);
	КонецЕсли;
	ДобавитьСтрокуНастроек(ГруппаГлавное, НСтр("ru = 'ИНН'"), "ИНН", , Истина);
	Если ВидОрганизации = ВидОрганизацииЮрЛицо Или ВидОрганизации = ВидОрганизацииОбособленноеПодразделение Тогда
		ДобавитьСтрокуНастроек(ГруппаГлавное, НСтр("ru = 'КПП'"), "КПП", , Истина);
		ДобавитьСтрокуНастроек(ГруппаГлавное, НСтр("ru = 'Руководитель'"), "РуководительДанные", , Истина);
		ДобавитьСтрокуНастроек(ГруппаГлавное, НСтр("ru = 'Главный бухгалтер'"), "ГлавныйБухгалтерДанные", , Ложь);
	КонецЕсли;
	
	// ЮридическиеДанные
	ГруппаЮридическиеДанные = ДобавитьГруппуНастроек(
		НастройкиРеквизитов, "ЮридическиеДанные", НСтр("ru = 'Юридические данные'"), Истина);
	Если ВидОрганизации = ВидОрганизацииОбособленноеПодразделение Тогда
		ДобавитьСтрокуНастроек(ГруппаЮридическиеДанные, НСтр("ru = 'Головная организация'"), "ГоловнаяОрганизация", , Истина);
	КонецЕсли;
	Если ВидОрганизации = ВидОрганизацииИП Тогда
		ДобавитьСтрокуНастроек(ГруппаЮридическиеДанные, НСтр("ru = 'Свидетельство'"), "Свидетельство", , Истина);
		ДобавитьСтрокуНастроек(ГруппаЮридическиеДанные, НСтр("ru = 'ОГРНИП'"), "ОГРН", , Истина);
		ДобавитьСтрокуНастроек(ГруппаЮридическиеДанные, НСтр("ru = 'ОКВЭД'"), "ОКВЭД", , Истина);			
	КонецЕсли;
	
	Если Не ВидОрганизации = ВидОрганизацииСамозанятый Тогда
		ДобавитьСтрокуНастроек(ГруппаЮридическиеДанные, НСтр("ru = 'ОКПО'"), "ОКПО", , Истина);
		Если ВидОрганизации = ВидОрганизацииЮрЛицо Или ВидОрганизации = ВидОрганизацииОбособленноеПодразделение Тогда
			ДобавитьСтрокуНастроек(ГруппаЮридическиеДанные, НСтр("ru = 'ОГРН'"), "ОГРН", , Истина);
		КонецЕсли;
		ДобавитьСтрокуНастроек(ГруппаЮридическиеДанные, НСтр("ru = 'Дата регистрации'"), "ДатаРегистрации", , Истина);
	КонецЕсли;
	ДобавитьСтрокуНастроек(ГруппаЮридическиеДанные, НСтр("ru = 'ОКТМО'"), "ОКТМО", , Истина);
	ДобавитьСтрокуНастроек(ГруппаЮридическиеДанные, НСтр("ru = 'Налогообложение'"), "Налогообложение", , Ложь);
		
	// РасчетныйСчет	
	ГруппаРасчетныйСчет = ДобавитьГруппуНастроек(НастройкиРеквизитов, "РасчетныйСчет", НСтр("ru = 'Расчетный счет'"), Истина);
	ДобавитьСтрокуНастроек(ГруппаРасчетныйСчет, НСтр("ru = 'Номер счета'"), "НомерСчета", , Истина);
	ДобавитьСтрокуНастроек(ГруппаРасчетныйСчет, НСтр("ru = 'Банк'"), "Банк", , Истина);
	ДобавитьСтрокуНастроек(ГруппаРасчетныйСчет, НСтр("ru = 'БИК'"), "БИК", , Истина);
	ДобавитьСтрокуНастроек(ГруппаРасчетныйСчет, НСтр("ru = 'Корр. счет'"), "КоррСчет", , Истина);
	
	ГруппаКонтакты = ДобавитьГруппуНастроек(НастройкиРеквизитов, "АдресаИКонтакты", НСтр("ru = 'Адреса и контакты'"), Истина);
	ДобавитьСтрокуНастроек(ГруппаКонтакты, НСтр("ru = 'Юридический адрес'"), "ЮридическийАдрес", , Истина);
	Если ВидОрганизации = ВидОрганизацииЮрЛицо Или ВидОрганизации = ВидОрганизацииОбособленноеПодразделение Тогда
		ДобавитьСтрокуНастроек(ГруппаКонтакты, НСтр("ru = 'Фактический адрес'"), "ФактическийАдрес");
	КонецЕсли;
	ДобавитьСтрокуНастроек(ГруппаКонтакты, НСтр("ru = 'Почтовый адрес'"), "ПочтовыйАдрес");
	ДобавитьСтрокуНастроек(ГруппаКонтакты, НСтр("ru = 'Телефон'"), "Телефоны", , Истина);
	ДобавитьСтрокуНастроек(ГруппаКонтакты, НСтр("ru = 'Электронная почта'"), "Email", , Ложь);
	
	// ИдентификаторыЭДО
	ГруппаИдентификаторыЭДО = ДобавитьГруппуНастроек(
		НастройкиРеквизитов, "ИдентификаторыЭДО", НСтр("ru = 'Идентификаторы ЭДО'"));
	ДанныеУчетныхЗаписейЭДО = ОбменСКонтрагентами.ДанныеУчетныхЗаписейЭДООрганизации(Организация);
	Для Каждого ДанныеЭДО Из ДанныеУчетныхЗаписейЭДО Цикл
		Представление = ДанныеЭДО.НаименованиеУчетнойЗаписи;
		Реквизит = ДанныеЭДО.ИдентификаторЭДО;
		ДобавитьСтрокуНастроек(ГруппаИдентификаторыЭДО, Представление, Реквизит, "ИдентификаторыЭДО");
	КонецЦикла;
	
	// Дополнительно
	ГруппаДополнительно = ДобавитьГруппуНастроек(НастройкиРеквизитов, "Дополнительно", НСтр("ru = 'Дополнительно'"));
		
	ДопРеквизитыИСведения = УправлениеСвойствами.СвойстваОбъекта(Справочники.Организации.ПустаяСсылка());
	Для Каждого Свойство Из ДопРеквизитыИСведения Цикл
		ДобавитьСтрокуНастроек(ГруппаДополнительно, Свойство.Наименование, Свойство.Имя, "ДопРеквизитыИСведения");
	КонецЦикла;
	
	// ПечатьИПодпись
	ДобавитьГруппуНастроек(НастройкиРеквизитов, "ПечатьИПодпись", НСтр("ru = 'Печать и подпись'"));
	
	Результат.НастройкиРеквизитов = НастройкиРеквизитов;
	
	Возврат Результат;
	
КонецФункции

Функция ДобавитьГруппуНастроек(Дерево, Группа, Представление, Печатать = Ложь)
	
	НоваяГруппа = Дерево.Строки.Добавить();
	НоваяГруппа.Группа = Группа;
	НоваяГруппа.Представление = Представление;
	НоваяГруппа.Печатать = Печатать;
	
	Возврат НоваяГруппа;
	
КонецФункции

Функция ДобавитьСтрокуНастроек(СтрокаГруппы, Представление, Реквизит = "", ИмяНабораСведений = "", Печатать = Ложь)
	
	НоваяСтрока = СтрокаГруппы.Строки.Добавить();
	НоваяСтрока.Группа = СтрокаГруппы.Группа;
	НоваяСтрока.Представление = Представление;
	НоваяСтрока.Реквизит = Реквизит;
	НоваяСтрока.ИмяНабораСведений = ИмяНабораСведений;
	НоваяСтрока.Печатать = Печатать;
	
	Возврат НоваяСтрока;
	
КонецФункции

Процедура ЗаполнитьНастройкиПечатиИзПользовательскихНастроекПоКлючу(Настройки, КлючНастроек, СтандартныеНастройки, 
	НастройкиЗаполнены, ЗаполнениеПоДругойОрганизации = Ложь)
	
	ПользовательскиеНастройки = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(КлючОбъектаНастроек(),
		КлючНастроек);
	
	Если ТипЗнч(ПользовательскиеНастройки) = Тип("Структура") Тогда
		
		НастройкиЗаполнены = Истина;
		Если Не ЗаполнениеПоДругойОрганизации Тогда
			ЗаполнитьЗначенияСвойств(Настройки, ПользовательскиеНастройки);
		КонецЕсли;	
		 
		Если ПользовательскиеНастройки.Свойство("НастройкиРеквизитов")
			И ТипЗнч(ПользовательскиеНастройки.НастройкиРеквизитов) = Тип("ДеревоЗначений") Тогда
			
			АктуализироватьПользовательскиеНастройкиПечати(
				ПользовательскиеНастройки.НастройкиРеквизитов, СтандартныеНастройки.НастройкиРеквизитов);
			Настройки.НастройкиРеквизитов = ПользовательскиеНастройки.НастройкиРеквизитов;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура АктуализироватьПользовательскиеНастройкиПечати(ПользовательскиеНастройки, СтандартныеНастройки)
	
	// Актуализируем пользовательские настройки по стандартным, т.к. с момента сохранения могла поменяться логика вывода
	
	// Удаляем из пользовательских настроек строки, которых больше нет в стандартных настройках
	// и обновляем представления пользовательских настроек по стандартным настройкам
	НеактуальныеГруппы = Новый Массив;
	ПараметрыОтбора = Новый Структура("Реквизит, ИмяНабораСведений");
	Для Каждого ГруппаПользовательских Из ПользовательскиеНастройки.Строки Цикл
		НеактуальныеСтроки = Новый Массив;
		ГруппаСтандартных = СтандартныеНастройки.Строки.Найти(ГруппаПользовательских.Группа, "Группа");
		Если ГруппаСтандартных = Неопределено Тогда
			НеактуальныеГруппы.Добавить(ГруппаПользовательских);
			Продолжить;
		Иначе
			ГруппаПользовательских.Представление = ГруппаСтандартных.Представление;
		КонецЕсли;
		Для Каждого СтрокаПользовательских Из ГруппаПользовательских.Строки Цикл
			ЗаполнитьЗначенияСвойств(ПараметрыОтбора, СтрокаПользовательских);
			СтрокиСтандартных = ГруппаСтандартных.Строки.НайтиСтроки(ПараметрыОтбора);
			Если СтрокиСтандартных.Количество() Тогда
				СтрокаПользовательских.Представление = СтрокиСтандартных[0].Представление;
			Иначе
				НеактуальныеСтроки.Добавить(СтрокаПользовательских);
			КонецЕсли;
		КонецЦикла;
		Для Каждого НеактуальнаяСтрока Из НеактуальныеСтроки Цикл
			ГруппаПользовательских.Строки.Удалить(НеактуальнаяСтрока);
		КонецЦикла;
	КонецЦикла;
	Для Каждого НеактуальнаяГруппа Из НеактуальныеГруппы Цикл
		ПользовательскиеНастройки.Строки.Удалить(НеактуальнаяГруппа);
	КонецЦикла;
	
	// добавляем новые строки
	Для Каждого ГруппаСтандартных Из СтандартныеНастройки.Строки Цикл
		ГруппаПользовательских = ПользовательскиеНастройки.Строки.Найти(ГруппаСтандартных.Группа, "Группа");
		Если ГруппаПользовательских = Неопределено Тогда
			ИндексСтандартных = СтандартныеНастройки.Строки.Индекс(ГруппаСтандартных);
			ГруппаПользовательских = ПользовательскиеНастройки.Строки.Вставить(ИндексСтандартных);
			ЗаполнитьЗначенияСвойств(ГруппаПользовательских, ГруппаСтандартных);
		КонецЕсли;
		Для Каждого СтрокаСтандартных Из ГруппаСтандартных.Строки Цикл
			СтрокаПользовательских = ГруппаПользовательских.Строки.Найти(СтрокаСтандартных.Реквизит, "Реквизит");
			Если СтрокаПользовательских = Неопределено Тогда
				СтрокаПользовательских = ГруппаПользовательских.Строки.Вставить(ГруппаСтандартных.Строки.Индекс(СтрокаСтандартных));
				ЗаполнитьЗначенияСвойств(СтрокаПользовательских, СтрокаСтандартных);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Функция ВидОрганизации(Организация)
	
	Результат = Неопределено;
	
	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Организация,
		"ЮридическоеФизическоеЛицо, ОбособленноеПодразделение, СтатусФизическогоЛица");
	ЭтоФизЛицо = (ЗначенияРеквизитов.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо);
	ЭтоСамозанятый = ЗначенияРеквизитов.СтатусФизическогоЛица = Перечисления.СтатусыФизическихЛиц.Самозанятый;
	ЭтоОбособленноеПодразделение = Не ЭтоФизЛицо И ЗначенияРеквизитов.ОбособленноеПодразделение;
	
	Если ЭтоФизЛицо Тогда
		Если ЭтоСамозанятый Тогда
			Результат = ВидОрганизацииСамозанятый();
		Иначе
			Результат = ВидОрганизацииИндивидуальныйПредприниматель();
		КонецЕсли;
	Иначе
		Если ЭтоОбособленноеПодразделение Тогда
			Результат = ВидОрганизацииОбособленноеПодразделение();
		Иначе
			Результат = ВидОрганизацииЮридическоеЛицо();
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ВидОрганизацииСамозанятый()
	Возврат "Самозанятый";
КонецФункции

Функция ВидОрганизацииИндивидуальныйПредприниматель()
	Возврат "ИндивидуальныйПредприниматель";
КонецФункции

Функция ВидОрганизацииОбособленноеПодразделение()
	Возврат "ОбособленноеПодразделение";
КонецФункции

Функция ВидОрганизацииЮридическоеЛицо()
	Возврат "ЮридическоеЛицо";
КонецФункции

Функция ОбластьМакетаСуществует(Макет, ИмяОбласти)
	
	Область = Макет.Области.Найти(ИмяОбласти);
	Возврат Область <> Неопределено;
	
КонецФункции

Процедура ВывестиОтступ(ТабличныйДокумент, Макет, Компактно = Ложь)
	
	ИмяОбластиМакета = СтрШаблон("Отступ%1", ?(Компактно, "Компактно", ""));
	
	Если ОбластьМакетаСуществует(Макет, ИмяОбластиМакета) Тогда
		ОбластьОтступ = Макет.ПолучитьОбласть(ИмяОбластиМакета);
		ТабличныйДокумент.Вывести(ОбластьОтступ);
	КонецЕсли;
	
КонецПроцедуры

Функция СформироватьЗаголовок(СтрокаЗаголовок, Макет, СведенияОбОрганизации)
	
	Результат = Новый ТабличныйДокумент;
	
	ВыводитьДату = Ложь;
	ВыводитьЛоготип = Ложь;
	ВыводитьНаименование = Ложь;
	Для Каждого РеквизитЗаголовка Из СтрокаЗаголовок.Строки Цикл
		Если РеквизитЗаголовка.Печатать Тогда
			Если РеквизитЗаголовка.Реквизит = "Дата" И ЗначениеЗаполнено(СведенияОбОрганизации.Дата) Тогда
				ВыводитьДату = Истина;
			КонецЕсли;
			Если РеквизитЗаголовка.Реквизит = "Логотип" И ЗначениеЗаполнено(СведенияОбОрганизации.Логотип) Тогда
				ВыводитьЛоготип = Истина;
			КонецЕсли;
			Если РеквизитЗаголовка.Реквизит = "ПолноеНаименование"
				И ЗначениеЗаполнено(СведенияОбОрганизации.ПолноеНаименование) Тогда
				ВыводитьНаименование = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если ВыводитьДату И ОбластьМакетаСуществует(Макет, "Дата") Тогда
		ОбластьДата = Макет.ПолучитьОбласть("Дата");
		ОбластьДата.Параметры.Дата = Формат(СведенияОбОрганизации.Дата, "ДЛФ=DD");
		Результат.Вывести(ОбластьДата);
	КонецЕсли;
	Если ВыводитьЛоготип И ВыводитьНаименование И ОбластьМакетаСуществует(Макет, "ЗаголовокЛоготипНаименование") Тогда
		ОбластьЗаголовок = Макет.ПолучитьОбласть("ЗаголовокЛоготипНаименование");
		ОбластьЗаголовок.Рисунки.Логотип.Картинка = Новый Картинка(СведенияОбОрганизации.Логотип);
	ИначеЕсли ВыводитьНаименование И ОбластьМакетаСуществует(Макет, "ЗаголовокНаименование") Тогда
		ОбластьЗаголовок = Макет.ПолучитьОбласть("ЗаголовокНаименование");
	ИначеЕсли ВыводитьЛоготип И ОбластьМакетаСуществует(Макет, "ЗаголовокЛоготип") Тогда
		ОбластьЗаголовок = Макет.ПолучитьОбласть("ЗаголовокЛоготип");
		ОбластьЗаголовок.Рисунки.Логотип2.Картинка = Новый Картинка(СведенияОбОрганизации.Логотип);
	Иначе
		ОбластьЗаголовок = Неопределено;
	КонецЕсли;
	
	Если ОбластьЗаголовок <> Неопределено Тогда
		ОбластьЗаголовок.Параметры.Заполнить(СведенияОбОрганизации);
		УбратьЛинииУРисунков(ОбластьЗаголовок);
		Результат.Вывести(ОбластьЗаголовок);
		ВывестиОтступ(Результат, Макет);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СформироватьНаименованиеГруппы(СтрокаГруппы, Макет)
	
	Результат = Новый ТабличныйДокумент;
	ИмяОбластиМакета = "Группа";
	
	Если Не ОбластьМакетаСуществует(Макет, ИмяОбластиМакета) Тогда
		Возврат Результат;
	КонецЕсли;
	
	ОбластьГруппа = Макет.ПолучитьОбласть(ИмяОбластиМакета);
	ОбластьГруппа.Параметры.Заполнить(СтрокаГруппы);
	Результат.Вывести(ОбластьГруппа);
	
	Возврат Результат;
	
КонецФункции

Функция СформироватьРеквизиты(СтрокаГруппы, Макет, СведенияОбОрганизации, Компактно = Ложь)
	
	Результат = Новый ТабличныйДокумент;
	ИмяОбластиМакета = СтрШаблон("Реквизит%1", ?(Компактно, "Компактно", ""));
	
	Если Не ОбластьМакетаСуществует(Макет, ИмяОбластиМакета) Тогда
		Возврат Результат;
	КонецЕсли;
	
	ОбластьРеквизит = Макет.ПолучитьОбласть(ИмяОбластиМакета);
	ЕстьСтроки = Ложь;
	Для Каждого СтрокаРеквизита Из СтрокаГруппы.Строки Цикл
		ДанныеРеквизита = ДанныеРеквизитаПоСведениямИСтрокеНастроек(СведенияОбОрганизации, СтрокаРеквизита);
		Если ДанныеРеквизита <> Неопределено Тогда
			ОбластьРеквизит.Параметры.Заполнить(ДанныеРеквизита);
			Результат.Вывести(ОбластьРеквизит);
			ЕстьСтроки = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Если ЕстьСтроки Тогда
		ВывестиОтступ(Результат, Макет, Компактно);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ДанныеРеквизитаПоСведениямИСтрокеНастроек(СведенияОбОрганизации, СтрокаНастроек)
	
	ДанныеРеквизита = Неопределено;
	
	Если Не СтрокаНастроек.Печатать Тогда
		Возврат ДанныеРеквизита;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтрокаНастроек.ИмяНабораСведений) Тогда
		НаборСведений = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СведенияОбОрганизации,
			СтрокаНастроек.ИмяНабораСведений,
			Новый Соответствие());
		ЗначениеРеквизита = НаборСведений.Получить(СтрокаНастроек.Реквизит);
	Иначе
		СведенияОбОрганизации.Свойство(СтрокаНастроек.Реквизит, ЗначениеРеквизита);
	КонецЕсли;
	Если ЗначениеЗаполнено(ЗначениеРеквизита) Тогда
		ДанныеРеквизита = РеквизитСтруктурой(СтрокаНастроек.Представление, ЗначениеРеквизита);
		Если ТипЗнч(ЗначениеРеквизита) = Тип("Структура") Тогда
			ДанныеРеквизита = РеквизитСтруктурой(ЗначениеРеквизита.НаименованиеРеквизита, ЗначениеРеквизита.ЗначениеРеквизита);
		КонецЕсли;
	КонецЕсли;
	
	Возврат ДанныеРеквизита;
	
КонецФункции

Функция СформироватьПечатьИПодпись(СтрокаПечатьИПодпись, Макет, СведенияОбОрганизации)
	
	Результат = Новый ТабличныйДокумент;
	ИмяОбластиМакета = "ПечатьИПодпись";
	
	Если Не ОбластьМакетаСуществует(Макет, ИмяОбластиМакета) Тогда
		Возврат Результат;
	КонецЕсли;
	
	ОбластьПечатьИПодпись = Макет.ПолучитьОбласть(ИмяОбластиМакета);
	ОбластьПечатьИПодпись.Рисунки.ПечатьОрганизации.Картинка = Новый Картинка(СведенияОбОрганизации.Печать);
	ОбластьПечатьИПодпись.Рисунки.ПодписьРуководителя.Картинка = Новый Картинка(СведенияОбОрганизации.Подпись);
	ОбластьПечатьИПодпись.Параметры.Заполнить(СведенияОбОрганизации);
	УбратьЛинииУРисунков(ОбластьПечатьИПодпись);
	Результат.Вывести(ОбластьПечатьИПодпись);
	ВывестиОтступ(Результат, Макет);
	
	Возврат Результат;
	
КонецФункции

Процедура УбратьЛинииУРисунков(Область)
	
	ЛинияСТипомНетЛинии = Новый Линия(ТипЛинииРисункаТабличногоДокумента.НетЛинии);
	Для Каждого Рисунок Из Область.Рисунки Цикл
		Рисунок.Линия = ЛинияСТипомНетЛинии;
	КонецЦикла;
	
КонецПроцедуры

// Возвращает структуру с данными реквизита
//
// Параметры:
//  НаименованиеРеквизита - Строка
//  ЗначениеРеквизита - Произвольный
//
// Возвращаемое значение:
//   Структура
//      * НаименованиеРеквизита
//      * ЗначениеРеквизита
//
Функция РеквизитСтруктурой(НаименованиеРеквизита, ЗначениеРеквизита)
	
	Результат = Новый Структура;
	Результат.Вставить("НаименованиеРеквизита", НаименованиеРеквизита);
	Результат.Вставить("ЗначениеРеквизита", ЗначениеРеквизита);
	
	Возврат Результат;
	
КонецФункции

Функция НовыйЭлементНабораНастроекИСведений(Организация, Настройки, Сведения)
	
	ЭлементНабора = Новый Структура("Организация, Настройки, Сведения");
	ЭлементНабора.Организация = Организация;
	ЭлементНабора.Настройки = Настройки;
	ЭлементНабора.Сведения = Сведения;
	
	Возврат ЭлементНабора;
	
КонецФункции

Функция НовыйСведенияОбОрганизации()
	
	СведенияОбОрганизации = Новый Структура;
	СведенияОбОрганизации.Вставить("Дата", Дата(1, 1, 1));
	СведенияОбОрганизации.Вставить("Логотип", Неопределено); // Двоичные данные файла с логотипом
	СведенияОбОрганизации.Вставить("ПолноеНаименование", "");
	СведенияОбОрганизации.Вставить("ИндивидуальныйПредприниматель", Справочники.ФизическиеЛица.ПустаяСсылка());
	СведенияОбОрганизации.Вставить("СокращенноеНаименование", "");
	СведенияОбОрганизации.Вставить("ИНН", "");
	СведенияОбОрганизации.Вставить("КПП", "");
	СведенияОбОрганизации.Вставить("ОГРН", "");
	СведенияОбОрганизации.Вставить("ЮридическийАдрес", "");
	
	// см. РеквизитСтруктурой, НаименованиеРеквизита - Должность руководителя, ЗначениеРеквизита - ФИО руководителя
	СведенияОбОрганизации.Вставить("РуководительДанные", Новый Структура);
	СведенияОбОрганизации.Вставить("РуководительФамилияИО", "");
	СведенияОбОрганизации.Вставить("Руководитель", Справочники.ФизическиеЛица.ПустаяСсылка());
	
	// см. РеквизитСтруктурой, НаименованиеРеквизита - Должность главбуха, ЗначениеРеквизита - ФИО главбуха
	СведенияОбОрганизации.Вставить("ГлавныйБухгалтерДанные", Новый Структура);
	СведенияОбОрганизации.Вставить("ГлавныйБухгалтерФамилияИО", "");
	СведенияОбОрганизации.Вставить("Свидетельство", "");
	СведенияОбОрганизации.Вставить("ГоловнаяОрганизация", ""); // Наименование головной организации
	
	СведенияОбОрганизации.Вставить("НомерСчета", "");
	СведенияОбОрганизации.Вставить("Банк", "");
	СведенияОбОрганизации.Вставить("БИК", "");
	СведенияОбОрганизации.Вставить("КоррСчет", "");
	
	СведенияОбОрганизации.Вставить("СведенияОРасчетныхСчетах", Новый Соответствие);	
	
	СведенияОбОрганизации.Вставить("Телефоны", "");
	СведенияОбОрганизации.Вставить("Email", "");
	СведенияОбОрганизации.Вставить("ФактическийАдрес", "");
	СведенияОбОрганизации.Вставить("ПочтовыйАдрес", "");
	СведенияОбОрганизации.Вставить("Налогообложение", "");
	СведенияОбОрганизации.Вставить("ОКТМО", "");
	СведенияОбОрганизации.Вставить("ОКВЭД", "");
	СведенияОбОрганизации.Вставить("ОКПО", "");
	СведенияОбОрганизации.Вставить("ДатаРегистрации", "");
	СведенияОбОрганизации.Вставить("Печать", Неопределено); // Двоичные данные файла с печатью
	СведенияОбОрганизации.Вставить("Подпись", Неопределено); // Двоичные данные файла с подписью
		
	// Дополнительные реквизиты и сведения, Ключ - имя свойства, Значение - представление
	СведенияОбОрганизации.Вставить("ДопРеквизитыИСведения", Новый Соответствие);
	
	// Массив структур, см. РеквизитСтруктурой, НаименованиеРеквизита - Представление оператора, ЗначениеРеквизита - ИД ЭДО
	СведенияОбОрганизации.Вставить("ИдентификаторыЭДО", Новый Массив);
	
	Возврат СведенияОбОрганизации;
	
КонецФункции

Функция КлючОбъектаНастроек()

	Возврат "НастройкиПечатиРеквизитовОрганизации";

КонецФункции

Процедура ЗаполнитьСведенияОРасчетныхСчетах(СведенияОРасчетныхСчетах, РасчетныеСчета)
	
	СведенияОРасчетныхСчетах.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	БанковскиеСчета.Ссылка КАК Ссылка,
	|	БанковскиеСчета.НомерСчета КАК НомерСчета,
	|	БанковскиеСчета.Банк.Наименование КАК Банк,
	|	БанковскиеСчета.Банк.Код КАК БИК,
	|	БанковскиеСчета.Банк.КоррСчет КАК КоррСчет
	|ИЗ
	|	Справочник.БанковскиеСчета КАК БанковскиеСчета
	|ГДЕ
	|	БанковскиеСчета.Ссылка В (&РасчетныеСчета)";

	Запрос.УстановитьПараметр("РасчетныеСчета", РасчетныеСчета);

	Выборка = Запрос.Выполнить().Выбрать();
		
	Пока Выборка.Следующий() Цикл
		РеквизитыСчета = ПустыеРеквизитыСчета();
		ЗаполнитьЗначенияСвойств(РеквизитыСчета, Выборка);
		СведенияОРасчетныхСчетах.Вставить(Выборка.Ссылка, РеквизитыСчета);	
	КонецЦикла;	

КонецПроцедуры

Функция ПустыеРеквизитыСчета()
	
	РеквизитыСчета = Новый Структура;
	РеквизитыСчета.Вставить("НомерСчета", "");
	РеквизитыСчета.Вставить("Банк",       "");
	РеквизитыСчета.Вставить("БИК",        "");
	РеквизитыСчета.Вставить("КоррСчет",   "");
	
	Возврат РеквизитыСчета;
		
КонецФункции

#КонецОбласти
