#Область ПрограммныйИнтерфейс

// Дополняет сформированный HTML перед выводом на дисплей покупателя.
//
// Параметры:
//  ТекстHTML            - Строка - сформированный HTML-код.
//  СтандартнаяОбработка - Булево - признак выполнения стандартной обработки.
//
Процедура ПослеФормированииТекстаHTML(ТекстHTML, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

// Дополняет список рекламных файлов для дисплея покупателя.
//
// Параметры:
//  Идентификатор    - СправочникСсылка.ПодключаемоеОборудование - устройство дисплея покупателя.
//  ДанныеКартинки   - Массив Из Структура - список рекламы. Каждый элемент должен соответствовать
//                     ОборудованиеДисплеиПокупателяКлиентСервер.ПараметрыРекламы().
//                     Уникальность элементов определяется по имени файла рекламы.
//  ПараметрыРекламы - Структура - параметры рекламного блока:
//   * РасположениеРекламы - Строка
//   * ПроцентРекламы - Число
//   * Реклама - Массив Из Структура - тот же список рекламы.
//   * ПолученныеФайлыРекламы - Массив Из Строка, Неопределено - имена файлов, уже полученных с сервера.
//
Процедура ПриПолученииФайловРекламы(Идентификатор, ДанныеКартинки, ПараметрыРекламы = Неопределено) Экспорт
	
КонецПроцедуры

#КонецОбласти
