
////////////////////////////////////////////////////////////////////////////////
// ЭлектронноеВзаимодействиеБПВызовСервера: вспомогательные процедуры и функции БЭД
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

#Область ДиректБанк

Функция ВидимостьЭлементовДиректБанк(Организация, ДанныеБанкаСчета) Экспорт
	
	ВалютаДенежныхСредств = УправлениеНебольшойФирмойПовтИсп.ПолучитьВалютуУчета();
	Если ТипЗнч(ДанныеБанкаСчета) = Тип("СправочникСсылка.БанковскиеСчета") Тогда
		ДанныеБанковскогоСчета = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеБанкаСчета, "Банк, ВалютаДенежныхСредств");
		Банк = ДанныеБанковскогоСчета.Банк;
		ВалютаДенежныхСредств = ДанныеБанковскогоСчета.ВалютаДенежныхСредств;
	Иначе
		
		Банк = ДанныеБанкаСчета;
		
	КонецЕсли;
	
	Результат = "НеПоказывать";
	Если ВалютаДенежныхСредств <> УправлениеНебольшойФирмойПовтИсп.ПолучитьВалютуУчета()
		Или Не (ЗначениеЗаполнено(Банк) И ТипЗнч(Организация) = Тип("СправочникСсылка.Организации")) Тогда
		
		Возврат Результат;
		
	КонецЕсли;
	
	Если Организация.Пустая() Тогда
		
		НастройкаОбмена = Неопределено;
		
	Иначе
		
		НастройкаОбмена = ОбменСБанками.НастройкаОбмена(Организация, Банк);
		
	КонецЕсли;
	
	БИК = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Банк, "Код");
	РекомендуетсяПрямойОбменСБанком = Ложь;
	
	// Баннер директ-банка отображается у всех пользователей, который открыли элемент с баннером.
	// У этих пользователей может не быть доступа к банку и настройкам интеграции, поэтому
	// получать настройки интеграции нужно в привилегированном режиме.
	УстановитьПривилегированныйРежим(Истина);
	
	ВключенаИнтеграцияСБанком = ТипЗнч(Банк) = Тип("СправочникСсылка.Банки") И ЗначениеЗаполнено(Банк) И
		ОбменСБанками.ВозможенПрямойОбменСБанком(Банк.Код);
	УстановитьПривилегированныйРежим(Ложь);
	
	Если Не ВключенаИнтеграцияСБанком
		И Не ЗначениеЗаполнено(НастройкаОбмена)
		И ОбменСБанками.ВозможенПрямойОбменСБанком(БИК, 1, РекомендуетсяПрямойОбменСБанком) Тогда
		
		Результат = "ПоказатьГиперссылку";
		ВидимостьРекламы = ХранилищеОбщихНастроек.Загрузить("ВидимостьРекламыДиректБанк", БИК);
		ВидимостьРекламы = ?(ВидимостьРекламы = Неопределено, Истина, ВидимостьРекламы);
		Если ВидимостьРекламы И РекомендуетсяПрямойОбменСБанком Тогда
			
			Результат = "ПоказатьБаннер";
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура СохранитьНастройкуВидимостиРекламыДиректБанк(Банк, Видимость) Экспорт
	
	БИК = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Банк, "Код");
	ХранилищеОбщихНастроек.Сохранить("ВидимостьРекламыДиректБанк", БИК, Видимость);
	
КонецПроцедуры

// Получает выписку банка в коллекцию ОбменСБанкомВФормате1С.НовыйДанныеИзБанка(),
// а также массив ссылок на банковские счета организаций в выписке.
//
// Параметры:
//  СообщениеОбмена - ДокументСсылка.СообщениеОбменСБанками, Массив - содержит ссылку или массив ссылок на выписки банка
//  СсылкаНаХранилище - Строка - содержит ссылку на хранилище тестовых данных;
//  МассивСчетов - Массив - содержит ссылки на банковские счета организации.
//
Функция ПолучитьДанныеВыпискиБанкаВКоллекцию(Знач СообщениеОбмена) Экспорт
	
	Результат = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СообщениеОбмена, "Организация, НастройкаОбмена, ВидЭД");
	Результат.Вставить("СсылкаНаХранилищеВыписки", Неопределено);
	Результат.Вставить("МассивСчетов", Неопределено);
	
	Если Результат.ВидЭД <> Перечисления.ВидыЭДОбменСБанками.ВыпискаБанка Тогда
		Возврат Результат;
	КонецЕсли;
	
	ПолучитьДанныеВыпискиБанка(СообщениеОбмена, Результат.СсылкаНаХранилищеВыписки, Результат.МассивСчетов);
	
	Возврат Результат;
	
КонецФункции

Функция ДанныеВыписокБанкаВКоллекцию(Знач МассивВыписок) Экспорт
	
	МассивСчетов      = Новый Массив;
	СсылкаНаХранилище = "";
	ПолучитьДанныеВыпискиБанка(МассивВыписок, СсылкаНаХранилище, МассивСчетов);
	
	Возврат СсылкаНаХранилище;
	
КонецФункции

Функция АвтоматическоеПолучениеВыпискиДоступно(СписокОрганизаций) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПараметрыОбменСБанками.НастройкаОбмена КАК НастройкаОбмена
	|ИЗ
	|	РегистрСведений.ПараметрыОбменСБанками КАК ПараметрыОбменСБанками
	|ГДЕ
	|	ПараметрыОбменСБанками.АвтоматическоеПолучениеВыписки
	|	И ПараметрыОбменСБанками.НастройкаОбмена.Организация В(&СписокОрганизаций)";
	Запрос.УстановитьПараметр("СписокОрганизаций", СписокОрганизаций);
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	Возврат НЕ РезультатЗапроса.Пустой();
	
КонецФункции

Функция НастройкиОбменаАвтоматическоеПолучениеВыписки(Организация = Неопределено, Банк = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ПараметрыОбменСБанками.НастройкаОбмена КАК НастройкаОбмена
	|ИЗ
	|	РегистрСведений.ПараметрыОбменСБанками КАК ПараметрыОбменСБанками
	|ГДЕ
	|	ПараметрыОбменСБанками.АвтоматическоеПолучениеВыписки
	|	И ПараметрыОбменСБанками.НастройкаОбмена.Ссылка ССЫЛКА Справочник.НастройкиОбменСБанками
	|	И НЕ ПараметрыОбменСБанками.НастройкаОбмена.ПометкаУдаления
	|	И НЕ ПараметрыОбменСБанками.НастройкаОбмена.Недействительна
	|	И ИСТИНА";
	
	ТекстДополнительногоОтбора = "";
	Если ЗначениеЗаполнено(Организация) Тогда
		ТекстДополнительногоОтбора = ТекстДополнительногоОтбора + " И ПараметрыОбменСБанками.НастройкаОбмена.Организация = &Организация ";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Банк) Тогда
		ТекстДополнительногоОтбора = ТекстДополнительногоОтбора + "
			|	И (ПараметрыОбменСБанками.НастройкаОбмена.Банк = &Банк
			|			ИЛИ ПараметрыОбменСБанками.НастройкаОбмена.Банк.Код = &БИК)";
		БИК = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Банк, "Код");
		Запрос.УстановитьПараметр("БИК",  БИК);
		Запрос.УстановитьПараметр("Банк", Банк);
	КонецЕсли;
	
	Если ТекстДополнительногоОтбора <> "" Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ИСТИНА", ТекстДополнительногоОтбора);
		Запрос.УстановитьПараметр("Организация", Организация);
	КонецЕсли;
	
	НастройкиОбмена = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("НастройкаОбмена");
	
	Возврат НастройкиОбмена;
	
КонецФункции

Функция ТаблицаОшибокАвтоматическоеПолучениеВыписки(НастройкиОбмена) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПараметрыОбменСБанками.ТекстОшибки КАК ТекстОшибки,
	|	ПараметрыОбменСБанками.НастройкаОбмена КАК НастройкаОбмена,
	|	ПараметрыОбменСБанками.ДатаСинхронизации КАК ДатаСинхронизации
	|ИЗ
	|	РегистрСведений.ПараметрыОбменСБанками КАК ПараметрыОбменСБанками
	|ГДЕ
	|	ПараметрыОбменСБанками.АвтоматическоеПолучениеВыписки
	|	И ПараметрыОбменСБанками.НастройкаОбмена В(&НастройкиОбмена)
	|	И (ВЫРАЗИТЬ(ПараметрыОбменСБанками.ТекстОшибки КАК СТРОКА(10))) <> """"
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаСинхронизации ВОЗР";
	Запрос.УстановитьПараметр("НастройкиОбмена", НастройкиОбмена);
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ТаблицаДатыСинхронизацииАвтоматическоеПолучениеВыписки(НастройкиОбмена) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ПараметрыОбменСБанками.ДатаСинхронизации КАК ДатаСинхронизации
	|ИЗ
	|	РегистрСведений.ПараметрыОбменСБанками КАК ПараметрыОбменСБанками
	|ГДЕ
	|	ПараметрыОбменСБанками.АвтоматическоеПолучениеВыписки
	|	И ПараметрыОбменСБанками.НастройкаОбмена В(&НастройкиОбмена)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаСинхронизации УБЫВ";
	Запрос.УстановитьПараметр("НастройкиОбмена", НастройкиОбмена);
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//Процедура ВыполнитьЗаписьСобытияПоЭДВЖурналРегистрации(ОписаниеСобытия,
//														КодСобытия = 0,
//														УровеньВажности = Неопределено,
//														ОбъектМетаданных = Неопределено,
//														ДанныеСсылка = Неопределено,
//														РежимТранзакции = Неопределено)
//	
//	Уровень = "Общая подсистема";
//	Если КодСобытия = 1 Тогда
//		Уровень = "Обмен с банками";
//	ИначеЕсли КодСобытия = 2 Тогда
//		Уровень = "Обмен с контрагентами";
//	ИначеЕсли КодСобытия = 3 Тогда
//		Уровень = "Обмен с сайтами";
//	ИначеЕсли КодСобытия = 4 Тогда
//		Уровень = "Регламентные задания";
//	КонецЕсли;
//	УровеньВажностиСобытия = ?(ТипЗнч(УровеньВажности) = Тип("УровеньЖурналаРегистрации"),
//		УровеньВажности, УровеньЖурналаРегистрации.Ошибка);
//	Шаблон = НСтр("ru = 'Электронное взаимодействие.%1'");
//	ИмяСобытия = СтрЗаменить(Шаблон, "%1", Уровень);
//	ЗаписьЖурналаРегистрации(ИмяСобытия,
//		УровеньВажностиСобытия, ОбъектМетаданных, ДанныеСсылка, ОписаниеСобытия, РежимТранзакции);
//	
//КонецПроцедуры

#Область ФормированиеВыписки

// см. Функцию ЭлектронноеВзаимодействиеБПВызовСервера.ПрочитанныеДанныеСервиса().
//
// Параметры:
//  СообщениеОбмена - ДокументСсылка.СообщениеОбменСБанками, Массив - содержит ссылку или массив ссылок на выписки банка
//  СсылкаНаХранилище - Строка - содержит ссылку на хранилище тестовых данных;
//  МассивСчетов - Массив - содержит ссылки на банковские счета организации.
//
Процедура ПолучитьДанныеВыпискиБанка(Знач СообщениеОбмена,
										  СсылкаНаХранилище,
										  МассивСчетов = Неопределено)
	
	ПрочитанныеДанныеСервиса = ПрочитанныеДанныеСервиса(СообщениеОбмена, МассивСчетов);
	
	СсылкаНаХранилище = ПоместитьВоВременноеХранилище(ПрочитанныеДанныеСервиса, Новый УникальныйИдентификатор());
	
КонецПроцедуры

Процедура ЗаполнитьШапкуВыписки(Организация, ДанныеВыписки, СтрокаТаблицыВыписок, МассивСчетов)
	
	Если ДанныеВыписки = Неопределено Тогда
		ДанныеВыписки = ОбменСБанкомВФормате1С.НовыйДанныеИзБанка();
	КонецЕсли;
	
	Индекс = 0;
	
	// Заголовок.1CClientBankExchange
	ДанныеВыписки.Заголовок.Вставить("ВерсияФормата", "1.03");
	ДанныеВыписки.Заголовок.Вставить("Кодировка", "Windows");
	
	МассивНомеровСчетов = Новый Массив;
	КоличествоВыписок = СтрокаТаблицыВыписок.Строки.Количество();
	Для ИндексВыписки = 0 По КоличествоВыписок - 1 Цикл
		Выписка = СтрокаТаблицыВыписок.Строки.Получить(ИндексВыписки);
		НомерСчета = ЗначениеРеквизитаВДереве(Выписка, "Выписки.НомерСтроки.НомерСчета");
		ИдентификаторЦифровогоСчета = ЗначениеРеквизитаВДереве(Выписка, "Выписки.НомерСтроки.ИдентификаторЦифровогоСчета");
		Если ЗначениеЗаполнено(ИдентификаторЦифровогоСчета) Тогда
			МассивНомеровСчетов.Добавить(ИдентификаторЦифровогоСчета);
		Иначе
			МассивНомеровСчетов.Добавить(НомерСчета);
		КонецЕсли;
	КонецЦикла;
	
	ПерваяВыписка = СтрокаТаблицыВыписок.Строки.Получить(0);
	
	ДобавитьНеПустойПараметр(ДанныеВыписки.Заголовок, ПерваяВыписка, "Отправитель",
		"Выписки.НомерСтроки.Банк.Наименование");
	ДанныеВыписки.Заголовок.Вставить("Получатель");
	
	ДатаСоздания = ЗначениеРеквизитаВДереве(ПерваяВыписка,    "Выписки.НомерСтроки.ДатаФормирования");
	Если ЗначениеЗаполнено(ДатаСоздания) Тогда
		ДанныеВыписки.Заголовок.Вставить("ДатаСоздания", Формат(ДатаСоздания, ФорматДатыРоссия()));
		ДанныеВыписки.Заголовок.Вставить("ВремяСоздания", Формат(ДатаСоздания, ФорматВремениРоссия()));
	КонецЕсли;
	
	ДатаНачала   = ЗначениеРеквизитаВДереве(ПерваяВыписка,    "Выписки.НомерСтроки.НачалоПериода");
	ДанныеВыписки.Заголовок.Вставить("ДатаНачала", Формат(ДатаНачала, ФорматДатыРоссия()));
	ПоследняяВыписка = СтрокаТаблицыВыписок.Строки.Получить(КоличествоВыписок - 1);
	ДатаКонца    = ЗначениеРеквизитаВДереве(ПоследняяВыписка, "Выписки.НомерСтроки.КонецПериода");
	ДанныеВыписки.Заголовок.Вставить("ДатаКонца", Формат(ДатаКонца, ФорматДатыРоссия()));
	
	ДополнительныеРеквизиты = Новый Структура("Владелец", Организация);
	БИК = ЗначениеРеквизитаВДереве(Выписка, "Выписки.НомерСтроки.Банк.БИК");
	Если ЗначениеЗаполнено(БИК) Тогда
		ДополнительныеРеквизиты.Вставить("БИК", БИК);
	КонецЕсли;
	
	МассивНомеровСчетов = ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивНомеровСчетов);
	Для Каждого НомерСчета Из МассивНомеровСчетов Цикл
		СчетОрганизации = ОбщегоНазначенияБЭД.НайтиСсылку("БанковскиеСчетаОрганизаций", НомерСчета, ДополнительныеРеквизиты);
		МассивСчетов.Добавить(СчетОрганизации);
	КонецЦикла;
	
	Если МассивНомеровСчетов.Количество() = 1 Тогда
		ДанныеВыписки.Заголовок.Вставить("РасчСчет", НомерСчета);
	Иначе
		ДанныеВыписки.Заголовок.Вставить("РасчСчет", МассивНомеровСчетов);
	КонецЕсли;
	
	ТаблицаИтогов = ОбменСБанкамиСлужебный.ТаблицаВыписок();
	Для Каждого Выписка Из СтрокаТаблицыВыписок.Строки Цикл
		НомерСчетаВыписки = ЗначениеРеквизитаВДереве(Выписка, "Выписки.НомерСтроки.НомерСчета");
		ИдентификаторЦифровогоСчета = ЗначениеРеквизитаВДереве(Выписка, "Выписки.НомерСтроки.ИдентификаторЦифровогоСчета");
		НачальныйОстаток = ЗначениеРеквизитаВДереве(Выписка, "Выписки.НомерСтроки.НачальныйОстаток");
		ОборотВходящихПлатежей = ЗначениеРеквизитаВДереве(Выписка, "Выписки.НомерСтроки.ОборотВходящихПлатежей");
		ОборотИсходящихПлатежей = ЗначениеРеквизитаВДереве(Выписка, "Выписки.НомерСтроки.ОборотИсходящихПлатежей");
		КонечныйОстаток = ЗначениеРеквизитаВДереве(Выписка, "Выписки.НомерСтроки.КонечныйОстаток");
		НачалоПериода = ЗначениеРеквизитаВДереве(Выписка, "Выписки.НомерСтроки.НачалоПериода");
		КонецПериода  = ЗначениеРеквизитаВДереве(Выписка, "Выписки.НомерСтроки.КонецПериода");
		
		СтрокаИтогов = ТаблицаИтогов.Найти(НомерСчетаВыписки, "НомерСчета");
		Если СтрокаИтогов = Неопределено Тогда
			СтрокаИтогов = ТаблицаИтогов.Добавить();
			СтрокаИтогов.ИдентификаторЦифровогоСчета = ИдентификаторЦифровогоСчета;
			СтрокаИтогов.НомерСчета       = НомерСчетаВыписки;
			СтрокаИтогов.НачалоПериода    = НачалоПериода;
			СтрокаИтогов.НачальныйОстаток = НачальныйОстаток;
			СтрокаИтогов.ОборотВходящихПлатежей  = 0;
			СтрокаИтогов.ОборотИсходящихПлатежей = 0;
		КонецЕсли;
		
		Если НачалоПериода < СтрокаИтогов.НачалоПериода Тогда
			СтрокаИтогов.НачальныйОстаток = НачальныйОстаток;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(СтрокаИтогов.КонецПериода) Или КонецПериода > СтрокаИтогов.КонецПериода Тогда
			СтрокаИтогов.КонечныйОстаток = КонечныйОстаток;
		КонецЕсли;
		
		СтрокаИтогов.НачалоПериода = Мин(НачалоПериода, СтрокаИтогов.НачалоПериода);
		СтрокаИтогов.КонецПериода =
			Макс(КонецПериода, ?(ЗначениеЗаполнено(СтрокаИтогов.КонецПериода), СтрокаИтогов.КонецПериода, '00010101'));
		
		СтрокаИтогов.ОборотВходящихПлатежей  = СтрокаИтогов.ОборотВходящихПлатежей
			+ ?(ЗначениеЗаполнено(ОборотВходящихПлатежей), ОборотВходящихПлатежей, 0);
		СтрокаИтогов.ОборотИсходящихПлатежей = СтрокаИтогов.ОборотИсходящихПлатежей
			+ ?(ЗначениеЗаполнено(ОборотИсходящихПлатежей), ОборотИсходящихПлатежей, 0);
	КонецЦикла;
	
	ЗаполнитьОстаткиИОбороты(ДанныеВыписки, ТаблицаИтогов);
	
КонецПроцедуры

Процедура ЗаполнитьОстаткиИОбороты(ДанныеВыписки, ТаблицаИтогов)
	
	ДатаНачала = '00010101';
	ДатаКонца  = '00010101';
	Для Каждого СтрокаИтогов Из ТаблицаИтогов Цикл
		СтрокаОстатка = ДанныеВыписки.Остатки.Добавить();
		
		ЕстьОстатки = Ложь;
		Если ЗначениеЗаполнено(СтрокаИтогов.НачальныйОстаток) Тогда
			СтрокаОстатка.НачальныйОстаток = СтрокаИтогов.НачальныйОстаток;
			ЕстьОстатки = Истина;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаИтогов.ОборотВходящихПлатежей) Тогда
			СтрокаОстатка.ВсегоПоступило = СтрокаИтогов.ОборотВходящихПлатежей;
			ЕстьОстатки = Истина;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаИтогов.ОборотИсходящихПлатежей) Тогда
			СтрокаОстатка.ВсегоСписано = СтрокаИтогов.ОборотИсходящихПлатежей;
			ЕстьОстатки = Истина;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаИтогов.КонечныйОстаток) Тогда
			СтрокаОстатка.КонечныйОстаток = СтрокаИтогов.КонечныйОстаток;
			ЕстьОстатки = Истина;
		КонецЕсли;
		
		Если ЕстьОстатки Тогда
			Если ЗначениеЗаполнено(СтрокаИтогов.ИдентификаторЦифровогоСчета) Тогда
				СтрокаОстатка.РасчСчет = СтрокаИтогов.ИдентификаторЦифровогоСчета;
			Иначе
				СтрокаОстатка.РасчСчет = СтрокаИтогов.НомерСчета;
			КонецЕсли;
			
			СтрокаОстатка.ДатаНачала = СтрокаИтогов.НачалоПериода;
			СтрокаОстатка.ДатаКонца  = СтрокаИтогов.КонецПериода;
			
			Если ЗначениеЗаполнено(ДатаНачала) Тогда
				ДатаНачала = Мин(ДатаНачала, СтрокаОстатка.ДатаНачала);
			Иначе
				ДатаНачала = СтрокаОстатка.ДатаНачала;
			КонецЕсли;
			
			ДатаКонца = Макс(ДатаКонца, СтрокаОстатка.ДатаКонца);
			
			// СекцияРасчСчет
			ДанныеВыписки.Условия.РасчСчет.Добавить(СтрокаИтогов.НомерСчета);
		Иначе
			ДанныеВыписки.Остатки.Удалить(СтрокаОстатка);
		КонецЕсли;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ДанныеВыписки.Условия.РасчСчет)
		И ЗначениеЗаполнено(ДатаНачала)
		И ЗначениеЗаполнено(ДатаКонца) Тогда
		ДанныеВыписки.Условия.Вставить("ДатаНачала", ДатаНачала);
		ДанныеВыписки.Условия.Вставить("ДатаКонца",  ДатаКонца);
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьДокумент(ДанныеВыписки, Операция, ОписаниеОбменаВФормате1С, Индекс, РасСчет = "")
	
	Документ = ДанныеВыписки.Документы.Добавить();
	
	СекцияДокумент = ЗначениеРеквизитаВДереве(Операция, "Выписки.НомерСтроки.Операции.НомерСтроки.ВидДокумента");
	Документ.Вид   = СекцияДокумент;
	
	ДобавитьНеПустойПараметр(Документ, Операция, "ИдентификаторДокумента",
		"Выписки.НомерСтроки.Операции.НомерСтроки.ИдентификаторДокумента");
	
	Номер          = ЗначениеРеквизитаВДереве(Операция, "Выписки.НомерСтроки.Операции.НомерСтроки.НомерДокумента");
	Документ.Номер = Номер;
	
	Дата           = ЗначениеРеквизитаВДереве(Операция, "Выписки.НомерСтроки.Операции.НомерСтроки.ДатаДокумента");
	Документ.Дата  = Дата;
	
	Сумма          = ЗначениеРеквизитаВДереве(Операция, "Выписки.НомерСтроки.Операции.НомерСтроки.СуммаДокумента");
	Документ.Сумма = Формат(Сумма, "ЧРД=.; ЧГ=");
	
	ДобавитьПлательщикаИПолучателя(Документ, Операция, ОписаниеОбменаВФормате1С);
	
	ДобавитьНеПустойПараметр(Документ, Операция, "ВидПлатежа",
		"Выписки.НомерСтроки.Операции.НомерСтроки.ВидПлатежа");
	ДобавитьНеПустойПараметр(Документ, Операция, "ВидОплаты",
		"Выписки.НомерСтроки.Операции.НомерСтроки.ВидОперации");
	ДобавитьНеПустойПараметр(Документ, Операция, "ВидОперацииЦР",
		"Выписки.НомерСтроки.Операции.НомерСтроки.ВидОперацииЦР");
	ДобавитьНеПустойПараметр(Документ, Операция, "MCC",
		"Выписки.НомерСтроки.Операции.НомерСтроки.MCC");
	ДобавитьНеПустойПараметр(Документ, Операция, "ПлатежнаяСсылкаЦР",
		"Выписки.НомерСтроки.Операции.НомерСтроки.ПлатежнаяСсылкаЦР");
	ДобавитьНеПустойПараметр(Документ, Операция, "Код",
		"Выписки.НомерСтроки.Операции.НомерСтроки.УникальныйИдентификаторПлатежа",, Истина);
	ДобавитьНеПустойПараметр(Документ, Операция, "КодНазПлатежа",
		"Выписки.НомерСтроки.Операции.НомерСтроки.КодВидаДохода");
	
	ДобавитьНазначениеПлатежа(Документ, Операция);
	
	ДобавитьБюджетныеРеквизиты(Документ, Операция);
	
	ДобавитьНеПустойПараметр(Документ, Операция, "Очередность",
		"Выписки.НомерСтроки.Операции.НомерСтроки.Очередность");
	
	ДобавитьДанныеПлатежногоТребования(Документ, Операция);
	
	ЗаполнитьОтсутствующиеРеквизиты(Документ, Операция, РасСчет);
	
	Документ.Идентификатор = Формат(Индекс, "ЧН=0; ЧГ=;");
	Индекс = Индекс + 1;
	
КонецПроцедуры

Процедура ЗаполнитьОтсутствующиеРеквизиты(Документ, Операция, РасСчет)
	
	Если Не ЗначениеЗаполнено(Документ.ВидОплаты) Тогда
		// Заполним код вида операции по коду вида электронного документа
		КодВидаЭД = ЗначениеРеквизитаВДереве(Операция, "Выписки.НомерСтроки.Операции.НомерСтроки.КодВидаЭД");
		ВидОперации = СоответствиеВидЭДВидОперации(КодВидаЭД);
		ДобавитьНеПустоеЗначениейПараметра(Документ, ВидОперации, "ВидОплаты");
	КонецЕсли;
	
	Если ПустаяСтрока(РасСчет) Тогда
		СтрокаДерева = Операция;
		Пока СтрокаДерева <> Неопределено И Не ЗначениеЗаполнено(РасСчет) Цикл
			РасСчет = ЗначениеРеквизитаВДереве(СтрокаДерева, "Выписки.НомерСтроки.НомерСчета");
			СтрокаДерева = СтрокаДерева.Родитель;
		КонецЦикла;
		
		Если Не ЗначениеЗаполнено(РасСчет) Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	// Заполним счет организации, если по дате исполнения известна сторона организации (плательщик/получатель)
	Если (Не Документ.ПлательщикРеквизиты.Свойство("РасчСчет")
			Или Не ЗначениеЗаполнено(Документ.ПлательщикРеквизиты.РасчСчет))
		И Не ЗначениеЗаполнено(Документ.ПлательщикСчет)
		И ЗначениеЗаполнено(Документ.ДатаСписано) И Не ЗначениеЗаполнено(Документ.ДатаПоступило) Тогда
		ДобавитьНеПустоеЗначениейПараметра(Документ.ПлательщикРеквизиты, РасСчет, "РасчСчет");
		ДобавитьНеПустоеЗначениейПараметра(Документ, РасСчет, "ПлательщикСчет");
	ИначеЕсли (Не Документ.ПолучательРеквизиты.Свойство("РасчСчет")
			Или Не ЗначениеЗаполнено(Документ.ПолучательРеквизиты.РасчСчет))
		И Не ЗначениеЗаполнено(Документ.ПолучательСчет)
		И ЗначениеЗаполнено(Документ.ДатаПоступило) И Не ЗначениеЗаполнено(Документ.ДатаСписано) Тогда
		ДобавитьНеПустоеЗначениейПараметра(Документ.ПолучательРеквизиты, РасСчет, "РасчСчет");
		ДобавитьНеПустоеЗначениейПараметра(Документ, РасСчет, "ПолучательСчет");
	КонецЕсли;
	
КонецПроцедуры

// Возвращает код вид операции по ЦБ, соответствующий коду вида электронного документа ДиректБанк
//
// Параметры:
//  КодВидаЭД - Строка - код вида электронного документа 1С:ДиректБанк
//
// Возвращаемое значение:
//  Строка - код вида операции в соответствии с нормативными актами Банка России
//
Функция СоответствиеВидЭДВидОперации(КодВидаЭД) Экспорт
	
	// Источники:
	// 1. Перечень условных обозначений (шифров) документов, проводимых по счетам в кредитных организациях
	// из Положение Банка России от 24.11.2022 № 809-П
	// 2. Таблица кодов видов электронных документов из раздела Классификаторы
	// из Описание стандарта взаимодействия между "1С:Предприятие 8" и банковским сервисом по технологии 1С:ДиректБанк
	
	СоответствиеКодов = Новый Соответствие;
	СоответствиеКодов.Вставить("10", "01"); // Платежное поручение
	СоответствиеКодов.Вставить("11", "02"); // Платежное требование
	СоответствиеКодов.Вставить("25", "03"); // Денежный чек по РКО
	СоответствиеКодов.Вставить("24", "04"); // Объявление на взнос наличными по ПКО
	СоответствиеКодов.Вставить("12", "06"); // Инкассовое поручение
	СоответствиеКодов.Вставить("16", "09"); // Мемориальный ордер
	СоответствиеКодов.Вставить("17", "16"); // Платежный ордер
	СоответствиеКодов.Вставить("18", "17"); // Банковский ордер
	
	КодВидаОперации = СоответствиеКодов[КодВидаЭД];
	
	Возврат КодВидаОперации;
	
КонецФункции

Процедура ДобавитьДанныеПлатежногоТребования(Документ, Операция)
	
	СтруктурированноеНазначениеПлатежа = Документ.СтруктурированноеНазначениеПлатежа;
	
	СрокАкцепта = ЗначениеРеквизитаВДереве(Операция,
		"Выписки.НомерСтроки.Операции.НомерСтроки.ПлатежноеТребование.СрокАкцепта");
	Если ЗначениеЗаполнено(СрокАкцепта) Тогда
		СтруктурированноеНазначениеПлатежа.Вставить("СрокАкцепта", Формат(СрокАкцепта, "ЧДЦ=0; ЧГ="));
	КонецЕсли;
	
	ДобавитьНеПустойПараметр(СтруктурированноеНазначениеПлатежа, Операция, "ДатаОтсылкиДок",
		"Выписки.НомерСтроки.Операции.НомерСтроки.ПлатежноеТребование.ДатаОтсылки");
	
	УсловиеОплаты = ЗначениеРеквизитаВДереве(Операция,
		"Выписки.НомерСтроки.Операции.НомерСтроки.ПлатежноеТребование.УсловиеОплаты");
	МассивПодстрок = СтрРазделить(УсловиеОплаты, Символы.ПС + Символы.ВК, Ложь);
	Индекс = 1;
	Для Каждого Строка Из МассивПодстрок Цикл
		СтруктурированноеНазначениеПлатежа.Вставить("УсловиеОплаты" + Индекс, Строка);
		Индекс = Индекс + 1;
		Если Индекс > 3 Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьПлательщикаИПолучателя(Документ, Операция, ОписаниеОбменаВФормате1С)
	
	ДанныеЭД = Новый Структура;
	
	ДобавитьНеПустойПараметр(ДанныеЭД, Операция, "ПлательщикСчет",
		"Выписки.НомерСтроки.Операции.НомерСтроки.Плательщик.РасчСчет", , Истина);
	
	НаправлениеПлатежа = ЗначениеРеквизитаВДереве(
		Операция, "Выписки.НомерСтроки.Операции.НомерСтроки.НаправлениеПлатежа");
	
	ДатаОперации = ЗначениеРеквизитаВДереве(Операция, "Выписки.НомерСтроки.Операции.НомерСтроки.ДатаОперации");
	Если НаправлениеПлатежа = "1" Тогда
		ДанныеЭД.Вставить("ДатаСписано", ДатаОперации);
	КонецЕсли;
	
	ДобавитьНеПустойПараметр(ДанныеЭД, Операция, "Плательщик",
		"Выписки.НомерСтроки.Операции.НомерСтроки.Плательщик.Наименование",
		"Выписки.НомерСтроки.Операции.НомерСтроки.Плательщик.НаименованиеМеждународное", Истина);
	ДобавитьНеПустойПараметр(ДанныеЭД, Операция, "ПлательщикИНН",
		"Выписки.НомерСтроки.Операции.НомерСтроки.Плательщик.ИНН", , Истина);
	ДобавитьНеПустойПараметр(ДанныеЭД, Операция, "ПлательщикКПП",
		"Выписки.НомерСтроки.Операции.НомерСтроки.Плательщик.КПП", , Истина);
	ДобавитьНеПустойПараметр(ДанныеЭД, Операция, "ПлательщикРасчСчет",
		"Выписки.НомерСтроки.Операции.НомерСтроки.Плательщик.РасчСчет", , Истина);
	ДобавитьНеПустойПараметр(ДанныеЭД, Операция, "ПлательщикИдентификаторЦифровогоСчета",
		"Выписки.НомерСтроки.Операции.НомерСтроки.Плательщик.ИдентификаторЦифровогоСчета", , Истина);
	ДобавитьНеПустойПараметр(ДанныеЭД, Операция, "ПлательщикБанк1",
		"Выписки.НомерСтроки.Операции.НомерСтроки.Плательщик.Банк.Наименование",
		"Выписки.НомерСтроки.Операции.НомерСтроки.Плательщик.Банк.НаименованиеМеждународное");
	ДобавитьНеПустойПараметр(ДанныеЭД, Операция, "ПлательщикБанк2",
		"Выписки.НомерСтроки.Операции.НомерСтроки.Плательщик.Банк.Город", , Истина);
	ДобавитьНеПустойПараметр(ДанныеЭД, Операция, "ПлательщикБИК",
		"Выписки.НомерСтроки.Операции.НомерСтроки.Плательщик.Банк.БИК",
		"Выписки.НомерСтроки.Операции.НомерСтроки.Плательщик.Банк.SWIFT", Истина);
	ДобавитьНеПустойПараметр(ДанныеЭД, Операция, "ПлательщикКорсчет",
		"Выписки.НомерСтроки.Операции.НомерСтроки.Плательщик.Банк.КоррСчет", , Истина);
	
	ДобавитьНеПустойПараметр(ДанныеЭД, Операция, "ПолучательСчет",
		"Выписки.НомерСтроки.Операции.НомерСтроки.Получатель.РасчСчет");
	
	Если НаправлениеПлатежа = "2" Тогда
		ДанныеЭД.Вставить("ДатаПоступило", ДатаОперации);
	КонецЕсли;
	
	ДобавитьНеПустойПараметр(ДанныеЭД, Операция, "Получатель",
		"Выписки.НомерСтроки.Операции.НомерСтроки.Получатель.Наименование",
		"Выписки.НомерСтроки.Операции.НомерСтроки.Получатель.НаименованиеМеждународное", Истина);
	ДобавитьНеПустойПараметр(ДанныеЭД, Операция, "ПолучательИНН",
		"Выписки.НомерСтроки.Операции.НомерСтроки.Получатель.ИНН", , Истина);
	ДобавитьНеПустойПараметр(ДанныеЭД, Операция, "ПолучательКПП",
		"Выписки.НомерСтроки.Операции.НомерСтроки.Получатель.КПП", , Истина);
	ДобавитьНеПустойПараметр(ДанныеЭД, Операция, "ПолучательРасчСчет",
		"Выписки.НомерСтроки.Операции.НомерСтроки.Получатель.РасчСчет", , Истина);
	ДобавитьНеПустойПараметр(ДанныеЭД, Операция, "ПолучательИдентификаторЦифровогоСчета",
		"Выписки.НомерСтроки.Операции.НомерСтроки.Получатель.ИдентификаторЦифровогоСчета", , Истина);
	ДобавитьНеПустойПараметр(ДанныеЭД, Операция, "ПолучательБанк1",
		"Выписки.НомерСтроки.Операции.НомерСтроки.Получатель.Банк.Наименование",
		"Выписки.НомерСтроки.Операции.НомерСтроки.Получатель.Банк.НаименованиеМеждународное", Истина);
	ДобавитьНеПустойПараметр(ДанныеЭД, Операция, "ПолучательБанк2",
		"Выписки.НомерСтроки.Операции.НомерСтроки.Получатель.Банк.Город", , Истина);
	ДобавитьНеПустойПараметр(ДанныеЭД, Операция, "ПолучательБИК",
		"Выписки.НомерСтроки.Операции.НомерСтроки.Получатель.Банк.БИК",
		"Выписки.НомерСтроки.Операции.НомерСтроки.Получатель.Банк.SWIFT", Истина);
	ДобавитьНеПустойПараметр(ДанныеЭД, Операция, "ПолучательКорсчет",
		"Выписки.НомерСтроки.Операции.НомерСтроки.Получатель.Банк.КоррСчет", , Истина);
	
	ЗаполнитьЗначенияСвойств(Документ, ДанныеЭД);
	
	Для Каждого Участник Из ОписаниеОбменаВФормате1С.Участники Цикл
		Для Каждого КлючИЗначение Из ДанныеЭД Цикл
			РазделДанных = Участник + "Реквизиты";
			ОтборПравила = Новый Структура;
			ОтборПравила.Вставить("Тег",          ВРег(КлючИЗначение.Ключ));
			ОтборПравила.Вставить("РазделДанных", РазделДанных);
			Правила = ОписаниеОбменаВФормате1С.ОписаниеФайлаОбмена.ПравилаРазмещенияДанныхОДокументах.НайтиСтроки(ОтборПравила);
			Если Правила.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			ИмяРеквизита = Правила[0].ИмяЭлемента;
			Если ОписаниеОбменаВФормате1С.РеквизитыУчастника.Найти(ИмяРеквизита) <> Неопределено Тогда
				Документ[РазделДанных].Вставить(ИмяРеквизита, ДанныеЭД[КлючИЗначение.Ключ]);
				Если ИмяРеквизита = "НаименованиеРасширенное" Тогда
					Документ[РазделДанных].Вставить("Наименование", ДанныеЭД[КлючИЗначение.Ключ]);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	ОбменСБанкомВФормате1С.ИсправитьОшибкиУчастникаСчет(Документ, "Плательщик");
	ОбменСБанкомВФормате1С.ИсправитьОшибкиУчастникаСчет(Документ, "Получатель");
	
КонецПроцедуры

Процедура ДобавитьБюджетныеРеквизиты(Документ, Операция)
	
	РеквизитыПлатежаВБюджет = Документ.РеквизитыПлатежаВБюджет;
	
	ДобавитьНеПустойПараметр(РеквизитыПлатежаВБюджет, Операция, "СтатусСоставителя",
		"Выписки.НомерСтроки.Операции.НомерСтроки.ПлатежВБюджет.СтатусСоставителя");
	ДобавитьНеПустойПараметр(РеквизитыПлатежаВБюджет, Операция, "ПоказательКБК",
		"Выписки.НомерСтроки.Операции.НомерСтроки.ПлатежВБюджет.ПоказательКБК");
	ДобавитьНеПустойПараметр(РеквизитыПлатежаВБюджет, Операция, "ОКАТО",
		"Выписки.НомерСтроки.Операции.НомерСтроки.ПлатежВБюджет.ОКТМО");
	ДобавитьНеПустойПараметр(РеквизитыПлатежаВБюджет, Операция, "ПоказательОснования",
		"Выписки.НомерСтроки.Операции.НомерСтроки.ПлатежВБюджет.ПоказательОснования");
	ДобавитьНеПустойПараметр(РеквизитыПлатежаВБюджет, Операция, "ПоказательПериода",
		"Выписки.НомерСтроки.Операции.НомерСтроки.ПлатежВБюджет.ПоказательПериода");
	ДобавитьНеПустойПараметр(РеквизитыПлатежаВБюджет, Операция, "ПоказательНомера",
		"Выписки.НомерСтроки.Операции.НомерСтроки.ПлатежВБюджет.ПоказательНомера");
	ДобавитьНеПустойПараметр(РеквизитыПлатежаВБюджет, Операция, "ПоказательДаты",
		"Выписки.НомерСтроки.Операции.НомерСтроки.ПлатежВБюджет.ПоказательДаты");
	ДобавитьНеПустойПараметр(РеквизитыПлатежаВБюджет, Операция, "ПоказательТипа",
		"Выписки.НомерСтроки.Операции.НомерСтроки.ПлатежВБюджет.КодВыплат");
	
КонецПроцедуры

Процедура ДобавитьНазначениеПлатежа(Документ, Операция)
	
	НазначениеПлатежа = ЗначениеРеквизитаВДереве(
		Операция, "Выписки.НомерСтроки.Операции.НомерСтроки.НазначениеПлатежа");
	НазначениеПлатежаОднойСтрокой = СтрЗаменить(СтрЗаменить(НазначениеПлатежа, Символы.ПС, ""), Символы.ВК, "");
	Документ.НазначениеПлатежа = НазначениеПлатежаОднойСтрокой;
	
КонецПроцедуры

Процедура ДобавитьНеПустойПараметр(Коллекция, ДеревоРазбора, ИмяПараметра, Путь, ПутьМеждународный = "", ОчиститьНули = Ложь)
	
	ЗначениеПараметра = ЗначениеРеквизитаВДереве(ДеревоРазбора, Путь);
	Если Не ЗначениеЗаполнено(ЗначениеПараметра) И Не ПустаяСтрока(ПутьМеждународный) Тогда
		ЗначениеПараметра = ЗначениеРеквизитаВДереве(ДеревоРазбора, ПутьМеждународный);
	КонецЕсли;
	
	ДобавитьНеПустоеЗначениейПараметра(Коллекция, ЗначениеПараметра, ИмяПараметра, ОчиститьНули);
	
КонецПроцедуры

Процедура ДобавитьНеПустоеЗначениейПараметра(Коллекция, ЗначениеПараметра, ИмяПараметра, ОчиститьНули = Ложь)
	
	Если Не ЗначениеЗаполнено(ЗначениеПараметра) Тогда
		Возврат;
	КонецЕсли;
	
	Если СтрНачинаетсяС(ВРег(ИмяПараметра), "НАЗНАЧЕНИЕПЛАТЕЖА") Тогда
		ЗначениеПараметра = ЗаменитьПереносыСтроки(ЗначениеПараметра);
	Иначе
		ЗначениеПараметра = СтрЗаменить(ЗначениеПараметра, Символы.ПС, "");
		ЗначениеПараметра = СтрЗаменить(ЗначениеПараметра, Символы.ВК, "");
	КонецЕсли;
	
	ЗначениеПараметра = СокрЛП(ЗначениеПараметра);
	
	Если ТипЗнч(Коллекция) = Тип("Структура") И Не Коллекция.Свойство(ИмяПараметра) Тогда
		Коллекция.Вставить(ИмяПараметра);
	КонецЕсли;
	
	Если ОчиститьНули Тогда
		ОбменСБанкомВФормате1С.ОчиститьТолькоНулиВСтроке(ЗначениеПараметра);
	КонецЕсли;
	
	Коллекция[ИмяПараметра] = ЗначениеПараметра;
	
КонецПроцедуры

Функция ЗначениеРеквизитаВДереве(Дерево, ИмяРеквизита)
	
	Возврат ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(Дерево, ИмяРеквизита, Ложь);
	
КонецФункции

// Возвращает формат даты для России.
// Не исправлять, т.к это не является ошибкой.
// 
// Возвращаемое значение:
//  Строка - формат даты для России
//
Функция ФорматДатыРоссия()
	
	Возврат "ДФ=dd.MM.yyyy";
	
КонецФункции

// Возвращает формат временем для России.
// Не исправлять, т.к это не является ошибкой.
// 
// Возвращаемое значение:
//  Строка - формат времени для России
//
Функция ФорматВремениРоссия()
	
	Возврат "HH:mm:ss";
	
КонецФункции

Функция ЗаменитьПереносыСтроки(ТекстРеквизита)
	
	// Заменим совокупность символов переноса строки ПС+ВК на пробел.
	// Совокупность ПС+ВК принята в Windows, но платформой в Windows определяется как один символ ПС.
	// Но в других ОС, скорее всего, эта совокупность будет определяться как 2 разных символа.
	ТекстРеквизита = СтрЗаменить(ТекстРеквизита, Символы.ПС + Символы.ВК, " ");
	// Если предыдущая замена не сработала, то заменим какждый спецсимвол отдельно.
	// В разных ОС будет сформирован (и виден) какой-то один из них.
	ТекстРеквизита = СтроковыеФункцииКлиентСервер.ЗаменитьОдниСимволыДругими(
		Символы.ПС + Символы.ВК,
		ТекстРеквизита,
		"  ");
	
	Возврат ТекстРеквизита;
	
КонецФункции

// Получает выписку банка в коллекцию ОбменСБанкомВФормате1С.НовыйДанныеИзБанка(),
// а также массив ссылок на банковские счета организаций в выписке.
//
// Параметры:
//  СообщениеОбмена - ДокументСсылка.СообщениеОбменСБанками, Массив - содержит ссылку или массив ссылок на выписки банка
//  МассивСчетов - Массив - содержит ссылки на банковские счета организации.
//
Функция ПрочитанныеДанныеСервиса(Знач СообщениеОбмена, МассивСчетов = Неопределено) Экспорт
	
	ДанныеВыписки = ОбменСБанкомВФормате1С.НовыйДанныеИзБанка();
	ПрочитанныеДанныеСервиса = Новый Структура;
	ПрочитанныеДанныеСервиса.Вставить("ДанныеИзБанка", ДанныеВыписки);
	ПрочитанныеДанныеСервиса.Вставить("Протокол", ОбменСБанкомВФормате1С.НовыйПротоколЧтенияФайла());
	
	Если ТипЗнч(СообщениеОбмена) = Тип("ДокументСсылка.СообщениеОбменСБанками") Тогда
		МассивСообщений = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(СообщениеОбмена);
	Иначе
		МассивСообщений = СообщениеОбмена;
	КонецЕсли;
	
	ДеревоДанных = Неопределено;
	ОбменСБанками.ПолучитьДанныеВыпискиБанкаДеревоЗначений(МассивСообщений, ДеревоДанных);
	
	Если ДеревоДанных = Неопределено Тогда
		Возврат ПрочитанныеДанныеСервиса;
	КонецЕсли;
	
	МассивСчетов = Новый Массив;
	
	СтрокаТаблицыВыписок = ДеревоДанных.Строки.Найти("Выписки", "ПолныйПуть");
	
	Организация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(МассивСообщений.Получить(0), "Организация");
	ЗаполнитьШапкуВыписки(Организация, ПрочитанныеДанныеСервиса.ДанныеИзБанка, СтрокаТаблицыВыписок, МассивСчетов);
	
	РасСчет = ВыделитьРасСчет(ПрочитанныеДанныеСервиса.ДанныеИзБанка);
	
	// Реквизиты плательщика и получателя
	ОписаниеОбменаВФормате1С = Новый Структура("Участники, РеквизитыУчастника, ОписаниеФайлаОбмена");
	ОписаниеОбменаВФормате1С.Участники           = ОбменСБанкомВФормате1С.НовыйУчастники();
	ОписаниеОбменаВФормате1С.РеквизитыУчастника  = ОбменСБанкомВФормате1С.ЭлементыРеквизитовУчастника();
	ОписаниеОбменаВФормате1С.ОписаниеФайлаОбмена = ОбменСБанкомВФормате1С.ОписаниеФайлаОбмена();
	
	Индекс = 0;
	Для Каждого Выписка Из СтрокаТаблицыВыписок.Строки Цикл
		СтрокаОперацияВыписки = Выписка.Строки.Найти("Выписки.НомерСтроки.Операции", "ПолныйПуть");
		
		Если СтрокаОперацияВыписки.Значение = Неопределено Или СтрокаОперацияВыписки.Значение = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого Операция Из СтрокаОперацияВыписки.Строки Цикл
			ДобавитьДокумент(ПрочитанныеДанныеСервиса.ДанныеИзБанка, Операция, ОписаниеОбменаВФормате1С, Индекс, РасСчет);
		КонецЦикла;
	КонецЦикла;
	
	ОбменСБанкомВФормате1С.ЗаписатьВПротокол(ПрочитанныеДанныеСервиса.Протокол, Истина, "ЭлектроннаяВыписка");
	
	Возврат ПрочитанныеДанныеСервиса;
	
КонецФункции

Функция ВыделитьРасСчет(ДанныеИзБанка)
	
	РасСчет = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеИзБанка.Заголовок, "РасчСчет", "");
	Если ТипЗнч(РасСчет) = Тип("Массив") И РасСчет.Количество() > 1 Тогда
		РасСчет = "";
	КонецЕсли;
	
	Если ПустаяСтрока(РасСчет) Тогда
		РасСчета = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеИзБанка.Условия, "РасчСчет");
		Если ЗначениеЗаполнено(РасСчета) И РасСчета.Количество() = 1 Тогда
			РасСчет = РасСчета[0];
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(РасСчет) И ЗначениеЗаполнено(ДанныеИзБанка.Остатки)
			И ДанныеИзБанка.Остатки.Количество() = 1 Тогда
			РасСчет = ДанныеИзБанка.Остатки[0].РасчСчет;
		КонецЕсли;
	КонецЕсли;
	
	Возврат РасСчет;
	
КонецФункции

// Получает выписку банка в коллекцию ОбменСБанкомВФормате1С.НовыйДанныеИзБанка(),
// а также массив ссылок на банковские счета организаций в выписке.
//
// Параметры:
//  ДеревоДанных - ДеревоЗначений - дерево данных с разобранной выпиской (см. ДеревоЭлектронногоДокументаБЭДСлужебный.ДеревоЭлектронногоДокумента)
//  Организация - СправочникСсылка.Организации - организация, по которой получена выписка
//  МассивСчетов - Массив из СправочникСсылка.БанковскиеСчета - содержит ссылки на банковские счета организации.
//
// Возвращаемое значение:
//  Структура - разобранные данные выписки, содержит значения:
//    * ДанныеИзБанка - Структура       - см. ОбменСБанкомВФормате1С.НовыйДанныеИзБанка()
//    * Протокол      - ТаблицаЗначений - см. ОбменСБанкомВФормате1С.НовыйПротоколЧтенияФайла()
//
Функция ПрочитанныеДанныеВыпискиИзДерева(Знач ДеревоДанных, Организация, МассивСчетов = Неопределено) Экспорт
	
	ДанныеВыписки = ОбменСБанкомВФормате1С.НовыйДанныеИзБанка();
	ПрочитанныеДанныеСервиса = Новый Структура;
	ПрочитанныеДанныеСервиса.Вставить("ДанныеИзБанка", ДанныеВыписки);
	ПрочитанныеДанныеСервиса.Вставить("Протокол", ОбменСБанкомВФормате1С.НовыйПротоколЧтенияФайла());
	
	Если ДеревоДанных = Неопределено Тогда
		Возврат ПрочитанныеДанныеСервиса;
	КонецЕсли;
	
	МассивСчетов = Новый Массив;
	
	СтрокаТаблицыВыписок = ДеревоДанных.Строки.Найти("Выписки", "ПолныйПуть");
	
	ЗаполнитьШапкуВыписки(Организация, ПрочитанныеДанныеСервиса.ДанныеИзБанка, СтрокаТаблицыВыписок, МассивСчетов);
	
	// Реквизиты плательщика и получателя
	ОписаниеОбменаВФормате1С = Новый Структура("Участники, РеквизитыУчастника, ОписаниеФайлаОбмена");
	ОписаниеОбменаВФормате1С.Участники           = ОбменСБанкомВФормате1С.НовыйУчастники();
	ОписаниеОбменаВФормате1С.РеквизитыУчастника  = ОбменСБанкомВФормате1С.ЭлементыРеквизитовУчастника();
	ОписаниеОбменаВФормате1С.ОписаниеФайлаОбмена = ОбменСБанкомВФормате1С.ОписаниеФайлаОбмена();
	
	Индекс = 0;
	Для Каждого Выписка Из СтрокаТаблицыВыписок.Строки Цикл
		СтрокаОперацияВыписки = Выписка.Строки.Найти("Выписки.НомерСтроки.Операции", "ПолныйПуть");
		
		Если СтрокаОперацияВыписки.Значение = Неопределено
			Или СтрокаОперацияВыписки.Значение = 0
			Или СтрокаОперацияВыписки.Значение = "" Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого Операция Из СтрокаОперацияВыписки.Строки Цикл
			ДобавитьДокумент(ПрочитанныеДанныеСервиса.ДанныеИзБанка, Операция, ОписаниеОбменаВФормате1С, Индекс);
		КонецЦикла;
	КонецЦикла;
	
	ОбменСБанкомВФормате1С.ЗаписатьВПротокол(ПрочитанныеДанныеСервиса.Протокол, Истина, "ЭлектроннаяВыписка");
	
	Возврат ПрочитанныеДанныеСервиса;
	
КонецФункции

#КонецОбласти

#КонецОбласти
