
#Область ПрограммныйИнтерфейс

#Область Системные

// Доступны возвраты без карты.       
//
// Возвращаемое значение:
//  Структура - Доступны возвраты без карты:
//   * ВозвратПоПлатежнойКарте - Булево
//   * ВозвратЭлектроннымСертификатом - Булево
//
Функция ДоступноВозвратыБезКарты() Экспорт
	
	ВозвратыБезКарты = Новый Структура();
	ВозвратыБезКарты.Вставить("ВозвратПоПлатежнойКарте"       , Истина);
	ВозвратыБезКарты.Вставить("ВозвратЭлектроннымСертификатом", Истина);
	МенеджерОборудованияВызовСервераПереопределяемый.ДоступноВозвратыБезКарты(ВозвратыБезКарты);    
	Возврат ВозвратыБезКарты; 
	
КонецФункции  

// Возвращает доступные протоколы обмена ФЭС НСПК.
//  
// Возвращаемое значение:
//  ПротоколыОбменаФЭСНСПК - Массив - Протоколы обмена ФЭС НСПК
//
Функция ДоступныеПротоколыОбменаФЭСНСПК() Экспорт
	
	ПротоколыОбменаФЭСНСПК = Новый Массив();  
	ПротоколыОбменаФЭСНСПК.Добавить(Перечисления.ПротоколОбменаФЭСНСПК.ВерсияV2);
	МенеджерОборудованияВызовСервераПереопределяемый.ДоступныеПротоколыОбменаФЭСНСПК(ПротоколыОбменаФЭСНСПК);
	Возврат ПротоколыОбменаФЭСНСПК; 
	
КонецФункции

// Изолированное подключения внешних компонент на клиенте 
// Возвращаемое значение:
//  Булево - Изолированно
//
Функция ИзолированноеПодключенияВнешнихКомпонентНаКлиенте() Экспорт
	
	Возврат ВнешниеКомпонентыБПО.ИзолированноеПодключенияВнешнихКомпонентНаКлиенте();
	
КонецФункции

// Получить соответствие типов оборудования
//
// Возвращаемое значение:
//   Соответствие из КлючИЗначение -
//
Функция СоответствиеТиповОборудования() Экспорт
	
	Возврат МенеджерОборудования.СоответствиеТиповОборудования();
	
КонецФункции

#КонецОбласти

#Область РабочееМесто

// Функция возвращает из переменной сеанса рабочее место клиента.
// 
// Параметры:
//   ЕстьПодключаемоеОборудование - Булево - возвращается Истина если в базе есть подключаемое оборудование.
//   ПараметрыПоискаРабочегоМеста - Структура
// 
// Возвращаемое значение:
//  СправочникСсылка.РабочиеМеста.
//
Функция РабочееМестоКлиента(ЕстьПодключаемоеОборудование = Истина, ПараметрыПоискаРабочегоМеста = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	РабочееМесто = ПараметрыСеанса.РабочееМестоКлиента;
	Если Не ЗначениеЗаполнено(РабочееМесто) Тогда
		ОбновитьРабочееМестоКлиента(ПараметрыПоискаРабочегоМеста);
		РабочееМесто = ПараметрыСеанса.РабочееМестоКлиента;
	КонецЕсли;
	// проверить что есть подключаемое оборудование в справочнике и передать эту информацию на клиент
	ЕстьПодключаемоеОборудование = МенеджерОборудования.ЕстьПодключаемоеОборудование();
	
	Возврат РабочееМесто;
	
КонецФункции

// Функция возвращает список рабочих мест, соответствующих указанному имени компьютера.
//
// Параметры:
//  ИдентификаторКлиента - Строка - идентификатор клиента для рабочего места      
//  ИмяКомпьютера - Строка - Имя компьютера  
//  MACАдрес - Строка, Массив Из Строка - MAC адрес или массив MAC адресов 
//
// Возвращаемое значение:
//  Массив из СправочникСсылка.РабочиеМеста.
//
Функция НайтиРабочиеМестаПоИдентификатору(ИдентификаторКлиента, ИмяКомпьютера, MACАдрес = "") Экспорт
	
	Результат = Новый Массив();
	
	Если Не ОбщегоНазначенияБПО.ДоступноИспользованиеРазделенныхДанных() Тогда
		Возврат Результат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ТипЗнч(MACАдрес) = Тип("Строка") Тогда
		MACАдреса = Новый Массив();
		Если ЗначениеЗаполнено(MACАдрес) Тогда
			MACАдреса.Добавить(MACАдрес);
		КонецЕсли;
	Иначе
		MACАдреса = MACАдрес;
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	0 КАК Приоритет,
	|	РабочиеМеста.Ссылка КАК Ссылка,
	|	РабочиеМеста.ИмяКомпьютера КАК ИмяКомпьютера
	|ПОМЕСТИТЬ РабочиеМестаПоПриоритетам
	|ИЗ
	|	Справочник.РабочиеМеста КАК РабочиеМеста
	|ГДЕ
	|	РабочиеМеста.Код = &ИдентификаторКлиента
	|	И НЕ РабочиеМеста.ПометкаУдаления
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	1,
	|	РабочиеМестаИдентификаторыКлиентов.Ссылка,
	|	РабочиеМестаИдентификаторыКлиентов.Ссылка.ИмяКомпьютера
	|ИЗ
	|	Справочник.РабочиеМеста.ИдентификаторыКлиентов КАК РабочиеМестаИдентификаторыКлиентов
	|ГДЕ
	|	РабочиеМестаИдентификаторыКлиентов.ИдентификаторКлиента = &ИдентификаторКлиента
	|	И НЕ РабочиеМестаИдентификаторыКлиентов.Ссылка.ПометкаУдаления
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2,
	|	РабочиеМеста.Ссылка,
	|	РабочиеМеста.ИмяКомпьютера
	|ИЗ
	|	Справочник.РабочиеМеста КАК РабочиеМеста
	|ГДЕ
	|	РабочиеМеста.MACАдрес В(&MACАдреса)
	|	И РабочиеМеста.ИмяКомпьютера = &ИмяКомпьютера
	|	И &ИмяКомпьютера <> """"
	|	И НЕ РабочиеМеста.ПометкаУдаления
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2,
	|	РабочиеМеста.Ссылка,
	|	РабочиеМеста.ИмяКомпьютера
	|ИЗ
	|	Справочник.РабочиеМеста КАК РабочиеМеста
	|ГДЕ
	|	РабочиеМеста.ИмяКомпьютера = &ИмяКомпьютера
	|	И &ИмяКомпьютера <> """"
	|	И НЕ РабочиеМеста.ПометкаУдаления
	|	И РабочиеМеста.MACАдреса.Адрес В(&MACАдреса)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	3,
	|	РабочиеМестаИдентификаторыКлиентов.Ссылка,
	|	РабочиеМестаИдентификаторыКлиентов.Ссылка.ИмяКомпьютера
	|ИЗ
	|	Справочник.РабочиеМеста.ИдентификаторыКлиентов КАК РабочиеМестаИдентификаторыКлиентов
	|ГДЕ
	|	РабочиеМестаИдентификаторыКлиентов.ИдентификаторКлиента = &ИдентификаторКлиента
	|	И РабочиеМестаИдентификаторыКлиентов.Ссылка.MACАдрес В(&MACАдреса)
	|	И НЕ РабочиеМестаИдентификаторыКлиентов.Ссылка.ПометкаУдаления
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	4,
	|	РабочиеМеста.Ссылка,
	|	РабочиеМеста.ИмяКомпьютера
	|ИЗ
	|	Справочник.РабочиеМеста КАК РабочиеМеста
	|ГДЕ
	|	РабочиеМеста.ИмяКомпьютера = &ИмяКомпьютера
	|	И &ИмяКомпьютера <> """"
	|	И НЕ РабочиеМеста.ПометкаУдаления
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	5,
	|	РабочиеМеста.Ссылка,
	|	РабочиеМеста.ИмяКомпьютера
	|ИЗ
	|	Справочник.РабочиеМеста КАК РабочиеМеста
	|ГДЕ
	|	РабочиеМеста.MACАдрес В(&MACАдреса)
	|	И НЕ РабочиеМеста.ПометкаУдаления
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	5,
	|	РабочиеМеста.Ссылка,
	|	РабочиеМеста.ИмяКомпьютера
	|ИЗ
	|	Справочник.РабочиеМеста КАК РабочиеМеста
	|ГДЕ
	|	РабочиеМеста.MACАдреса.Адрес В(&MACАдреса)
	|	И НЕ РабочиеМеста.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	РабочиеМестаПоПриоритетам.Ссылка КАК Ссылка,
	|	РабочиеМестаПоПриоритетам.ИмяКомпьютера КАК ИмяКомпьютера
	|ИЗ
	|	РабочиеМестаПоПриоритетам КАК РабочиеМестаПоПриоритетам
	|
	|УПОРЯДОЧИТЬ ПО
	|	РабочиеМестаПоПриоритетам.Приоритет");
	
	
	Запрос.УстановитьПараметр("ИдентификаторКлиента", ИдентификаторКлиента);
	Запрос.УстановитьПараметр("ИмяКомпьютера", ИмяКомпьютера);
	Запрос.УстановитьПараметр("MACАдреса", MACАдреса);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Результат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	РабочееМестоСсылка = Выборка.Ссылка;
	Результат.Добавить(РабочееМестоСсылка);
	
	Если ПустаяСтрока(Выборка.ИмяКомпьютера) И Не ПустаяСтрока(ИмяКомпьютера) Тогда
		РабочееМестоОбъект = РабочееМестоСсылка.ПолучитьОбъект();
		РабочееМестоОбъект.ИмяКомпьютера = ИмяКомпьютера;
		РабочееМестоОбъект.Записать();
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Функция устанавливает в переменную сеанса имя компьютера клиента.
//
// Параметры:
//  РабочееМестоКлиента - СправочникСсылка.РабочиеМеста
//
Процедура УстановитьРабочееМестоКлиента(РабочееМестоКлиента) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	ПараметрыСеанса.РабочееМестоКлиента = РабочееМестоКлиента;

КонецПроцедуры

// Функция возвращает созданное рабочее место клиента.
//
// Параметры:
//  Параметры - Структура:
//  * ИдентификаторКлиента - Строка - Уникальный идентификатор.
//  * ИмяКомпьютера - Строка - Имя компьютера     
//  * MACАдрес - Строка - MAC Адрес     
//
// Возвращаемое значение:
//  СправочникСсылка.РабочиеМеста.
//
Функция СоздатьРабочееМестоКлиента(Параметры) Экспорт

	Если Не ОбщегоНазначенияБПО.ДоступноИспользованиеРазделенныхДанных() Тогда
		Возврат Справочники.РабочиеМеста.ПустаяСсылка();
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	РабочееМесто = Справочники.РабочиеМеста.СоздатьЭлемент();
	РабочееМесто.Код = Параметры.ИдентификаторКлиента;
	РабочееМесто.ИмяКомпьютера = Параметры.ИмяКомпьютера;
	Если Параметры.Свойство("MACАдреса") И Параметры.MACАдреса.Количество() > 0 Тогда
		Для Каждого MACАдрес Из Параметры.MACАдреса Цикл
			Строка = РабочееМесто.MACАдреса.Добавить();
			Строка.Адрес = MACАдрес;
		КонецЦикла;
	КонецЕсли;
	
	МенеджерОборудованияКлиентСервер.ЗаполнитьНаименованиеРабочегоМеста(РабочееМесто, ПользователиИнформационнойБазы.ТекущийПользователь());
	РабочееМесто.Записать();
	
	УстановитьРабочееМестоКлиента(РабочееМесто.Ссылка);
	
	Возврат РабочееМесто.Ссылка;

КонецФункции 

// Процедура устанавливает значения параметров сеанса, относящихся к подключаемому оборудованию.
//
// Параметры:
//  ИмяПараметра - Строка - имя параметра сеанса. 
//  УстановленныеПараметры - Массив из Строка
//
Процедура УстановитьПараметрыСеансаПодключаемогоОборудования(ИмяПараметра, УстановленныеПараметры) Экспорт

	Если ИмяПараметра = "РабочееМестоКлиента" Тогда
		
		ОбновитьРабочееМестоКлиента();
		
	КонецЕсли;
	
КонецПроцедуры

// Функция возвращает типы используемого оборудования для текущего рабочего места.
// 
// Возвращаемое значение:
//  Массив.
// 
Функция ТипыИспользуемогоОборудованияТекущегоРабочегоМеста()  Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	РабочееМесто = РабочееМестоКлиента();
	
	Если ЗначениеЗаполнено(РабочееМесто) Тогда
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПодключаемоеОборудование.ТипОборудования КАК ТипОборудования
		|ИЗ
		|	Справочник.ПодключаемоеОборудование КАК ПодключаемоеОборудование
		|ГДЕ
		|	ПодключаемоеОборудование.УстройствоИспользуется
		|	И ПодключаемоеОборудование.РабочееМесто = &РабочееМесто
		|	И НЕ ПодключаемоеОборудование.ПометкаУдаления
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПодключаемоеОборудование.ТипОборудования
		|ИЗ
		|	Справочник.ПодключаемоеОборудование КАК ПодключаемоеОборудование
		|ГДЕ
		|	ПодключаемоеОборудование.ТипПодключения = ЗНАЧЕНИЕ(Перечисление.ТипыПодключенияОборудования.ОбщийДоступ)
		|	И ПодключаемоеОборудование.УстройствоИспользуется
		|	И НЕ ПодключаемоеОборудование.ПометкаУдаления");
		
		Запрос.УстановитьПараметр("РабочееМесто", РабочееМесто);
		
		Результат = Запрос.Выполнить();
		Возврат Результат.Выгрузить().ВыгрузитьКолонку("ТипОборудования");
		
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область РаботаСОборудованием

// Возвращает список подключенного в справочнике ПО по установленному отбору
//
// Параметры:
//  Отбор - см. МенеджерОборудованияКлиентСервер.СписокОборудованияОтбор.
//
// Возвращаемое значение:
//  Массив из Структура:
//    * Наименование - Строка
Функция СписокОборудования(Отбор) Экспорт
	
	Возврат МенеджерОборудования.СписокОборудования(Отбор);
	
КонецФункции

// Функция возвращает структуру с данными устройства.
//
// Параметры:
//  Идентификатор - СправочникСсылка.ПодключаемоеОборудование.    
//  КодЯзыка - Строка                                     
//  ПараметрыУстройства - Структура - параметры устройства.
//
// Возвращаемое значение:
//  см. Справочники.ПодключаемоеОборудование.ДанныеУстройства
//
Функция ДанныеУстройства(Идентификатор, КодЯзыка = Неопределено, ПараметрыУстройства = Неопределено) Экспорт
	
	Результат = МенеджерОборудования.ДанныеУстройства(Идентификатор, КодЯзыка);        
	
	Если Не ПараметрыУстройства = Неопределено Тогда
		Результат.Параметры = ПараметрыУстройства;  
		Результат.ПараметрыXML = МенеджерОборудования.ПолучитьПараметрыXML(ПараметрыУстройства, Результат.ТипОборудованияИмя);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Получить параметры подключения в XML
//
// Параметры:
//   Параметры - Структура - Параметры подключения.     
//   ТипОборудования - Строка - Тип оборудования.    
//   ЗаписьПараметров - Булево - Признак записи параметров драйверов.      
// Возвращаемое значение:
//   Строка -
//
Функция ПолучитьПараметрыXML(Параметры, ТипОборудования = Неопределено, ЗаписьПараметров = Истина)  Экспорт
	
	Возврат МенеджерОборудования.ПолучитьПараметрыXML(Параметры, ТипОборудования, ЗаписьПараметров);
	
КонецФункции    

// Функция возвращает по идентификатору устройства его параметры
//
// Параметры:
//  Идентификатор - СправочникСсылка.ПодключаемоеОборудование.
//
// Возвращаемое значение:
//  - Произвольный
//  - Структура.
//
Функция ПараметрыУстройства(Идентификатор) Экспорт
	
	Возврат МенеджерОборудования.ПараметрыУстройства(Идентификатор);
	
КонецФункции

// Процедура предназначена для сохранения параметров устройства
// в реквизит Параметры типа хранилище значения в элементе справочника.
//
// Параметры:
//  Идентификатор - СправочникСсылка.ПодключаемоеОборудование.
//  Параметры - Структура - параметры устройства.
//
// Возвращаемое значение:
//  Булево.
//
Функция СохранитьПараметрыУстройства(Идентификатор, Параметры) Экспорт
	
	Возврат МенеджерОборудования.СохранитьПараметрыУстройства(Идентификатор, Параметры);
	
КонецФункции

// Функция возвращает структуру с данными драйвера.
//
// Параметры:
//  ИдентификаторДрайвера - СправочникСсылка.ДрайверыОборудования - идентификатор драйвера.
//
// Возвращаемое значение:
//  Структура.
//
Функция ДанныеДрайвераОборудования(ИдентификаторДрайвера) Экспорт
	
	Возврат МенеджерОборудования.ДанныеДрайвераОборудования(ИдентификаторДрайвера);
	
КонецФункции

// Получить параметры подключения из XML
//
// Параметры:
//   ПараметрыXML - Строка - Параметры подключения в XML.     
// Возвращаемое значение:
//   Структура -
//
Функция ЗагрузитьПараметрыXML(ПараметрыXML) Экспорт
	
	Возврат МенеджерОборудования.ЗагрузитьПараметрыXML(ПараметрыXML);
	
КонецФункции

Функция ДрайверПоставляетсяВКонфигурации(ИдентификаторУстройства) Экспорт
	
	Возврат МенеджерОборудования.ДрайверПоставляетсяВКонфигурации(ИдентификаторУстройства);
	
КонецФункции

// ++ НеМобильноеПриложение

Функция АнализТекстаОшибкиОборудования(ИдентификаторУстройства, Знач ПараметрыПодключения, Знач ТекстОшибки) Экспорт
	
	Возврат МенеджерОборудования.АнализТекстаОшибкиОборудования(ИдентификаторУстройства, ПараметрыПодключения, ТекстОшибки);
	
КонецФункции

// -- НеМобильноеПриложение

#КонецОбласти

#Область КодаВидаНоменклатурнойКлассификации

// Устарела: больше не используется.
// Возвращает классификатор кода вида номенклатурной классификации
//
// Возвращаемое значение:
//  ТаблицаЗначений.
//
Функция КодыВидаНоменклатурнойКлассификации() Экспорт
	
	ТаблицаЗначений = Новый ТаблицаЗначений;
	ТаблицаЗначений.Колонки.Добавить("НаименованиеВидаНоменклатурнойКлассификации",,"НаименованиеВидаНоменклатурнойКлассификации");
	ТаблицаЗначений.Колонки.Добавить("КодВидаНоменклатурнойКлассификации",,"КодВидаНоменклатурнойКлассификации");
	
	// ++ Локализация
	УстановитьПривилегированныйРежим(Истина);
	
	Данные = ПолучитьОбщийМакет("КодВидаНоменклатурнойКлассификации").ПолучитьТекст() ;
	Если Не ПустаяСтрока(Данные) Тогда
		ЧтениеXML = Новый ЧтениеXML; 
		ЧтениеXML.УстановитьСтроку(Данные);
		ЧтениеXML.ПерейтиКСодержимому();
		Если ЧтениеXML.Имя = "КодВидаНоменклатурнойКлассификации" И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда  
			Пока ЧтениеXML.Прочитать() Цикл  
				Если ЧтениеXML.Имя = "ВидНоменклатурнойКлассификации" И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда 
					ВидНоменклатурнойКлассификации = ТаблицаЗначений.Добавить();
					ВидНоменклатурнойКлассификации.НаименованиеВидаНоменклатурнойКлассификации = ЧтениеXML.ЗначениеАтрибута("Имя");
					ВидНоменклатурнойКлассификации.КодВидаНоменклатурнойКлассификации = ЧтениеXML.ЗначениеАтрибута("КодВида");
				КонецЕсли;
			КонецЦикла;           
		КонецЕсли;
	КонецЕсли;
	// -- Локализация
	
	Возврат ТаблицаЗначений;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ПараметрыТипыОборудования() Экспорт
	
	Возврат МенеджерОборудованияПовтИсп.ПараметрыТипыОборудования();
	
КонецФункции

// Функция вызывает процедуру подготовки данных операции на сервере.
//
// Параметры:
//  ПараметрыПодключения - Структура - параметры подключения оборудования.   
//  ПроцессорДанных - Строка - Модуль обработки данных. 
//  Команда - Строка - Имя выполняемой команды. 
//  ПараметрыОперации - Структура - Параметры выполняемой операции.   
//
// Возвращаемое значение:
//  Структура
//
Функция ПодготовитьДанныеОперации(ПараметрыПодключения, ПроцессорДанных, Команда, ПараметрыОперации) Экспорт 
	
	МодульПроцессорДанных = ОбщегоНазначенияБПО.ОбщийМодуль(ПроцессорДанных);
	Возврат МодульПроцессорДанных.ПодготовитьДанныеОперации(ПараметрыПодключения, Команда, ПараметрыОперации);
	
КонецФункции

// Процедура обработки данных операции на сервере.
//
// Параметры:
//  ПараметрыПодключения - Структура - параметры подключения оборудования.   
//  ПроцессорДанных - Строка - Модуль обработки данных. 
//  Команда - Строка - Имя выполняемой команды.       
//  РезультатВыполнения - Структура - Результат выполнения.   
//  ДанныеОперации - Структура - Данные выполненной операции.   
//
Процедура ОбработатьДанныеОперации(ПараметрыПодключения, ПроцессорДанных, Команда, РезультатВыполнения, ДанныеОперации) Экспорт 
	
	МодульПроцессорДанных = ОбщегоНазначенияБПО.ОбщийМодуль(ПроцессорДанных);
	МодульПроцессорДанных.ОбработатьДанныеОперации(ПараметрыПодключения, Команда, РезультатВыполнения, ДанныеОперации);
	
КонецПроцедуры

Функция СовместимостьВнешнейКомпонентыИзФайла(Знач ИмяМакета) Экспорт
	
	Возврат МенеджерОборудованияПовтИсп.СовместимостьВнешнейКомпонентыИзФайла(ИмяМакета);
	
КонецФункции

#Область RFID

// Получить таблицу меток RFID. Используется для обращения в веб клиенте.
//
// Параметры:
//  ДанныеМеток - Строка
//
// Возвращаемое значение:
//  Массив из Структура
// 
Функция МеткиRFID(ДанныеМеток) Экспорт
	
	Возврат МенеджерОборудованияКлиентСервер.МеткиRFID(ДанныеМеток);
	
КонецФункции

#КонецОбласти         

#Область РабочиеМеста

// Возвращает рабочее место клиента, найденное по переданному отбору
// 
// Параметры:
//  ПараметрыПоискаРабочегоМеста - см. МенеджерОборудованияКлиент.ПодключаемоеОборудование
//  СоздатьРабочееМесто - Булево - Создать рабочее место
// 
// Возвращаемое значение:
//  СправочникСсылка.РабочиеМеста, Произвольный - Найденное рабочее место клиента, иначе ПустаяСсылка
Функция ОбновитьРабочееМестоКлиента(ПараметрыПоискаРабочегоМеста = Неопределено, СоздатьРабочееМесто = Ложь) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	МенеджерОборудования.ЗаполнитьАктуальныеРеквизитыРабочегоМеста(ПараметрыПоискаРабочегоМеста);
	
	ИдентификаторКлиента = "";
	ИмяКомпьютера = "";
	MACАдреса = "";
	Если ПараметрыПоискаРабочегоМеста <> Неопределено Тогда
		ИдентификаторКлиента = ПараметрыПоискаРабочегоМеста.ИдентификаторКлиента;
		ИмяКомпьютера = ПараметрыПоискаРабочегоМеста.ИмяКомпьютера;
		MACАдреса = ПараметрыПоискаРабочегоМеста.MACАдреса;
	КонецЕсли;
	
	ТекущееРМ = Справочники.РабочиеМеста.ПустаяСсылка();
	СписокРМ = НайтиРабочиеМестаПоИдентификатору(ИдентификаторКлиента, ИмяКомпьютера, MACАдреса);
	Если СписокРМ.Количество() > 0 Тогда
		ТекущееРМ = СписокРМ[0];
		МенеджерОборудования.ОбновитьРеквизитыРабочегоМеста(ТекущееРМ, ПараметрыПоискаРабочегоМеста);
	Иначе
		Если СоздатьРабочееМесто Тогда
			ТекущееРМ = СоздатьРабочееМестоКлиента(ПараметрыПоискаРабочегоМеста);
		КонецЕсли;
	КонецЕсли;
	
	УстановитьРабочееМестоКлиента(ТекущееРМ);
	Возврат ТекущееРМ;
	
КонецФункции

// Обновляет реквизиты рабочего места
// 
// Параметры:
//  РабочееМесто - СправочникСсылка.РабочиеМеста - Рабочее место
//  АктуальныеРеквизитыРабочегоМеста - см. МенеджерОборудованияКлиент.ПодключаемоеОборудование
//
Процедура ОбновитьРеквизитыРабочегоМеста(РабочееМесто, АктуальныеРеквизитыРабочегоМеста) Экспорт
	
	МенеджерОборудования.ОбновитьРеквизитыРабочегоМеста(РабочееМесто, АктуальныеРеквизитыРабочегоМеста);
	
КонецПроцедуры


Процедура ОбновитьИдентификаторРабочегоМеста(РабочееМесто, НовыйИдентификатор) Экспорт
	
	Если ЗначениеЗаполнено(РабочееМесто) Тогда
		
		РабочееМестоОбъект = РабочееМесто.ПолучитьОбъект();
		РабочееМестоОбъект.Код = НовыйИдентификатор;
		РабочееМестоОбъект.Записать();
		
	КонецЕсли;
	
КонецПроцедуры

// Выполняет привязку идентификатора клиента к элементу справочника рабочего места
//
// Параметры:
//   ИдентификаторКлиента - Строка
//   MACАдрес - Строка
//
// Возвращаемое значение:
//   Массив из СправочникСсылка.РабочиеМеста.
//
Функция ПривязатьРабочееМестоПоMACАдресу(ИдентификаторКлиента, MACАдрес) Экспорт
	
	Если Не ОбщегоНазначенияБПО.ДоступноИспользованиеРазделенныхДанных() Тогда
		Возврат Новый Массив();
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	СписокРабочиеМеста = НайтиРабочиеМестаПоИдентификатору(ИдентификаторКлиента, "", MACАдрес);
	
	Если СписокРабочиеМеста.Количество() > 0 Тогда   
		ТекущееРабочееМесто = СписокРабочиеМеста[0].ПолучитьОбъект();                     
		Если ТекущееРабочееМесто.ИдентификаторыКлиентов.Найти(ИдентификаторКлиента, "ИдентификаторКлиента") = Неопределено  Тогда 
			ИдентификаторыКлиентов = ТекущееРабочееМесто.ИдентификаторыКлиентов.Добавить();   
			ИдентификаторыКлиентов.ИдентификаторКлиента = ИдентификаторКлиента;
			ТекущееРабочееМесто.ЛокальноеУстройство = Истина;
			ТекущееРабочееМесто.Записать();       
		КонецЕсли;
	Иначе
		Параметры = Новый Структура;
		Параметры.Вставить("ИдентификаторКлиента", ИдентификаторКлиента);
		Параметры.Вставить("MACАдрес"            , MACАдрес);     
		Параметры.Вставить("ИмяКомпьютера");
		РабочееМесто = СоздатьРабочееМестоКлиента(Параметры);         
		ТекущееРабочееМесто = РабочееМесто.ПолучитьОбъект();         
		Если ТекущееРабочееМесто.ИдентификаторыКлиентов.Найти(ИдентификаторКлиента, "ИдентификаторКлиента") = Неопределено  Тогда 
			ИдентификаторыКлиентов = ТекущееРабочееМесто.ИдентификаторыКлиентов.Добавить();   
			ИдентификаторыКлиентов.ИдентификаторКлиента = ИдентификаторКлиента;
			ТекущееРабочееМесто.ЛокальноеУстройство = Истина;
			ТекущееРабочееМесто.Записать();       
		КонецЕсли;
		СписокРабочиеМеста.Добавить(РабочееМесто);
	КонецЕсли;
	УстановитьРабочееМестоКлиента(СписокРабочиеМеста[0]);
	
	Возврат СписокРабочиеМеста;
	
КонецФункции

Процедура СохранитьMACАдресДляРабочееМеста(MACАдрес) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	РабочееМестоКлиента = РабочееМестоКлиента();
	Если ЗначениеЗаполнено(РабочееМестоКлиента) Тогда
		РабочееМестоКлиентаMACАдрес = ОбщегоНазначенияБПО.ЗначениеРеквизитаОбъекта(РабочееМестоКлиента, "MACАдрес");
		Если РабочееМестоКлиентаMACАдрес <> MACАдрес Тогда
			РабочееМестоОбъект = РабочееМестоКлиента.ПолучитьОбъект();
			РабочееМестоОбъект.MACАдрес = MACАдрес;
			РабочееМестоОбъект.Записать();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Функция информацию о текущем рабочем месте.
// 
// Возвращаемое значение:
//  Структура:
//   * РабочееМесто - СправочникСсылка.РабочиеМеста
//   * ЕстьПодключаемоеОборудование - Булево
//
Функция ИнформацияОРабочемМестеКлиента() Экспорт
	
	Результат = Новый Структура();
	Результат.Вставить("РабочееМесто", РабочееМестоКлиента());
	Результат.Вставить("ЕстьПодключаемоеОборудование", МенеджерОборудования.ЕстьПодключаемоеОборудование());
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ОбменССервером

Процедура ОбменССервером(ДанныеДляСервера, Знач ДанныеДляСервераПоЗначению) Экспорт
	
	// ++ НеМобильноеПриложение 
	Если ОбщегоНазначенияБПО.ИспользуетсяКассоваяСмена() Тогда
		Если ДанныеДляСервера.Свойство("СтатусыКассовыхСмен") Тогда
			СтатусыКассовыхСмен = ДанныеДляСервера.СтатусыКассовыхСмен;
			МодульКассовыеСмены = ОбщегоНазначенияБПО.ОбщийМодуль("КассовыеСмены");
			Для Каждого Статус Из СтатусыКассовыхСмен Цикл
				СтатусСмены = МодульКассовыеСмены.СтатусПоследнейСмены(Статус.Ключ);
				СтатусыКассовыхСмен.Вставить(Статус.Ключ, СтатусСмены);
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ДанныеДляСервераПоЗначению.Свойство("ЗаписиЛогирования") Тогда
		
		ЗаписиЛогирования = ДанныеДляСервераПоЗначению.ЗаписиЛогирования;
		ЛогированиеОперацийБПО.ЗаписатьЛогОперацииНаСервереВФоне(ЗаписиЛогирования);
		
	КонецЕсли;
	// -- НеМобильноеПриложение 
	
КонецПроцедуры

#КонецОбласти

// Записывает архив логов драйвера для указанного подключаемого оборудования.
//
// Параметры:
//  ПодключаемоеОборудование - СправочникСсылка.ПодключаемоеОборудование - 
//      оборудование, для которого записываются логи
//  Данные - Массив Из ОписаниеПередаваемогоФайла - если файлы переданы для архивирования на сервер
//         - ДвоичныеДанные  - если фалы были заархивированы на клиенте
Процедура ЗаписатьАрхивЛоговДрайвера(ПодключаемоеОборудование, Знач Данные) Экспорт
	
	РегистрыСведений.АрхивЛоговДрайверовОборудования.
		ЗаписатьАрхивЛоговДрайвера(ПодключаемоеОборудование, Данные);
	
КонецПроцедуры

// Отправляет ответ на запрос записи архива логов драйвера подключенного оборудования.
//
// Параметры:
//   ДанныеЗапроса - Структура - данные исходного запроса:
//    * ПодключаемоеОборудование - СправочникСсылка.ПодключаемоеОборудование - 
//       ссылка на подключаемое оборудование
//    * НомерСеансаДляОтвета - Число - номер сеанса отправки запроса
//    * Данные - Структура - данные записи архива логов
//   РезультатЗагрузки - Структура - результат обработки запроса который нужно отправить:
//    * Успешно - Булево - признак успешности обработки запроса
//    * ТекстОшибки - Строка - текст ошибки обработки
//
Процедура ОтправитьОтветЗаписиАрхиваЛоговДрайвера(Знач ДанныеЗапроса, Знач РезультатЗагрузки) Экспорт

	Справочники.ПодключаемоеОборудование.
		ОтправитьОтветЗаписиАрхиваЛоговДрайвера(ДанныеЗапроса, РезультатЗагрузки);
	
КонецПроцедуры

Процедура ПриПодготовкеДанныхОперации(Знач ПроцессорДанных, ДанныеОперации, Знач ПараметрыПодключения, Знач Команда, Знач ПараметрыОперации) Экспорт
	
	МодульПроцессорДанных = ОбщегоНазначенияБПО.ОбщийМодуль(ПроцессорДанных);
	МодульПроцессорДанных.ПриПодготовкеДанныхОперации(ДанныеОперации, ПараметрыПодключения, Команда, ПараметрыОперации);
	
КонецПроцедуры

Процедура ПриОбработкеРезультатовОперации(Знач ПроцессорДанных, ДанныеОперации, Знач ПараметрыПодключения, Знач Команда, РезультатОперации) Экспорт
	
	РезультатОперации.Вставить("ТестовоеПолеСозданноеНаСервере", Новый Структура);
	
	МодульПроцессорДанных = ОбщегоНазначенияБПО.ОбщийМодуль(ПроцессорДанных);
	МодульПроцессорДанных.ПриОбработкеРезультатовОперации(ДанныеОперации, ПараметрыПодключения, Команда, РезультатОперации);
	
КонецПроцедуры

Функция КлючиЗаписейПоДокументу(ДокументОснование) Экспорт
	Результат = Новый Массив;
	ЗначенияКлючей = РегистрыСведений.ФискальныеОперации.ЗначенияКлючейПоДокументу(ДокументОснование);
	Для Каждого ЗначенияКлюча Из ЗначенияКлючей Цикл
		Ключ = РегистрыСведений.ФискальныеОперации.СоздатьКлючЗаписи(ЗначенияКлюча);
		Результат.Добавить(Ключ);
	КонецЦикла;
	Возврат Результат; 
	
КонецФункции

Функция ВызватьHTTPМетодСервер(Метод, ПараметрыСоединения) Экспорт
	
	Результат = МенеджерОборудованияКлиентСервер.РезультатВызоваМетодаHTTP();
	Результат.ВызовНаСервере = Истина;
	
	Если ОбщегоНазначенияБПО.ПодсистемаСуществует("СтандартныеПодсистемы.ПолучениеФайловИзИнтернета") Тогда
		ПолучениеФайловИзИнтернетаМодуль = ОбщегоНазначенияБПО.ОбщийМодуль("ПолучениеФайловИзИнтернета");
		Прокси = ПолучениеФайловИзИнтернетаМодуль.ПолучитьПрокси("https");
	Иначе
		Прокси = Неопределено;
	КонецЕсли;
	
	Если ПараметрыСоединения.Порт = 443 Тогда
		ЗащищенноеСоединение = ОбщегоНазначенияБПОКлиентСервер.НовоеЗащищенноеСоединение();
		Соединение = Новый HTTPСоединение(
			ПараметрыСоединения.Хост, ПараметрыСоединения.Порт, , , Прокси, ПараметрыСоединения.Таймаут, ЗащищенноеСоединение);
	Иначе
		Соединение = Новый HTTPСоединение(
			ПараметрыСоединения.Хост, ПараметрыСоединения.Порт, , , Прокси, ПараметрыСоединения.Таймаут);
	КонецЕсли;
		
	Если ЗначениеЗаполнено(ПараметрыСоединения.ТокенДоступа) Тогда
		ПараметрыСоединения.Заголовки.Вставить("Authorization", ПараметрыСоединения.ТокенДоступа);
	КонецЕсли;
	HTTPЗапрос = Новый HTTPЗапрос(ПараметрыСоединения.АдресРесурса, ПараметрыСоединения.Заголовки);
	
	Попытка
		HTTPОтвет = Соединение.ВызватьHTTPМетод(Метод, HTTPЗапрос);
		Результат.КодОтвета = HTTPОтвет.КодСостояния;
		Результат.ТелоОтвета = HTTPОтвет.ПолучитьТелоКакСтроку();
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		Если ИнформацияОбОшибке.ЯвляетсяОшибкойКатегории(КатегорияОшибки.ОшибкаСети) Тогда
			Результат.Таймаут = Истина;
		Иначе
			ОбщегоНазначенияБПО.ЗаписатьОшибкуВЖурналРегистрации(
				НСтр("ru = 'Ошибка доступа к сервису проверки возраста Макс'"), 
				ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецЕсли;
		Результат.ОписаниеОшибки = ОбработкаОшибок.ПредставлениеОшибкиДляПользователя(ИнформацияОбОшибке);
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

#Область РазрешенныеМетодыДляВызоваКакПроизвольныйКод

// Возвращает список методов, которые могут быть вызваны как произвольный код
// (для регламентных заданий и фоновых заданий)
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	
	Методы.Вставить("УстановитьПараметрыСеансаПодключаемогоОборудования");
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти