///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2026, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

///////////////////////////////////////////////////////////////////////////////////////////////////////
// Подсистема "ИнтернетПоддержкаПользователей.ПлатежныеСистемы.ЯндексПэй".
// ОбщийМодуль.ЯндексПэйКлиент.
//
// Клиентские процедуры работы с платежной системой Яндекс Пэй:
//  - открытие списка кассовых ссылок.
//
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

// Выполняет открытие кассовых ссылок на основе данных строки, переданных из формы общих настроек.
// 
// Параметры:
//  ДанныеСтроки - ДанныеФормыЭлементКоллекции - данные выделенной строки.
//
Процедура ОткрытьКассовыеСсылки(ДанныеСтроки) Экспорт
	
	Если ДанныеСтроки.ЭтоГруппа Тогда
		ПоказатьПредупреждение(
			Неопределено,
			НСтр("ru = 'Работа с кассовыми QR-кодами не доступна для группы.'"));
		Возврат;
	КонецЕсли;
	
	ПараметрыНастройки = Новый Структура;
	ПараметрыНастройки.Вставить("НастройкаПодключения", ДанныеСтроки.Ссылка);
	ПараметрыНастройки.Вставить(
		"ПлатежнаяСистема",
		ОбщегоНазначенияКлиент.ПредопределенныйЭлемент("Перечисление.ПлатежныеСервисы.ЯндексПэй"));
	
	ПлатежныеСистемыКлиент.ПриНастройкеКассовыхСсылок(
		ПараметрыНастройки,
		Неопределено);
	
КонецПроцедуры

#КонецОбласти

