#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Параметры.Свойство("Организация", Организация);
	Параметры.Свойство("ЭтоРежимВыбора", ЭтоРежимВыбора);
	Если ЗначениеЗаполнено(Организация) Тогда 
		Элементы.Организация.Видимость = Ложь;
		Элементы.СписокОрганизация.Видимость = Ложь;
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			Список, "Организация", Организация, ВидСравненияКомпоновкиДанных.Равно, , Истина);
	КонецЕсли;
	Если Не ЭтоРежимВыбора Тогда 
		Элементы.ФормаВыбрать.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список, "Организация", Организация, ВидСравненияКомпоновкиДанных.Равно, , ЗначениеЗаполнено(Организация));
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если ЭтоРежимВыбора Тогда 
		Закрыть(Элемент.ПолучитьСтрокиДляОбработки()[0]);
	Иначе
		ПоказатьЗначение(, Элемент.ПолучитьСтрокиДляОбработки()[0]);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	Элементы.ФормаВыбрать.Доступность = 
		(ТипЗнч(Элементы.Список.ПолучитьСтрокиДляОбработки()[0]) = Тип("ДокументСсылка.УведомлениеОСпецрежимахНалогообложения"));
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выбрать(Команда)
	Если ЭтоРежимВыбора Тогда 
		Закрыть(Элементы.Список.ПолучитьСтрокиДляОбработки()[0]);
	Иначе
		ПоказатьЗначение(, Элементы.Список.ПолучитьСтрокиДляОбработки()[0]);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
