#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ПлатежнаяВедомость", ПараметрКоманды);
	ПараметрыФормы.Вставить("СпособВыплаты", ПредопределенноеЗначение("Перечисление.ТипыДенежныхСредств.Безналичные"));
	ОткрытьФорму("Обработка.СозданиеВыплатЗарплатыСотрудникам.Форма", ПараметрыФормы,
		ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность,
		ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
КонецПроцедуры

#КонецОбласти