#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	Методы.Вставить("ЗагрузкаСообщения", Истина);
КонецПроцедуры

Функция ЗагрузкаСообщения(МассивИменФайлов) Экспорт

	Если МассивИменФайлов.Количество() > 0 Тогда

		ОбработкаЗагрузки = Обработки.ВыгрузкаЗагрузкаEnterpriseData.Создать();

		Для Каждого ИмяВременногоФайла Из МассивИменФайлов Цикл

			СтруктураПараметров = Новый Структура;
			СтруктураПараметров.Вставить("АдресНаСервере", ИмяВременногоФайла);
			СтруктураПараметров.Вставить("ЭтоФоновоеЗадание", Истина);

			ОбработкаЗагрузки.ЗагрузкаСообщения(СтруктураПараметров, Неопределено);
				
			//@skip-check empty-except-statement
			Попытка
				УдалитьФайлы(ИмяВременногоФайла);
			Исключение
			КонецПопытки;

		КонецЦикла;

	КонецЕсли;

	Возврат Истина;

КонецФункции

#КонецОбласти

#КонецЕсли