#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Назначение = Параметры.Назначение;
	ЗаполнитьСтандартныеШаблоны(СтандартныеШаблоны, Назначение);

	ЭтоВебКлиент = ОбщегоНазначения.ЭтоВебКлиент();
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Назначение", "Видимость",
		Не Параметры.СкрытьВыборназначения);

	ЭтоМобильныйКлиент = ОбщегоНазначения.ЭтоМобильныйКлиент();
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаПросмотр", "Видимость",
		Не ЭтоМобильныйКлиент);
		
	ЗаполнитьСписокНазначений();
	ЗаполнитьСписокФорматовФайлов();
	ВывестиБаннеры();
	
	ФорматФайла = ШаблоныПечатиОфисныхДокументовКлиентСервер.РасширениеФайлаDocx();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьРасширениеДляРаботыСФайлами();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПредложитьШаблонНажатие(Элемент)

	Тег   = НСтр("ru = 'Шаблоны печати офисных документов'");
	Текст = НСтр("ru = 'Опишите, каких шаблонов офисных документов вам не хватает в программе:'");
	Тема  = НСтр("ru = 'Хочу эти шаблоны офисных документов в будущей версии'");
	УправлениеНебольшойФирмойКлиент.ПредложитьВозможностьНажатие(Тег, Текст, Тема);
	
КонецПроцедуры

&НаКлиенте
Процедура НазначениеПриИзменении(Элемент)
	
	ПриИзмененииНазначения();
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбработатьДействиеИнформационногоСообщения(ЭлементИлиКоманда,
	НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	
	ОбщегоНазначенияКлиент.ОбработатьДействиеИнформационногоСообщения(ЭтотОбъект, ЭлементИлиКоманда,
		НавигационнаяСсылка, СтандартнаяОбработка);
		
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_УстановитьРасширениеРаботыСФайлами(Команда)
	
	УстановитьРасширениеДляРаботыСФайлами();
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВажноеСообщениеОбработчикЗакрытия(Элемент)

	КлючОбъекта = СтрЗаменить(ИмяФормы, ".", "");
	ОбщегоНазначенияКлиент.ХранилищеОбщихНастроекСохранить(КлючОбъекта, КлючНастроекОтображенияСообщения(), Ложь);
	
	ОбщегоНазначенияКлиентСервер.УдалитьСтатусИлиВажноеСообщение(ЭтотОбъект, "УведомлениеСтандартногоШаблона");
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокСтандартныхШаблонов

&НаКлиенте
Процедура СписокСтандартныхШаблоновПриАктивизацииСтроки(Элемент)
	ПодключитьОбработчикОжидания("ОбновитьДанныеШаблонаНаКлиенте", 0.1, Истина);
КонецПроцедуры

&НаКлиенте
Процедура СписокСтандартныхШаблоновВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ДобавитьШаблон();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выбрать(Команда)

	ДобавитьШаблон();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьРасширениеДляРаботыСФайлами()

	ТекстСообщения = НСтр("ru = 'Для предварительного просмотра необходимо установить расширение для веб-клиента 1С:Предприятие.'");
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПриПодключенииРасширениеДляРаботыСФайлами", ЭтотОбъект);
	ФайловаяСистемаКлиент.ПодключитьРасширениеДляРаботы1СПредприятия(ОписаниеОповещения, ТекстСообщения, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриПодключенииРасширениеДляРаботыСФайлами(РасширениеПодключено, ДополнительныеПараметры) Экспорт

	РасширениеРаботыСФайламиПодключено = РасширениеПодключено;
	Если Не РасширениеРаботыСФайламиПодключено Тогда
		Возврат;
	КонецЕсли;  

	ПодключитьОбработчикОжидания("ОбновитьДанныеШаблонаНаКлиенте", 0.1, Истина);
	ОбщегоНазначенияКлиентСервер.УдалитьСтатусИлиВажноеСообщение(ЭтотОбъект, ИдентификаторУведомленияРаботаСФайлами());
	ВывестиБаннеры();			
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ИдентификаторУведомленияРаботаСФайлами()
	Возврат "УведомлениеПодключениеРасширенияРаботыСФайлами";
КонецФункции

&НаСервере
Процедура ЗаполнитьСписокФорматовФайлов()
	
	РасширениеDocx = ШаблоныПечатиОфисныхДокументовКлиентСервер.РасширениеФайлаDocx();
	РасширениеOdt = ШаблоныПечатиОфисныхДокументовКлиентСервер.РасширениеФайлаOdt();
	
	Элементы.ФорматФайла.СписокВыбора.Очистить();
	Элементы.ФорматФайла.СписокВыбора.Добавить(РасширениеDocx, НСтр("ru = 'Microsoft Word (.docx)'"), , 
		БиблиотекаКартинок.ФорматWord2007);
	Элементы.ФорматФайла.СписокВыбора.Добавить(РасширениеOdt, НСтр("ru = 'Текстовый документ ODF (.odt)'"), , 
		БиблиотекаКартинок.ФорматOpenOfficeWriter);

КонецПроцедуры

&НаСервере
Процедура ВывестиБаннеры()

	КлючОбъекта = СтрЗаменить(ИмяФормы, ".", "");		
	ОтображатьПодсказку = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(КлючОбъекта,
		КлючНастроекОтображенияСообщения(), Истина);
		
	Если ОтображатьПодсказку Тогда
		
		ПараметрыВажногоСообщения = ОбщегоНазначения.ПараметрыВажногоСообщения();
		ПараметрыВажногоСообщения.Идентификатор = "УведомлениеСтандартногоШаблона";
		ПараметрыВажногоСообщения.ТипСообщения = "Информация";
		ПараметрыВажногоСообщения.КраткоеПредставление = НСтр("ru = 'Стандартные шаблоны'");
		ПараметрыВажногоСообщения.ОбработчикЗакрытия = "Подключаемый_ВажноеСообщениеОбработчикЗакрытия";
		ПараметрыВажногоСообщения.Сообщение =
			НСтр("ru = 'Стандартный шаблон может быть использован в качестве основы для создания собственного шаблона.'");
		
		ОбщегоНазначения.ДобавитьВажноеСообщение(ЭтотОбъект, ПараметрыВажногоСообщения);
		
	КонецЕсли;
	
	Если ЭтоВебКлиент И Не РасширениеРаботыСФайламиПодключено Тогда
		
		ПараметрыСообщенияРаботаСФайлами = ОбщегоНазначения.ПараметрыВажногоСообщения();
		ПараметрыСообщенияРаботаСФайлами.Идентификатор = ИдентификаторУведомленияРаботаСФайлами();
		ПараметрыСообщенияРаботаСФайлами.ТипСообщения = "Предупреждение";
		ПараметрыСообщенияРаботаСФайлами.Скрываемый = Ложь;
		ПараметрыСообщенияРаботаСФайлами.КраткоеПредставление = НСтр("ru = 'Предварительный просмотр'");
		ПараметрыСообщенияРаботаСФайлами.Сообщение =
			НСтр("ru = 'Предварительный просмотр недоступен: необходимо установить расширение для веб-клиента 1С:Предприятие.'");
		
		ПараметрыДействия = ОбщегоНазначения.ПараметрыДействияВажногоСообщения();
		ПараметрыДействия.ИмяКоманды = "УстановитьРасширениеРаботыСФайлами";
		ПараметрыДействия.Обработчик = "Подключаемый_УстановитьРасширениеРаботыСФайлами";
		ПараметрыДействия.Заголовок = НСтр("ru = 'Установить'");
		
		ПараметрыСообщенияРаботаСФайлами.ПараметрыДействия = ПараметрыДействия;
	
		ОбщегоНазначения.ДобавитьВажноеСообщение(ЭтотОбъект, ПараметрыСообщенияРаботаСФайлами);
		
	КонецЕсли;
	
	ОбщегоНазначения.ВывестиСтатусыИВажныеСообщенияНаФорму(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция КлючНастроекОтображенияСообщения()
	
	КлючНастроек = "ОтображатьУведомлениеСтандартногоШаблона";
	Возврат КлючНастроек;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьСписокНазначений()
	
	Элементы.Назначение.СписокВыбора.Очистить();
	
	НазначенияСтандартныхШаблонов = ШаблоныПечатиОфисныхДокументов.НазначенияСтандартныхШаблонов();
	Для Каждого НазначениеШаблона Из НазначенияСтандартныхШаблонов Цикл
		Элементы.Назначение.СписокВыбора.Добавить(НазначениеШаблона);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииНазначения()
	
	СтандартныеШаблоны.Очистить();
	
	СтандартныеШаблоныЗаполняемые = ОбщегоНазначенияКлиент.СкопироватьРекурсивно(СтандартныеШаблоны);
	ЗаполнитьСтандартныеШаблоны(СтандартныеШаблоныЗаполняемые, Назначение);
	
	Для Каждого СтандартныйШаблон Из СтандартныеШаблоныЗаполняемые Цикл
		ЗаполнитьЗначенияСвойств(СтандартныеШаблоны.Добавить(), СтандартныйШаблон);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ДобавитьШаблон()

	ТекущиеДанные = Элементы.СписокСтандартныхШаблонов.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеШаблона = ШаблоныПечатиОфисныхДокументовКлиентСервер.НовыйОписаниеСтандартногоШаблона();
	ЗаполнитьЗначенияСвойств(ОписаниеШаблона, ТекущиеДанные);
	
	ФорматФайлаODT = ШаблоныПечатиОфисныхДокументовКлиентСервер.РасширениеФайлаOdt();
	Если ФорматФайла = ФорматФайлаODT Тогда
		ШаблоныПечатиОфисныхДокументовКлиентСервер.ПривестиИмяМакетаКРасширению(ОписаниеШаблона.Макет, ФорматФайлаODT);
	КонецЕсли;	
	
	Закрыть(ОписаниеШаблона);
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ОбновитьДанныеШаблонаНаКлиенте()
		
	Если ЭтоМобильныйКлиент Или (ЭтоВебКлиент И Не РасширениеРаботыСФайламиПодключено) Тогда
		Возврат;
	КонецЕсли;

	ПолеPDF = Неопределено;
	
	ТекущиеДанные = Элементы.СписокСтандартныхШаблонов.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОбъектМакета        = ?(ТекущиеДанные = Неопределено, "", ТекущиеДанные.Объект);
	ИзображениеМакета   = ?(ТекущиеДанные = Неопределено, "", ТекущиеДанные.Изображение);

	Если ЭтоВебКлиент Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаЗагрузкаПросмотра",
			"Видимость", Истина);
	КонецЕсли;
		
	АдресДвоичныхДанные = "";
	
	АдресДвоичныхДанные = АдресИзображенияШаблона(ОбъектМакета, ИзображениеМакета); 
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресДвоичныхДанные);
	УдалитьИзВременногоХранилища(АдресДвоичныхДанные);
	
	ПотокФайла = ДвоичныеДанные.ОткрытьПотокДлячтения();
	Ждать ПолеPDF.ПрочитатьАсинх(ПотокФайла);

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаЗагрузкаПросмотра",
		"Видимость", Ложь);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция АдресИзображенияШаблона(Объект, Изображение)
	
	МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(Объект);
	
	ОбъектМетаданных = ОбщегоНазначения.ОбъектМетаданныхПоПолномуИмени(Объект);
	Если ПустаяСтрока(Объект) Или ПустаяСтрока(Изображение)
		Или ОбъектМетаданных.Макеты.Найти(Изображение) = Неопределено Тогда
		
		ИмяСобытия = ШаблоныПечатиОфисныхДокументовКлиентСервер.ИмяСобытияЖурналаРегистрации();
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Не обнаружен макет для просмотра. Объект: %1, Макет: %2'"),
			Объект, Изображение);
			
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, , ,
			ТекстСообщения);
		
		МакетИзображения = ШаблоныПечатиОфисныхДокументов.ПустойМакетПросмотраPDF();
		
	Иначе
		
		МакетИзображения = МенеджерОбъекта.ПолучитьМакет(Изображение);
		
	КонецЕсли;
	
	АдресДвоичныхДанных = ПоместитьВоВременноеХранилище(МакетИзображения);
	Возврат АдресДвоичныхДанных;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ЗаполнитьСтандартныеШаблоны(СтандартныеШаблоны, Назначение)
	
	ШаблоныПечатиОфисныхДокументов.ДобавитьСтандартныеШаблоныОбъекта(СтандартныеШаблоны,
		Метаданные.Справочники.ШаблоныПечатиОфисныхДокументов, Назначение, Истина);
		
КонецПроцедуры

#КонецОбласти
