////////////////////////////////////////////////////////////////////////////////
// ЕдиныйНалоговыйСчетИнтеграцияУНФ
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

Процедура ГоловнаяОрганизация(ТекущаяОрганизация) Экспорт
	
	ТекущаяОрганизация = РегламентированнаяОтчетность.ГоловнаяОрганизация(ТекущаяОрганизация);
	
КонецПроцедуры

Процедура ПоддерживаетсяВводПлатежныхДокументов(ЕстьПлатежныеДокументы, Организация) Экспорт
	
	ЕстьПлатежныеДокументы =
		ДоступенВводПлатежныхДокументов();
	
КонецПроцедуры

Процедура ПоддерживаетсяРежимСверки(Признак) Экспорт
	
	Если Не Признак Тогда
		ПоддерживаетсяРежимСверкиПлатежи(Признак);
	КонецЕсли;
	Если Не Признак Тогда
		ПоддерживаетсяРежимСверкиОтчеты(Признак);
	КонецЕсли;
	Если Не Признак Тогда
		ПоддерживаетсяРежимСверкиНачисления(Признак);
	КонецЕсли;
	Если Не Признак Тогда
		ПоддерживаетсяРежимСверкиПениШтрафы(Признак);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПоддерживаетсяРежимСверкиГлавное(Признак) Экспорт
	
	Признак = Истина;
	
КонецПроцедуры

Процедура ПоддерживаетсяРежимСверкиСальдоЕНС(Признак) Экспорт
	
	Признак = Истина;
	
КонецПроцедуры

Процедура ПоддерживаетсяРежимСверкиПлатежи(Признак) Экспорт
	
	Признак = Истина;
	
КонецПроцедуры

Процедура ПоддерживаетсяРежимСверкиОтчеты(Признак) Экспорт
	
	Признак = Истина;
	
КонецПроцедуры

Процедура ПоддерживаетсяРежимСверкиНачисления(Признак) Экспорт
	
	Признак = Истина;
	
КонецПроцедуры

Процедура ПоддерживаетсяРежимСверкиУплаты(Признак) Экспорт
	
	Признак = Ложь;
	
КонецПроцедуры

Процедура ПоддерживаетсяРежимСверкиПениШтрафы(Признак) Экспорт
	
	Признак = Истина;
	
КонецПроцедуры

Процедура ПоддерживаетсяАвтоматическаяРегистрацияУплат(Признак) Экспорт
	
	Признак = Ложь;
	
КонецПроцедуры

Процедура ПериодОбработкиДанныхДляРегистрацииУплат(Организация, НачалоПериода, КонецПериода) Экспорт
	
	НачалоПериода = ЕдиныйНалоговыйСчет.НачалоПростогоУчета();
	
КонецПроцедуры

Процедура ПоддерживаетсяАвтоматическаяРегистрацияОперацийЕНС(Признак) Экспорт
	
	Признак = Ложь;
	
КонецПроцедуры

Процедура ПериодОбработкиДанныхДляРегистрацииОперацийЕНС(Организация, НачалоПериода, КонецПериода) Экспорт
	
	НачалоУчетаПоДаннымФНС = ЕдиныйНалоговыйСчет.НачалоУчетаПоДаннымФНС(Организация);
	Если Не ЗначениеЗаполнено(НачалоУчетаПоДаннымФНС) Тогда
		Возврат;
	КонецЕсли;
	НачалоПериода = НачалоУчетаПоДаннымФНС;
	КонецПериода = '2099-01-01';
	
КонецПроцедуры

Процедура ДоступныеОрганизации(ТаблицаОрганизаций) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Организации.Ссылка КАК Значение,
	|	Организации.Представление КАК Представление
	|ИЗ
	|	Справочник.Организации КАК Организации
	|ГДЕ
	|	Организации.Ссылка = Организации.ГоловнаяОрганизация";
	
	ТаблицаОрганизаций = Запрос.Выполнить().Выгрузить();
	
КонецПроцедуры

Процедура ДоступноОтражениеВУчетеНачисленийПениШтрафов(Признак) Экспорт
	
	Признак = Ложь;
	
КонецПроцедуры

Процедура ДоступноОтражениеВУчетеУплаты(Признак) Экспорт
	
	Признак = Ложь;
	
КонецПроцедуры

// Заполняет перечень доступных возвращаемых данных.
//
// Параметры:
//  ДоступныеВозвращаемыеДанные - Соответствие - данные, доступные для получения через API
//    * Ключ - Строка - Идентификатор данных
//    * Значение - Структура - см. АсинхронноеПолучениеДанных.НовыйОписаниеВозвращаемыхДанных().
//
Процедура УстановитьДоступныеВозвращаемыеДанные(ДоступныеВозвращаемыеДанные) Экспорт
	
	ОписаниеВозвращаемыхДанных = АсинхронноеПолучениеДанных.НовыйОписаниеВозвращаемыхДанных();
	ОписаниеВозвращаемыхДанных.Наименование = НСтр("ru='Личный кабинет ЕНС'");
	ОписаниеВозвращаемыхДанных.Описание = НСтр("ru='Личный кабинет ЕНС.'");
	ОписаниеВозвращаемыхДанных.МодульМенеджер = ЕдиныйНалоговыйСчетИнтеграцияУНФ;
	ОписаниеВозвращаемыхДанных.ТипыРезультата.Добавить(АсинхронноеПолучениеДанныхСловарь.ТипJSON());
	
	ДоступныеВозвращаемыеДанные.Вставить(ПубликуемыйИдентификатор(), ОписаниеВозвращаемыхДанных);
	
КонецПроцедуры

// Возвращает идентификатор помощника для вызова через внешний программный интерфейс.
//
// Возвращаемое значение:
//   Строка - идентификатор помощника.
//
Функция ПубликуемыйИдентификатор() Экспорт
	
	Возврат "ens_dashboard";
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДоступенВводПлатежныхДокументов() Экспорт
	
	Возврат ПравоДоступа("Редактирование", Метаданные.Документы.ПлатежноеПоручение);
	
КонецФункции

Функция НавигационнаяСсылкаДляОткрытияЛичногоКабинетаЕНС() Экспорт
	
	Возврат "e1cib/app/Обработка.ЕдиныйНалоговыйСчетЛичныйКабинет";
	
КонецФункции

#КонецОбласти
